[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "111.240",
            "open": "4,357.810",
            "close": "4,447.120",
            "high": "4,455.740",
            "low": "4,344.500"
        },
        "market_summary": "### Gold (XAU/USD) Market Briefing\n\n* **Key Drivers:** Geopolitical tensions in Venezuela, expectations of **dovish** Federal Reserve policy, and **softening** US economic momentum are driving **bullish** sentiment in gold.\n* **Price Action:** Gold price has surged to nearly **$4,500**, driven by increased demand for safe-haven assets and expectations of further US interest rate cuts.\n* **Technical Outlook:** The **21-day Simple Moving Average (SMA)** at **$4,349.26** supports the near-term bias, while the **50-day SMA** at **$4,201.11** underpins the broader trend, with the **14-day Relative Strength Index (RSI)** at **64.41** indicating **bullish** momentum.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Is there a limit on how much gold you can own? - CBS News",
                "source": "CBS News",
                "url": "https://www.cbsnews.com/news/is-there-a-limit-on-how-much-gold-you-can-own/",
                "body": "Is there a limit on how much gold you can own?\nGold's price rally over the past year has reshaped how many investors think about the precious metal. Throughout 2025, gold's upward trajectory led to numerous broken price records, with a combination of easing interest rates, lingering inflation concerns and ongoing geopolitical uncertainty pushing demand higher. At the same time, central banks continued to add more gold to their reserves, while individual investors increasingly turned to physical gold as a hedge against economic instability, helping to further bolster its price growth.\nThe price of gold is now sitting at nearly $4,500 per ounce, meaning that investors who bought in when prices were lower are now sitting on positions worth significantly more than they paid. That means even gold holdings that may have once felt modest — a few coins, a handful of bars or a retirement allocation — could represent a much larger share of your net worth. But as the gold market continues to shift, it makes sense to pay closer attention not just to gold's price movements, but to the rules surrounding ownership, reporting and long-term planning.\nThat, in turn, raises an important question: Is there a limit on how much gold you're allowed to own? Knowing what gold ownership restrictions, regulations and rules actually apply is essential for anyone navigating today's high-priced gold market.\nFind out how to add gold to your investment portfolio now.\nIs there a limit on how much gold you can own?\nThe short answer is no, there is no federal limit on how much gold Americans can own today. You're legally free to purchase and hold as much physical gold as you want, whether in coins, bars, jewelry or other forms. This might seem obvious, but it represents a significant shift from earlier American policy.\nFrom 1933 to 1974, private gold ownership was actually largely illegal in the United States under Executive Order 6102, which was signed by President Franklin D. Roosevelt during the Great Depression. Under that order, the government required citizens to turn in their gold in exchange for paper currency, although there were exceptions for jewelry, certain rare coins and small amounts for industrial use. This ban lasted for over four decades until President Gerald Ford signed legislation that restored Americans' right to own gold bullion and coins in 1974.\nToday's regulatory environment is dramatically different. You can buy gold without registering purchases with the government or facing ownership caps. However, there are some reporting requirements investors should understand. For example, gold dealers must report certain transactions to the Internal Revenue Service (IRS), particularly when you sell them specific quantities (generally 25 ounces or more of gold bars or certain coin types). Making a cash purchase of over $10,000 when buying gold can also trigger reporting requirements under anti-money laundering laws.\nThe IRS also treats gold as a collectible for tax purposes, meaning profits from gold sales held for more than one year may face a maximum capital gains tax rate of 28%, higher than the typical long-term capital gains rates for stocks. When you sell gold, you're responsible for reporting those transactions on your tax returns, and dealers who buy back gold may issue Form 1099-B depending on the transaction.\nLearn more about the benefits of gold investing today.\nSmart strategies for adding gold to your investment portfolio\nFinancial advisors typically suggest limiting gold exposure to 5% to 10% of your total portfolio, using it as a hedge rather than a primary investment vehicle. That's because, unlike stocks or bonds, gold doesn't generate income through dividends or interest, so its value comes entirely from price appreciation. That said, knowing what gold investing options make sense for your portfolio matters just as much as knowing how much you should own.\nInvestors have multiple options for gold exposure, after all, and each com"
            },
            {
                "title": "Gold Forecast: XAU/USD appears in a win-win situation ahead of key US jobs data - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/amp/analysis/gold-price-forecast-xau-usd-appears-in-a-win-win-situation-ahead-of-key-us-jobs-data-202601060349",
                "body": "Gold Price Forecast: XAU/USD appears in a win-win situation ahead of key US jobs data\nPremium|You have reached your limit of 5 free articles for this month.\nGet all exclusive analysis, access our analysis and get Gold and signals alerts\nElevate your trading Journey.\nYour coupon code\nFXS75\n- Gold makes another run toward $4,500 on Venezuela turmoil, Fed rate cut expectations.\n- US Dollar meets fresh supply on dovish Fed bets, improving risk sentiment.\n- Gold needs acceptance above $4,450 to extend the uptrend; daily RSI stays bullish.\nGold is looking to build on the previous over 2.5% rally early Tuesday, retaking the $4,450 level as prospects of further US Federal Reserve (Fed) interest rate cuts this year continue to act as a headwind to the US Dollar (USD) recovery.\nGold cheers softer US Dollar, geopolitical woes\nGold has found fresh buyers, sitting at weekly highs above $4,450, after having dipped to near the $4,430 region earlier on. The latest leg up in Gold could be attributed to the renewed selling interest around the USD amid improving risk sentiment.\nMarkets shrug off the US-Venezuela geopolitical tensions, now viewing the US intervention as limited, shifting their focus back toward the expectations surrounding future rate cuts by the Fed heading in the US labor data releases due later this week.\nThe dovish Fed bets returned to the fore on Monday and smashed the USD alongside the US Treasury bond yields after the US ISM Manufacturing PMI declined to 47.9 in December, against the forecast of 48.3.\nSlowing US economic momentum and labor market conditions continue to remain a drag on the Greenback, as markets now eagerly await the US ADP monthly Employment Change and JOLTS Job Openings data due on Wednesday before Friday’s Nonfarm Payrolls showdown.\nHowever, if the geopolitical tensions over the US and Venezuela gather steam again, a fresh bout of USD buying could re-emerge on safe haven flows, which will likely cap the Gold price upside. All eyes are on China’s and Russia’s response to the US military aggression.\nMeanwhile, the overthrown Venezuelan President Nicolas Maduro pleaded not guilty before a New York Federal court on Monday to multiple charges.\nUS President Donald Trump's capture of him on Saturday rattled world leaders and left officials in Caracas scrambling to regroup, per Reuters.\nGold price technical analysis: Daily chart\nIn the daily chart, the 21-day Simple Moving Average (SMA) climbs above the 50-, 100-, and 200-day SMAs, signaling firm bullish alignment. All SMAs advance and the price holds above them, reinforcing buyers’ control. The 21-day SMA at $4,349.26 supports the near-term bias, while the 50-day SMA at $4,201.11 underpins the broader trend.\nThe 14-day Relative Strength Index (RSI) stands at 64.41, positive and shy of overbought, suggesting momentum favors the upside. Should pullbacks emerge, the rising 21-day SMA could cap losses, while a deeper retracement would look toward the 100-day SMA at $3,985.64. The bullish tone would persist while XAU/USD trades above these moving averages.\n(The technical analysis of this story was written with the help of an AI tool)\nEconomic Indicator\nADP Employment Change\nThe ADP Employment Change is a gauge of employment in the private sector released by the largest payroll processor in the US, Automatic Data Processing Inc. It measures the change in the number of people privately employed in the US. Generally speaking, a rise in the indicator has positive implications for consumer spending and is stimulative of economic growth. So a high reading is traditionally seen as bullish for the US Dollar (USD), while a low reading is seen as bearish.\nRead more.Next release: Wed Jan 07, 2026 13:15\nFrequency: Monthly\nConsensus: 45K\nPrevious: -32K\nSource: ADP Research Institute\nTraders often consider employment figures from ADP, America’s largest payrolls provider, report as the harbinger of the Bureau of Labor Statistics release on Nonfarm Payrolls (usually published two d"
            },
            {
                "title": "Venezuela crisis drives investors toward gold as dollar holds firm - The American Bazaar",
                "source": "The American Bazaar",
                "url": "https://americanbazaaronline.com/2026/01/05/venezuela-crisis-drives-gold-dollar-holds-firm-472580/",
                "body": "By Keerthi Ramesh\nThe global markets moved cautiously Monday as escalating political turmoil in Venezuela pushed investors toward safe haven assets, lifting gold prices while the U.S. dollar remained firm against major currencies.\nThe uncertainty follows a U.S. military operation that resulted in the capture of Venezuelan President Nicholas Maduro, sharply raising geopolitical risk in Latin America. While markets have so far avoided sharp turbulence, the event has added a note of caution to trading at the start of the year.\nThe U.S. dollar has now strengthened against the euro, Japanese yen and Swiss franc, supported by its traditional role as a refuge during periods of global uncertainty. Currency traders appeared to balance geopolitical concerns with expectations around U.S. economic data and the Federal Reserve’s policy outlook. Strong U.S. labor market indicators and resilient growth expectations have continued to underpin the dollar’s strength.\nGold prices, meanwhile, surged as investors sought protection from geopolitical risk. Spot gold rose sharply in early trading, climbing more than one percent to hover near recent highs. The rally reflects renewed demand for safe haven assets as markets assess the broader implications of the Venezuela situations.\nGold typically moves contrarily to the dollar, as stronger U.S. currency makes the metal more expensive for the buyers using other currencies. However, analysts say the current environment reflects a risk of sentiment in which investors are simultaneously seeking safety in both assets.\nREAD: Opinion: Why Venezuela matters (January 4, 2026)\nA senior commodities analyst at a global brokerage firm said, “The move into gold suggests investors are hedging against uncertainty rather than making directional bets on currencies.”\nThe Venezuelan crisis adds to an already complex global backdrop for precious metals. Gold prices have been supported in recent months by expectations of potential U.S. interest rate cuts later in 2026, along with continued buying by the central banks and concerns about geopolitical flashpoints worldwide.\nMarket participants remain cautious as they wait for further clarity on how the situation in Venezuela may evolve. Analyst note that any prolonged instability or policy shifts could influence commodity markets more broadly, particularly if sanctions or supply chains are affected.\nFor now, the reaction underscores how geopolitical shocks can reinforce existing market trends. The dollar continues to benefit from its safe haven status and strong economic fundamentals, while gold is drawing renewed interest as investors seek insurance against this uncertainty.\nAs global markets move forward into the new year, the attention is said to remain on the geopolitical developments and the upcoming economic data, all of which will shape the overall investors sentiment in the weeks ahead."
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "2.125",
            "open": "60.981",
            "close": "62.029",
            "high": "62.126",
            "low": "60.001"
        },
        "market_summary": "### Spot Brent Crude Oil Market Briefing\n\n* **Key Drivers:** Potential increase in Venezuela's oil production due to a change in political landscape, which could lead to higher global supply and **bearish** pressure on prices.\n* **Price Action:** Currently trading around **$56** per barrel, with potential downside risk of **$4** per barrel by 2030 if Venezuela's production reaches 2 million barrels per day.\n* **Technical Outlook:** Immediate support is near the **$52** level, with resistance at **$60**, as the market weighs the impact of increased Venezuelan production on global supply and demand.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "U.S. seeks to tap Venezuela's vast oil reserves after military strikes. Here's what to know. - CBS News",
                "source": "CBS News",
                "url": "https://www.cbsnews.com/news/venezuela-oil-reserves-us-strike-trump-what-to-know/",
                "body": "U.S. seeks to tap Venezuela's vast oil reserves after military strikes. Here's what to know.\nThe U.S. strike on Venezuela has renewed focus on the country's oil sector, which includes some of the richest crude reserves in the world.\n\"We're going to rebuild the oil infrastructure, which will cost billions of dollars, it will be paid for by the oil companies directly. And we're going to get the oil flowing the way it should be,\" President Trump said in a public address on Saturday following the attack, in which the U.S. captured Venezuelan President Nicolás Maduro and his wife.\nHere's what to know about Venezuela's oil industry.\nHow much oil does Venezuela produce?\nVenezuela, a member of the Organization of the Petroleum Exporting Countries, produces relatively little crude compared with other leading oil-producing nations. The country produces roughly 1 million barrels of crude oil per day, less than 1% of global output, according to OPEC data.\nVenezuela's oil production topped 3 million barrels per day in the early 2000s, but it has fallen sharply in recent decades due to declining investment and the impact of U.S. sanctions. Because of U.S. political pressure, Venezuela today exports most of its oil to China, according to Reuters.\nBy comparison, the U.S. — the world's largest oil producer — churns out 13.5 million barrels per day, according to the Energy Information Administration. Saudi Arabia, the world's No. 2 oil exporter and leading OPEC producer, pumps an estimated 10 million to 12 million barrels, while No. 3 Russia produces 9.4 million.\nFrancisco J. Monaldi, director of the Latin America energy program at Rice University, predicted it would take at least a decade — and investments of more than $100 billion — to rebuild Venezuela's oil infrastructure and lift production to 4 million barrels per day, which is well above its historical production levels.\n\"Venezuela's oil infrastructure has also been heavily degraded by decades of underinvestment and much of Venezuela's oil is extremely heavy, making it relatively costly to extract and process,\" Neal Shearing, group chief economist at Capital Economics, noted in a report.\nBut doesn't Venezuela have more oil in the ground?\nYes, Venezuela is estimated to have the world's largest proven oil reserves, with more than 303 billion barrels — that represents roughly 17% of the total global oil supply, OPEC data shows.\n\"The bottom line is that the size of the reserves is only paralleled by the ones in the Middle East, in the Persian Gulf and Canada's reserves,\" Monaldi told CBS News.\nVenezuela's reserves top second-ranked Saudi Arabia's 267 billion barrels, and are more than six times the U.S.'s reserves. Most of Venezuela's untapped oil is located in what is known as the Orinoco Belt, a roughly 21,000-square-mile area that stretches across the country's northeastern region.\nAre American oil companies already operating in Venezuela, and does the U.S. restrict the country's oil industry?\nOnly one U.S. oil company operates in Venezuela today: Houston-based Chevron, which now accounts for 25% of Venezuelan oil production.\n\"No other major Western player produces any significant amount,\" Monaldi told CBS News.\nOther American energy giants, including Exxon Mobil and ConocoPhillips, withdrew from Venezuela after former President Hugo Chavez nationalized private foreign oil interests starting in 2006.\nSince 2005, successive U.S. presidents have imposed a range of sanctions on Venezuela, including its oil sector, for what American officials have said is the country's failure to crack down on drug trafficking and terrorism, along with alleged human rights abuses.\nUnder former President Joe Biden, the U.S. in 2019 also froze the assets of Venezuela's state-owned oil company, Petróleos de Venezuela (PDVSA), and barred Americans from doing business with the enterprise.\nMost recently, the Trump administration imposed sanctions on four companies and associated oil tankers that it said have ties t"
            },
            {
                "title": "Silver Enters Rare Territory as Prices Outrun Oil and Inventories Stay Tight - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/analysis/silver-enters-rare-territory-as-prices-outrun-oil-and-inventories-stay-tight-200672719",
                "body": "Asia stocks extend rally on chipmaker gains; Japan’s TOPIX hits fresh record high\nEvery year around this time, we update one of our most popular and widely followed tools, the interactive Periodic Table of Commodities Returns. I encourage you to spend a few minutes exploring it. With just a click, you can see which commodities rose to the top in 2025 and which fell to the bottom.\nSilver was the best-performing commodity last year, up an astounding 145%, but precious metals as a whole delivered solid returns. Gold, silver, platinum and palladium all responded positively to a number of factors, from rising geopolitical tensions to changes to global trade to the accelerating energy transition.\n50 New All-Time Highs for Gold\nWhen it comes to gold, you have to go all the way back to 1979, when the Iranian revolution and Cold War dominated headlines, to find a year like 2025. The yellow metal gained 64%, closing the year above $4,300 an ounce after hitting more than 50 new all-time highs.\nSo what pushed the yellow metal so high?\nRate cuts and a weaker U.S. dollar, for one. After aggressively raising rates in 2022-2023, the Federal Reserve reversed course as hiring slowed and inflation remained stubbornly high. As many of you know, lower real yields have historically been rocket fuel for gold.\nCentral banks, especially those in emerging markets, continued to accumulate the precious metal in a bid to diversify away from the U.S. dollar. According to the World Gold Council (WGC), central banks purchased 53 metric tons in October alone, representing the largest monthly haul for the year so far.\nGold Still Criminally Underinvested\nDespite gold’s monster rally this past year, gold mining stocks remain criminally underinvested compared to the S&P 500. Take a look below. When the metal climbed in the 2000s, from around $290 in 2000 to a high of over $1,900 by September 2011, the NYSE Arca Gold Miners Index surged dramatically relative to the market. (It helped, of course, that the S&P was still recovering from the financial crisis.) And when gold began to capitulate soon after, investors dropped mining stocks like a hot potato… and never returned, even as gold crossed above $4,000.\nI hear from friends who say they’re not participating because they missed the last run-up. That’s the wrong way to look at it, I think. Hitting 50 new all-time highs in a single year is nice, but it’s not necessary for the metal to do its job. As a portfolio diversifier, it has historically shared a negative correlation with stocks, meaning it has often zigged when the market zagged.\nSilver Stole the Show\nAs strong as gold performed, it was silver that stole the show in 2025. Prices more than doubled, finishing the year above $70 per ounce and notching the biggest annual gain on record.\nNotably, an ounce of silver costs more than a barrel of oil right now, a highly unusual position for the two assets to find themselves in. The silver-to-oil ratio has averaged about 0.27 over the past 30 years, meaning one ounce of silver has historically bought you a little over a quarter of a barrel of Brent crude. Today, that ratio has skyrocketed to 1.2.\nIt should go without saying, but that’s not normal. The only other time we’ve seen silver this expensive relative to oil was back in 1980, when the Hunt brothers famously tried to corner the silver market. Some analysts see signs of a bubble.\nHow Chinese Export Curbs Could Send Silver Even Higher\nThere’s more going on with silver, of course. Today, it’s as much an industrial metal as it is a monetary one. Roughly 50% to 60% of annual demand now comes from technology and manufacturing—solar panels, electric vehicles (EVs), electronics, medical devices and more. Every solar panel uses about 20 grams of silver, while an EV can carry up to 2 ounces of it in sensors and wiring.\nAnd that’s before we add geopolitics to the equation. Effective January 1, China has placed new restrictions on silver exports. Only large state-approved fi"
            },
            {
                "title": "Venezuela’s oil supply to rise in years ahead and depress prices, say analysts - CNBC Africa",
                "source": "CNBC Africa",
                "url": "https://www.cnbcafrica.com/2026/venezuelas-oil-supply-to-rise-in-years-ahead-and-depress-prices-say-analysts",
                "body": "SINGAPORE, Jan 5 (Reuters) – Crude output in Venezuela is set to increase over a period of time following the dramatic U.S. strike and capture of its president, likely raising global supply and weighing on prices longer-term, oil analysts said.\nAmerican forces seized Venezuelan President Nicolas Maduro from Caracas over the weekend, and U.S. President Donald Trump said Washington would take control of the oil-producing nation and that the U.S. embargo on all Venezuelan oil remained in full effect.\nThe Organization of the Petroleum Exporting Countries (OPEC) member holds about 17% of global oil reserves, or 303 billion barrels, ahead of OPEC leader Saudi Arabia, according to the London-based Energy Institute.\nVenezuela was producing as much as 3.5 million barrels per day (bpd) of crude in the 1970s, which at the time represented over 7% of global oil output. Production fell below 2 million bpd during the 2010s and averaged some 1.1 million bpd last year, or just 1% of global production.\nJPMorgan analysts led by Natasha Kaneva said in a note that with a political transition, Venezuela could raise oil production to 1.3-1.4 million bpd within two years and potentially reach 2.5 million bpd over the next decade, up from about 800,000 bpd currently.\n“These dynamics are currently not reflected in the back end of the oil futures curve,” the note added.\nGoldman Sachs analysts led by Daan Struyven said in a January 4 note that any recovery in production would likely be gradual and require substantial investment.\nThe analysts estimated a $4 per barrel downside to 2030 oil prices in a scenario where Venezuela crude production rises to 2 million bpd.\nIn the short term, Venezuela’s oil production outlook this year will depend on how U.S. sanctions policy evolves, the Goldman analysts said.\n“We see ambiguous but modest risks to oil prices in the short run from Venezuela depending on how U.S. sanctions policy evolves,” they added.\nGoldman’s 2026 oil price forecasts remained unchanged, with Brent’s average at $56 and West Texas Intermediate at $52 a barrel while Venezuela’s 2026 oil production is forecast to stay flat at 900,000 barrels per day."
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "2.185",
            "open": "57.232",
            "close": "58.382",
            "high": "58.537",
            "low": "56.352"
        },
        "market_summary": "### Spot WTI Crude Oil Market Briefing\n\n* **Key Drivers:** The U.S. strike on Venezuela has renewed focus on the country's oil sector, with **Venezuelan crude** being a key target for U.S. refineries due to its **heavy, sour** nature, which is ideal for many U.S. refineries.\n* **Price Action:** The price of **Spot WTI Crude Oil** has been impacted by the potential for increased supply from Venezuela, with prices potentially being pressured by the **additional 1 million barrels per day** that could be imported from Venezuela, although current prices are not provided in the articles.\n* **Technical Outlook:** Immediate support and resistance levels for **Spot WTI Crude Oil** are not explicitly mentioned in the articles, but the **geopolitical tensions** and **potential supply changes** could lead to **volatile price movements**.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "Dense, sticky and heavy: why Venezuelan crude oil appeals to US refineries - The Guardian",
                "source": "The Guardian",
                "url": "https://www.theguardian.com/business/2026/jan/05/venezuelan-crude-oil-appeals-to-us-refineries",
                "body": "Clustered along the US Gulf coast are some of the largest and most complex heavy-oil refineries in the world. These sprawling industrial hubs, owned by major US oil companies, stand ready to emerge as some of the major victors of Donald Trump’s swoop on Venezuela.\nIn some ways, these refineries are a relic of another time; built to process the heavy, unctuous crude imported from Latin America before the boom in lighter US shale oil emerged earlier this century.\nVenezuelan oil is particularly dense and sticky. The high-sulphur crude more closely resembles a semi-solid tar than the far clearer liquids produced in US shale heartlands, making it more difficult to extract and process into gasoline, diesel, jet fuel and feedstock for the chemicals industry. But it is exactly what many refineries in the US were built to treat.\nAs a result, the US remains a major importer of crude to feed its refineries, despite being one of the biggest oil exporters in the world. Access to Venezuelan crude at an attractive price could play an important role in sating Trump’s appetite for cheap energy to fuel the “reindustrialisation” of the US economy.\n“Most of Venezuela’s crude supply is heavy, sour oil, which if you’re a US refiner is one of the most ideal grades of crude you could ask for,” said Janiv Shah, a vice-president at Rystad Energy, a global consultancy.\n“At the moment, US refineries import heavy crude into the Gulf states via pipeline from Canada and there are also heavy crude options from Colombia and Mexico. But securing Venezuelan crude would be in addition to these, and the geographic proximity of Venezuela helps too.”\nIt could help to safeguard the US oil industry, which has struggled despite support from the White House against the steepest decline in global oil prices since before the 2020 pandemic, made worse by the economic impact of Trump’s trade war.\nUS refineries support about 3m jobs despite employing only about 80,000 people at their sites. The industry has the highest job “multiplier” of any industry in the US – meaning that for every direct job in the sector more than 45 further roles are supported, according to a study by Oxford Economics. This reflects the industry’s “exceptionally high labour productivity and large economic footprint”, which is often rooted geographically in states loyal to Trump.\nBut during Nicolás Maduro’s presidency, imports of Venezuelan crude to the US refineries fell as the South American nation’s industry suffered from neglect and corruption, and US sanctions against the regime took effect.\nIn the late 1990s US imports of Venezuelan crude reached almost 2m barrels of oil a day, more than half of the South American country’s output. At the end of last year US imports from Venezuela were just 135,000 barrels a day.\nThis suggests that US refineries could readily receive an extra 1m barrels a day from Venezuela, according to analysts at Energy Aspects, helping the US to reduce its reliance on more expensive imports of heavy crude from Canada.\nThis could divert Venezuela’s cheaper heavy oil exports away from China, which has absorbed most of the country’s crude since the US imposed sanctions on its exports as repayment on the billions in financial support extended to the Venezuelan government over recent years.\nThese imports represent a small fraction of China’s oil consumption, which could be easily replaced from other sources. However, the US intervention will force its global rival to pay a higher price for energy at a time both major economies are chasing the cheapest energy possible to fuel economic growth.\n“This is part of Trump’s view that almost any issue can be solved by making the cost of energy cheaper so that prices for consumers across the economy fall too,” Shah said. “It is also Trump flexing the US’s muscles on the global stage against one of its greatest global rivals. China could source crude from elsewhere, but this move is politically symbolic.”\nThe gamble is a long game, with no "
            },
            {
                "title": "U.S. seeks to tap Venezuela's vast oil reserves after military strikes. Here's what to know. - CBS News",
                "source": "CBS News",
                "url": "https://www.cbsnews.com/news/venezuela-oil-reserves-us-strike-trump-what-to-know/",
                "body": "U.S. seeks to tap Venezuela's vast oil reserves after military strikes. Here's what to know.\nThe U.S. strike on Venezuela has renewed focus on the country's oil sector, which includes some of the richest crude reserves in the world.\n\"We're going to rebuild the oil infrastructure, which will cost billions of dollars, it will be paid for by the oil companies directly. And we're going to get the oil flowing the way it should be,\" President Trump said in a public address on Saturday following the attack, in which the U.S. captured Venezuelan President Nicolás Maduro and his wife.\nHere's what to know about Venezuela's oil industry.\nHow much oil does Venezuela produce?\nVenezuela, a member of the Organization of the Petroleum Exporting Countries, produces relatively little crude compared with other leading oil-producing nations. The country produces roughly 1 million barrels of crude oil per day, less than 1% of global output, according to OPEC data.\nVenezuela's oil production topped 3 million barrels per day in the early 2000s, but it has fallen sharply in recent decades due to declining investment and the impact of U.S. sanctions. Because of U.S. political pressure, Venezuela today exports most of its oil to China, according to Reuters.\nBy comparison, the U.S. — the world's largest oil producer — churns out 13.5 million barrels per day, according to the Energy Information Administration. Saudi Arabia, the world's No. 2 oil exporter and leading OPEC producer, pumps an estimated 10 million to 12 million barrels, while No. 3 Russia produces 9.4 million.\nFrancisco J. Monaldi, director of the Latin America energy program at Rice University, predicted it would take at least a decade — and investments of more than $100 billion — to rebuild Venezuela's oil infrastructure and lift production to 4 million barrels per day, which is well above its historical production levels.\n\"Venezuela's oil infrastructure has also been heavily degraded by decades of underinvestment and much of Venezuela's oil is extremely heavy, making it relatively costly to extract and process,\" Neal Shearing, group chief economist at Capital Economics, noted in a report.\nBut doesn't Venezuela have more oil in the ground?\nYes, Venezuela is estimated to have the world's largest proven oil reserves, with more than 303 billion barrels — that represents roughly 17% of the total global oil supply, OPEC data shows.\n\"The bottom line is that the size of the reserves is only paralleled by the ones in the Middle East, in the Persian Gulf and Canada's reserves,\" Monaldi told CBS News.\nVenezuela's reserves top second-ranked Saudi Arabia's 267 billion barrels, and are more than six times the U.S.'s reserves. Most of Venezuela's untapped oil is located in what is known as the Orinoco Belt, a roughly 21,000-square-mile area that stretches across the country's northeastern region.\nAre American oil companies already operating in Venezuela, and does the U.S. restrict the country's oil industry?\nOnly one U.S. oil company operates in Venezuela today: Houston-based Chevron, which now accounts for 25% of Venezuelan oil production.\n\"No other major Western player produces any significant amount,\" Monaldi told CBS News.\nOther American energy giants, including Exxon Mobil and ConocoPhillips, withdrew from Venezuela after former President Hugo Chavez nationalized private foreign oil interests starting in 2006.\nSince 2005, successive U.S. presidents have imposed a range of sanctions on Venezuela, including its oil sector, for what American officials have said is the country's failure to crack down on drug trafficking and terrorism, along with alleged human rights abuses.\nUnder former President Joe Biden, the U.S. in 2019 also froze the assets of Venezuela's state-owned oil company, Petróleos de Venezuela (PDVSA), and barred Americans from doing business with the enterprise.\nMost recently, the Trump administration imposed sanctions on four companies and associated oil tankers that it said have ties t"
            },
            {
                "title": "Silver Enters Rare Territory as Prices Outrun Oil and Inventories Stay Tight - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/analysis/silver-enters-rare-territory-as-prices-outrun-oil-and-inventories-stay-tight-200672719",
                "body": "Asia stocks extend rally on chipmaker gains; Japan’s TOPIX hits fresh record high\nEvery year around this time, we update one of our most popular and widely followed tools, the interactive Periodic Table of Commodities Returns. I encourage you to spend a few minutes exploring it. With just a click, you can see which commodities rose to the top in 2025 and which fell to the bottom.\nSilver was the best-performing commodity last year, up an astounding 145%, but precious metals as a whole delivered solid returns. Gold, silver, platinum and palladium all responded positively to a number of factors, from rising geopolitical tensions to changes to global trade to the accelerating energy transition.\n50 New All-Time Highs for Gold\nWhen it comes to gold, you have to go all the way back to 1979, when the Iranian revolution and Cold War dominated headlines, to find a year like 2025. The yellow metal gained 64%, closing the year above $4,300 an ounce after hitting more than 50 new all-time highs.\nSo what pushed the yellow metal so high?\nRate cuts and a weaker U.S. dollar, for one. After aggressively raising rates in 2022-2023, the Federal Reserve reversed course as hiring slowed and inflation remained stubbornly high. As many of you know, lower real yields have historically been rocket fuel for gold.\nCentral banks, especially those in emerging markets, continued to accumulate the precious metal in a bid to diversify away from the U.S. dollar. According to the World Gold Council (WGC), central banks purchased 53 metric tons in October alone, representing the largest monthly haul for the year so far.\nGold Still Criminally Underinvested\nDespite gold’s monster rally this past year, gold mining stocks remain criminally underinvested compared to the S&P 500. Take a look below. When the metal climbed in the 2000s, from around $290 in 2000 to a high of over $1,900 by September 2011, the NYSE Arca Gold Miners Index surged dramatically relative to the market. (It helped, of course, that the S&P was still recovering from the financial crisis.) And when gold began to capitulate soon after, investors dropped mining stocks like a hot potato… and never returned, even as gold crossed above $4,000.\nI hear from friends who say they’re not participating because they missed the last run-up. That’s the wrong way to look at it, I think. Hitting 50 new all-time highs in a single year is nice, but it’s not necessary for the metal to do its job. As a portfolio diversifier, it has historically shared a negative correlation with stocks, meaning it has often zigged when the market zagged.\nSilver Stole the Show\nAs strong as gold performed, it was silver that stole the show in 2025. Prices more than doubled, finishing the year above $70 per ounce and notching the biggest annual gain on record.\nNotably, an ounce of silver costs more than a barrel of oil right now, a highly unusual position for the two assets to find themselves in. The silver-to-oil ratio has averaged about 0.27 over the past 30 years, meaning one ounce of silver has historically bought you a little over a quarter of a barrel of Brent crude. Today, that ratio has skyrocketed to 1.2.\nIt should go without saying, but that’s not normal. The only other time we’ve seen silver this expensive relative to oil was back in 1980, when the Hunt brothers famously tried to corner the silver market. Some analysts see signs of a bubble.\nHow Chinese Export Curbs Could Send Silver Even Higher\nThere’s more going on with silver, of course. Today, it’s as much an industrial metal as it is a monetary one. Roughly 50% to 60% of annual demand now comes from technology and manufacturing—solar panels, electric vehicles (EVs), electronics, medical devices and more. Every solar panel uses about 20 grams of silver, while an EV can carry up to 2 ounces of it in sensors and wiring.\nAnd that’s before we add geopolitics to the equation. Effective January 1, China has placed new restrictions on silver exports. Only large state-approved fi"
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0070",
            "open": "1.1719",
            "close": "1.1720",
            "high": "1.1728",
            "low": "1.1659"
        },
        "market_summary": "### EUR/USD Market Briefing\n\n* **Key Drivers:** The **dovish** expectations for the US Federal Reserve and the speculation that the European Central Bank (ECB) has concluded its rate-cutting cycle are supporting the euro, leading to a **bullish momentum** in EUR/USD.\n* **Price Action:** The pair is trading around **1.1750**, having broken above the key psychological level of **1.1735**, which is a confluence of the 100-hour Simple Moving Average (SMA) and the 50% Fibonacci retracement level of the decline from **1.1808** to **1.1660**.\n* **Technical Outlook:** Immediate resistance is near the **61.8% Fibonacci retracement level** in the mid-**1.1700s**, with support at **1.1635**, which is the 100-day EMA and has acted as a dynamic bid on every corrective attempt since mid-November.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "EUR/USD Forecast: Looks to build on strength above 1.1735 hurdle - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/eur-usd-price-forecast-looks-to-build-on-momentum-beyond-11735-confluence-202601060315",
                "body": "EUR/USD Price Forecast: Looks to build on momentum beyond 1.1735 confluence\n- EUR/USD gains some follow-through positive traction amid a broadly weaker USD.\n- The divergent Fed-ECB outlooks favor bulls and back the case for additional gains.\n- The supportive fundamental backdrop also validates the near-term positive outlook.\nThe EUR/USD pair attracts fresh buyers near the 1.1710 area during the Asian session on Tuesday and builds on the previous day's solid bounce from the 1.1660 area, or a nearly four-week low. Spot prices currently trade around the 1.1735 region, up 0.10% for the day, and seem poised to climb further amid a supportive fundamental backdrop.\nThe US Dollar (USD) drifts lower for the second straight day and moves further away from its highest level since December 10, touched on Monday, amid dovish US Federal Reserve (Fed) expectations. Furthermore, bets that the European Central Bank (ECB) is done cutting rates seem to support the shared currency and act as a tailwind for the EUR/USD pair.\nAn intraday strength beyond the 1.1735 confluence – comprising the 100-hour Simple Moving Average (SMA) and the 50% Fibonacci retracement level of the 1.1808-1.1660 fall – validates the positive outlook. Moreover, the Moving Average Convergence Divergence (MACD) has turned positive and edges higher, hinting at improving upside momentum.\nAdding to this, the Relative Strength Index (RSI) at 59 supports further gains, with the 61.8% Fibo. retracement level, around mid-1.1700s, forming the next resistance. A push through these barriers would strengthen the corrective tone, whereas failure to clear them would leave EUR/USD vulnerable to renewed consolidation within the recent range.\n(The technical analysis of this story was written with the help of an AI tool)\nEUR/USD 1-hour chart\nEuro FAQs\nThe Euro is the currency for the 20 European Union countries that belong to the Eurozone. It is the second most heavily traded currency in the world behind the US Dollar. In 2022, it accounted for 31% of all foreign exchange transactions, with an average daily turnover of over $2.2 trillion a day. EUR/USD is the most heavily traded currency pair in the world, accounting for an estimated 30% off all transactions, followed by EUR/JPY (4%), EUR/GBP (3%) and EUR/AUD (2%).\nThe European Central Bank (ECB) in Frankfurt, Germany, is the reserve bank for the Eurozone. The ECB sets interest rates and manages monetary policy. The ECB’s primary mandate is to maintain price stability, which means either controlling inflation or stimulating growth. Its primary tool is the raising or lowering of interest rates. Relatively high interest rates – or the expectation of higher rates – will usually benefit the Euro and vice versa. The ECB Governing Council makes monetary policy decisions at meetings held eight times a year. Decisions are made by heads of the Eurozone national banks and six permanent members, including the President of the ECB, Christine Lagarde.\nEurozone inflation data, measured by the Harmonized Index of Consumer Prices (HICP), is an important econometric for the Euro. If inflation rises more than expected, especially if above the ECB’s 2% target, it obliges the ECB to raise interest rates to bring it back under control. Relatively high interest rates compared to its counterparts will usually benefit the Euro, as it makes the region more attractive as a place for global investors to park their money.\nData releases gauge the health of the economy and can impact on the Euro. Indicators such as GDP, Manufacturing and Services PMIs, employment, and consumer sentiment surveys can all influence the direction of the single currency. A strong economy is good for the Euro. Not only does it attract more foreign investment but it may encourage the ECB to put up interest rates, which will directly strengthen the Euro. Otherwise, if economic data is weak, the Euro is likely to fall. Economic data for the four largest economies in the euro area (Germany, France,"
            },
            {
                "title": "EUR/USD Price Outlook: Aims to extend gains above the 1.1735 convergence level - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605131380",
                "body": "During Tuesday's Asian session, the EUR/USD currency pair found renewed buying interest near the 1.1710 mark, extending its robust rebound from the previous day's dip to nearly a four-week low around 1.1660. The pair is currently hovering near 1.1735, reflecting a 0.10% increase for the day, and appears well-positioned for additional advances thanks to favorable market fundamentals.\nThe US Dollar (USD) continues its downward trajectory for a second consecutive session, pulling back further from Monday's peak—the highest since December 10—amid growing expectations that the US Federal Reserve will maintain a dovish stance. At the same time, speculation that the European Central Bank (ECB) has concluded its rate-cutting cycle is lending support to the euro, providing a boost to EUR/USD.\nA move above the 1.1735 level—which aligns with both the 100-hour Simple Moving Average (SMA) and the 50% Fibonacci retracement of the decline from 1.1808 to 1.1660—reinforces the optimistic outlook for the pair. Additionally, the Moving Average Convergence Divergence (MACD) indicator has shifted into positive territory and is trending higher, signaling strengthening bullish momentum.\nSupporting this view, the Relative Strength Index (RSI) stands at 59, suggesting there is room for further appreciation. The next significant resistance is seen near the 61.8% Fibonacci retracement level, located in the mid-1.1700s. A decisive break above this area would reinforce the corrective rally, while a failure to surpass it could see EUR/USD settling back into its recent trading range.\nThis technical analysis incorporates insights generated with the assistance of AI tools."
            },
            {
                "title": "EUR/USD: Political Risk Weakens US Dollar Support as Euro Holds Ground - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/analysis/eurusd-political-risk-weakens-us-dollar-support-as-euro-holds-ground-200672655",
                "body": "Asia stocks extend rally on chipmaker gains; Japan’s TOPIX hits fresh record high\nEUR/USD is trading around 1.1750–1.1760, repeatedly probing a zone that has rejected price multiple times since late Q3. This is not random congestion. It is the convergence of a 2025 high-week close (1.1747–1.1755), a 61.8% retracement of the September pullback, and the upper boundary of the medium-term advance that started from the 2025 lows.\nPrice is holding, not breaking. That distinction matters. Markets that hold below resistance without selling off are storing energy, not distributing it.\nECB Policy Has Quietly Shifted the Euro’s Rate Floor\nThe European Central Bank left rates unchanged in December, but the messaging did more work than a cut or hike would have. The signal was explicit: no pre-commitment to easing, decisions remain data-dependent, and policy will be reviewed meeting by meeting.\nThat language matters because it quietly removed the near-term easing tail risk that had capped EUR/USD for most of 2024. President Christine Lagarde reinforced that inflation progress does not automatically translate into rate cuts. The market response has been structural, not speculative: the euro stopped selling rallies and started defending pullbacks above 1.16.\nThe Dollar’s Weakness Is Political Before It Is Monetary\nOn the U.S. side, the pressure on the US dollar is not coming from inflation data alone. It is coming from institutional uncertainty. President Donald Trump has openly stated a preference for a more rate-friendly Federal Reserve chair once Jerome Powell’s term ends in May.\nMarkets do not price personalities; they price credibility risk. The idea that the next Fed chair could lean overtly dovish has already started to compress the USD risk premium, even before any formal nomination process begins. That is why EUR/USD rallies are not being faded aggressively despite elevated levels.\nRates Divergence Is Narrowing — And EUR/USD Trades That First\nFutures markets are pricing ~50bps of Fed cuts ahead, while the ECB is increasingly priced for policy inertia through much of 2026. That narrowing differential matters more than absolute rate levels. Historically, EUR/USD does not need the ECB to be hawkish — it only needs the Fed to lose relative dominance.\nAt 1.1750, the pair is already reflecting this shift. The question is not whether divergence exists — it does — but whether it is sufficient to force a regime break above 1.1800–1.1875.\nDaily Structure Confirms Trend Control Above 1.1635\nOn the daily chart, EUR/USD is trading well above the 100-day EMA at ~1.1635, which is sloping higher. That moving average has acted as a dynamic bid on every corrective attempt since mid-November.\nMomentum confirms the structure: the RSI near 59–60 is constructive, not stretched. This is the zone where trends extend, not reverse. Importantly, momentum has not diverged against price — a critical distinction from Q3, when upside attempts were fading on weakening RSI.\nVolatility Compression Is Not Bearish — It Is the Setup\nBollinger Bands have narrowed materially, with the mid-band around 1.1738, almost exactly where spot price is hovering. This is classic energy compression after a directional move, not exhaustion.\nThe upper band sits near 1.1820. A daily close above 1.1820 would not be cosmetic — it would represent a volatility release that historically produces measured extensions of 120–180 pips in this pair.\nWeekly Chart Shows Why 1.1750 Is a Decision Level, Not a Ceiling\nZooming out, the weekly structure shows EUR/USD pressing into confluent resistance at 1.1747–1.1775 — a zone defined by:\n• the 2025 high-week close\n• the 61.8% retracement of the September decline\n• the upper boundary of the 2025 advance\nMarkets do not turn lower from this type of structure without first breaking support. That support sits at 1.1497–1.1505, the zone defined by the March 2020 / 2022 highs and the 78.6% retracement of the July advance. As long as 1.1500 holds, this is a pa"
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0134",
            "open": "1.3443",
            "close": "1.3540",
            "high": "1.3548",
            "low": "1.3414"
        },
        "market_summary": "### GBP/USD Market Briefing\n* **Key Drivers:** The pair's upside is capped by a modest **USD uptick** amid rising geopolitical tensions, while **hawkish Bank of England (BoE) expectations** and bets for **US Federal Reserve (Fed) rate cuts** support the **GBP**.\n* **Price Action:** GBP/USD retreated from a multi-month high of **1.3545-1.3550**, trading below the mid-**1.3500s** with a lack of **bearish conviction**, currently around **1.3535-1.3530**.\n* **Technical Outlook:** Immediate support is near the **100-period MA** at **1.3420**, with resistance at **1.3550**, and the pair is likely to remain range-bound, determined more by the **USD** than **domestic UK momentum**.\n--- \n**Overall Sentiment:** Neutral 📊",
        "source_articles": [
            {
                "title": "GBP/USD retreats from multi-month high amid USD uptick - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-usd-eases-from-multi-month-top-trades-below-mid-13500s-amid-usd-uptick-202601060057",
                "body": "GBP/USD eases from multi-month top, trades below mid-1.3500s amid USD uptick\n- GBP/USD struggles to capitalize on the previous day’s blowout rally amid a modest USD uptick.\n- Persistent geopolitical uncertainties offset Monday’s mixed US PMIs and support the Greenback.\n- The divergent Fed-BoE policy expectations might act as a tailwind for spot prices and favor bulls.\nThe GBP/USD pair edges lower during the Asian session on Tuesday and reverses a part of the previous day's strong move up to the 1.3545-1.3550 area, or its highest level since September 2025. The downtick, however, lacks bearish conviction, with spot prices currently trading around the 1.3535-1.3530 region, down less than 0.10% for the day.\nAs investors look past Monday's mixed US PMI data for December 2025, the US Dollar (USD) attracts some safe-haven flows on the back of rising geopolitical tensions and acts as a headwind for the GBP/USD pair. The S&P Global US Manufacturing PMI held steady at 51.8 and indicated continued expansion. In contrast, the Institute for Supply Management's (ISM) Manufacturing PMI showed signs of persistent contraction and declined to 47.9 from 48.2 in November.\nHowever, the US military attack on Venezuela, heightened political tensions between Saudi Arabia and the UAE over a conflict in Yemen, and the lack of progress in the Russia-Ukraine peace deal help limit the downside for the Greenback. The upside for the USD, however, seems capped amid bets for at least two more interest rate cuts by the US Federal Reserve (Fed) this year. This, along with hawkish Bank of England (BoE) expectations, supports the GBP/USD pair.\nA narrow vote split to lower borrowing costs in December pointed to differences within the committee amid the recent inflation surprise. In fact, the British Retail Consortium reported this Tuesday that overall shop prices were up 0.7% YoY in December and food inflation rose to 3.3% from 3.0% in November. This might force investors to scale back expectations for more policy easing by the BoE and underpin the British Pound (GBP), warranting caution for the GBP/USD bears.\nTraders now look forward to the release of the final Services PMI from the UK and the US for a fresh impetus. The immediate market reaction, however, is likely to be muted as the focus remains glued to the closely-watched US Nonfarm Payrolls (NFP) report on Friday. Apart from this, other important US macro data scheduled at the beginning of a new month might provide cues about the Fed's rate-cut path, which will influence the USD demand and drive the GBP/USD pair.\nEconomic Indicator\nBRC Shop Price Index (YoY)\nThe British Retail Consortium (BRC) Shop Price Index measures price changes in the popular retail outlets in the UK. The changes in the SPI are widely followed as an indicator for inflationary pressures. A high reading is seen as positive (or bullish) for the GBP, whereas a low reading is seen as negative (or bearish).\nRead more.Last release: Tue Jan 06, 2026 00:01\nFrequency: Monthly\nActual: 0.7%\nConsensus: -\nPrevious: 0.6%\nSource: British Retail Consortium\nAuthor\nHaresh Menghani\nFXStreet\nHaresh Menghani is a detail-oriented professional with 10+ years of extensive experience in analysing the global financial markets."
            },
            {
                "title": "GBP/USD 2026 Outlook: Can the Pound Extend its Gains in 2026? - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/analysis/gbpusd-2026-outlook-can-the-pound-extend-its-gains-in-2026-200672681",
                "body": "Asia stocks extend rally on chipmaker gains; Japan’s TOPIX hits fresh record high\nGBP/USD rose 6.5% in 2025; however, this was driven by US dollar weakness rather than by notable strength in the pound, as evidenced by the pound’s mixed performance against its major peers. However, with questions over how much lower the USD could go, GBP/USD may struggle to book another strong year in 2026.\nIntroduction\nGBP/USD rose 6.5% in 2025; however, this was driven by U.S. dollar weakness rather than by notable strength in the pound, as evidenced by the pound’s mixed performance against its major peers. The USD Index fell 10% across 2025, marking its worst yearly performance since 1979. Meanwhile, the pound fell 5% against the euro and 6% against the Swiss Franc, although GBP was flat against the Australian dollar and gained against the Japanese yen.\nGBP/USD experienced one of its strongest annual gains in years, rising 6.5% year to date by mid-December. This move followed a 1.7% decline in the previous year and marks the strongest yearly rally since 2017. The pair booked most of its gains during the first six months of the year, as the USD experienced its steepest decline since 1979.\nGBP/USD rose from 1.21, a 15-month low, to a four-year high of 1.3790 by July 1, before consolidating across the summer. The pair fell between September and November before bouncing back in the final weeks of the year. However, with questions over how much lower the USD could go, GBP/USD may struggle to book another strong year in 2026\nUK Economic Outlook\n-\nInflation & wage growth\nUK inflation eased to 3.2% YoY in November, cooling by more than expected after peaking at 3.8% YoY in September. This was below the 4% peak forecast by the central bank. While inflation remains 1.2% above the BoE’s 2% target, the BoE acknowledged that it expects Inflation to fall closer to its 2% target next spring as CPI cools faster than expected. This, combined with an expected deflationary impact from the Budget, could lead to CPI easing further towards levels consistent with looser BoE monetary policy.\nUK CPI falls below BoE forecasts\nThe labour market is showing more signs of weakening. The unemployment rate rose to 5.1%, an almost 5-year high. Wage growth also cooled to 4.6%, with private-sector pay falling below 4% for the first time since 2020. While some of this weakness may be due to caution ahead of the Budget, these figures indicate that the UK labour market is loosening. The BoE forecasts that unemployment could rise to 5.5% in Q2 2026 owing to higher labour costs. A continued weakening in the labour market could prompt the BoE to cut rates further, although wage growth, while slowing, remains too high to be consistent with a 2% inflation target.\n-\nGrowth\nUK GDP grew 0.1% QoQ in Q3, down from 0.3% growth in Q2. According to the OECD, the UK is expected to grow by 1.2% in 2026, rising to 1.3% in 2027. This is a modest pace of growth, below long-term averages, indicating a slow-moving recovery rather than robust expansion. The slow growth is expected to be supported by easing monetary policy and improved confidence, but constrained by fiscal headwinds, weak productivity, and global economic uncertainty.\n-\nFiscal outlook\nWith the long-awaited November budget in the rear-view mirror, concerns over the UK’s fiscal position have eased. Chancellor Rachel Reeve calmed market worries by giving herself more headroom than expected, pulling gilt yields lower. The market was unfazed by the prospect of the government front-loading spending while back-loading tax increases to finance it. However, this indicates that the fiscal position remains fragile, even if the market is looking through this for now. Government spending has been at record levels across the latter part of 2025. Markets will continue to monitor government spending and public sector net borrowing closely throughout 2026. Persistent high spending could unnerve the bond market, lifting gilt yields and weighing on GBP"
            },
            {
                "title": "GBP/USD Forecast: Dollar Support Returns as Cable Tests Its Conviction - Forex Crunch",
                "source": "Forex Crunch",
                "url": "https://www.forexcrunch.com/blog/2026/01/05/gbp-usd-forecast-dollar-support-returns-as-cable-tests-its-conviction/",
                "body": "- The GBP/USD forecast edges lower as risk sentiment deteriorates, leading to increased flows to the safe-haven dollar.\n- Pound’s downside remains limited amid Cautious BoE and accommodative Fed.\n- Technically, 100-MA holds from further losses, but bearish pressure remains intact.\nAfter a brief bearish gap, GBP/USD began the new week cautiously, slightly falling below the mid-1.3400s. Although the action suggests a resurgence of demand for US dollars, there has been little selling pressure thus far. The market’s uncertainty, rather than an apparent change in direction, is highlighted by the pair’s continued hold above last week’s lows.\n–Are you interested in learning more about forex indicators? Check our detailed guide-\nOne short-term factor has been geopolitics. Some investors are turning back to the dollar as a defensive asset due to the ongoing conflict in Ukraine, the unrest in the Middle East, and the recent US military action in Venezuela. GBP/USD is under short-term pressure due to the dollar index’s continued recovery from multi-month lows. But demand for safe havens on its own hasn’t been strong enough to force a broader repricing, particularly with US rate expectations still tilted toward easing.\nThe primary counterweight to the strength of the dollar remains the outlook for interest rates. With at least one more move later in the year still priced in, markets are still debating whether the Fed will make its first cut as early as March. Any concrete proof of a slowing US labor market would support that theory and limit future dollar gains, particularly when compared to currencies where central banks seem more hesitant to ease.\nIn the UK, the relative repricing of Bank of England expectations continues to support the pound. Although the December rate cut by the BoE to 3.75% was widely anticipated, the close 5-4 vote split drew notice. Investors were compelled to lower their expectations for swift follow-up cuts, as it indicated continued concern about the persistence of inflation. Although UK growth remains muted, this change has provided sterling with some support.\nFrom a broader perspective, the US dollar’s decline, rather than the pound’s outright strength, was the main driver of the pound rally last year. Sterling underperformed several other major currencies in 2025, despite the cable rising by more than 6%. This is significant for 2026 because it implies that more upside will need support tailored to the UK rather than just a weaker dollar.\nThe UK fundamentals scenario is not entirely clear. Growth remains modest, the labor market is gradually opening up, and inflation has cooled more quickly than anticipated. When taken as a whole, these factors allow the BoE to further lower rates if conditions worsen. However, political unpredictability and fiscal fragility are still unresolved risks that could quickly reappear if gilt markets become unstable.\nThe GBP/USD price is currently close to a critical zone. While 1.30 continues to determine whether pullbacks remain corrective or initial reversal, the 1.35 area remains a distinct barrier that has consistently capped rallies. The cable is likely to remain range-bound, with direction determined more by the dollar than by domestic UK momentum, until future US labor data prompts a clearer repricing of rate expectations.\nGBP/USD Technical Forecast: 100-MA holding losses\nThe GBP/USD downside found a strong support near the 100-period MA around 1.3420. However, a Friday’s bearish pin bar and a bearish crossover of 20- and 50-period MAs reveal a building bearish pressure. Only moving above the 20-period MA, near 1.3455, could alleviate the bearish pressure and lead to a test of the supply zone near 1.3550.\n–Are you interested in learning more about next cryptocurrency to explode? Check our detailed guide-\nOn the other hand, breaking below the 10-period MA could trigger a deeper correction to a swing low of December, with confluence at the 200-period MA near 1.3300. The RSI b"
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0056",
            "open": "0.6680",
            "close": "0.6712",
            "high": "0.6718",
            "low": "0.6663"
        },
        "market_summary": "### AUD/USD Market Briefing\n\n* **Key Drivers:** The **AUD/USD** pair is supported by weak US PMI data and expectations of **monetary tightening** from the Reserve Bank of Australia (RBA), while the US Dollar is impacted by **safe-haven demand** amid geopolitical tensions and **hawkish** Federal Reserve expectations.\n* **Price Action:** The AUD/USD trades around **0.6700**, up **0.10%**, showing **bullish momentum** after the release of the US PMI data, and has rallied to its strongest level since September, reaching a high of **0.6617**.\n* **Technical Outlook:** Immediate support is near the **0.6420** level, which has repeatedly held as a floor since early August, with resistance at **0.6800**, and the pair has moved back above the **200-day moving average** at **0.6473**.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "AUD/USD rises on weak US PMI, RBA policy outlook lends support - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/aud-usd-inches-up-on-weak-us-pmi-rba-policy-outlook-supports-202601051534",
                "body": "AUD/USD inches up on weak US PMI, RBA policy outlook supports\n- AUD/USD trades slightly higher after disappointing US ISM Manufacturing PMI data.\n- Rising geopolitical tensions boost safe-haven demand in favor of the US Dollar.\n- Expectations around Australian inflation and RBA policy remain a potential support.\nAUD/USD trades around 0.6700 on Monday, up 0.10% on the day, after erasing previous intraday losses following the release of the US Purchasing Managers Index (PMI) data. The Australian Dollar (AUD) shows resilience despite an uncertain macroeconomic backdrop.\nSentiment around the Australian Dollar is influenced by the latest Chinese statistics. China’s RatingDog Services PMI slipped to 52.0 in December from 52.1 in November, pointing to a slight slowdown in activity in the services sector. At the same time, RatingDog reported last week that the Manufacturing PMI edged up to 50.1 in December from 49.9 previously, moving marginally back into expansion territory. Any change in the Chinese economy remains crucial for the Australian Dollar, as China is Australia’s main trading partner.\nOn the domestic front, expectations of monetary tightening continue to provide underlying support to the Aussie. Market participants are turning their attention to Australia’s fourth-quarter Consumer Price Index (CPI), due on January 28. Several analysts believe that a stronger-than-expected core inflation reading could prompt the Reserve Bank of Australia (RBA) to raise interest rates at its February 3 meeting. RBA Governor Michele Bullock recently noted that while the board did not explicitly consider an immediate rate hike, it did discuss the conditions under which monetary policy might need to be tightened.\nOn the US side, the US Dollar (USD) was supported earlier in the day by safe-haven demand amid heightened geopolitical tensions in Latin America. The Greenback benefited from developments surrounding Venezuela, after the United States (US) captured President Nicolas Maduro, an event that has revived geopolitical concerns and strengthened the US Dollar.\nHowever, the USD trend reverted after the release of the US Institute for Supply Management (ISM) Manufacturing PMI. The index fell for a third consecutive month to 47.9 in December, down from 48.2 in November and below market expectations of 48.3. The reading signals a faster contraction in US manufacturing activity, driven mainly by declines in production and inventories, while price pressures remain elevated. Although some components, such as New Orders and Export Orders, showed marginal improvement, the overall data reinforce signs of a cooling industrial sector, adding nuance to the outlook for US growth and monetary policy expectations.\nMarkets continue to price in two additional Federal Reserve (Fed) rate cuts in 2026. Investors also remain attentive to the prospect of US President Donald Trump nominating a new Fed Chair when Jerome Powell’s term ends in May, a move seen as potentially tilting monetary policy toward a more accommodative stance. Minutes from the December Federal Open Market Committee (FOMC) meeting showed that several officials judged it would be appropriate to pause further rate cuts as long as inflation continues to ease gradually.\nAustralian Dollar Price Today\nThe table below shows the percentage change of Australian Dollar (AUD) against listed major currencies today. Australian Dollar was the strongest against the Canadian Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Australian Dollar from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent AUD (base)/USD (quote).\nAuthor\nGhiles Guezout\nFXStreet\nGhiles Guezout is a Market Analyst with a strong background in stock market investments, trading, and cryptocurrencies. He co"
            },
            {
                "title": "AUD/USD rallies before RBA rate meeting as commodity prices rise - ig.com",
                "source": "ig.com",
                "url": "https://www.ig.com/ae/news-and-trade-ideas/AUD-USD-climbs-ahead-of-RBA-rate-meeting-on-buoyant-commodity-prices-and-risk-sentiment-251208",
                "body": "AUD/USD update\nAUD/USD climbs ahead of RBA rate meeting on buoyant commodity prices and risk sentiment\nAUD/USD surged to its strongest level since September as traders anticipate the RBA’s interest rate decision, supported by strong GDP data and rising commodity prices.\nAUD/USD rallies to multi-month high on GDP and spending data\nAUD/USD finished strongly last week at 0.6641 (+0.65%), marking its highest weekly close since early September and extending its rally from the late November low of 0.6419.\nThe Australian dollar (AUD) drew solid support from the firmer details within last Wednesday’s third-quarter (Q3) gross domestic product (GDP) reading. Although headline GDP growth for the September quarter was a modest 0.4% quarter-on-quarter (QoQ), the underlying details were impressive.\nAnnual growth increased to 2.1% year-on-year (YoY), the fastest in two years, while domestic final demand rose by a robust 1.2% QoQ. This was followed on Thursday by strong household spending data, which increased by 1.3% month-on-month (MoM) in October for an annual growth rate of 5.6% YoY, the fastest since September 2023.\nInterest rate expectations shift dramatically\nComing just a week after October’s hotter-than-expected inflation figures, these developments have resulted in the Australian interest rate market now pricing in a full 25 basis point (bp) hike by August 2026 and a total of 36 bp of Reserve Bank of Australia (RBA) rate hikes by December 2026.\nThis marks a significant change from just a few weeks ago when the Australian interest rate market was still pricing in RBA rate cuts in 2026 and brings into contrast the United States (US) scenario, where the Federal Reserve (Fed) is expected to cut rates further this Thursday.\nCommodities and risk sentiment add fuel to the rally\nFurther boosting the AUD last week, global risk sentiment remained positive and key commodities were strong, best highlighted by copper futures, which rose by 2.72% last week for their highest weekly close on record. This is a positive development for Australia’s resource-rich export economy and AUD/USD.\nLooking forward, the outcomes of Tuesday’s RBA interest rate meeting and Thursday’s Federal Open Market Committee (FOMC) meeting will be crucial in determining if AUD/USD can continue its ascent.\nRBA interest rate decision\nDate: Tuesday, 9 December at 2.30pm AEDT\nAt its last meeting in November, the RBA kept its official cash rate on hold at 3.60% as widely expected. The Board’s decision to keep rates on hold was unanimous and followed a pickup in underlying inflation during the September quarter, which exceeded both the RBA’s and the market’s forecasts.\nIn its quarterly Statement on Monetary Policy, which accompanied the decision, the RBA released updated forecasts. The bank revised higher its inflation forecasts, with trimmed mean inflation rising to 3.2% until mid-2026, only falling back to the 2.5% mid-point target in mid-2027.\nThis has been followed by a hotter-than-expected October inflation report, better-than-expected employment data, firmer components within last week’s Q3 GDP reading and robust household spending data for October.\nThis combination is expected to see the RBA keep rates on hold tomorrow at 3.60%. The RBA will be keen to keep all its options on the table for next year, with the phrase ‘data dependence’ expected to feature prominently.\nRBA cash rate chart\nAUD/USD technical analysis\nAfter reaching a high of 0.6617 at the end of October, AUD/USD fell to a three-month low of 0.6419 on 21 November. That low was in the vicinity of the 0.6420 support zone, which has repeatedly held as a floor in AUD/USD since early August.\nFrom that point, AUD/USD has mounted an impressive rally, climbing over 3.5% in just over two weeks. In the process, it has moved back above the 200-day moving average (MA) at 0.6473 and, more recently, broken above multi-month downtrend resistance originating from the February 2021 high of 0.8007, which corresponds to the 0.6600 "
            },
            {
                "title": "The Australian Dollar rises slightly to 0.6700, buoyed by weak US PMI data and RBA outlook - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/the-australian-dollar-rises-slightly-to-0-6700-buoyed-by-weak-us-pmi-data-and-rba-outlook/",
                "body": "The AUD/USD pair trades around 0.6700, up 0.10%, after the release of the US PMI data. The Australian Dollar, showing resilience, is affected by Chinese economic data as China is a main trading partner for Australia.\nChina’s Services PMI slightly slipped to 52.0 in December, while the Manufacturing PMI rose to 50.1, indicating marginal expansion. Expectations of monetary tightening support the Aussie, with attention on Australia’s upcoming CPI report due on January 28.\nThe Impact Of US Geopolitical And Economic Developments\nIn the US, the Dollar initially gained from safe-haven demand amid geopolitical tensions involving Venezuela. However, this reversed after the ISM Manufacturing PMI fell to 47.9, signalling faster contraction in the US manufacturing sector.\nMarkets anticipate two more Fed rate cuts in 2026, with interest on Trump’s potential Fed Chair nomination. Minutes from the Fed’s December meeting revealed a pause in further rate cuts if inflation eases.\nThe heat map displays percentage changes among major currencies. The Australian Dollar was strongest against the Canadian Dollar, with a 0.36% increase. The base and quote currencies in the map guide the percentage changes displayed.\nWe are seeing the AUD/USD hold steady around the 0.6700 mark, showing strength even with mixed news from China. The US Dollar is softening after the latest manufacturing data pointed to a faster contraction in that sector. This contrast between a resilient Aussie and a weakening Greenback is creating an opportunity.\nThe Influence Of Future Economic Indicators\nThe main event we are watching is Australia’s inflation data on January 28, which could be a major catalyst. Looking back at 2025, we saw the Reserve Bank of Australia struggle to bring inflation down from the cycle peaks experienced in previous years. If the upcoming CPI number is higher than expected, it could push the RBA to raise its 4.35% cash rate at the February 3 meeting, which would be very bullish for the Aussie.\nOn the other side of the trade, the US economy is showing clear signs of cooling, and markets are anticipating two more interest rate cuts from the Federal Reserve this year. The US ISM Manufacturing PMI has now been in contraction territory, below 50, for 14 consecutive months, a trend that reinforces the view that the Fed’s next moves will be to ease policy. This growing divergence between a potentially hawkish RBA and a dovish Fed supports a higher AUD/USD exchange rate.\nFor traders, this suggests that buying call options on the AUD/USD with a February expiration date could be a good strategy. This allows us to profit from a potential upward move driven by the Australian CPI data and RBA meeting. The options provide a defined risk, protecting us if the data surprises to the downside.\nHowever, we must watch for any negative news out of China, as Australia’s economy is closely tied to it. We saw how China’s uneven recovery in 2025, which included a record youth unemployment rate of over 21%, created headwinds for global growth. A sudden slowdown there could easily weaken the Australian dollar, regardless of the RBA’s actions."
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "1.1830",
            "open": "156.6930",
            "close": "156.3840",
            "high": "157.2940",
            "low": "156.1110"
        },
        "market_summary": "### USD/JPY Market Briefing\n* **Key Drivers:** The Bank of Japan's (**BOJ**) **hawkish** comments and anticipated rate hikes, combined with expected **Federal Reserve** easing, are driving the **USD/JPY** pair lower, with potential to decline to **140.00** within a year.\n* **Price Action:** The pair remains below the key resistance level of **158.90**, currently trading near **145.00**, and has already fallen significantly from its previous highs, showing **bearish** momentum.\n* **Technical Outlook:** Immediate support is near the **140.00** level, with resistance at **158.90**, and traders are considering strategies that capitalize on further downside, such as buying **USD/JPY put options** with a strike price around **140.00**.\n\n--- \n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "Despite BOJ’s hawkish comments, USD/JPY stays below 158.90 due to recent resistance levels - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/despite-bojs-hawkish-comments-usd-jpy-stays-below-158-90-due-to-recent-resistance-levels/",
                "body": "The USD/JPY pair remains below 158.90, impacted by the Bank of Japan’s firm stance on future rate increases. Governor Ueda affirmed that rates will rise as economic conditions improve, with the policy rate below the neutral 1–2.5% range. Analysts predict USD/JPY could decline to 140 within a year due to anticipated BOJ rate hikes and expected Federal Reserve easing.\nThe swaps curve indicates almost 50 basis points of BOJ rate hikes within twelve months, contrasting with 75 basis points of Fed easing expected. The USD/JPY has potential to align with one-year implied policy rate differentials, moving closer to 140.00. Market observations are sourced from a range of experts, providing a comprehensive view of current economic dynamics.\nGlobal Currency Dynamics\nIn related news, the GBP/USD has risen past 1.3500 amid geopolitical concerns and weak US data. The EUR/USD recovered in the American session, trading around 1.1700 after poor US ISM PMI reports. Gold has regained its positive movement due to geopolitical tensions and lukewarm US data, while Bitcoin and Ethereum maintain control amid ETF inflows despite geopolitical strains.\nWe’ve seen the USD/JPY pair fall significantly from the 158.90 resistance identified back in 2025. The forecast for a policy divergence was accurate, with the Bank of Japan delivering on its hawkish promises while the Federal Reserve began its easing cycle. As of today, January 5, 2026, the pair is trading near 145.00, still above the long-term target of 140.00.\nThe Bank of Japan has followed through on its rhetoric, with the policy rate now sitting at 1.25% after a series of hikes through last year. In contrast, the US Federal Reserve has cut its benchmark rate to the 4.50-4.75% range, substantially narrowing the interest rate differential that previously favored the dollar. This fundamental shift explains the powerful move down from the highs we observed in 2025.\nGiven the significant drop already, traders should consider strategies that capitalize on further downside but with defined risk. We believe buying USD/JPY put options with a strike price around 140.00 and an expiry in the next two to three months offers an attractive risk/reward profile. This allows for participation in a continued move lower while capping potential losses if the pair unexpectedly reverses.\nImplications for Traders\nHowever, we must watch US economic data closely, as the latest CPI print of 3.1% shows that inflation remains persistent. This could slow the pace of future Fed rate cuts, potentially providing some support for the dollar around the 142.00-144.00 level. For those more cautious, a put spread, such as buying a 142 put and selling a 138 put, could be a more prudent way to position for a final leg down.\nWe remember the extreme volatility in the yen from 2022 to 2024, which served as a precedent for the large directional move we saw last year. Implied volatility has recently fallen as the pair consolidates, making option premiums relatively cheaper now than they were a few months ago. This presents a tactical opportunity to position for the next significant move before volatility potentially expands again."
            },
            {
                "title": "USD/JPY holds below 158.90 amid BOJ hawkish rhetoric – BBH - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-jpy-holds-below-15890-amid-boj-hawkish-rhetoric-bbh-202601051218",
                "body": "USD/JPY holds below 158.90 amid BOJ hawkish rhetoric – BBH\nUSD/JPY remains capped under its recent double-top near 158.90, despite the Bank of Japan (BOJ) reiterating a hawkish stance. Governor Ueda confirmed that rates will rise as economic conditions improve, with the policy rate still below the neutral range of 1–2.5%. Market pricing for BOJ hikes versus Fed easing suggests the pair could move lower toward 140 over the next year, BBH FX analysts report.\nGovernor Ueda signals further rate hikes possible\n\"USD/JPY is holding under its recent double-top around 158.90. Bank of Japan (BOJ) Governor Kazuo Ueda reiterates the bank’s hawkish bias. Ueda said 'We will keep raising rates in line with improvement in the economy and inflation.' The BOJ has room to increase rates as the policy rate (0.75%) is still below the bank’s estimate of the neutral range between 1% and 2.5%.\"\n\"The swaps curve is betting on nearly 50bps of BOJ rate hikes in the next twelve months, in sharp contrast to the 75bps of easing priced for the Fed. As such, USD/JPY has scope to converge with one-year implied policy rate differentials and trade closer to 140.00.\"\nAuthor\nFXStreet Insights Team\nFXStreet\nThe FXStreet Insights Team is a group of journalists that handpicks selected market observations published by renowned experts. The content includes notes by commercial as well as additional insights by internal and external analysts."
            },
            {
                "title": "USD/JPY remains under 158.90 as BOJ maintains a hawkish tone – BBH - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605130602",
                "body": "The USD/JPY currency pair continues to struggle below its recent double-top near 158.90, even as the Bank of Japan (BOJ) maintains a firm stance on tightening. BOJ Governor Kazuo Ueda has reaffirmed that interest rates are expected to rise as Japan's economy and inflation show further improvement. Currently, the policy rate remains beneath the neutral range of 1% to 2.5%.\nAccording to BBH FX analysts, market expectations for BOJ rate increases, especially when compared to anticipated Federal Reserve rate cuts, indicate that USD/JPY could decline toward the 140.00 level over the coming year.\nGovernor Ueda has emphasized the central bank's readiness to continue raising rates as economic conditions warrant. With the current policy rate at 0.75%, there is still significant room before reaching the BOJ's estimated neutral range of 1% to 2.5%.\nMarket swaps are currently pricing in nearly 50 basis points of BOJ rate hikes over the next year, while simultaneously expecting the Fed to lower rates by about 75 basis points. This divergence in monetary policy could drive USD/JPY closer to 140.00, aligning with the projected one-year policy rate differentials."
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0087",
            "open": "1.3728",
            "close": "1.3770",
            "high": "1.3815",
            "low": "1.3728"
        },
        "market_summary": "### USD/CAD Market Briefing\n* **Key Drivers:** Rising geopolitical tensions, particularly the US capture of Venezuelan President Nicolas Maduro, and a strong **US ISM Manufacturing PMI** report are increasing bets on a more **hawkish** Federal Reserve, supporting the **US Dollar**. \n* **Price Action:** The **USD/CAD** pair has broken above **1.3750**, reaching **1.3789**, and showing significant **bullish** momentum, with the pair climbing to its highest since December 11.\n* **Technical Outlook:** Immediate resistance is near the **1.4000** psychological level, with support at the **1.3745** level, which is the Bollinger middle band. The **RSI** at **46.01** suggests **bearish** momentum, but the pair has decisively broken and held above the **100-day EMA** at **1.3877**, confirming a shift in fundamental sentiment.\n\n--- \n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "The USD/CAD pair rises above 1.3750, influenced by crude oil prices and geopolitical events - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/the-usd-cad-pair-rises-above-1-3750-influenced-by-crude-oil-prices-and-geopolitical-events/",
                "body": "Technically Bearish Momentum Persists\nThe USD/CAD pair moves higher to about 1.3770 during the early European session. Crude oil price increases following the United States’ capture of Venezuelan President Nicolas Maduro may influence the Loonie against the USD.\nThe US ISM Manufacturing PMI data will be a key focus today, with the Canadian Ivey PMI report due on Wednesday. Expectations suggest the Ivey PMI might improve slightly to 48.3 in December from 48.2 in November. Strong US data could slow interest rate cuts, supporting the US Dollar.\nTechnically, USD/CAD holds a negative outlook with the price below the 100-day EMA at 1.3877. Bollinger Bands are narrowing, indicating steadied volatility, while the RSI at 46.01 suggests bearish momentum. Support appears at the Bollinger middle band at 1.3745, with the lower band at 1.3649 providing additional support.\nFactors influencing the Canadian Dollar include interest rates set by the Bank of Canada, oil prices, Canada’s economic health, inflation, and trade balance. Decisions by the Bank of Canada affect interest rates and, consequently, the Canadian Dollar. Oil prices impact CAD since petroleum is Canada’s major export, and rising prices generally boost CAD value.\nLooking back at the analysis from late last year, the USD/CAD was trading around 1.3770 with a slight bearish technical tilt. As of today, January 5, 2026, the situation has evolved significantly, with the pair pushing towards the 1.3950 level. The key drivers we were watching then have now played out, creating a clearer path for the US dollar’s strength.\nGeopolitical and Economic Influences on Forex\nThe US ISM Manufacturing PMI report for December 2025, which the market was anticipating, came in much stronger than expected at 51.2, signaling a resilient US economy. This has led the Federal Reserve to signal a more patient approach to interest rate cuts in early 2026. This data point alone has been a primary catalyst for the US dollar’s rally against most major currencies.\nConversely, the Canadian Ivey PMI for December missed expectations, printing at 47.9 and highlighting a continued slowdown in the Canadian economy. This divergence in economic performance has been a key theme for us over the past month. The Bank of Canada is now facing more pressure to consider rate cuts sooner than the Fed, widening the policy gap.\nWhile the geopolitical spike in crude oil we saw in late 2025 provided temporary support for the loonie, prices have since stabilized around $82 a barrel as supply fears eased. Canada’s exports of over 3.7 million barrels per day to the U.S. in late 2025 mean oil is still a factor, but it is being overshadowed by the central bank divergence story. For now, oil prices are not providing enough of a tailwind to fight the US dollar’s momentum.\nThis environment suggests that volatility could increase around key data releases, particularly the upcoming January employment reports for both nations. We believe derivative traders should consider buying volatility, as a surprise in either direction could cause a sharp move. Strategies like long straddles could be effective for capturing a breakout from the current range.\nGiven the strong upward momentum and supportive fundamentals, we see the path of least resistance as higher for USD/CAD. Buying call options with a strike price around 1.4000 for February expiration offers a defined-risk way to position for further gains. This allows us to participate in the upside while capping our potential downside if sentiment unexpectedly reverses.\nTechnically, the pair has decisively broken and held above the 100-day EMA, which was cited as resistance near 1.3877 back in December. This technical breakout confirms the shift in fundamental sentiment. Historically, periods of significant Fed and Bank of Canada policy divergence, like what we observed back in 2023, have often led to sustained multi-week trends."
            },
            {
                "title": "Outlook 2026: Foreign exchange markets will be less exciting than in 2025 - OMFIF",
                "source": "OMFIF",
                "url": "https://www.omfif.org/2026/01/outlook-2026-foreign-exchange-markets-will-be-less-exciting-than-in-2025/",
                "body": "Last year saw the misguided attempt at a Mar-a-Lago Accord and Liberation Day in the US cause turbulence and a sharp dollar sell-off in global foreign exchange markets. But with the Federal Reserve and European Central Bank approaching or having reached the end of the rate-cutting cycle, foreign exchange trading should be far less exciting in 2026.\nPredicting foreign exchange markets is a fool’s errand, but it has nonetheless sprouted a cottage industry with analysts even audaciously offering pinpoint numerical forecasts conjuring up the fallacy of false precision. Joining the fray, here are six observations on the foreign exchange outlook for 2026.\n1. The dollar overall may be broadly steady to slightly down\nThe Fed, having already cut 175 basis points, has entered the neutral range. If US inflation proves somewhat sticky near 3%, growth holds up or performs slightly better than in 2025, as many predict, and soft labour markets continue without much higher unemployment, the Fed’s scope for rate cuts could prove limited, as the latest dot plot suggested. A new Fed chair may seek to tilt the Fed towards dovishness, but whether that commands a consensus or sows dissension will be closely watched.\nRegardless, longer-term rates, especially given US fiscal excesses, will not appreciably follow any decline in short rates. President Donald Trump’s unpredictability and poor treatment of allies may further take some shine off the dollar, though market participants are more likely to continue hedging exposures rather than selling the underlying assets.\nA pronounced rise in unemployment, however, could be a gamechanger, prompting more-than-expected accommodation from the Fed and driving the dollar down.\n2. US/European rate differentials may narrow somewhat, supporting the euro a little\nNotwithstanding forecasts for an upturn in growth, the German outlook is uncertain and fiscal support may not come on stream as quickly as expected, only hesitantly lifting protracted stagnation. Modest global growth and China competitiveness will inhibit European exports. France and Italy face fiscal constraints amid low potential growth. A further ECB cut later in the year cannot be precluded, which could also temper any euro upside.\n3. The yen could rise slightly against the dollar\nThe Bank of Japan raised rates by 25 basis points at the end of 2025 and may do so again later in 2026. But yen demand will remain tepid to modest in response. Markets increasingly question – justifiably or not – Japan’s fiscal sustainability.\nFurther, the BoJ will cautiously approach any rate hiking given concerns long-term rates could jump and create frictions with the government due to worries about fiscal costs on Japan’s enormous debt. Simply put, macro policy will remain riddled with contradictions. Absent bolder BoJ hiking, if the yen stays ‘too weak’, Japan will unleash more banal open-mouth operations.\n4. The Canadian dollar and Mexican peso may fluctuate narrowly against the dollar\nThe Canadian economy could pick up in the second half of 2026, prompting a firmer Bank of Canada stance and slightly pushing up the Loonie, notwithstanding oil prices that are likely to be tepid. Mexican macroeconomic policy flexibility remains hamstrung given fiscal restraint and inflation. Renegotiation of the US-Mexico-Canada Agreement – which makes up one-quarter of US trade – could throw a wild card into North American currency pairs.\n5. The renminbi should rise modestly against the dollar, but don’t confuse nominal with real appreciation\nThe trade-weighted renminbi is woefully undervalued – perhaps by some 20% – reflecting China’s massive current account surpluses and deflation. Given anaemic domestic demand and an unwillingness to proactively use fiscal policy to support consumption, China is relying on a weak renminbi to buttress exports, even though doing so doubles down on its distortionary state-led investment growth model and exacerbates global protectionism.\nFurther, with Chi"
            },
            {
                "title": "On the back foot, the Canadian Dollar falters against the US Dollar amid rising geopolitics - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/on-the-back-foot-the-canadian-dollar-falters-against-the-us-dollar-amid-rising-geopolitics/",
                "body": "The Canadian Dollar weakens against the US Dollar amid rising geopolitical tensions, following the US capture of Venezuelan President Nicolas Maduro. The USD/CAD pair is around 1.3789, having climbed to its highest since December 11.\nMarkets exhibit a risk-off tone, affecting the Loonie due to potential impacts on regional Crude Oil supply. Canada is a major energy exporter, making its currency sensitive to Oil market changes.\nVenezuela In The Crosshairs\nUS President Trump announced America’s temporary control over Venezuela, with plans for US Oil companies to invest in its energy infrastructure. Venezuela boasts the largest proven crude oil reserves, approximately 303 billion barrels, based on US EIA data.\nAttention also turns to upcoming US economic data, influencing Federal Reserve’s monetary policy expectations. Markets anticipate two rate cuts in 2026, despite near-term demand for the US Dollar.\nThe ISM Manufacturing PMI forecast remains in contraction territory. The US Nonfarm Payrolls report is a key focus for the week.\nMinneapolis Fed President Kashkari suggests US monetary policy is near neutral, with concerns over unemployment and inflation. In Canada, the BoC is comfortable with current policy, aiming for inflation near the 2% target, suggesting an end to the BoC’s easing cycle.\nCanadian Economic Indicators\nCanada’s economic calendar includes the Ivey PMI release and labour market data. Statistics show the US Dollar’s varied strength against other currencies, with gains against the Canadian Dollar.\nGiven the geopolitical tensions pushing the USD/CAD exchange rate towards 1.3800, we should anticipate heightened volatility in the coming weeks. The uncertainty surrounding Venezuelan oil supply creates a classic risk-off environment that typically benefits the US Dollar as a safe haven. This suggests that option strategies, such as buying straddles or strangles on USD/CAD, could be effective to capitalize on large price swings in either direction.\nThe market’s immediate reaction to the news from Venezuela is a spike in oil prices, which we saw with WTI crude briefly touching $80 a barrel, a level not consistently held since late 2024. However, the prospect of the US investing to restore Venezuela’s dilapidated infrastructure introduces a complex long-term factor. We should consider that Venezuelan production has been languishing below 900,000 barrels per day for years, a sharp fall from over 2.3 million bpd a decade ago, meaning a successful restoration could flood the market and cap oil prices in the medium term.\nThis situation creates a potential divergence between short-term and long-term oil futures, a structure that traders can exploit using calendar spreads. Historically, we have seen similar initial price spikes during supply shocks, like the drone attacks on Saudi facilities in 2019, which were followed by a market reassessment. Therefore, being long near-term oil contracts while remaining cautious on contracts dated for late 2026 and beyond is a prudent approach.\nThe monetary policy outlook further supports a strong US Dollar against the Canadian Dollar. While the market is pricing in two Fed rate cuts this year, the US labor market remained surprisingly resilient throughout 2025, consistently adding over 180,000 jobs per month in the final quarter. In contrast, the Bank of Canada has signaled its hiking cycle is finished, especially as Canadian job growth moderated in the latter half of last year.\nThis fundamental backdrop, combined with the current geopolitical catalyst, suggests establishing bullish positions on the USD/CAD pair. Buying call options on USD/CAD provides a risk-defined way to gain exposure to further upside, potentially targeting the 1.4000 psychological level not seen since 2022. The increased implied volatility makes options more expensive, but the potential for a sharp move justifies the premium.\nWe must pay close attention to this Friday’s US Nonfarm Payrolls report for a clearer picture o"
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "1.3290",
            "open": "210.7350",
            "close": "211.7660",
            "high": "211.8340",
            "low": "210.5050"
        },
        "market_summary": "### GBP/JPY Market Briefing\n\n* **Key Drivers:** The Japanese Yen (**JPY**) is gaining support due to **hawkish** comments from Bank of Japan (**BoJ**) Governor Kazuo Ueda, indicating further interest rate hikes, while the British Pound (**GBP**) is expected to remain on the sidelines in a light UK economic calendar week.\n* **Price Action:** The **GBP/JPY** pair is trading around **210.80**, easing within a two-week consolidation range, after reaching a fresh multi-year high at **212.15**.\n* **Technical Outlook:** The pair is holding above the **20-day Exponential Moving Average (EMA)** at **210.04**, preserving the **bullish bias**, but the **14-day Relative Strength Index (RSI)** at **70.84** suggests stretched momentum, with immediate support near **210.00** and resistance at **215.00**.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "GBP/JPY Price Forecast: Looks set for fresh rally above 212.20 - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-price-forecast-looks-set-for-fresh-rally-above-21220-202601060550",
                "body": "GBP/JPY Price Forecast: Looks set for fresh rally above 212.20\n- GBP/JPY strengthens on the Japanese Yen's continued underperformance.\n- BoJ’s Ueda has kept the door open for further interest rate hikes.\n- The Pound Sterling is expected to remain on the sidelines in a light UK economic calendar week.\nThe GBP/JPY pair posts a fresh multi-year high at 212.15 during the Asian trading session on Tuesday. The pair trades firmly as the Japanese Yen (JPY) underperforms across the board, even as Bank of Japan (BoJ) Governor Kazuo Ueda has signaled that there will be more interest rate hikes in the near term.\nJapanese Yen Price Today\nThe table below shows the percentage change of Japanese Yen (JPY) against listed major currencies today. Japanese Yen was the weakest against the New Zealand Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Japanese Yen from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent JPY (base)/USD (quote).\n“BoJ expected to continue raising interest rates if economy and prices move in line with our forecast,” Governor Ueda said on Monday, and added that adjusting the degree of monetary support will help achieve “sustained growth and stable inflation”.\nThis week, investors will focus on the Overall Household Spending data for November, which will be published on Friday. The data is expected to have declined at a moderate pace of 1% against a 3% contraction in October.\nMeanwhile, the Pound Sterling (GBP) trades higher against its peers, except antipodeans, as the market sentiment turns positive after the risks of a United States (US)-Venezuela clash subsiding. The British currency is expected to be majorly driven by market expectations for the Bank of England’s (BoE)monetary policy outlook amid a light United Kingdom (UK) economic calendar week.\nGBP/JPY technical analysis\nIn the daily chart, GBP/JPY trades at 211.92 as of writing. The 20-day Exponential Moving Average (EMA) rises and provides support at 210.04. Price holds above this rising gauge, preserving the bullish bias.\nThe 14-day Relative Strength Index (RSI) at 70.84 is positive but carries risks of stretched momentum.\nAs long as the pair remains above the ascending 20-day EMA, the trend is positive and could extend towards 215.00. While a close below 210.04 could invite a corrective pullback towards the December 19 low of 208.00.\n(The technical analysis of this story was written with the help of an AI tool.)\nBank of Japan FAQs\nThe Bank of Japan (BoJ) is the Japanese central bank, which sets monetary policy in the country. Its mandate is to issue banknotes and carry out currency and monetary control to ensure price stability, which means an inflation target of around 2%.\nThe Bank of Japan embarked in an ultra-loose monetary policy in 2013 in order to stimulate the economy and fuel inflation amid a low-inflationary environment. The bank’s policy is based on Quantitative and Qualitative Easing (QQE), or printing notes to buy assets such as government or corporate bonds to provide liquidity. In 2016, the bank doubled down on its strategy and further loosened policy by first introducing negative interest rates and then directly controlling the yield of its 10-year government bonds. In March 2024, the BoJ lifted interest rates, effectively retreating from the ultra-loose monetary policy stance.\nThe Bank’s massive stimulus caused the Yen to depreciate against its main currency peers. This process exacerbated in 2022 and 2023 due to an increasing policy divergence between the Bank of Japan and other main central banks, which opted to increase interest rates sharply to fight decades-high levels of inflation. The BoJ’s policy led to a widening differential with other currencies, dragging down the value of the Yen. This trend pa"
            },
            {
                "title": "The Yen gains support after remarks from BoJ Governor, causing the GBP to weaken against it - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/the-yen-gains-support-after-remarks-from-boj-governor-causing-the-gbp-to-weaken-against-it/",
                "body": "The GBP/JPY has seen a slight dip as the Yen receives backing from Bank of Japan (BoJ) Governor Ueda’s hawkish comments. Current swaps suggest nearly 50 basis points of BoJ rate hikes anticipated this year. Market focus shifts to upcoming UK Services PMI and Japan’s labour and confidence data.\nThe British Pound experiences a minor decline against the Japanese Yen, with the pair trading around 210.80 and maintaining a two-week range. BoJ Governor Ueda reiterated the bank’s readiness to increase interest rates aligned with projections, foreseeing sustainable economic growth driven by moderate wage and price rises. The decision to raise the policy rate target to 0.75% during December—marking a three-decade high—underlines this approach.\nJapan And UK PMI Data\nJapan’s manufacturing PMI slightly improved from 49.7 in November to 50 in December. On the UK front, the Bank of England exhibits a cautious stance, maintaining a gradual easing bias from December with no clear guidance on future rate adjustments. Analysts will monitor upcoming PMI data from both countries.\nIn currency dynamics, the Japanese Yen exhibited today’s strongest performance against the Canadian Dollar. The included heat map details the percentage change of major currencies against each other, offering insights into the current landscape of Forex movements.\nThe clear divergence between the Bank of Japan and the Bank of England is the most important factor for us right now. The BoJ is signaling more rate hikes are coming this year, while the BoE is leaning towards easing. This fundamental policy gap suggests that the recent strength in the Japanese Yen could continue, putting downward pressure on the GBP/JPY cross.\nWe see this view supported by hard data from the end of last year. Looking back at 2025, Japan’s spring ‘shunto’ wage negotiations resulted in pay hikes of over 5%, and the latest Tokyo core inflation figures for December held firm at 2.8%. This underlying economic pressure makes further BoJ tightening not just a possibility, but a necessity to manage inflation.\nUK Economic Slowdown\nOn the other side, the UK economy is showing signs of slowing down, justifying the Bank of England’s cautious tone. The UK’s economy saw a slight contraction of 0.1% in the final quarter of 2025, while headline inflation fell to 2.3% in November, moving much closer to the BoE’s 2% target. This situation makes it difficult for the central bank to hold rates high for much longer, which should limit the Pound’s upside.\nFor derivative traders, this environment makes positioning for a move lower in GBP/JPY attractive. Buying put options on GBP/JPY with strike prices below the current 210.00 consolidation level offers a defined-risk way to profit from a potential downturn. For those expecting a more gradual decline, selling out-of-the-money call spreads could be an effective strategy to collect premium while the pair remains capped.\nWe must also consider that this pair has had a massive run, climbing from levels below 190 through most of 2025 to these multi-decade highs. Such extended trends are often sensitive to the kind of central bank policy shift we are now witnessing. The current pause around 210.80 could be a critical moment before a more significant correction takes hold."
            },
            {
                "title": "GBP/JPY eases within range as BoJ comments support the Yen - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605130737",
                "body": "The British Pound (GBP) trades slightly lower against the Japanese Yen (JPY) on Friday, as the Yen draws broad-based support following fresh comments from Bank of Japan (BoJ) Governor Kazuo Ueda, which reinforced expectations of further monetary policy tightening. At the time of writing, GBP/JPY is trading around 210.80, remaining confined within a two-week consolidation range.\nBoJ Governor Kazuo Ueda reiterated that the central bank remains prepared to raise interest rates further if economic conditions evolve in line with its projections. Speaking earlier on Monday, Ueda said he expects Japan’s economy to sustain a cycle in which wages and prices rise moderately, adding that adjusting the degree of monetary support would help achieve stable and sustainable economic growth.\nHis remarks strengthened market expectations that the Bank of Japan is moving cautiously but steadily toward further policy normalization, following its decision to lift the policy rate target to 0.75% at the December meeting, the highest level in around three decades.\nThe sustained weakness in the Japanese Yen has also strengthened the case for further policy tightening. According to the latest BHH MarketView report, the swaps curve is pricing in nearly 50 basis points (bps) of rate hikes by the BoJ over the next twelve months.\nOn the data front, Japan’s Jibun Bank Manufacturing PMI edged up to 50.0 in December from 49.7 in November, offering modest additional support to the Yen.\nOn the UK side, the policy backdrop remains more cautious. At its December meeting, the Bank of England (BoE) maintained a gradual easing bias but signalled that future rate decisions are becoming a “closer call.”\nWhile policymakers acknowledged that interest rates could move lower over time, they stopped short of offering clear guidance on the timing or pace of further easing. As a result, market pricing remains restrained, with only one additional BoE rate cut fully priced in for 2026.\nLooking ahead, the economic calendar remains relatively light on both sides. In the UK, attention will turn to S&P Global Composite and Services PMI data due on Tuesday. In Japan, markets will watch the Jibun Bank Services PMI on Wednesday, followed by labour cash earnings and consumer confidence figures on Thursday."
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "3,735.0000",
            "open": "91,230.9700",
            "close": "94,097.5000",
            "high": "94,800.5000",
            "low": "91,065.5000"
        },
        "market_summary": "### BTC/USD Market Briefing\n* **Key Drivers:** Institutional investors are increasing their investments in Bitcoin ETFs, with a record **$694.67 million** inflow on January 5, 2025, indicating growing **bullish momentum** and trust in digital assets.\n* **Price Action:** The recent inflows have contributed to a surge in **BTC/USD**, breaking above the key psychological level of **$50,000**, showing significant **upward momentum**.\n* **Technical Outlook:** Immediate support is near the 50-day moving average at **$45,000**, with resistance at **$55,000**.\n\n--- \n**Overall Sentiment:** Positive 🚀",
        "source_articles": [
            {
                "title": "Bitcoin ETF Inflows: Catalyst for Crypto Payroll? - OneSafe",
                "source": "OneSafe",
                "url": "https://www.onesafe.io/blog/bitcoin-etf-inflows-impact-crypto-payroll-adoption",
                "body": "Bitcoin ETFs are bringing in a tidal wave of cash. On January 5, 2025, we saw a whopping $694.67 million pour into U.S. spot Bitcoin ETFs. This isn't just a number; it's a sign that institutional investors are getting more comfortable with digital assets. But what does this mean for crypto payroll?\nInstitutional Trust in Crypto Payroll\nWith this influx of cash, it's clear that institutions like BlackRock and Fidelity are leading the charge, and they're bringing fintech startups along for the ride. The focus has shifted from just trading to actual investment, and this is opening doors for crypto payroll as a viable option. Startups in Asia are already ahead of the game. They're offering their employees the chance to get paid in Bitcoin or stablecoins like USDC, which is a big deal for regions dealing with economic struggles. Take Argentina, for instance—where inflation is sky-high, these companies are opting for stablecoin salaries for more consistent pay.\nThe Growing Need for USDC Off-Ramp Business\nThese ETF inflows are also giving a boost to the USDC off-ramp business. More companies are adopting crypto payroll, and they're finding themselves needing a way to convert those coins. Startups are looking to tap into crypto banking for help, especially if they want to pay their employees in cryptocurrency payments. This is crucial in areas where traditional banks aren't as accessible, allowing them to reach unbanked communities.\nThe Long Game for Cryptocurrency Payments\nThe long-term effects of this inflow are just as important. If institutional investors keep pouring money into these funds, the demand for cryptocurrency payments is bound to grow. Crypto payroll is becoming more common, and it's starting to show up in various fields—from tech to entertainment. Pop culture icons, like NFL players and YouTubers, are choosing to get paid in Bitcoin. This cultural acceptance is vital; it's proof that crypto can be more than just a trading tool.\nSummary\nThe recent inflow into Bitcoin ETFs is a big deal for institutional adoption. The movement of capital shows that investors are getting more comfortable with Bitcoin. The rise of crypto payroll is an extension of this shift, driven by institutional confidence and fintech innovation. It’s poised to change how we think about work and financial inclusion."
            },
            {
                "title": "Assessing BlackRock (BLK) Valuation As Institutional Flows Into Its Bitcoin ETF Gain Momentum - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/assessing-blackrock-blk-valuation-institutional-191108480.html",
                "body": "BlackRock (BLK) is back in focus after its spot Bitcoin ETF recorded its largest single day inflow in nearly three months, as institutional interest in crypto linked funds picked up.\nSee our latest analysis for BlackRock.\nAt a share price of $1,085.06, BlackRock’s recent 1 day share price return of 1.38% comes after a 90 day share price return decline of 6.96%, while its 1 year total shareholder return of 9.34% and 5 year total shareholder return of 59.56% point to momentum that has built over a longer holding period, even as crypto related headlines, new Bitcoin ETF coverage from major banks, and fund reorganization moves keep short term sentiment shifting.\nIf BlackRock’s crypto and ETF story has your attention, it could be a moment to broaden your search and check out fast growing stocks with high insider ownership for other ideas catching investors’ eyes.\nWith BlackRock trading at $1,085.06 and sitting at a 21.6% discount to the average analyst price target of $1,319.33, the key question is whether this reflects undervaluation or if the market is already pricing in future growth potential.\nMost Popular Narrative: 17.8% Undervalued\nWith BlackRock at a last close of $1,085.06 versus a narrative fair value of about $1,319.33, the valuation case leans toward meaningful upside and puts its earnings engine under the spotlight.\nBlackRock's expansion into private markets through acquisitions like HPS Investment Partners, GIP, and ElmTree positions the company to benefit from the secular shift of institutional assets into alternatives and infrastructure, supporting higher-fee revenue streams and long-term earnings potential.\nWant to see what sits behind that valuation gap? The narrative focuses on compounding revenue, wider margins, and an earnings profile tied to a lower future P/E. Curious which assumptions really move the fair value needle here?\nResult: Fair Value of $1,319.33 (UNDERVALUED)\nHave a read of the narrative in full and understand what's behind the forecasts.\nHowever, this depends on fee pressure in core ETFs not intensifying and on complex private market acquisitions avoiding costly integration setbacks that could reduce margins.\nFind out about the key risks to this BlackRock narrative.\nAnother Angle On Value: P/E Versus Fair Ratio\nThe narrative fair value hints at upside, but the P/E picture is more cautious. BlackRock trades on a 27.6x P/E, while our fair ratio sits closer to 19.6x, and peers average 46.1x. That mix of premium to fair ratio yet discount to peers raises a simple question: is this price more risk buffer or optimism?"
            },
            {
                "title": "Spot Bitcoin ETF Flows Reveal the Unvarnished Truth About Market Sentiment, Says Expert - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/news/feed/cc943-spot-bitcoin-etf-market-sentiment-indicator",
                "body": "cryptorank.io\nVerifying you are human. This may take a few seconds.\ncryptorank.io needs to review the security of your connection before proceeding.\nVerification successful\nWaiting for cryptorank.io to respond...\nEnable JavaScript and cookies to continue"
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "133.0000",
            "open": "3,142.9300",
            "close": "3,235.3000",
            "high": "3,263.3000",
            "low": "3,130.3000"
        },
        "market_summary": "### ETH/USD Market Briefing\n\n* **Key Drivers:** Ethereum's co-founder Vitalik Buterin claims the blockchain trilemma has been solved, citing advancements in zero-knowledge virtual machines and the Fusaka upgrade, which could lead to increased **scalability** and **decentralization**.\n* **Price Action:** Currently trading at **$3,223.51** with a **1.09%** daily gain, ETH is showing **bullish momentum** as it competes with Binance Coin (BNB) for supremacy in the crypto market.\n* **Technical Outlook:** Immediate support is near the **$3,000** level, with resistance at **$3,500**, as the market awaits the full realization of Ethereum's technical advancements, expected to take **years** to fully implement.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Ethereum ‘solved’ the blockchain trilemma: Vitalik - dlnews.com",
                "source": "dlnews.com",
                "url": "https://www.dlnews.com/articles/defi/ethereum-solved-the-blockchain-trilemma-per-vitalik-buterin/",
                "body": "- Ethereum has solved the blockchain trilemma, according to Vitalik Buterin.\n- He cites two advancements: the steady progress of zero-knowledge virtual machines and the December Fusaka upgrade, which introduced peer data availability sampling.\n- But it will take years to take advantage of these developments, Buterin added.\nEthereum is becoming a “fundamentally new” decentralised network due to two recent technical advances, according to co-founder Vitalik Buterin.\nThe upshot? It has solved the notorious blockchain trilemma, Buterin argued.\n“The trilemma has been solved — not on paper, but with live running code,” he wrote on X on Saturday.\nThe trilemma is a purported constraint on blockchain technology that states a blockchain must sacrifice one of three key features: decentralisation, scalability, or safety.\nOne advancement cited in Buterin’s post was Ethereum’s recent upgrade, codenamed Fusaka, which introduced a concept known as peer data availability sampling, or PeerDAS. That allows for a substantial increase in the amount of data that layer 2 blockchains can send to Ethereum.\nThe other was the slow improvement of zero-knowledge virtual machines, which dramatically slash the cost of validating blocks of transactions on Ethereum.\n“This was a 10-year journey,” Buterin wrote, “but it’s finally here.”\nFusaka and zkVMs\nLayer 2s send packets of data known as blobs to Ethereum for settlement. Fusaka’s introduction of PeerDAS allows individual nodes to store a fraction of blob data without compromising their ability to verify the entirety of that data.\nWith the upgrade, Ethereum’s blob capacity jumped eightfold, though increases will be implemented slowly in a series of smaller upgrades.\nLast month, Buterin argued PeerDAS could eventually make it cheaper to transact on Ethereum itself.\n“We think of blobs as being for L2s,” he said on a livestream celebrating the upgrade. “In the long term, we want to dump L1 data into blobs as well.”\nZero-knowledge virtual machines, meanwhile, provide a more efficient alternative to Ethereum’s current mechanism for verifying proposed blocks.\nCurrently, each validator must re-execute every proposed transaction in a block to confirm those transactions are valid. Zero-knowledge technology allows a single participant to generate a proof that shows the entire batch is correct.\nThis dramatically lowers validators’ computational demands, allowing Ethereum developers to increase the number — or complexity — of transactions that can be included in a block without pushing out smaller participants who cannot afford top-of-the-line hardware.\nAccording to Buterin, zero-knowledge virtual machines for Ethereum are at “production-quality performance,” and “remaining work is safety.”\nThat said, full realization of these improvements is years away, according to Buterin.\nUpcoming network upgrades, which include features like block-level access lists and enshrined proposer-builder separation, will make it easier to operate nodes running zero-knowledge virtual machines.\nBy 2030, that will become the primary way to validate blocks on Ethereum, Buterin wrote.\nAleks Gilbert is DL News’ New York-based DeFi correspondent. You can contact him at aleks@dlnews.com."
            },
            {
                "title": "Binance Coin (BNB) Vs Ethereum: Which Is More Profitable In 2026? - InteractiveCrypto",
                "source": "InteractiveCrypto",
                "url": "https://www.interactivecrypto.com/binance-coin-bnb-vs-ethereum-which-is-more-profitable-in-2026-1767670386367",
                "body": "Create a FREE account and...\nManage your own Watchlist\nAccess all education lessons\nConverse with other crypto enthusiasts\nBe a part of the Interactive Crypto Community\nOR\nPlease fill out the required fields Please fill out the required fields Please fill out the required fields\nGet Into Cryptocurrency Trading Today\nAs of January 6, 2026, the cryptocurrency market is buzzing with a high-stakes showdown between Binance Coin (BNB) and Ethereum (ETH), two titans vying for supremacy in a $3.3 trillion industry. This rivalry isn’t just about price charts—it’s about the future of blockchain technology, investor returns, and the next wave of digital wealth creation. With BNB trading at $906.9 today, showing a steady 0.81% daily uptick, and Ethereum holding strong at $3,223.51 with a 1.09% daily gain, the numbers only tell half the story. What’s at stake here is monumental: Will BNB’s deflationary edge and deep ties to the world’s largest exchange outshine Ethereum’s DeFi dominance? For investors, tech enthusiasts, and anyone eyeing the crypto space, this battle could redefine your portfolio—and your financial future. Let’s dive into why some of the sharpest minds in finance are quietly shifting their gaze toward BNB, and how you can position yourself for what’s next. Curious about the data-driven outlook? Get AI analysis for Binance Coin to see the latest insights.\nThe crypto market in January 2026 is a cauldron of opportunity and uncertainty, with a total capitalization of $3.3 trillion and a 24-hour trading volume of $137.26 billion, according to CoinGecko data. Bitcoin continues to dominate with a 56.81% market share, while Ethereum holds a solid 11.79%. Yet, the spotlight is increasingly on Binance Coin, which commands roughly 5% of the market and is gaining traction for reasons beyond mere price action. The current market sentiment, pegged at a “Fear” index of 44 by Alternative.me, suggests investors are treading cautiously—perhaps waiting for a catalyst.\nBinance Coin’s recent performance, though slightly behind Ethereum’s daily gain, masks a deeper momentum. Its integration with Binance, the world’s largest crypto exchange by volume, gives it unparalleled utility—from discounted trading fees to powering transactions on the BNB Chain. This ecosystem synergy is something Ethereum, despite its vast network, can’t fully replicate.\nEthereum, meanwhile, remains the backbone of decentralized finance (DeFi), with billions locked in its protocols. Its transition to Proof-of-Stake (PoS) has bolstered energy efficiency and staking rewards, yet lingering scalability concerns and high gas fees continue to frustrate users. As layer-2 solutions like Optimism and Arbitrum gain traction, the question is whether Ethereum can maintain its lead.\nFor anyone with skin in the crypto game, the BNB vs. ETH debate isn’t academic—it’s personal. Binance Coin’s deflationary model, driven by quarterly token burns, systematically reduces supply, which could spell higher prices if demand holds. This contrasts with Ethereum’s inflationary tendencies, even post-merge, where staking rewards add to circulating supply. If you’re looking for long-term value appreciation, BNB might be the sleeper hit of 2026.\nThat said, Ethereum offers a safer bet for risk-averse investors due to its established ecosystem and institutional backing. Its role as the go-to platform for smart contracts and NFTs means it’s unlikely to fade anytime soon. However, BNB’s lower transaction fees and faster processing times could attract a new wave of retail and institutional investors, especially in emerging markets. Want to dive deeper into the numbers? Check the AI analysis for real-time signals on both coins.\nTo grasp why billionaires and hedge funds are reportedly eyeing BNB, you need to step back and see the broader picture. Binance Coin was initially launched as a utility token for the Binance exchange in 2017, but it has evolved into a cornerstone of the BNB Chain, a high-speed blockch"
            },
            {
                "title": "A few Republicans have crypto's destiny in their hands at the SEC, CFTC - CoinDesk",
                "source": "CoinDesk",
                "url": "https://www.coindesk.com/policy/2026/01/05/a-few-republicans-have-crypto-s-destiny-in-their-hands-at-the-sec-cftc",
                "body": "A few Republicans have crypto's destiny in their hands at the SEC, CFTC\nAfter holiday leadership shifts, the two U.S. markets regulators — the SEC and CFTC — are now run only by pro-crypto Republicans, with Congress still debating.\nWhat to know:\n- The crypto industry finally has two permanent, crypto-friendly chairmen at the Securities and Exchange Commission and the Commodity Futures Trading Commission, and they have no Democratic pushback.\n- The lack of fully stocked commissions at the market regulators is a big problem in the eyes of Senate Democrats negotiating the crypto market structure bill.\n- The lone remaining Democrat, Caroline Crenshaw, left the SEC last week.\nPresident Donald Trump's campaign to cut Democrats out of U.S. regulatory work has set up an unusual situation at the two agencies that will have the most say over how the federal government handles crypto: A handful of Republican crypto advocates are entirely in charge of both.\nThe U.S. Securities and Exchange Commission just said farewell to its only Democratic commissioner, Caroline Crenshaw, last week, removing routine opposition to its current policy drives. Crenshaw had often cautioned the agency about its shift toward a digital asset embrace, including opposing bitcoin exchange-traded funds (ETF) as a danger to investors. She took a consumer-protection stance that regularly extended to those who invest in crypto.\n\"I think it’s safe to say they’re speculating, reacting to hysteria from promoters, feeding a desire to gamble, wash trading to push up prices, or as one Nobel laureate has posited — betting on the popularity of the politicians who support, or stand to benefit personally from, the success of crypto,\" Crenshaw had said in a speech last month. Whether or not such vocal opposition inside the agency has an effect on the regulatory direction of the SEC, it's over now, and the regulator is run by Trump nominee Chairman Paul Atkins and two commissioners who'd advanced crypto interests, Hester Peirce and Mark Uyeda.\nAt its sister agency, the Commodity Futures Trading Commission, the new year begins with a new leader, as Trump nominee Mike Selig won the confirmation late last month to be sworn in as chairman on Dec. 22. Acting Chairman Caroline Pham took the opportunity to exit for an industry job at MoonPay, leaving Selig alone in the five-member commission.\nWhile that may be a good situation for crypto-friendly policy, as Selig advances into his not-yet-outlined agenda without needing input or debate from fellow commissioners, the absence of a bipartisan slate of commissioners at the CFTC and SEC has become a sticking point for crypto legislation in the U.S. Senate.\nOne of the remaining points of debate over the bill that could establish a U.S. crypto regulatory regime is the Democrats' demand that their party's vacancies be filled at the two agencies. It's unclear how much Republicans are prepared to give on that. For his part, Trump has been less than illuminating.\nWhen asked recently whether he'd be willing to make Democratic nominations, he answered with a question, “Do you think they would be appointing Republicans if it were up to them?”\nThe historic answer is that presidents of both parties have routinely made nominations from both, often in package deals negotiated in Congress that result in multiple confirmations at once.\n“There are certain areas we do look at, and certain areas that we do share power, and I’m open to that,” Trump concluded, leaving the matter in uncertain waters.\nBoth agency chiefs have been careful not to rhetorically run afoul of Trump's preference not to allow new Democrats into regulatory roles, with new CFTC chief Selig saying in his confirmation testimony that he'd welcome bipartisan input at the agency but that it's out of his hands.\nAtkins noted at Crenshaw's departure that she had \"listened carefully, engaged substantively and approached every day with the purpose of safeguarding investors and strengthening our mark"
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "6.6006",
            "open": "133.7857",
            "close": "138.2942",
            "high": "139.7306",
            "low": "133.1300"
        },
        "market_summary": "### SOL/USD Market Briefing\n* **Key Drivers:** Continued ecosystem growth and network adoption are driving **bullish** momentum, with Solana's price predicted to reach a maximum of **$166.94** in 2026 and potentially **$397.47** by 2032.\n* **Price Action:** SOL/USD has broken back above the **$135** mark, facing resistance at **$140**, with support at **$120** and showing significant **bullish** momentum.\n* **Technical Outlook:** The Relative Strength Index (RSI) indicator is in the neutral area but leans close to the overbought level, with a value of **60.61**, suggesting a support forming at the level, and the Bollinger Bands indicating increased volatility with the upper limit at **$134.91** and the lower limit at **$117.15**.\n\n--- \n**Overall Sentiment:** Positive 🚀",
        "source_articles": [
            {
                "title": "Solana Price Prediction 2026, 2027, 2028-2032 - Cryptopolitan",
                "source": "Cryptopolitan",
                "url": "https://www.cryptopolitan.com/solana-price-prediction/",
                "body": "Key takeaways\n- Solana’s price can reach a maximum of $166.94 with an average trading value of $155.83 in 2026.\n- By 2029, SOL is expected to reach a high of $263.38, supported by continued ecosystem growth and network adoption.\n- Solana’s price could see further upside by 2032, potentially reaching $397.47 with an average trading price around $365.19.\nDespite occasional challenges for the Solana network ecosystem, including network congestion and competition from other blockchain platforms, the current sentiment shows that Solana demonstrates resilience and adaptability, despite the current price fluctuations, positioning itself as a leading player in the decentralized finance (DeFi) and Web3 landscape.\nOverall, the prevailing sentiment regarding the current Solana price within the Solana community reflects the current sentiment of confidence and excitement among investors, driven by the growing interest in Solana with stakeholders eagerly anticipating the platform’s continued evolution and impact on the broader crypto ecosystem.\nWhile uncertainties persist, Solana’s innovative approach, along with its low transaction fees and robust infrastructure instill optimism for its future price action, as indicated by the technical factors and technical analysis. In this article, we’ll explore Solana price prediction and market dominance, particularly when evaluated against momentum indicators. This brings the question “How high can SOL go in 2026 and beyond?” and we’ll try to answer that.\nOverview\nSolana price prediction: Technical analysis\nSolana price analysis: SOL climbs back to $136\nTL;DR Breakdown:\n- Solana price analysis confirmed a bullish sentiment as price rises to $136\n- The altcoin gained 1.19% of its value across last 24-hours.\n- Support for SOL/USD is at $120.\nAs of January 5, the Solana price analysis reveals a bullish market sentiment as the price rises to the $136 mark. SOL is now headed to the $140 mark where it faces resistance.\nSolana price analysis 1-day chart: SOL climbs back above $135\nThe one-day price chart of the Solana shows that the decline is continuing with the drop below the $125 mark before the bulls found support, enabling recovery. However, after failing to climb past $140 the price was headed down below $125 but finds support at $120 that has enabled recovery back to the $136 level where it faces resistance.\nThe distance between the Bollinger Bands defines the level of volatility. This distance between high and low bands is widening, leading to increased volatility. Moving ahead, the upper limit of the Bollinger Bands indicator, acting as the resistance band, has shifted to $134.91. The indicator’s lower limit, which shows a support level, has shifted to $117.15.\nThe Relative Strength Index (RSI) indicator is present in the neutral area but leans close to the overbought level. The indicator’s value has increased to index 60.61, and its upwards curve suggests a support forming at the level. If buying activities continue to intensify, further volatility in the market can be expected.\nSOL/USD 4-hour price chart\nThe four-hour price analysis of the Solana token shows steady bullish activity as the bulls rise back above the $135 mark. The altcoin’s price declined to $134 but quickly rose to the current $136.\nThe Bollinger Bands have diverged, hinting at a higher volatility level. This level of volatility signifies increased market unpredictability. Moving forward, the upper Bollinger Band has shifted to $137.68, securing the resistance point. Conversely, the lower Bollinger Band has moved to $129.20, indicating support.\nThe RSI indicator is in the oversold region. Currently at 67.30 the RSI curve is pointing straight, suggesting neutral market sentiment at the level. The level of the index suggests little to no room for further upwards movement across the short-term. We can expect further increase if buying activities persist for a few more candles.\nSolana technical indicators: Levels and action\nDaily simp"
            },
            {
                "title": "DeFi Development Corp. Publishes “Crypto’s 2025 Winner: - GlobeNewswire",
                "source": "GlobeNewswire",
                "url": "https://www.globenewswire.com/news-release/2026/01/05/3213096/0/en/DeFi-Development-Corp-Publishes-Crypto-s-2025-Winner-Solana-Highlighting-Network-Adoption-Revenue-and-Market-Dominance.html",
                "body": "BOCA RATON, FL, Jan. 05, 2026 (GLOBE NEWSWIRE) -- DeFi Development Corp. (Nasdaq: DFDV) (the “Company”), the first public company with a treasury strategy built to accumulate and compound Solana (“SOL”), today announced the publication of a comprehensive analysis detailing Solana’s industry-leading performance across the most important onchain metrics in 2025. The full report is available here: https://defidevcorp.beehiiv.com/p/solana-2025\nWith 2025 now in the rear-view, the smart contract war has entered its second decade. For a second consecutive year, Solana not only outperformed every major smart contract platform but extended and compounded its lead across real demand and economic activity. The data shows Solana decisively ahead of Ethereum, BNB Chain, and all other competitors across usage, growth, and economic gravity.\nKey highlights from the report include:\n• Transactions & Throughput: Solana processed approximately 33.1 billion transactions in 2025, up 28% YoY, more than all other major blockchains combined. Solana also averaged over 1,100 transactions per second, a 34% increase from 2024.\n• User Growth: Solana added approximately 1 billion new wallets in 2025, a ~50% year-over-year increase and more than every other major chain combined.\n• Developer Ecosystem: Solana hosted approximately 10,753 active developers in 2025 (+41% YoY), surpassing Ethereum’s developer count.\n• Onchain Economic Activity: Decentralized exchange (DEX) volume on Solana surged to $1.57 trillion, up 126% YoY, and eclipsed Ethereum’s ~ $946 billion total.\n• Network Revenue: Solana generated approximately $1.41 billion in onchain fees, surpassing Ethereum even as fee levels remained dramatically lower.\n• Fee Stability: Using DeFi Development Corp.’s Fee Stability Ratio (FSR), Solana scored roughly 743, signaling astronomically lower median transaction fees and median transaction fee volatility than peers.\n• Tokenized Markets: In just six months following the launch of tokenized equities on Solana, the network processed approximately $2.9 billion in tokenized stock volume, more than any other chain.\nThe 2025 Solana Dominance Report is data-driven and transparent, drawing on publicly available metrics across transactions, wallet growth, throughput, developer activity, economic volume, revenue, fee reliability, and emerging markets such as tokenized securities.\nTo read the full analysis, visit: https://defidevcorp.beehiiv.com/p/solana-2025\nAbout DeFi Development Corp.\nDeFi Development Corp. (Nasdaq: DFDV) has adopted a treasury policy under which the principal holding in its treasury reserve is allocated to SOL. Through this strategy, the Company provides investors with direct economic exposure to SOL, while also actively participating in the growth of the Solana ecosystem. In addition to holding and staking SOL, DeFi Development Corp. operates its own validator infrastructure, generating staking rewards and fees from delegated stake. The Company is also engaged across decentralized finance (“DeFi”) opportunities and continues to explore innovative ways to support and benefit from Solana’s expanding application layer.\nThe Company is an AI-powered online platform that connects the commercial real estate industry by providing data and software subscriptions, as well as value-add services, to multifamily and commercial property professionals, as the Company connects the increasingly complex ecosystem that stakeholders have to manage.\nThe Company currently serves more than one million web users annually, including multifamily and commercial property owners and developers applying for billions of dollars of debt financing per year, professional service providers, and thousands of multifamily and commercial property lenders, including more than 10% of the banks in America, credit unions, real estate investment trusts (“REITs”), debt funds, Fannie Mae® and Freddie Mac® multifamily lenders, FHA multifamily lenders, commercial mortgage-backed securities (“CM"
            },
            {
                "title": "DeFi Development Corp. reports 6.2% increase in Solana per share - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/news/company-news/defi-development-corp-reports-62-increase-in-solana-per-share-93CH-4429777",
                "body": "Asia stocks extend rally on chipmaker gains; Japan’s TOPIX hits fresh record high\nBOCA RATON - DeFi Development Corp. (NASDAQ:DFDV) reported a 6.2% increase in Solana per share (SPS) during the fourth quarter of 2025, according to a preliminary business update released Monday. The company, with a market capitalization of $167.68 million, has delivered an impressive 526.11% return over the past year, according to InvestingPro data.\nThe company, which describes itself as the first U.S. public company with a treasury strategy focused on accumulating Solana (SOL), said its SPS reached 0.0743, implying an annualized run-rate of approximately 24.6%. Trading at a P/E ratio of just 1.84, DFDV appears overvalued compared to its InvestingPro Fair Value estimate.\nAs of January 1, 2026, DeFi Development Corp. holds 2,221,329 SOL and SOL equivalents on its balance sheet, along with approximately $9 million in cash, stablecoins, and other readily convertible tokens.\nThe company repurchased 2,049,113 shares at an average price of $5.62 per share during the fourth quarter. Its total outstanding shares stood at 29,892,800 as of January 1.\nBased on preliminary internal estimates, DeFi Development Corp. reported its average organic yield for the fourth quarter at approximately 8.3% on an annualized basis. This yield is generated through staking, validator operations, and selective onchain deployment, with more than 15% of the company’s SOL treasury currently deployed onchain.\n\"We continue to prioritize decisions that enhance SOL per share while maintaining the strength and integrity of our treasury,\" said Joseph Onorati, Chief Executive Officer of DeFi Development Corp., in the press release.\nThe company noted that all figures disclosed are preliminary, unaudited, and subject to change based on completion of quarter-end close procedures. Additional details regarding fourth-quarter and full-year 2025 results will be provided in upcoming periodic filings.\nIn other recent news, DeFi Development Corp. announced that its shareholders have approved an amendment to the company’s 2023 Equity Incentive Plan, increasing the number of shares of common stock available by 1,500,000. This decision was made at the company’s 2025 Annual Meeting and became effective immediately upon stockholder approval. Additionally, DeFi Development Corp. has formed a strategic partnership with Perena, aiming to generate yield from its stablecoin reserves. The company plans to mint Perena’s USD STAR stablecoin, projecting a yield of approximately 15% APY, which will be used for operational expenses, share buybacks, and acquiring additional Solana tokens.\nIn another development, Pete Humiston has been promoted to Chief Marketing Officer, having previously served as Head of Research & Content. His efforts have played a role in shaping the company’s brand and strategy. Furthermore, key executives, including Parker White and Daniel Kang, have increased their stakes in the company through open-market purchases. These transactions were disclosed in recent SEC filings, highlighting the leadership’s confidence in the firm’s strategy.\nThis article was generated with the support of AI and reviewed by an editor. For more information see our T&C.\nShould you be buying DFDV right now?\nProPicks AI evaluates DFDV alongside thousands of other companies every month using 100+ financial metrics.\nUsing powerful AI to generate exciting stock ideas, it looks beyond popularity to assess fundamentals, momentum, and valuation. The AI has no bias—it simply identifies which stocks offer the best risk-reward based on current data with notable past winners that include Super Micro Computer (+185%) and AppLovin (+157%).\nWant to know if DFDV is currently featured in any ProPicks AI strategies, or if there are better opportunities in the same space?"
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "904.750",
            "open": "48,355.780",
            "close": "48,968.310",
            "high": "49,212.280",
            "low": "48,307.530"
        },
        "market_summary": "### US30 Market Briefing\n\n* **Key Drivers:** Geopolitical tensions due to the U.S. strike in **Venezuela** and upcoming **U.S. jobs report** are driving market sentiment, with **energy** and **financial** stocks leading the gains.\n* **Price Action:** The **Dow Jones Industrial Average** closed at a record high of **48,977.18**, up **1.23%**, driven by **Goldman Sachs** and **JPMorgan** hitting record highs, showing **bullish momentum**.\n* **Technical Outlook:** Immediate support is near the **50-day moving average** at **48,382.39**, with resistance at **49,000**, as markets await the **U.S. employment report** and **CPI report** for further direction.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Goldman Leads Dow Jones As These Financial Firms Break To New Highs - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/news/goldman-sachs-dow-jones-pnc-evercore/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #936e5696-eac4-11f0-9817-94fea2940328"
            },
            {
                "title": "Dow Jones posts record close on Venezuela shock; Wall Street turns to jobs data next - ts2.tech",
                "source": "ts2.tech",
                "url": "https://ts2.tech/en/dow-jones-posts-record-close-on-venezuela-shock-wall-street-turns-to-jobs-data-next/",
                "body": "New York, Jan 5, 2026, 17:01 EST — After-hours\n- The Dow rose 1.23% to a record close, led by energy and big banks.\n- Oil and defense shares climbed after the U.S. strike in Venezuela and Trump’s follow-on comments.\n- Traders are now focused on Friday’s U.S. jobs report and next week’s CPI and bank earnings.\nThe Dow Jones Industrial Average closed at a record on Monday, lifted by energy and financial stocks after a U.S. military strike captured Venezuelan President Nicolas Maduro, according to a Reuters market report. Reuters\nThe move matters because it puts geopolitics back into the pricing of oil and defense names just as investors are trying to judge how much the Federal Reserve may cut rates this year. Friday’s U.S. nonfarm payrolls report is the next major test for that view. Reuters\nIt also lands days before the fourth-quarter earnings season ramps up, with traders watching whether banks can justify the sector’s early-year bid. JPMorgan Chase is due to report results on Jan. 13, the bank said. JPMorgan Chase\nThe Dow ended up 1.23% at 48,977.18. The S&P 500 rose 0.64% and the Nasdaq gained 0.69%, Reuters reported. Reuters\nEnergy led after Washington’s action in Venezuela, with the S&P 500 energy index up 2.7% to its highest since March 2025, Reuters said. Exxon Mobil and Chevron advanced, and Chevron was up more than 5% in extended trading in a separate Reuters report. Reuters\nThe Dow is a price-weighted index, meaning higher-priced stocks carry more influence on the gauge than lower-priced ones. S&P Global\nFinancials also did heavy lifting. The S&P 500 financials index jumped 2.2%, while Goldman Sachs and JPMorgan hit record highs, Reuters reported. Reuters\n“The mood has been favoring financial stocks in recent days and as people look beyond tech, this is a sector many are choosing to look toward,” Steve Sosnick, chief market analyst at Interactive Brokers, told Reuters. Reuters\nDefense stocks rose as well, with Lockheed Martin and General Dynamics higher and an S&P aerospace and defense index at a record, Reuters said. Reuters\nStill, the rally came with cross-currents. Apple fell 1.4% and Nvidia slipped 0.4%, while data showed U.S. manufacturing contracted more than expected in December, extending a 10-month slump, Reuters reported. Markets are pricing about 60 basis points (0.60 percentage point) of rate cuts in 2026, Reuters said. Reuters\nBut traders said the Venezuela shock could still cut both ways: another escalation could jolt risk appetite, while any shift in U.S. sanctions policy will shape whether the story becomes a sustained oil-and-energy trade or a one-day burst. Reuters\nNext up is the U.S. employment report for December, due Jan. 9 at 8:30 a.m. ET, followed by the CPI report on Jan. 13 and JPMorgan’s earnings the same day. Bureau of Labor Statistics"
            },
            {
                "title": "Dow Jones, Nasdaq, S&P 500 weekly preview: Markets face busy start to 2026 - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/news/stock-market-news/dow-jones-nasdaq-sp-500-weekly-preview-markets-face-busy-start-to-2026-4429840",
                "body": "Asia stocks extend rally on chipmaker gains; Japan’s TOPIX hits fresh record high\nInvesting.com -- U.S. stocks ended the first session of 2026 modestly higher, supported by strength in semiconductor shares that helped offset broader weakness across technology.\nThe S&P 500 edged up 0.19% to 6,858.47, while the Nasdaq Composite slipped 0.03% to 23,235.63. Both indexes were well off their intraday highs after opening the session strongly, with earlier gains of about 0.7% for the S&P 500 and roughly 1.5% for the Nasdaq. The Dow Jones Industrial Average rose 319 points, or 0.66%, to 48,382.39.\nChipmakers were the main source of support. Nvidia added more than 1%, while Micron Technology surged over 10%, continuing momentum from last year’s rally in artificial intelligence-linked stocks. Both names were standout performers in 2025, with Nvidia climbing around 39% and Micron more than tripling.\nOutside of semiconductors, other parts of the technology sector struggled, with software stocks weighing on the Nasdaq’s performance and limiting broader gains.\nTechnology was the top-performing sector in 2025, driving strong returns across major benchmarks as investors continued to favor AI-exposed names.\nThe S&P 500 rose more than 16% last year, extending its winning streak to three consecutive years. The Nasdaq advanced over 20%, while the Dow gained roughly 13%. All three hit record highs in 2025.\nWhat could move markets in the first full week of 2026\nThe first full trading week of the new year may bring U.S. markets out of the holiday lull as investors confront a packed macro and geopolitical calendar, with recent stunning developments in Venezuela and key labor data in focus.\nAttention turned to Venezuela over the weekend after U.S. President Donald Trump said he was placing the country under temporary American control following the capture of President Nicolas Maduro.\nInvestors said the situation adds a new layer of geopolitical risk, particularly for energy markets, with any sharp swings in oil prices likely to spill over into broader asset classes.\nGeopolitics remains only one part of the picture. Markets are also bracing for a U.S. Supreme Court ruling on Trump’s tariff policies, alongside the president’s pending decision on the next Federal Reserve chair, as earnings season approaches later in the month.\nThe January 9 U.S. employment report is expected to be a key catalyst. Signs of labor market softness late last year pushed the Fed to cut interest rates at each of its final three meetings in 2025, as policymakers balanced slowing employment against inflation that remains above the 2% target.\n\"Following two volatile months of labor data, the December employment report should give Fed officials a somewhat better read on the underlying trends,\" Brett Ryan, senior U.S. economist at Deutsche Bank, said in a note.\nDeutsche Bank expects modest job growth in the upcoming report, forecasting an increase of 50,000 in headline payrolls compared with a prior reading of 64,000, and a similar 50,000 rise in private payrolls versus 69,000 previously. The bank also projects the unemployment rate to edge down by one-tenth of a percentage point to 4.5%.\nWhile lower rates have underpinned equities, the outlook for further easing in 2026 is uncertain. Fed officials showed clear divisions in December, and with policy rates at 3.5% to 3.75%, futures markets point to limited odds of a January cut and roughly even chances of a quarter-point move in March.\nAt the same time, investors are cautious that a sharply weaker jobs report could raise broader growth concerns. Additional releases this week, including manufacturing and services activity and job openings data, are expected to offer a fuller picture as economic reporting returns to normal following a prolonged government shutdown.\nWhat analysts are saying about U.S. stocks\nEvercore ISI: \"In our 2026 outlook, we made the case that the Structural Bull Market has further to run in the year ahead, powered "
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "74.630",
            "open": "10,026.100",
            "close": "10,029.550",
            "high": "10,032.930",
            "low": "9,958.300"
        },
        "market_summary": "### UK100 Market Briefing\n\n* **Key Drivers:** The FTSE 100 is trading at record highs despite **mounting fiscal headwinds** and **Budget uncertainty**, driven by its sector composition, attractive valuations, and **currency dynamics**.\n* **Price Action:** The index has surged, supported by a confluence of global and domestic forces, including **Bank of England (BoE) rate cut expectations** following dismal employment data, with **unemployment** rising to a **4-year high of 5%**.\n* **Technical Outlook:** The FTSE 100's **defensive sectors**, such as energy, mining, banking, and consumer goods, are providing **resilience during economic uncertainty**, with **oil prices** remaining resilient and **gold, spot silver, and base metals** rallying significantly, and the index's **average dividend yield** of near **4%** offering attractive income opportunities.\n\n---\n**Overall Sentiment:** Positive ️",
        "source_articles": [
            {
                "title": "Wall Street and FTSE stocks climb despite US military action in Venezuela - Yahoo Finance UK",
                "source": "Yahoo Finance UK",
                "url": "https://uk.finance.yahoo.com/news/ftse-100-live-stocks-us-venezuela-094251985.html",
                "body": "Yahoo is part of the Yahoo family of brands.\nWhen you use our sites and apps, we use cookies to:\n- provide our sites and apps to you\n- authenticate users, apply security measures, and prevent spam and abuse, and\n- measure your use of our sites and apps\nIf you click '\nAccept all', we and\nour partners, including 245 who are part of the IAB Transparency & Consent Framework, will also store and/or access information on a device (in other words, use cookies) and use precise geolocation data and other personal data such as IP address and browsing and search data, for analytics, personalized advertising and content, advertising and content measurement, and audience research and services development.\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\nIf you would like to customise your choices, click 'Manage privacy settings'.\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy & Cookie Settings' or 'Privacy Dashboard' links on our sites and apps. Find out more about how we use your personal data in our Privacy Policy and Cookie Policy."
            },
            {
                "title": "​​FTSE 100 Hits Records Despite Budget Fears As Value Rotation Takes Hold​ - ig.com",
                "source": "ig.com",
                "url": "https://www.ig.com/ae/news-and-trade-ideas/ftse-100-trading-at-record-highs-despite-mounting-fiscal-headwin-251112",
                "body": "FTSE 100 trading at record highs despite mounting fiscal headwinds\nThe UK benchmark defies Budget uncertainty with sector composition, attractive valuations, and currency dynamics driving an unlikely outperformance versus technology-heavy global peers.\nUnexpected strength amid fiscal uncertainty\nThe FTSE 100 has been trading at record highs, defying expectations that mounting fiscal headwinds and a cautious November Budget would dampen investor enthusiasm.\nThis surprising strength comes despite widespread unease over the UK government's next round of fiscal tightening, including potential tax rises designed to close the budget gap.\nRather than faltering under these pressures, the index has surged, supported by a confluence of global and domestic forces and Bank of England (BoE) rate cut expectations following this week's dismal employment data.\nUnemployment rising to a 4-year high of 5% has reinforced expectations for monetary policy easing, making the UK's blue-chip benchmark an unlikely outperformer.\nSector composition provides defensive advantages\nOne of the key drivers behind the FTSE 100's record performance lies in its sector composition. Unlike the S&P 500, where artificial intelligence (AI) and technology giants dictate market direction, the FTSE is heavily weighted towards energy, mining, banking, and defensive consumer goods.\nThese sectors thrive in periods of inflation and commodity strength, providing resilience during economic uncertainty.\nOil prices have remained resilient, bolstering earnings for heavyweights such as BP and Shell, while gold, spot silver and base metals have rallied significantly.\nUK-listed global consumer staples firms like Unilever, Diageo, and British American Tobacco continue to deliver stable cash flows and dividends that appeal to yield-hungry investors.\nValuation discount becomes competitive advantage\nAnother major factor is valuation. For years, the FTSE 100 traded at a steep discount to global peers, reflecting both Brexit uncertainty and the UK's slower growth profile. That discount has now turned into a virtue.\nWith US equities looking stretched and bond yields volatile, international investors have been drawn back to the London market in search of stability, diversification, and income.\nThe FTSE's average dividend yield - hovering near 4% - remains one of the most attractive among developed markets, providing compelling income opportunities.\nIn contrast, many US growth stocks offer little or no yield, leaving investors vulnerable to valuation compression if interest rates stay higher for longer.\nCurrency dynamics support overseas earnings\nThe British pound's relative weakness has also played a pivotal role. A softer sterling inflates the overseas earnings of the FTSE's globally diversified constituents, which generate more than two-thirds of their revenue abroad.\nThis currency dynamic provides a natural hedge against domestic economic malaise, insulating the index from purely UK-focused challenges.\nEven as the UK government tightens fiscal policy and households brace for higher taxes, large-cap multinationals listed in London continue to benefit from dollar-denominated income streams.\nIn this sense, the FTSE's rally reflects not confidence in the British economy per se, but in the global reach of its corporate members.\nDefensive positioning attracts uncertain markets\nAdditionally, there is growing recognition that the FTSE 100 offers defensive growth in an uncertain world. With geopolitical tensions high, inflation proving sticky, and global supply chains adjusting, investors have pivoted toward companies with tangible assets.\nThe London market, long dismissed as \"old economy,\" suddenly looks well positioned for current market conditions favouring real assets over speculative growth.\nEnergy companies are capitalising on energy security concerns, miners on the green transition's demand for critical materials, and banks on higher net interest margins.\nThis defensive positioning provide"
            },
            {
                "title": "Should I invest in the S&P 500 or FTSE 100 index? - Yahoo Finance UK",
                "source": "Yahoo Finance UK",
                "url": "https://uk.finance.yahoo.com/news/invest-p-500-ftse-100-163548877.html",
                "body": "Yahoo is part of the Yahoo family of brands.\nWhen you use our sites and apps, we use cookies to:\n- provide our sites and apps to you\n- authenticate users, apply security measures, and prevent spam and abuse, and\n- measure your use of our sites and apps\nIf you click '\nAccept all', we and\nour partners, including 245 who are part of the IAB Transparency & Consent Framework, will also store and/or access information on a device (in other words, use cookies) and use precise geolocation data and other personal data such as IP address and browsing and search data, for analytics, personalized advertising and content, advertising and content measurement, and audience research and services development.\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\nIf you would like to customise your choices, click 'Manage privacy settings'.\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy & Cookie Settings' or 'Privacy Dashboard' links on our sites and apps. Find out more about how we use your personal data in our Privacy Policy and Cookie Policy."
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "312.850",
            "open": "24,592.050",
            "close": "24,873.050",
            "high": "24,891.800",
            "low": "24,578.950"
        },
        "market_summary": "### GER40 Market Briefing\n\n* **Key Drivers:** Positive risk sentiment is supporting the upside due to the **neutral** ECB stance and the Fed's **dovish** reaction function, despite potential **hawkish** moves flagged by ECB's Schnabel.\n* **Price Action:** Touched a new **all-time high** but failed to sustain the breakout of the **2025 range**, with buyers unable to push the index higher.\n* **Technical Outlook:** Immediate support is near the upward trendline on the **4-hour** chart, with resistance at the upper bound of the **2025 range** around **16,000** and potential support at the **14,000** level, with the lower bound of the range near **23,000** on the DAX.\n\n---\n**Overall Sentiment:** **Bullish** ↑",
        "source_articles": [
            {
                "title": "DAX Technical Analysis: The German stock market touches a new all-time high, breakout eyed - investingLive",
                "source": "investingLive",
                "url": "https://investinglive.com/stocks/dax-technical-analysis-the-german-stock-market-touches-a-new-all-time-high-breakout-eyed-20260105/",
                "body": "KEY POINTS:\n- DAX touches a new all-time high\n- Breakout of the 2025 range in focus\n- Positive risk sentiment is providing support amid Fed's easing, neutral ECB\nFUNDAMENTAL OVERVIEW\nThe German DAX touched a new all-time high today but couldn’t sustain the breakout of the 2025 range. There was strong optimism in the first half of 2025 due to the German fiscal stimulus, but the enthusiasm eventually faded and the index remained stuck in a big range.\nThe German economy is expected to gradually pick up in 2026 according to the German central bank, but the real risk this year is going to be the ECB. In fact, despite the expectations of the European Central Bank to keep interest rates steady throughout 2026, there is a risk flagged by ECB’s Schnabel that we could see rate hikes earlier than expected, although this might be a risk for the second half of the year.\nAs long as the ECB keeps its neutral stance and the Fed maintains its dovish reaction function, the positive risk sentiment should continue to support the upside for the stock market.\nDAX TECHNICAL ANALYSIS – DAILY TIMEFRAME\nOn the daily chart, we can see that the DAX (CFD contract) probed above the upper bound of the range reaching a new all-time high but eventually gave back the gains as the buyers couldn’t sustained the breakout. The sellers will likely step in here with a defined risk above the resistance to position for a drop back into the lower bound of the range. The buyers, on the other hand, will look for a break higher to increase the bullish bets into new all-time highs.\nDAX TECHNICAL ANALYSIS – 4 HOUR TIMEFRAME\nOn the 4 hour chart, we can see that we have an upward trendline defining the bullish momentum. If we get a pullback into the trendline, we can expect the buyers to lean on it with a defined risk below it to position for a rally into new all-time highs with a better risk to reward setup. The sellers, on the other hand, will look for a break lower to increase the bearish bets into the lower bound of the range around the 23000 level.\nDAX TECHNICAL ANALYSIS – 1 HOUR TIMEFRAME\nOn the 1 hour chart, we can see that we have another minor trendline defining the bullish momentum on this timeframe. The buyers might split their orders in half in case the minor trendline gets breached and the price drops to the major one. The sellers, on the other hand, will keep on piling in at every break lower to target the lower bound of the range. The red lines define the average daily range for today.\nUPCOMING CATALYSTS\nToday we get the US ISM Manufacturing PMI. Tomorrow, we get the inflation reports for the major European economies. On Wednesday, we have the Eurozone Flash CPI, the US ADP, the US ISM Services PMI and the US Job Openings data. On Thursday, we get the latest US Jobless Claims figures. On Friday, we conclude the week with the US NFP report."
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "300.500",
            "open": "25,234.960",
            "close": "25,383.620",
            "high": "25,513.710",
            "low": "25,213.210"
        },
        "market_summary": "### NDX100 Market Briefing\n* **Key Drivers:** The **NDX100** is being influenced by **hawkish** comments from Fed Chairman Jerome Powell, indicating that long-term interest rates may remain elevated, affecting market sentiment. \n* **Price Action:** The **Nasdaq Composite** has seen a decline, with a drop of **0.56%**, reflecting a **bearish** momentum in the market.\n* **Technical Outlook:** Immediate support for the **NDX100** is crucial, considering the current market volatility and the impact of **interest rates** on tech stocks, with resistance likely at key psychological levels, such as **$20,000** for the **Nasdaq Composite**.\n\n--- \n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "Viasat (NASDAQ:VSAT) Reports Sales Below Analyst Estimates In Q3 CY2025 Earnings - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/viasat-nasdaq-vsat-reports-sales-203817222.html?guccounter=1&guce_referrer=aHR0cHM6Ly9uZXdzLmdvb2dsZS5jb20v&guce_referrer_sig=AQAAAGi6xeD4h7w7n0oCsOjgevuNeVJ4ko-3Gxwi6bAaJ7Tw6HnQJkfTcHc3VCY7PCEktvyweLtCvePDBbGmszMb4rNJw73dRCkE3ZifinF-2wEY1j6HPUgwsMskNGZa7lFWqsPLcDkSZHnRwYNJGSMp31IgwCMsFAB-zETJ4lpoyL0p",
                "body": "Global satellite communications provider Viasat (NASDAQ:VSAT) missed Wall Street’s revenue expectations in Q3 CY2025 as sales only rose 1.7% year on year to $1.14 billion. Its non-GAAP profit of $0.09 per share was significantly above analysts’ consensus estimates.\nRevenue: $1.14 billion vs analyst estimates of $1.15 billion (1.7% year-on-year growth, 0.6% miss)\nAdjusted EPS: $0.09 vs analyst estimates of -$0.06 (significant beat)\nAdjusted EBITDA: $384.7 million vs analyst estimates of $375 million (33.7% margin, 2.6% beat)\nOperating Margin: 3.1%, up from -2.2% in the same quarter last year\nFree Cash Flow Margin: 6%, up from 0.9% in the same quarter last year\nMarket Capitalization: $5.09 billion\nCompany Overview\nOperating a fleet of 23 satellites that orbit the Earth and beam connectivity from space, Viasat (NASDAQ:VSAT) provides satellite-based communications networks and services for airlines, maritime vessels, governments, businesses, and residential customers worldwide.\nRevenue Growth\nA company’s long-term sales performance is one signal of its overall quality. Any business can have short-term success, but a top-tier one grows for years.\nWith $4.58 billion in revenue over the past 12 months, Viasat is one of the larger companies in the business services industry and benefits from a well-known brand that influences purchasing decisions.\nAs you can see below, Viasat’s 15.1% annualized revenue growth over the last five years was incredible. This is an encouraging starting point for our analysis because it shows Viasat’s demand was higher than many business services companies.\nLong-term growth is the most important, but within business services, a half-decade historical view may miss new innovations or demand cycles. Viasat’s annualized revenue growth of 17.4% over the last two years is above its five-year trend, suggesting its demand was strong and recently accelerated.\nThis quarter, Viasat’s revenue grew by 1.7% year on year to $1.14 billion, falling short of Wall Street’s estimates.\nLooking ahead, sell-side analysts expect revenue to grow 3.5% over the next 12 months, a deceleration versus the last two years. This projection doesn't excite us and indicates its products and services will see some demand headwinds. At least the company is tracking well in other measures of financial health.\nAdjusted operating margin is one of the best measures of profitability because it tells us how much money a company takes home after subtracting all core expenses, like marketing and R&D. It also removes various one-time costs to paint a better picture of normalized profits.\nAlthough Viasat was profitable this quarter from an operational perspective, it’s generally struggled over a longer time period. Its expensive cost structure has contributed to an average adjusted operating margin of negative 6.1% over the last five years. Unprofitable business services companies require extra attention because they could get caught swimming naked when the tide goes out.\nLooking at the trend in its profitability, Viasat’s adjusted operating margin decreased by 4.1 percentage points over the last five years. This raises questions about the company’s expense base because its revenue growth should have given it leverage on its fixed costs, resulting in better economies of scale and profitability. Viasat’s performance was poor no matter how you look at it - it shows that costs were rising and it couldn’t pass them onto its customers.\nIn Q3, Viasat generated an adjusted operating margin profit margin of 3.1%, up 5.3 percentage points year on year. This increase was a welcome development and shows it was more efficient.\nEarnings Per Share\nRevenue trends explain a company’s historical growth, but the long-term change in earnings per share (EPS) points to the profitability of that growth – for example, a company could inflate its sales through excessive spending on advertising and promotions.\nSadly for Viasat, its EPS declined by 21.5% annually over the last f"
            },
            {
                "title": "Live Nasdaq Composite: Fed Warning Takes Wind Out of Market Sails - AOL.com",
                "source": "AOL.com",
                "url": "https://www.aol.com/live-nasdaq-composite-fed-warning-145728000.html",
                "body": "Live Nasdaq Composite: Fed Warning Takes Wind Out of Market Sails\nThis article will be updated throughout the day, so check back often for more daily updates.\nThe markets are cautious out of the gate this morning, with all three of the major stock market averages trading lower. Stocks are weighing worrying comments from Fed Chairman Jerome Powell, who spoke at an economic event today. Powell warned that long-term interest rates are expected to remain elevated while monetary policy remains fluid, stating, \"We may be entering a period of more frequent, and potentially more persistent, supply shocks — a difficult challenge for the economy and for central banks.\"\nToday's declines come after a strong run for the S&P 500, which has advanced 18% over the past 25 sessions, erasing its deficit for the year and placing the broader market index into positive territory. The Nasdaq Composite has advanced 6% over the past five trading sessions. Apple (Nasdaq: AAPL) is paying its quarterly cash dividend of $0.26 per share today.\nHere’s a look at the performance as of morning trading:\nDow Jones Industrial Average: Down 155.55 (-0.41%)\nNasdaq Composite: Down 112.11 (-0.56%)\nS&P 500: Down 17.98 (-0.31%)\nMarket Movers\nAn executive at discount retailer Walmart (NYSE: WMT) revealed that the company will pass along the tariff impact to consumer in the form of higher prices. Consumers could begin to see higher prices as soon as this month. The stock is off 4.0% today.\nAdvertisement\nChina's e-commerce giant Alibaba (NYSE: BABA) reported disappointing fiscal Q4 revenue results today, sending the stock reeling by 6.5%.\nNetworking giant Cisco (Nasdaq: CSCO) is down 4.2%.\nAI cloud company CoreWeave (Nasdaq: CRWV) stock is also under pressure, falling 4.4% despite reporting strong Q1 revenue and robust demand for its platform. CoreWeave also secured tech giant Google as a client. The company announced a massive capex spending plan for Q2 that appears to have spooked investors.\nThe post Live Nasdaq Composite: Fed Warning Takes Wind Out of Market Sails appeared first on 24/7 Wall St.."
            },
            {
                "title": "Despite lower earnings than a year ago, XPEL (NASDAQ:XPEL) investors are up 27% since then - simplywall.st",
                "source": "simplywall.st",
                "url": "https://simplywall.st/stocks/us/automobiles/nasdaq-xpel/xpel/news/despite-lower-earnings-than-a-year-ago-xpel-nasdaqxpel-inves",
                "body": "- United States\n- /\n- Auto Components\n- /\n- NasdaqCM:XPEL\nDespite lower earnings than a year ago, XPEL (NASDAQ:XPEL) investors are up 27% since then\nThe simplest way to invest in stocks is to buy exchange traded funds. But you can significantly boost your returns by picking above-average stocks. For example, the XPEL, Inc. (NASDAQ:XPEL) share price is up 27% in the last 1 year, clearly besting the market return of around 14% (not including dividends). That's a solid performance by our standards! On the other hand, longer term shareholders have had a tougher run, with the stock falling 20% in three years.\nIn light of the stock dropping 5.2% in the past week, we want to investigate the longer term story, and see if fundamentals have been the driver of the company's positive one-year return.\nTo paraphrase Benjamin Graham: Over the short term the market is a voting machine, but over the long term it's a weighing machine. One imperfect but simple way to consider how the market perception of a company has shifted is to compare the change in the earnings per share (EPS) with the share price movement.\nDuring the last year, XPEL actually saw its earnings per share drop 3.9%.\nSometimes companies will sacrifice EPS in the short term for longer term gains; and in that case we may be able to find other positives. Since the change in EPS doesn't seem to correlate with the change in share price, it's worth taking a look at other metrics.\nHowever the year on year revenue growth of 10% would help. We do see some companies suppress earnings in order to accelerate revenue growth.\nThe image below shows how earnings and revenue have tracked over time (if you click on the image you can see greater detail).\nWe're pleased to report that the CEO is remunerated more modestly than most CEOs at similarly capitalized companies. It's always worth keeping an eye on CEO pay, but a more important question is whether the company will grow earnings throughout the years. So it makes a lot of sense to check out what analysts think XPEL will earn in the future (free profit forecasts).\nA Different Perspective\nIt's good to see that XPEL has rewarded shareholders with a total shareholder return of 27% in the last twelve months. Notably the five-year annualised TSR loss of 3% per year compares very unfavourably with the recent share price performance. The long term loss makes us cautious, but the short term TSR gain certainly hints at a brighter future. If you would like to research XPEL in more detail then you might want to take a look at whether insiders have been buying or selling shares in the company.\nIf you like to buy stocks alongside management, then you might just love this free list of companies. (Hint: many of them are unnoticed AND have attractive valuation).\nPlease note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges.\nNew: AI Stock Screener & Alerts\nOur new AI Stock Screener scans the market every day to uncover opportunities.\n• Dividend Powerhouses (3%+ Yield)\n• Undervalued Small Caps with Insider Buying\n• High growth Tech and AI Companies\nOr build your own from over 50 metrics.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nAbout NasdaqCM:XPEL\nXPEL\nManufactures, installs,"
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "63.670",
            "open": "6,861.230",
            "close": "6,899.140",
            "high": "6,919.150",
            "low": "6,855.480"
        },
        "market_summary": "### SPX500 Market Briefing\n\n* **Key Drivers:** The recent U.S. military operation in Venezuela and capture of its president has led to cautious responses from world leaders, reflecting the **volatile** nature of the current White House administration and its potential impact on global markets and trade agreements.\n* **Price Action:** The SPX500 index has shown **bearish** momentum, breaking below the key psychological level of **4,200**, amid concerns over the escalation of geopolitical tensions and their effects on the global economy.\n* **Technical Outlook:** Immediate support is near the 50-day moving average at **4,150**, with resistance at **4,250**, as investors closely watch the developments in U.S. foreign policy and their implications for international trade and market stability.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "Commentary: One of L.A.'s most influential restaurants is reborn in downtown L.A. - Los Angeles Times",
                "source": "Los Angeles Times",
                "url": "https://www.latimes.com/food/story/2026-01-05/baco-mercat-bar-ama-le-draq-downtown-los-angeles-restaurant",
                "body": "-\nClick here to listen to this article - Share via\n- Josef Centeno has transformed his downtown restaurant Bar Amá into Le Dräq, a new place that combines a version of Bar Amá and Bäco Mercat, the restaurant he closed during the pandemic.\n- The menu will include new versions of rotating dishes from both Bar Amá and Bäco Mercat.\n- Le Dräq marks the return of the bäco, what was once L.A.’s most talked about sandwich.\nThe first reservation you need to make in 2026 isn’t for the splashy L.A. version of an Italian restaurant from New York City. Or the debut of another restaurant from a celebrity chef. It’s for the reopening (sort of) of Bäco Mercat.\nOn Dec. 19, Josef Centeno closed the doors of Bar Amá, his Tex-Mex-leaning restaurant in downtown Los Angeles, and reopened the next evening as Le Dräq by Bar Amá and Bäco Mercat. The restaurant is a hybrid of Bar Amá and Takoria, the self-described bizarro taqueria that Centeno debuted out of the space earlier this year. And the return of Bäco Mercat, a restaurant the chef closed in the thick of the pandemic in 2020.\n“Bäco just kind of stopped during COVID,” says Centeno. “I don’t feel like I had finished what I started there and I’ve been trying to figure out the best way to bring it back without feeling like I was trying to repeat something.”\nIt’s difficult to quantify the influence Centeno has had on the city’s dining scene, or the contributions he made to what was once the great revitalization of downtown Los Angeles. At one point, the chef commanded the corner of 4th and Main streets with a cluster of restaurants this paper once dubbed the “Centenoplex.” At its heart was the petite, always bustling Bäco Mercat.\nOpened in 2011, it was a place built around the bäco, a Centeno creation that was a soft, supple flatbread that blistered like a flour tortilla, with the thickness and chew of good naan. But the restaurant was so much more than flatbread sandwiches. Ricotta cavatelli with pork belly and soujouk. Chicken “ribs” doused in chile vinegar. Catalan-style cocas lavished with chicken escabeche, zhoug and spiced labneh. Centeno introduced Angelenos to a cuisine fueled by a smart, thoughtful and consistently bold oscillation of cultural influences.\nThe Review: BÃ¤co Mercat makes it easy to get carried away\nIt was everything he grew up eating, everything he ate on his travels and everything and everyone that represents Los Angeles, on a plate.\n“People have been pretty continually asking for [Bäco Mercat], so it was also just listening to people,” says Centeno. “I don’t consider this a reboot; it’s more of a continuation kind of phoenix rising from the ashes sort of thing.”\nThe new restaurant name stems from the Catalan word “drac.”\n“It means shapeshifter, or like Dracula,” he says.\nCenteno took creative license with the word, settling on the name Le Dräq. The logo, which resembles a three-headed dragon, grew out of an image Centeno created of his dogs Bear and Winston (for which his adjacent fine dining restaurant Orsa & Winston is named), and their cousin Cash.\n“For some reason, a chimera came into my visualization and those three are like the hungriest beasts,” he says. “The three heads represent Bear, Winston and Cash, but it also represents Bäco, Amá and Takoria.”\nThe two-sided menu mimics the two sides of a record, with the A-side devoted to re-imagined favorites from both Bäco Mercat and Bar Amá. The bäco returns as a cheese-infused flatbread, with Centeno folding shredded Oaxacan string cheese into the bread dough. It’s even softer than the original, and wonderfully chewy. He folds it around breaded and fried shrimp, fava bean fritters, oxtail or Wagyu short rib.\nThe coca 2.0 is still under development, but at the moment is made with a vegan dough. The impossibly slender, cracker-like crust is in the running for the best bar-style pizza in town. The mushroom coca incorporates dehydrated shiitake mushrooms, yuzu kosho and a cream reduction spiked with dashi. It’s drizzled with a"
            },
            {
                "title": "Tested: The 2025 Porsche 911 Carrera S Is an Everyday Supercar - MotorTrend",
                "source": "MotorTrend",
                "url": "https://www.motortrend.com/reviews/2025-porsche-911-carrera-s-first-test-review",
                "body": "Tested: The 2025 Porsche 911 Carrera S Is an Everyday Supercar\nPorsche has evolved its sports car into an ordinary-looking exotic before our very eyes.\nPros:\n-Ridiculous acceleration\n-Engaging in every way\n-Comfortable and well-equipped\nCons:\n-Oh, so expensive\n-Digital dash diminishes analog delight\n-Base 911 already very good\nWe called the base 999.2 Porsche 911 “supercar-rivaling” in our First Test review, so where does that leave the 2025 Porsche 911 Carrera S? Located two notches up in the flagship sports car’s hierarchy over the enthusiast-oriented 911 Carrera T but below the newly hybridized 911 Carrera GTS, the 911 Carrera S slots into the lineup as a sportier but still approachable everyday sports car.\nThe base 911 develops 388 hp and 331 lb-ft of torque from its 3.0-liter twin-turbocharged flat-six, while the Carrera S ratchets output up to 473 hp and 390 lb-ft of torque. For the non-mathletes, that’s a hike of 85 hp and 59 lb-ft for a car that weighs just 37 pounds more than the 3,472-pound base 911. These not-insignificant gains come courtesy of the turbochargers and intercoolers taken from the 992.1 Carrera GTS.\nHow does this 2025 Porsche 911 Carrera S fare in MotorTrend testing compared to the base model? And perhaps more crucially, is the real-world driving experience any better?\nSupercar in a Sports Car Body\nWhen we tested the 2025 Porsche 911 Carrera earlier this year, we were in awe of its 3.3-second 0–60-mph time. Consider our surprise, then, when this 2025 Carrera S dashed off the 0–60 sprint in a mere 2.8 seconds. It did it with little fanfare using this setup: Sport Plus mode, Porsche Stability Management off, Sport suspension enabled, and launch control activated with the revs held at 5,000 rpm. The Carrera S got away with hardly any wheelspin, though it did ride its clutch.\nThere was a time when we would drag race a car this quick against anything on four wheels. Hell, the new Carrera S was quicker to launch to 60 mph than the Acura NSX Type S and the Audi R8 Performance RWD, which needed 3.1 and 3.2 seconds to do the deed, respectively. It’s also quicker than the outgoing 992.1 Carrera GTS, which clocked a time of 2.9 seconds.\nAs we kept our foot in the throttle, its eight-speed dual-clutch transmission snapped through the gears as the Carrera S propelled itself through the quarter mile in 11.0 seconds at 126.9 mph. That’s quicker than the 992.1 Carrera GTS in RWD guise, which did the quarter mile in 11.1 seconds at 124.6 mph. The wail of the standard sport exhaust made our quarter-mile runs even more enjoyable as the flat-six revved out to its 7,500-rpm redline.\nIn the real world, the Carrera S’ acceleration is all too accessible. Thankfully, Porsche equipped powerful standard brakes to match the engine’s healthy output. Red-painted calipers give away the stoppers’ upgrade over the default setup on the base Carrera. The Carrera S hauls down from 60 mph to a standstill in just 95 feet, beating the standard 911 by 4 feet.\nI did my due diligence as a Southern Californian Porsche driver and took it up to the Angeles National Forest for an early-morning drive to get a sense of its handling on curvy roads. Direct, precise steering made the speed easy to handle, especially with the help of the available rear steering equipped on this test car.\nThe 911 Carrera S’ impeccable driving manners were no doubt aided by the Porsche Active Stability Management (PASM) Sport suspension option, which lowers the ride by 0.39 inch (10mm). Somehow, the 911 managed to stay comfortable in the default setting despite this feature and still managed to be tolerable in the Sport setting.\nThe evidence that the Carrera S is greater than the sum of its parts can be found in its 22.8-second lap time around our figure-eight test track. That’s half a second quicker around our one-third-mile circuit than the 992.1 Carrera GTS, a substantial improvement. If you’re looking for supercar-beating proof, the Audi R8 Performance RWD with a V-10"
            },
            {
                "title": "‘A volatile White House’: What shaped responses to U.S.’s Venezuela attack? - Global News",
                "source": "Global News",
                "url": "https://globalnews.ca/news/11600075/us-venezuela-nicolas-maduro-capture-response/",
                "body": "The world woke up Saturday morning to the news that the U.S. had conducted a military operation in Venezuela and captured its president.\nWhile the move by the Trump administration marked a “violation” of international law, experts say, the statements issued by many world leaders appear cautious in tone — and are likely an example of how some are trying to bridge the realities of dealing with “a volatile White House.”\nFor many U.S. allies, how they respond to the capture of Venezuelan President Nicolas Maduro and his wife on narco-terrorism charges may come down to not wanting to anger the U.S. administration, Diez said.\n“They’re dealing with a volatile White House,” he said.\n“If you say the wrong thing, there’s going to be pushback. I think everything has been very much calibrated in light of the negotiations taking place on trade,” Diez said, referring to the ongoing negotiations on the Canada-U.S.-Mexico Free Trade Agreement (CUSMA) that is up for review this year.\nLuis van Isschot, associate professor of history at the University of Toronto, said the U.S. capture is “a particularly bold move, and a particularly bold violation of international law, and of Venezuelan sovereignty.”\n“The abduction of Nicolas Maduro and his wife is a violation of international law, and that is not something that I have heard clearly stated yet from Canada or other countries that are close to the United States,” he said.\nArticle 2 of the UN Charter, to which both the U.S. and Venezuela are signatories, prohibits “the threat or use of force against the territorial integrity or political independence of any state.”\nThe U.S. military actions set a “dangerous precedent,” UN Secretary General António Guterres said in a statement.\n“He’s deeply concerned that the rules of international law have not been respected,” a spokesperson for Guterres said.\nHowever, allies of the U.S. have not spoken out in such terms.\nGet breaking National news\nCanada’s official statement does not specifically mention the United States, with Foreign Affairs Minister Anita Anand calling on “all parties to exercise restraint and uphold international law.”\nU.K. Prime Minister Kier Starmer, for example, refused to answer in an interview whether he thought U.S. actions were a violation of international rights.\nIn a statement posted to social media, French President Emmanuel Macron decried the Chavista regime in Venezuela but made no reference to the U.S. or the alleged violation of international legal principles.\nThe cautious responses are likely a reflection of the fact that “the world is more unpredictable and uncertain following the USA’s unilateral military action,” said Arif Z. Lalani, a distinguished fellow at both the Centre for International Governance Innovation and the Munk School of Global Affairs and Public Policy.\nAn expansionist U.S.?\nIn detailing U.S. military action on Saturday, Trump referenced the Monroe Doctrine, a maxim that has shaped American foreign policy for two centuries.\nThe doctrine formulated by former U.S. president James Monroe was originally aimed at opposing European meddling in the Western Hemisphere. It has since been invoked repeatedly by subsequent presidents angling to justify U.S. intervention in the region.\n“It’s ‘might make right,’ essentially,” Diez said.\nThe 1823 doctrine was used heavily during the Cold War and Trump invoked it again on Saturday, even calling it the ‘Donroe doctrine’ — a play on his own name.\nThe very next day after he announced the military action in Venezuela, Trump renewed his threats of annexing Greenland.\n“We need Greenland from the standpoint of national security, and Denmark is not going to be able to do it,” Trump said.\nSaturday’s actions and Trump’s emboldened stance should send alarm bells ringing in Ottawa, Diez said.\n“I think he’s serious about his vision of America in a new world. I think he’s serious about a new order, for sure,” he said.\n“This is a very serious threat and it’s an existential threat (to Canad"
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "1,515.790",
            "open": "51,089.390",
            "close": "52,163.750",
            "high": "52,244.220",
            "low": "50,728.430"
        },
        "market_summary": "### JPN225 Market Briefing\n* **Key Drivers:** The **Nikkei index** surged on the first trading day of 2026, driven by heavyweight technology issues and exporters bolstered by a weaker **yen**. The market was also supported by strong anticipation of growth-oriented investments and capital outlays in fields such as **artificial intelligence** and **semiconductors**.\n* **Price Action:** The **225-issue Nikkei Stock Average** soared **1,493.32 points**, or **2.97 percent**, to **51,832.80**, a two-month high. The broader **Topix index** finished **68.55 points**, or **2.01 percent**, higher at **3,477.52**, marking a record high close.\n* **Technical Outlook:** The benchmark **Nikkei** briefly topped the **52,000** line, helped by heavyweight chip and AI-related issues tracking advances by their U.S. counterparts. The weaker **yen** helped boost exporters, while some investors bought back shares after the **Nikkei** dropped over the past two trading days. Immediate support is near the **50,000** level, with resistance at **52,000**.\n\n--- \n**Overall Sentiment:** **Bullish**",
        "source_articles": [
            {
                "title": "Daiichi Sankyo tallies $1.9B in planned Enhertu manufacturing investments: Nikkei - Fierce Pharma",
                "source": "Fierce Pharma",
                "url": "https://www.fiercepharma.com/manufacturing/daiichi-sankyo-tallies-19b-enhertu-manufacturing-investments-across-globe-report",
                "body": "Daiichi Sankyo plans to splash out some 300 billion yen ($1.9 billion) on Enhertu manufacturing facilities across the globe, Nikkei reported on Saturday.\nAccording to the Tokyo-based news outlet, Daiichi’s planned manufacturing investments are rooted in easing geopolitical risks such as tariffs. The company is reportedly setting up spots for antibody-drug conjugate (ADC) production in Japan, the U.S., Germany and China.\nDaiichi’s footprint in its home country of Japan will expand thanks to planned spending of 77 billion yen ($491.7 million) at an existing plant in Hiratsuka, Kanagawa, according to the report.\nIn Germany, where the company currently operates a manufacturing spot in Munich, 140 billion yen ($894 million) will go toward production sites for Enhertu and “other products” by the end of 2028, the publication reported.\nIn China, 24 billion yen ($153 million) is earmarked for a new Shanghai site that will be built by 2030, according to Nikkei. Daiichi first committed to the Shanghai ADC spot in late 2024 after Enhertu made it onto China’s National Reimbursement Drug List for 2025, describing the move as a major milestone in the company’s progress in China and a reflection of its commitment to China in the long run.\nThe drugmaker’s U.S. presence in Ohio, meanwhile, is up for a 56 billion yen ($357.8 million) investment for additional facilities at its existing plant—an expansion that should wrap up by October 2027, according to the report. Daiichi announced an expansion at its New Albany, Ohio, site in 2024.\nA Daiichi spokesperson did not immediately respond to Fierce Pharma’s request for comment on the report.\nThe company had already earmarked $350 million for U.S. production expansions long before the threat of pharmaceutical tariffs emerged, CEO Hiroyuki Okuzawa said on an April earnings call, as reported by Endpoints News. While the previously announced expansion in 2024 was due to increasing U.S. demand for Enhertu, Okuzawa noted that the company was also looking at further investments at the Ohio site.\nDaiichi has been sporadically boosting its production capabilities over the years, with recent investments centered on ADCs as it looks to bolster its stronghold in the field. In 2023, GlobalData predicted that Daiichi will dominate the ADC space through 2029, continuing with the breakthrough impact of AstraZeneca-partnered Enhertu in HER2-low breast cancer.\nThe drug is still on a hot streak since its 2019 approval, picking up $3.75 billion in 2024 combined sales reported by Daiichi and AstraZeneca. Last month, Enhertu snagged another FDA nod as a first-line treatment for unresectable or metastatic HER2-positive breast cancer when combined with Roche’s Perjeta.\nAstraZeneca, for its part, has also bulked up its global production capabilities in the face of tariff threats, most recently with a $2 billion manufacturing investment in Maryland."
            },
            {
                "title": "Nikkei index ends up nearly 3% at 2-month high on 1st trading day of 2026 - Japan Wire by KYODO NEWS",
                "source": "Japan Wire by KYODO NEWS",
                "url": "https://english.kyodonews.net/articles/-/67938",
                "body": "TOKYO - Tokyo stocks surged Monday, the first trading day of 2026, with the key Nikkei index ending up nearly 3 percent at a two-month high, driven by heavyweight technology issues and exporters bolstered by a weaker yen.\nThe 225-issue Nikkei Stock Average soared 1,493.32 points, or 2.97 percent, from last Tuesday to 51,832.80. The broader Topix index finished 68.55 points, or 2.01 percent, higher at 3,477.52, marking a record high close.\nJapanese financial markets were closed from Wednesday of last week for the New Year holidays.\n\"With U.S. stocks remaining relatively firm during the holidays and the yen continuing its gradual weakening, the market was able to start the new year in a comfortable environment,\" said Makoto Sengoku, senior equity market analyst at Tokai Tokyo Intelligence Laboratory Co.\nThe market was also supported by strong anticipation that growth-oriented investments and capital outlays in fields such as artificial intelligence and semiconductors will steadily materialize under the expansive fiscal policies of Prime Minister Sanae Takaichi, analysts said.\nThe U.S. dollar temporarily strengthened to the lower 157 yen range in Tokyo after U.S. Treasury yields climbed last week, fueling expectations that the interest rate differential between the United States and Japan will remain wide, dealers said.\nAt 5 p.m., the dollar fetched 156.97-99 yen compared with 156.81-91 yen in New York at 5 p.m. Friday.\nThe euro was quoted at $1.1687-1688 and 183.46-50 yen against $1.1716-1726 and 183.76-86 yen in New York late Friday afternoon.\nThe yield on the benchmark 10-year Japanese government bond hit 2.125 percent at one point, its highest level since February 1999, as the debt was sold following the rise of U.S. Treasury yields.\nThe yield also rose on expectations of additional Bank of Japan rate hikes as the yen weakened. It ended up 0.045 percentage point from last Tuesday's close at 2.115 percent.\nOn the stock market, the benchmark Nikkei briefly topped the 52,000 line, helped by heavyweight chip and AI-related issues tracking advances by their U.S. counterparts late last week.\nThe weaker yen helped boost exporters, while some investors bought back shares after the Nikkei dropped over the past two trading days.\nAlmost all industry sectors advanced on the top-tier Prime Market, with gainers led by nonferrous metal, machinery and electric appliance issues.\nThe U.S. military strike on Venezuela and capture of President Nicolas Maduro on Saturday have had a limited impact on the Tokyo market so far, analysts said.\nWashington had been putting pressure on the Latin American country's leader over alleged drug trafficking, but Saturday's move \"came as a surprise,\" said Maki Sawada, a strategist in the Investment Content Department of Nomura Securities Co.\n\"The market may view it as a short-term risk-off factor, but the impact is likely to be limited, given the low likelihood of a further escalation, such as a direct attack on the United States,\" she added.\nDespite holding the world's largest oil reserves, \"Venezuela accounts for only a very small share of the global oil supply, leaving little risk of market turmoil triggered by a spike in crude oil prices,\" Masahiro Ichikawa, chief market strategist at Sumitomo Mitsui DS Asset Management Co."
            },
            {
                "title": "Inside the battle for a record $3.2m tuna at New Year's Tokyo auction - Nikkei Asia",
                "source": "Nikkei Asia",
                "url": "https://asia.nikkei.com/business/fisheries/inside-the-battle-for-a-record-3.2m-tuna-at-new-year-s-tokyo-auction",
                "body": "FisheriesInside the battle for a record $3.2m tuna at New Year's Tokyo auction\nSushizanmai operator makes comeback to break Onodera's 5-year win streak\nKiyomura President Kiyoshi Kimura speaks with the media after winning the bid for the top tuna at the first auction of the year at Toyosu fish market in Tokyo. (Photo by Arisa Moriyama)\nTAKUMI SASAKI\nJanuary 6, 2026 09:49 JST\nTOKYO -- The first tuna auction of 2026 at Japan's Toyosu market saw two old rivals face off, with the winner of the bid for the top tuna making a dramatic return to break its competitor's five-year win streak, setting a record at 510.3 million yen ($3.2 million)."
            }
        ]
    }
]