[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "76.060",
            "open": "3,983.270",
            "close": "4,040.190",
            "high": "4,059.210",
            "low": "3,983.150"
        },
        "market_summary": "### Gold (XAU/USD) Market Briefing\n\n* **Key Drivers:** Growing economic uncertainty, **de-dollarization** trends, and a weakening **US Dollar** are driving investors towards **gold** as a safe-haven asset, with prices surging past **$4,000** an ounce.\n* **Price Action:** Gold has broken out to a record high, showing significant **bullish momentum** with a **54%** gain year-to-date, fueled by concerns over the **US government shutdown**, **tariffs**, and **geopolitical tensions**.\n* **Technical Outlook:** Immediate resistance is near the **$4,036** level, with support at **$3,800**, as investors await the outcome of the **US government shutdown** and further cues on **monetary policy** from central banks.\n\n---\n**Overall Sentiment:** Positive 🚀",
        "source_articles": [
            {
                "title": "Here's what gold crossing $4,000 is telling us about the U.S. economy - CBS News",
                "source": "CBS News",
                "url": "https://www.cbsnews.com/news/why-is-the-price-of-gold-rising-4000-ounce-economy/",
                "body": "Here's what gold crossing $4,000 is telling us about the U.S. economy\nGold is glittering for investors, with prices now topping a record $4,000 an ounce. But the reasons behind the shiny metal's surge may be less than dazzling, with Wall Street analysts saying it reflects growing unease over the U.S. economy and political stability.\nThe price of gold has leaped 53% this year alone, far outpacing the 15% gain in the S&P 500 stock index over the same period. The price of an ounce of gold edged higher on Wednesday, touching $4,078, according to financial data company FactSet, with some analysts predicting it to go higher.\nInvestors have long turned to gold during periods of economic turmoil and high inflation, viewing it as both a safe haven when markets turn volatile and a hedge against rising prices.\nOf late, however, stock prices have steamed to record highs this year, economic growth has accelerated in recent months and inflation this year has remained relatively subdued, prompting questions about what's fueling investors' renewed appetite for gold.\n\"$4,000 an ounce seemed far-fetched at the start of the year as gold entered 2025 near $2,800 an ounce. But after a ~50% rally, here we are,\" eToro U.S. investment analyst Bret Kenwell said in an email.\nThe reasons for the surge boil down to several economic and political factors, according to Kenwell and other investment analysts.\nEconomic uncertainty\nGold is often a refuge for investors when they're worried about the economy, and the ongoing U.S. government shutdown is only fueling their anxieties, according to Nigel Green, CEO of investment firm deVere Group.\n\"The situation in Washington has reminded investors that political promises do not equate to financial security. Gold represents protection from that uncertainty, but its price now also reflects how much faith has drained from other assets. That level of dependence always carries risk,\" Green said in an email.\nAlthough the economy continues to expand, investors are also expressing concern about potential headwinds to growth, including the impact of U.S. tariffs and a weakening job market, according to economists.\nFederal agencies currently aren't releasing economic data due to the government shutdown, now in its second week. That makes it more difficult to get a handle on the state of the economy, said Kevin Ford, FX and macro strategist at Convera.\n\"[T]he US economy remains a challenge to read due to the ongoing government shutdown, which has severely diminished visibility,\" Ford noted. \"However, the shutdown is a material headwind: S&P Global Ratings estimates it could trim GDP growth by 0.1−0.2 percentage point for every week the government remains closed.\"\nFed rate cuts\nIn September, the Federal Reserve lowered its benchmark interest rate for the first time since late 2024 and signaled that two more cuts could be in the cards later this year.\nGold has risen partly due to investor expectations that the Fed is entering a cycle of easing its monetary policy, according to Bart Melek, head of commodity strategy at TD Securities.\nWith interest rates seemingly heading lower, gold is more attractive as a financial asset because investors aren't losing out on higher yields from Treasuries and other government bonds, he told investors in a report. And with inflation drifting up due to the impact of the Trump administration's tariffs, gold can also continue to offer an inflation hedge.\nGold \"may be a better safe-haven than Treasuries,\" Melek wrote. \"Add to that the fact that ore grades are dropping, the increased use of these factors of production suggests that gold would be better at protecting purchasing power.\"\nGlobal gold demand\nInvestments in gold have also been driven by other factors. Analysts point to strong gold demand from central banks around the world amid heightened geopolitical tensions, such as the ongoing wars in Gaza and Ukraine.\n\"The gold rally started in 2022,\" Giovanni Staunovo, commodity analyst at UBS Global"
            },
            {
                "title": "Gold surges past record $4,000 an ounce as uncertainty fuels rally - BBC",
                "source": "BBC",
                "url": "https://www.bbc.com/news/articles/c8ex3wgjlexo",
                "body": "Gold surges past $4,000 an ounce as uncertainty fuels rally\nThe price of gold has hit a record high of more than $4,000 (£2,985) an ounce as investors look for safe places to put their money over concerns about economic and political uncertainty around the world.\nGold has seen its biggest rally since the 1970s, rising by around a third since April when US President Donald Trump announced tariffs which have upset global trade.\nAnalysts say another issue worrying investors is delays to the release of key economic data as the US government shutdown enters its second week.\nGold is seen as a so-called safe haven investment, which is expected to retain or increase its value during times of market turbulence or economic downturns.\nAt the same time, the Bank of England (BoE) has warned the value of AI tech companies \"appear stretched\" with a rising risk of a \"sharp correction\" to financial markets.\nStock markets in the US, UK and Europe have hit record highs recently as investors try to benefit from a rally in tech companies. A correction would be defined as a fall in these indexes of more than 10%.\nThe price of spot gold - the real-time market value of the precious metal for immediate delivery - rose to more than $4,036 an ounce on Wednesday afternoon in Asia.\nGold futures - which serve as a gauge of market sentiment - reached the same level on 7 October. Futures are agreements to buy or sell the asset at a pre-determined date in the future.\nThe US government shutdown, which was triggered by repeated impasses over public spending, is a \"tailwind for gold prices\", said OCBC's Christopher Wong, who is the Singapore-based bank's rates strategist.\nInvestors have turned to safe haven assets like gold during previous US government shutdowns.\nIt rose by nearly 4% during the month-long shutdown in Trump's first term in the White House.\nBut gold prices could fall if the shutdown ends more quickly than some investors are expecting, said Mr Wong.\nGold's \"unprecedented rally\" in the past month has surpassed analysts' expectations, said UOB bank's head of markets strategy Heng Koon How.\nHe added that the rise is also tied to the weakening US dollar and more non-professional buyers, known as retail investors, purchasing gold.\nAlthough the current surge in gold prices has been triggered by short-term uncertainty, the overall strength of gold is largely the result of central banks buying it as a strategic move away from US treasuries and over-reliance on the strength of the dollar.\nCentral banks have collectively bought more than 1,000 tonnes of gold each year since 2022, up from an average of 481 tonnes a year between 2010 and 2021. Poland, Turkey, India, Azerbaijan and China were among the leading buyers last year.\nNot everyone investing in gold buys the physical precious metal.\nSome investors put their money into financial products, such as exchange-traded funds (ETFs), which are backed by gold.\nA record $64bn has been invested in gold ETFs so far this year, according to the World Gold Council trade association.\nGregor Gregersen, the founder of precious metals dealer and storage provider Silver Bullion, said he has seen customers numbers more than double in the last year.\nRetail investors, banks and wealthy families have increasingly turned to gold, viewing it as a safeguard against global economic uncertainty, he said.\n\"Gold will fall at some point, but I believe given the economic environment, it's on an upward trend for at least five years,\" Mr Gregersen said.\nGold may fall in value if there is a hike in interest rates or geopolitical tensions and political uncertainties ease, said OCBC's Mr Wong.\nIn April, for instance, the price of gold fell by around 6% after Trump backed off from firing Fed Chair Jerome Powell, he said.\n\"Gold is often seen as a hedge against uncertainty, but the hedge can be unwound.\"\nAnd in 2022, gold's value plunged from $2,000 to $1,600 an ounce, after the US central bank raised interest rates to curb the inflation trig"
            },
            {
                "title": "Gold price vs US Dollar: $6,000 to $9,000 - where will gold rate go up? Is Donald Trump responsible for go - The Economic Times",
                "source": "The Economic Times",
                "url": "https://economictimes.indiatimes.com/news/international/us/gold-price-vs-us-dollar-6000-to-9000-where-will-gold-rate-go-is-donald-trump-responsible-for-gold-rush-over-slipping-usd/articleshow/124404865.cms?from=mdr",
                "body": "U.S. President Donald Trump's policies have eroded the dollar, fuelling a gold rush which has pushed prices to a record high above $4,000 an ounce this week, the president and CEO of Canada's Franco-Nevada said on Thursday. If gold prices have appreciated 9 per cent a year over the dollar, the \"rational target\" is to say that over five years, at the same rate, gold prices will hit $6,000 an ounce and over 10 years they will hit $9,000, bullion experts said. Gold surged past $4,000 per troy ounce for the first time on Wednesday and is up 54 per cent year-to-date.\nTariffs, a growing structural deficit in the U.S. trade balance and the break down of trust in U.S. institutions have combined to speed \"de-dollarisation,\" Paul Brink told a business lunch in Melbourne.\nDe-dollarisation refers to when countries reduce reliance on the dollar as a reserve currency and in financial transactions. A weaker dollar makes gold more affordable for buyers using other currencies.\n\"You couldn't have written a more perfect script if you wanted to, on how to undermine the U.S. dollar,\" said Brink, who runs the $41.3 billion dollar company that invests in gold mines in exchange for a share of revenue from production.\nTariffs are shrinking the U.S.'s share of international trade and eroding the use of the U.S. currency, while its structural deficit, the worst among the Group of Seven nations, has lost the U.S. its 'AAA' investment ratings, he noted.\n\"The third thing you need to be the reserve currency is unbreakable trust in the independence of your institutions,\" he said. \"And Mr. Trump has undermined the banks. He is pivotal in that. That I would say is certainly what is driving this leg of the of the gold cycle,\" he said.\nLonger term, a more enduring rally in gold prices would come from how central banks think about monetary policy and how central banks think about their own reserves, he said.\nCentral banks have come to realize that their populations do not want to tolerate austerity, so the way out of an economic downturn must be to boost liquidity, which will also lift the relative value of assets like real estate and gold, he said.\nQ1. How has gold performed this year?\nA1. Gold price surged past $4,000 per troy ounce for the first time on Wednesday and is up 54 per cent year-to-date.\nQ2. What is causing erosion of US Dollar?\nA2. US Tariffs, a growing structural deficit in the U.S. trade balance and the break down of trust in U.S. institutions have combined to speed \"de-dollarization\".\nTariffs, a growing structural deficit in the U.S. trade balance and the break down of trust in U.S. institutions have combined to speed \"de-dollarisation,\" Paul Brink told a business lunch in Melbourne.\nDe-dollarisation refers to when countries reduce reliance on the dollar as a reserve currency and in financial transactions. A weaker dollar makes gold more affordable for buyers using other currencies.\n\"You couldn't have written a more perfect script if you wanted to, on how to undermine the U.S. dollar,\" said Brink, who runs the $41.3 billion dollar company that invests in gold mines in exchange for a share of revenue from production.\nTariffs are shrinking the U.S.'s share of international trade and eroding the use of the U.S. currency, while its structural deficit, the worst among the Group of Seven nations, has lost the U.S. its 'AAA' investment ratings, he noted.\n\"The third thing you need to be the reserve currency is unbreakable trust in the independence of your institutions,\" he said. \"And Mr. Trump has undermined the banks. He is pivotal in that. That I would say is certainly what is driving this leg of the of the gold cycle,\" he said.\nLonger term, a more enduring rally in gold prices would come from how central banks think about monetary policy and how central banks think about their own reserves, he said.\nCentral banks have come to realize that their populations do not want to tolerate austerity, so the way out of an economic downturn must be to boost liqu"
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "0.765",
            "open": "66.117",
            "close": "66.305",
            "high": "66.832",
            "low": "66.067"
        },
        "market_summary": "### Spot Brent Crude Oil Market Briefing\n\n* **Key Drivers:** Concerns over **ample global supplies** and a predicted **glut in global balances** are capping price gains, despite support from declines in US product stockpiles and strength in broader markets.\n* **Price Action:** Trading in a range with **$65 to $70** seen as a firm level for flat price, while **Goldman Sachs** expects **Brent** to average **$56** a barrel in **2026** due to a forecasted average daily surplus of about **2 million barrels**.\n* **Technical Outlook:** Immediate support for **WTI** is near **$61.50**, with resistance levels to be determined by the outcome of the **OPEC+** production increase of **137,000 barrels per day** and the impact of potential sanctions on **Russian energy exports**.\n\n---\n**Overall Sentiment:** Neutral ⚖️",
        "source_articles": [
            {
                "title": "Oil Declines With Gaza Peace Plan and US Inventories in Focus - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/articles/2025-10-08/latest-oil-market-news-and-analysis-for-oct-9",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            },
            {
                "title": "Oil Climbs as US Product Stockpiles Drop and Equities Advance - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/oil-climbs-inventories-seen-declining-095526752.html",
                "body": "(Bloomberg) -- Oil rose to the highest in a week after a government report showed a decline in domestic product stockpiles, while strength in broader markets supported crude prices.\nWest Texas Intermediate climbed 1.3% to trade above $62 a barrel, aided by gains in US equities. The Energy Information Administration reported a 763,000-barrel weekly drop at the Cushing hub in Oklahoma, as well as lower oil-product holdings across the board. US distillate stocks, in particular, saw the largest decline since late June.\nMost Read from Bloomberg\nPrice gains are still capped by the outlook for ample global supplies, with OPEC+ ramping up production and the US forecasting record domestic output this year. Russian exports are also close to a 16-month high as Ukrainian drone strikes against refineries cut domestic processing.\n“The disconnect continues between paper pricing and the predicted glut in global balances,” said Keshav Lohiya, founder of consultant Oilytics. “We are back to an oil trading world where flat price is firmly in the $65 to $70 world.”\nGoldman Sachs Group Inc. reaffirmed its bearish outlook on oil, saying the global market faces an average daily surplus of about 2 million barrels from this quarter through next year. That will drag prices lower, with Brent expected to average $56 a barrel in 2026, analysts including Yulia Grigsby said in a note.\nIn corporate news, Exxon Mobil Corp. signed agreements that lay the groundwork for it to explore Iraq’s giant Majnoon oil field, ending the company’s near two-year hiatus in the country.\n--With assistance from Yongchang Chin and Alex Longley.\nMost Read from Bloomberg Businessweek\n-\nHow Din Tai Fung Became America’s Top-Earning Restaurant Chain\n-\nA Shipwreck Killed 41 Crew and 5,900 Cattle. The Brutal Business Behind It Goes On\n-\nThe Political Transformation of California’s Billionaire Mall King\n-\nTrump’s Global Trade Chaos Creates an Opportunity for African Farmers\n©2025 Bloomberg L.P."
            },
            {
                "title": "WTI declines to near $61.50 on EIA crude oil inventories surge - Mitrade",
                "source": "Mitrade",
                "url": "https://www.mitrade.com/insights/commodity-analysis/oil-news/fxstreet-USOIL-202510091117",
                "body": "WTI price drifts lower to near $61.70 in Thursday’s Asian session.\nOPEC+ agreed on a modest increase of 137,000 barrels per day for November.\nUS crude inventories climbed by 3.715 million barrels last week, the EIA noted.\nWest Texas Intermediate (WTI), the US crude oil benchmark, is trading around $61.70 during the Asian trading hours on Thursday. The WTI edges lower amid a larger-than-expected crude inventory build. Traders will take more cues from the speech by Federal Reserve (Fed) Chair Jerome Powell later on Thursday.\nThe US Energy Information Administration (EIA) reported on Wednesday that crude oil stockpiles in the US for the week ending October 3 climbed by 3.715 million barrels compared to an increase of 1.792 million barrels in the previous week. Analysts estimated that stocks would rise by 2.25 million barrels.\nOn the other hand, the WTI price received some support after the Organization of the Petroleum Exporting Countries and its allies (OPEC+) agreed to a smaller-than-expected increase in its crude production levels. The group will raise oil output from November by 137,000 barrels per day (bpd), below market expectations of as much as a 500,000 bpd boost to production.\nAdditionally, persistent geopolitical risks in Ukraine could lead to additional sanctions on Russian energy exports, lifting the WTI price. The US proposed that the G7 allies impose tariffs as high as 100% on China and India for their purchases of Russian oil in an effort to convince Russia to end the war in Ukraine.\n* The content presented above, whether from a third party or not, is considered as general advice only. This article should not be construed as containing investment advice, investment recommendations, an offer of or solicitation for any transactions in financial instruments."
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "0.835",
            "open": "62.306",
            "close": "62.441",
            "high": "63.061",
            "low": "62.226"
        },
        "market_summary": "### Spot WTI Crude Oil Market Briefing\n\n* **Key Drivers:** Supply data showing a decrease in crude stocks at the Cushing hub and a planned modest increase in **OPEC+** output have eased fears of an imminent glut, while the **US crude inventories** increased by **3.7 million bbl**.\n* **Price Action:** **WTI Crude** prices rose by **1.44%** to **$62.62**, with **Brent Crude** futures trading **1.42%** higher at **$66.38**, indicating **bullish momentum**.\n* **Technical Outlook:** Support is near the recent low of **$60**, with resistance at the psychological level of **$65** to **$70**, as emphasized by analyst Keshav Lohiya, who notes the market is back to an oil trading world where flat price is firmly in the **$65 to $70** range.\n\n---\n**Overall Sentiment:** Positive 🚀",
        "source_articles": [
            {
                "title": "Oil Declines With Gaza Peace Plan and US Inventories in Focus - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/articles/2025-10-08/latest-oil-market-news-and-analysis-for-oct-9",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            },
            {
                "title": "Crude Oil Futures Rise on Supply Data and OPEC Outlook - Crude Oil Prices Today | OilPrice.com",
                "source": "Crude Oil Prices Today | OilPrice.com",
                "url": "https://oilprice.com/Latest-Energy-News/World-News/Crude-Oil-Futures-Rise-on-Supply-Data-and-OPEC-Outlook.html",
                "body": "The return of populist Andrej…\n\"It's most important 8 minute read of my week…\"\nOil prices rose early on Wednesday after an industry report showed on Tuesday that the crude stocks at the key Cushing hub fell further and OPEC+ somewhat eased fears of an imminent glut with a planned modest increase in output.\nAs of 8:05 a.m. EDT on Wednesday, WTI Crude prices were up by 1.44% at $62.62, while the front-month Brent Crude futures traded 1.42% higher at $66.38.\nCushing, Oklahoma, is the physical delivery spot for oil bought and sold in West Texas Intermediate futures contracts.\nThe American Petroleum Institute (API) estimated on Tuesday that stocks at the WTI delivery hub, Cushing, fell by 1.2 million barrels in the week ending October 3.\nEIA data for week ending September 26 showed Cushing inventories at 23.467 million barrels—a figure that is unusually low. Levels this thin leave the market more vulnerable to regional supply disruptions and amplify price swings when pipeline flows shift.\n“The disconnect continues between paper pricing and the predicted glut in global balances,” Keshav Lohiya, founder of consultant Oilytics, told Bloomberg.\n“We are back to an oil trading world where flat price is firmly in the $65 to $70 world.”\nThe modest monthly production increases from the OPEC+ alliance have also eased some of the oversupply fears, especially as estimates suggest that the group will not be returning all the barrels indicated in the headline figures of the deal. Some producers are compensating for previous overproduction, while many others simply lack the production capacity to raise output much further.\nThe price move higher is also supported by short-covering after last week’s sell-off, even as rising OPEC+ output and a fresh EIA upgrade to U.S. production stoke fears of a growing glut into 2026, Saxo Bank analysts said on Wednesday.\n“Until the physical market shows signs of softening via rising inventories, investors are likely to discount the impact of the production increases,” analysts at ANZ commented on Wednesday.\nBy Tsvetana Paraskova for Oilprice.com\nMore Top Reads From Oilprice.com:\nADVERTISEMENT\nTsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews."
            },
            {
                "title": "EIA: US crude inventories up 3.7 million bbl as federal government shutdown continues - Oil & Gas Journal",
                "source": "Oil & Gas Journal",
                "url": "https://www.ogj.com/general-interest/news/55321991/eia-us-crude-inventories-up-37-million-bbl-as-federal-government-shutdown-continues",
                "body": "EIA: US crude inventories up 3.7 million bbl as federal government shutdown continues\n[UPDATED: to reflect correct release date]\nUS crude oil inventories for the week ended Oct. 3, excluding the Strategic Petroleum Reserve, increased by 3.7 million bbl from the previous week, according to data from the US Energy Information Administration (EIA).\nRelease of the data Oct. 8 comes as the closure of the federal government continues. EIA said it is continuing normal publication schedules and data collection until further notice.\nAt 420.3 million bbl, US crude oil inventories are about 4% below the 5-year average for this time of year, the EIA report indicated.\nEIA said total motor gasoline inventories decreased by 1.6 million bbl from last week and are about 1% below the 5-year average for this time of year. Finished gasoline inventories increased while blending components inventories decreased last week. Distillate fuel inventories decreased by 2.0 million bbl last week and are about 6% below the 5-year average for this time of year.\nPropane-propylene inventories decreased by 2.9 million bbl from last week and are 9% above the 5-year average for this time of year, EIA said.\nUS crude oil refinery inputs averaged 16.3 million b/d for the week ended Oct. 3, about 130,000 b/d more than the previous week’s average. Refineries operated at 92.4% of capacity.\nGasoline production increased, averaging 9.8 million b/d. Distillate fuel production increased by 210,000 b/d, averaging 5.2 million b/d.\nUS crude oil imports averaged 6.4 million b/d, up 570,000 b/d from the previous week. Over the last 4 weeks, crude oil imports averaged 6.1 million b/d, 4.8% less than the same 4-week period last year. Total motor gasoline imports averaged 627,000 b/d. Distillate fuel imports averaged 132,000 b/d."
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0063",
            "open": "1.1653",
            "close": "1.1627",
            "high": "1.1661",
            "low": "1.1598"
        },
        "market_summary": "### EUR/USD Market Briefing\n\n* **Key Drivers:** The **political crisis in France** and **risk-averse markets** are increasing bets on a more **hawkish** Federal Reserve, strengthening the dollar, while the **Eurozone's lack of growth momentum** and **widening interest rate differentials** undermine the euro.\n* **Price Action:** Broke below the key psychological level of **1.1635**, showing significant **bearish** momentum, with the pair trading near **1.1615** and staying above the one-month low of **1.1605**.\n* **Technical Outlook:** Immediate support is near **1.1585 – 1.1600**, with resistance at **1.1650**, and a sustained break below **1.1575** could open the way to **1.1450 – 1.1465**.\n\n---\n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "EUR/USD sells off amid France's political crisis, risk-averse markets - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/eur-usd-falls-to-one-month-lows-on-political-fears-risk-off-markets-202510080727",
                "body": "EUR/USD remains pinned near one-month lows with the FOMC minutes on tap\n- The Euro depreciates for the third consecutive day, reaching levels near 1.1600.\n- The political impasse in France keeps the Euro under pressure.\n- The lack of progress to restore US government funding is starting to boost the Dollar on risk-averse flows.\nEUR/USD keeps hovering right above one-month lows at 1.1605, weighed by investors' concerns about the fragile political and fiscal situation in France. The pair trades at 1.1635 at the time of writing, with investors awaiting the release of the minutes of the last Fed meeting along with a string of Federal Reserve (Fed) and European Central Bank (ECB) speakers, including President Christine Lagarde.\nThe Common currency had come under increasing pressure earlier on the day as pressure on French President Emmanuel Macron to call a snap election mounted amid growing criticism from his own ranks. Former allies have joined the demands of opposition parties to call elections or resign, and rating agencies have warned of a further downgrade of France's sovereign credit status if the political impasse drags on.\nAcross the Atlantic, the political scenario is not much better. US Senate Democratic and Republican leaders remain unable to find a way to restart funding as the shutdown enters its second week, and hopes of a breakthrough this week have fallen to 23% according to a poll by Polymarket. The lack of progress has started to erode market sentiment, boosting demand for the US Dollar and other traditional safe havens.\nEuro Price Today\nThe table below shows the percentage change of Euro (EUR) against listed major currencies today. Euro was the strongest against the New Zealand Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Euro from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent EUR (base)/USD (quote).\nDaily digest market movers: Political uncertainty hurts the Euro\n- The growing political uncertainty in France keeps bleeding the Euro this week, while investors' concerns about a prolonged shutdown of the US federal government have started to hurt market sentiment and boost demand for the safe-haven USD. In the absence of key macroeconomic data to alter this view, the bearish EUR/USD trend has further room to go.\n- On Wednesday, France's recently resigned Prime Minister, Sébastien Lecornu, assured that he is going to present a solution to President Macron later today and affirmed that \"the dissolution of the parliament is becoming more remote\". These comments have given some air to an ailing Euro, but the broader trend remains strongly bearish.\n- On Tuesday, ECB President Christine Lagarde reiterated that the disinflationary process in the Eurozone has been completed and that she is hopeful that France will meet its international commitments and produce a budget in time.\n- Eurozone data has failed to improve investors' sentiment. German Factory Orders figures showed a 0.8% decline in August, against market expectations of a 1.4% growth, following a 2.7% contraction in July. Year-on-year, orders have increased at a 1.5% rate, after a 3.3% fall in July.\n- Fed policymakers continue showing their divergences. Minneapolis Fed President Neel Kashkari has warned about a burst of inflation if the bank lowers rates too fast, while US President Donald Trump's latest appointment, Fed Governor Stephen Miran, stated that inflation is due to population increases and reiterated that monetary policy needs to ease.\nTechnical Analysis: EUR/USD remains dangerously close to 1.1610 support\nThe EUR/USD technical picture reflects strong bearish pressure. The 4-hour chart Relative Strength Index (RSI) is low but not yet at oversold levels, and the Moving Average Convergence Divergence (MAC"
            },
            {
                "title": "U.S. Dollar Tests New Highs Ahead Of FOMC Minutes: Analysis For EUR/USD, GBP/USD, USD/CAD, USD/JPY - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/u-s-dollar-tests-new-highs-ahead-of-fomc-minutes-analysis-for-eur-usd-gbp-usd-usd-cad-usd-jpy-1553630",
                "body": "U.S. Dollar Index gains ground as traders wait for FOMC Minutes, which will be released soon.\nCurrently, U.S. Dollar Index is trying to settle above the resistance at 98.85 – 99.00. In case this attempt is successful, U.S. Dollar Index will move towards the next resistance level, which is located in the 100.00 – 100.15 range.\nEUR/USD remains under pressure as traders focus on the weaker-than-expected Industrial Production report from Germany. The report indicated that Industrial Production declined by -4.3% month-over-month in August, compared to analyst forecast of -1%.\nA successful test of the support at 1.1585 – 1.1600 will open the way to the test of the next support level at 1.1450 – 1.1465.\nGBP/USD pulled back as traders focused on general strength of the American currency.\nThe nearest support level for GBP/USD is located in the 1.3335 – 1.3350 range. A move below the 1.3335 level will push GBP/USD towards the next support at 1.3150 – 1.3165.\nUSD/CAD stays range-bound despite the strong rally in precious metals markets. Spot gold climbed above the $4000 level, while silver moved above the $49.00 level.\nIn case USD/CAD declines below the support at 1.3910 – 1.3925, it will move towards the next support at 1.3845 – 1.3860.\nUSD/JPY tested new highs as traders remained focused on the results of Japan ruling party elections. Traders expect that BoJ will be more dovish than previously expected.\nIf USD/JPY climbs above the 153.00 level, it will head towards the resistance at 154.50 – 155.00. RSI is in the overbought territory, so the risks of a pullback are increasing.\nFor a look at all of today’s economic events, check out our economic calendar.\nVladimir is an independent trader, with over 18 years of experience in the financial markets. His expertise spans a wide range of instruments like stocks, futures, forex, indices, and commodities, forecasting both long-term and short-term market movements."
            },
            {
                "title": "EUR USD Price Forecast - Euro to Dollar Sinks to 1.1615 as French Bond Turmoil - TradingNEWS",
                "source": "TradingNEWS",
                "url": "https://www.tradingnews.com/news/euro-to-dollar-sinks-to-11615",
                "body": "Political Risk in Japan and the Euro’s Cross-Currency Headwinds\nThe euro’s troubles are compounded by external cross-flows. The victory of Sanae Takaichi in Japan’s leadership race triggered a collapse in the JPY, with USD/JPY climbing above 150, its highest in 18 months. The yen’s weakness redirected capital into the dollar, strengthening U.S. indices and weighing indirectly on the euro. The spillover from Asian markets amplified the safe-haven rotation, where investors favored the greenback over the single currency due to Europe’s internal divisions. Analysts note that the euro’s underperformance is not isolated to the dollar—EUR/GBP fell to 0.8512, while EUR/JPY plunged below 174.00, its sharpest two-day drop since May. The widening interest rate differentials between the ECB and other central banks further undermine carry appeal for the euro.\nMacro Catalysts Ahead: FOMC Minutes and ECB Speeches in Focus\nTraders are now awaiting the FOMC meeting minutes, due later today, as a potential catalyst for EUR/USD volatility. The minutes from the September 16–17 meeting, where the Fed voted to cut rates by 25 basis points, will shed light on policymakers’ internal debate over growth risks amid the data blackout caused by the shutdown. Fed members including Governor Bowman and President Goolsbee are scheduled to speak later in the day, offering clues about how deeply divided the Committee remains. Simultaneously, the ECB’s Lagarde is expected to address fiscal risks and market fragmentation in a high-profile speech in Frankfurt. A dovish tone from either side could trigger a corrective bounce toward 1.1690, while any sign of Fed caution on further cuts would reinforce dollar strength and drive EUR/USD toward 1.1500.\nMarket Sentiment: Traders Stay Bearish but Volatility Remains Contained\nDespite persistent bearish momentum, implied volatility in EUR/USD options remains muted at 6.2%, indicating traders expect controlled downside rather than disorderly selling. However, sentiment surveys reveal caution: over 64% of leveraged funds tracked by the CFTC hold net-short euro positions, the highest ratio since April. Retail traders, on the other hand, appear increasingly contrarian, with positioning data showing 58% long exposure, a setup that typically precedes further downside before a potential reversal. As liquidity remains thin amid the government shutdown and Chinese holidays, intraday ranges are expected to remain tight, with volume clusters forming between 1.1590–1.1650.\nTradingNews Verdict: EUR/USD – SELL (Short-Term), Neutral Medium-Term\nBased on combined macro, technical, and positioning signals, the balance of risk favors continued euro weakness. The mix of French political paralysis, lack of Eurozone growth momentum, and a defensive dollar points to further downside. As long as EUR/USD stays below 1.1650, bears maintain control with targets at 1.1575 and 1.1490. A sustained rebound above 1.1720 would be required to shift bias toward neutral. For now, the outlook remains bearish short-term, neutral mid-term, as traders brace for the FOMC minutes and ECB rhetoric to determine whether the next 200-pip move unfolds before the week’s end."
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0067",
            "open": "1.3425",
            "close": "1.3401",
            "high": "1.3438",
            "low": "1.3371"
        },
        "market_summary": "### GBP/USD Market Briefing\n\n* **Key Drivers:** The **US government shutdown** and comments from Federal Reserve (Fed) officials, including Fed Chair Jerome Powell, are influencing the **GBP/USD** pair, with the **US Dollar (USD)** softening amid concerns over a prolonged shutdown.\n* **Price Action:** The **GBP/USD** pair has reclaimed the **1.3400** mark, showing modest gains, but is not out of the woods yet, with the **100-period Simple Moving Average (SMA)** and a descending channel since the beginning of the month favoring the bears.\n* **Technical Outlook:** Immediate support is near the **1.3370** area, with resistance at **1.3425**, and the **US Dollar Index (DXY)** is up but beneath daily highs, indicating a potential **bearish** momentum for the **USD**.\n\n---\n**Overall Sentiment:** Neutral 📊",
        "source_articles": [
            {
                "title": "Pound Sterling Price News and Forecast: GBP/USD gains some positive traction amid a broadly weaker US Dollar - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/pound-sterling-price-news-and-forecast-gbp-usd-gains-some-positive-traction-amid-a-broadly-weaker-us-dollar-202510090537",
                "body": "Pound Sterling Price News and Forecast: GBP/USD gains some positive traction amid a broadly weaker US Dollar\nGBP/USD Price Forecast: Reclaims 1.3400 amid a weaker USD; not out of the woods yet\nThe GBP/USD pair attracts some buyers during the Asian session on Thursday and moves away from a nearly two-week trough, around the 1.3370 area touched the previous day. Spot prices climb further beyond the 1.3400 mark in the last hour and, for now, seem to have snapped a two-day losing streak amid a broadly weaker US Dollar (USD).\nFrom a technical perspective, the recent repeated failures near the 100-period Simple Moving Average (SMA) and the downfall along a descending channel since the beginning of this month favor the GBP/USD bears. Furthermore, negative oscillators on 4-hour/daily charts suggest that any subsequent move up might still be seen as a selling opportunity and run the risk of fizzling out rather quickly. Read more...\nGBP/USD posts modest gains above 1.3400 amid ongoing US government shutdown\nThe GBP/USD pair posts modest gains near 1.3405, snapping the two-day losing streak during the early Asian session on Thursday. The US Dollar (USD) softens against the Pound Sterling (GBP) amid concerns over a prolonged US government shutdown. The speech by Federal Reserve (Fed) Chair Jerome Powell will be in the spotlight later on Thursday.\nThe US government shutdown has entered its ninth day with no hint of progress toward a resolution as the Senate on Wednesday again rejected dueling Republican and Democratic funding proposals to end the federal shutdown. The competing stopgaps had already failed to pass in five previous votes. Read more...\nGBP/USD stabilizes as US Dollar eases, traders await Fed minutes\nGBP/USD recovers ground on Wednesday as the US Dollar (USD) trims some of its earlier gains amid a scarce economic docket on both sides of the Atlantic. At the time of writing, the pair trades at 1.3425, up 0.08%. The British Pound (GBP) stopped the bleeding as risk appetite improved, and the USD retreated. Nevertheless, the US Dollar Index (DXY), which tracks the performance of the US Dollar’s value against a basket of six currencies, including Sterling, is up 0.25% at 98.82, but beneath daily highs of 98.98.\nThe US government shutdown extends to its eighth day. Bloomberg reported that US House Speaker Mike Johnson opposes any attempt to end the Senate filibuster to bypass Democrats and reopen the government. The lack of economic data in the US left traders adrift on comments by Federal Reserve (Fed) officials. St. Louis Fed Alberto Musalem and Governor Michael Barr crossed the wires but did not comment on monetary policy or the economic outlook. Later, traders will digest the latest minutes of the Federal Open Market Committee (FOMC) monetary policy meeting. Read more...\nAuthor\nFXStreet Team\nFXStreet"
            },
            {
                "title": "GBP/USD posts modest gains above 1.3400 amid ongoing US government shutdown - Mitrade",
                "source": "Mitrade",
                "url": "https://www.mitrade.com/insights/forex-analysis/more/fxstreet-GBPUSD-202510090904",
                "body": "GBP/USD posts modest gains above 1.3400 amid ongoing US government shutdown\nGBP/USD trades with mild gains around 1.3405 in Thursday’s early Asian session.\nFed officials were strongly inclined to lower rates, with some members favoring a more cautious approach, meeting minutes released Wednesday showed.\nBoE’s Pill said policymakers should adopt a 'conservative' approach to setting rates.\nThe GBP/USD pair posts modest gains near 1.3405, snapping the two-day losing streak during the early Asian session on Thursday. The US Dollar (USD) softens against the Pound Sterling (GBP) amid concerns over a prolonged US government shutdown. The speech by Federal Reserve (Fed) Chair Jerome Powell will be in the spotlight later on Thursday.\nThe US government shutdown has entered its ninth day with no hint of progress toward a resolution as the Senate on Wednesday again rejected dueling Republican and Democratic funding proposals to end the federal shutdown. The competing stopgaps had already failed to pass in five previous votes.\nThe Bureau of Labor Statistics and the Bureau of Economic Analysis have suspended data collecting and reporting, which complicates the Fed's decision-making on interest rates and businesses' ability to make informed decisions. This, in turn, could weigh on the Greenback in the near term.\nMinutes from the Fed's September meeting released on Wednesday showed that a majority of policymakers supported the September rate cut and signaled further reduction later this year. However, some members favored a more cautious approach, citing concerns about inflation.\nBank of England (BoE) Chief Economist Huw Pill said on Wednesday that central bankers should adopt a \"conservative\" approach to setting interest rates, including responding firmly if price growth gets out of hand. The upside for the major pair might be capped as the uncertainty over the BoE’s monetary policy outlook has increased.\n* The content presented above, whether from a third party or not, is considered as general advice only. This article should not be construed as containing investment advice, investment recommendations, an offer of or solicitation for any transactions in financial instruments."
            },
            {
                "title": "Pound to Dollar Forecast: GBP/USD Slips as BoE’s Pill Calls for Cautious Approach - currencynews.co.uk",
                "source": "currencynews.co.uk",
                "url": "https://www.currencynews.co.uk/forecast/20251008-44228_pound-to-dollar-forecast-gbp-usd-slips-boes-pill-calls-cautious-approach.html",
                "body": "The Pound to Dollar exchange rate (GBP/USD) traded mostly flat on Wednesday ahead of the release of the Federal Reserve’s September FOMC meeting minutes.\nAt the time of writing, GBP/USD was trading at approximately $1.3423, virtually unchanged from the start of Wednesday’s session.\nThe US Dollar (USD) strengthened against most of its major counterparts on Wednesday, extending its gains as investors sought safe-haven assets amid ongoing geopolitical tensions in Europe and Japan.\nThe prevailing risk-off sentiment continued to underpin demand for the ‘Greenback’, keeping USD exchange rates on the front foot through the first half of the session.\nHowever, later in the day, the Dollar could face headwinds with the release of the Federal Reserve’s latest FOMC meeting minutes.\nIf the minutes strike a dovish tone or hint at a greater willingness to cut interest rates, this could prompt a pullback in USD, potentially halting the currency’s recent winning streak.\nThe Pound (GBP) held its ground against most major peers on Wednesday, showing resilience despite a lack of UK economic data and a broadly risk-off market mood.\nSave on Your GBP/USD Transfer\nGet better rates and lower fees on your next international money transfer.\nCompare TorFX with top UK banks in seconds and see how much you could save.\nSterling was offered mild support later in the session after comments from Bank of England (BoE) Chief Economist Huw Pill.\nSpeaking at the University of Birmingham, Pill said policymakers should take a “conservative” approach to setting interest rates and stand ready to act firmly if inflation risks rise.\nHe reiterated that the Bank must remain focused on price stability, while acknowledging the high level of uncertainty facing the economy.\nPound to US Dollar Forecast: Sparse Data to Prompt Choppy Trade?\nLooking ahead to Thursday’s European session, the Pound US Dollar (GBP/USD) exchange rate is likely to remain at the mercy of broader market sentiment amid a continued lack of key economic data.\nWith the US government still in shutdown, the release of the latest initial jobless claims report will be delayed, leaving investors without fresh US data to guide trading.\nIn the absence of new catalysts, the ‘Greenback’ is expected to react primarily to shifts in risk appetite.\nShould a cautious, risk-off tone persist across markets, the safe-haven US Dollar could stay in demand, extending its recent strength.\nAs for the Pound, the UK calendar also remains bare, likely leaving Sterling directionless once again.\nGBP exchange rates may therefore fluctuate in response to prevailing risk trends and external developments, with the currency likely to struggle to find a firm footing through Thursday’s session.\nLike this piece? Please share with your friends and colleagues:\nInternational Money Transfer? Ask our resident FX expert a money transfer question or try John's new, free, no-obligation personal service! ,where he helps every step of the way,\nensuring you get the best exchange rates on your currency requirements."
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0033",
            "open": "0.6580",
            "close": "0.6585",
            "high": "0.6589",
            "low": "0.6556"
        },
        "market_summary": "### AUD/USD Market Briefing\n\n* **Key Drivers:** The **hawkish** stance of the Reserve Bank of Australia (RBA) and rising inflation expectations are supporting the **AUD/USD** pair, while the US government shutdown is bolstering the **US Dollar**.\n* **Price Action:** The pair is currently trading around **$0.660**, with recent gains driven by higher inflation expectations, and faces resistance at **$0.6750** and **$0.7000**.\n* **Technical Outlook:** Immediate support is near the 50 and 10-day moving averages at **$0.6550-0.6500**, with a potential measured move of **70 pips** if an upside rally materializes, targeting the recent highs at **$0.6685**.\n\n---\n**Overall Sentiment:** **Bullish** 📈",
        "source_articles": [
            {
                "title": "AUD/USD Forecast: Navigating US Government Shutdown & Technical Signals - marketpulse.com",
                "source": "marketpulse.com",
                "url": "https://www.marketpulse.com/markets/audusd-forecast-navigating-us-government-shutdown-technical-signals/",
                "body": "This article is a follow up from the previous article on the Australian Dollar titled AUD/USD Forecast: Are Fresh Highs Incoming After RBA Rate Hold?\nIs the Aussie Dollar Poised for Gains?\nAs discussed in the previous Australian Dollar article titled AUD/USD Forecast: Are Fresh Highs Incoming After RBA Rate Hold? The Aussie Dollar may be poised for a rally.\nSince the interest rate decision by the RBA the Aussie Dollar has flattered to deceive. AUD/USD has faced a challenge given the US Dollars recent renaissance but that rally is likely to run out of steam soon in my opinion.\nThe fact that the RBA are holding rates and the Fed expected to cut bodes well for the AUD/USD pair to rise higher.\nThe US government shutdown appears to be benefitting the US Dollar at the moment and there is a possibility that this persists for a little while longer.\nWhat this could mean for AUD/USD is that we could see a continued grind over the coming days and weeks until the US government shutdown ends and US data releases begin filtering through.\nCommodity Rally to Benefit the Australian Dollar?\nThere is another factor to consider and that is the continued rally of commodity markets such as Gold, Silver and Copper. The Australian Dollar is considered a commodity currency and usually gains when the precious metal markets are on the rise.\nThis definitely adds weight to the theory that a rally for the Aussie Dollar may be in the offing. The technicals further support the idea for the AUD/USD to rally higher. Let us take a look at why.\nTechnical Analysis - AUD/USD\nFrom a technical point of view, AUD/USD has been consolidating and edging lower over the last 6 or so trading days,\nHaving broken the bull flag pattern which was in play the pair looked poised for a rally but has since had a pullback to a key level of confluence.\nThe level/area in question around 0.6550-0.6500 houses the 50 and 10-day MAs. The daily candle also looks poised to close with a downside wick highlighting the potential buying pressure in this price zone.\nIf an upside rally does materialize, the measured move potential from the flag breakout is around 70 pips.\nThis would mean a potential retest for AUD/USD of the recent highs at around the 6685 handle.\nA move beyond that level would bring the 0.6750 and 0.7000 psychological level into focus.\nIf AUD/USD pushes lower from here, immediate support rests at 0.6542, 0.6530 and 0.6500. A break below 0.6500 could open up a retest of the 200-day MA, which rests at the 0.6418 handle.\nAUD/USD Daily Chart, October 8, 2025\nSource:TradingView.com\nClient Sentiment Data - AUD/USD\nLooking at OANDA client sentiment data and market participants are Long on the AUD/USD with 60% of traders Net-Long. I prefer to take a contrarian view toward crowd sentiment and thus the fact that so many traders are Long means AUD/USD could fall in the near-term.\nFollow Zain on Twitter/X for Additional Market News and Insights @zvawda\nOpinions are the authors'; not necessarily that of OANDA Business Information & Services, Inc. or any of its affiliates, subsidiaries, officers or directors. The provided publication is for informational and educational purposes only.\nIf you would like to reproduce or redistribute any of the content found on MarketPulse, an award winning forex, commodities and global indices analysis and news site service produced by OANDA Business Information & Services, Inc., please refer to the MarketPulse Terms of Use.\nVisit https://www.marketpulse.com/ to find out more about the beat of the global markets.\n© 2025 OANDA Business Information & Services Inc."
            },
            {
                "title": "Aussie Dollar Gains Amid Rising Inflation Outlook - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/te_news:491545:0-aussie-dollar-gains-amid-rising-inflation-outlook/",
                "body": "Aussie Dollar Gains Amid Rising Inflation Outlook\nThe Australian dollar appreciated to around $0.660 on Thursday, building on the prior session’s gains, as higher inflation expectations reinforced the RBA's hawkish stance.\nConsumer inflation expectations rose to 4.8% in October 2025 from 4.7% in September, the highest since June, amid concerns that Q3 inflation could surpass forecasts.\nThe uptick, driven by the rollback of subsidies, elevated labor costs, and global trade and commodity pressures, adds to signs of lingering price pressures.\nThis reinforces the central bank’s cautious stance, which is expected to hold its policy rate steady after keeping the cash rate at 3.6% in September, citing persistent inflation and a tight labor market.\nMeanwhile, upside was capped by a firmer US dollar as investors continued to weigh the impact of the ongoing government shutdown, which fueled safe-haven demand.\nMarkets now await comments from Fed Chair Jerome Powell later today after the FOMC meeting showed mixed views on future rate moves."
            },
            {
                "title": "UBS raises AUD/USD forecast to 0.72 from 0.70 on RBA hawkish stance - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/news/forex-news/ubs-raises-audusd-forecast-to-072-from-070-on-rba-hawkish-stance-93CH-4276381",
                "body": "US approves several billion dollars of Nvidia chip sales to UAE- Bloomberg\nInvesting.com - UBS has upgraded its September 2026 AUD/USD forecast to 0.72 from 0.70, citing the Reserve Bank of Australia’s hawkish tone and upside inflation risks that emerged from last week’s policy meeting.\nThe RBA maintained its current interest rate levels during its meeting last week, prompting UBS to push back its projection for the first rate cut from November 2025 to February 2026. The investment bank also noted there is an increasing possibility that the central bank might remain on hold for an extended period.\nDespite recent softening in consumer sentiment and labor market indicators, UBS expects Australia’s unemployment rate to have remained largely stable in September. The third-quarter Consumer Price Index data, scheduled for release on October 29, will be crucial for the RBA’s next policy decision at its November 4 meeting.\nUBS now recommends long positions on the Australian dollar at current levels and suggests selling downside at 0.65 or below. The bank also identified several other currency pairs for potential long-Aussie positions, including AUD/CHF, AUD/CNY, and AUD/NZD.\nThe revised forecast reflects UBS’s assessment that Australia’s monetary policy will remain tighter for longer than previously anticipated, supporting the Australian dollar’s strength against the U.S. dollar through September 2026.\nThis article was generated with the support of AI and reviewed by an editor. For more information see our T&C.\nWhich stock should you buy in your very next trade?\nAI computing powers are changing the stock market. Investing.com's ProPicks AI includes dozens of winning stock portfolios chosen by our advanced AI.\nYear to date, 3 out of 4 global portfolios are beating their benchmark indexes, with 98% in the green. Our flagship Tech Titans strategy doubled the S&P 500 within 18 months, including notable winners like Super Micro Computer (+185%) and AppLovin (+157%).\nWhich stock will be the next to soar?"
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "1.2610",
            "open": "151.8660",
            "close": "152.6750",
            "high": "152.9940",
            "low": "151.7330"
        },
        "market_summary": "### USD/JPY Market Briefing\n\n* **Key Drivers:** The **delayed BoJ rate hike** and **US Dollar strength** due to **global risk sentiment** and **hawkish** Federal Reserve expectations are driving the USD/JPY pair.\n* **Price Action:** The pair is struggling near **152.00**, after recovering from an over seven-month low, showing **bearish** momentum.\n* **Technical Outlook:** Immediate support is near **152.00**, with resistance at **155.00**, and the daily Relative Strength Index (RSI) remains close to the overbought zone.\n\n---\n**Overall Sentiment:** **Bullish** ↑",
        "source_articles": [
            {
                "title": "Yen’s Haven Status Undercut by Gold Surge, BOJ Rate-Hike Doubts - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/articles/2025-10-08/yen-s-haven-status-undercut-by-gold-surge-boj-rate-hike-doubts",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            },
            {
                "title": "Japanese Yen recovers but struggles amid delayed BoJ rate hike bets - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/japanese-yen-edges-higher-but-faces-headwinds-from-delayed-boj-hike-bets-202510090226",
                "body": "Japanese Yen remains on the front foot; USD/JPY struggles near mid-152.00 on weaker USD\n- The Japanese Yen recovers from an over seven-month low against its American counterpart.\n- Expectations that Takaichi's policies could delay BoJ rate hikes might cap gains for the JPY.\n- The Israel-Hamas peace deal boosts investors’ appetite and acts as a headwind for the JPY.\nThe Japanese Yen (JPY) remains firm against a weaker US Dollar (USD), pushing the USD/JPY pair below the mid-152.00s in Thursday's Asian session. Earlier this week, Japan's Finance Minister Katsunobu Kato warned against forex volatility after the recent slump in the domestic currency. Expectations for another Bank of Japan (BoJ) rate hike also offer some support to the JPY.\nAny meaningful JPY appreciation, however, seems elusive amid concerns about the fiscal outlook in Japan. In fact, Sanae Takaichi, who is expected to become Japan's first female Prime Minister, is a big supporter of aggressive government spending and is expected to oppose further policy tightening by the BoJ. Moreover, the Israel-Hamas agreement to the first phase of the peace deal boosts the global risk sentiment and might contribute to capping the upside for the safe-haven JPY.\nJapanese Yen lacks bullish conviction amid BoJ uncertainty, receding safe-haven demand\n- Japan's Finance Minister Katsunobu Kato said earlier this week that the government will be vigilant for volatile movements on the currency market, and it's important for currencies to move in a stable manner reflecting fundamentals.\n- Sanae Takaichi's surprise win in the ruling Liberal Democratic Party's (LDP) leadership race last Saturday puts her on course to become the first female Prime Minister and fueled speculations about more expansionary fiscal policy.\n- Traders are now pricing in a 26% chance that the Bank of Japan will raise interest rates at its next meeting on October 30, down from around 60% last Friday. This has been weighing on the Japanese Yen since the beginning of this week.\n- Takaichi's economic advisors – Etsuro Honda and Takuji Aida – were quoted as saying that the new PM would probably tolerate another interest rate hike either in December or in January, though the path beyond that remains unclear.\n- Moreover, inflation in Japan has stayed at or above the BoJ’s 2% target for more than three years, and the economy expanded for a fifth straight quarter in the three months through June, keeping hopes alive for another BoJ hike this year.\n- Minutes from the Federal Reserve’s September meeting released on Wednesday indicated near unanimity among participants to lower interest rates amid concern about labour market risks and a more balanced inflation outlook.\n- Policymakers, however, remained split on whether there should be one or two more rate reductions before the end of this year. Nevertheless, the overall tone was cautious and pointed to a continued easing bias.\n- In fact, the CME Group's FedWatch Tool indicates that traders are still pricing in a greater possibility of 25-basis-point rate cut at each of the two remaining policy meetings this year, in October and in December.\n- US President Donald Trump said on Wednesday that Israel and Hamas have agreed to the first phase of his 20-point peace plan to pause fighting and release at least some hostages and prisoners, undermining safe-haven assets.\n- Traders now look forward to Fed Chair Jerome Powell's speech for more cues about the future rate-cut path. This, in turn, will influence the US Dollar price dynamics and provide some meaningful impetus to the USD/JPY pair.\nUSD/JPY technical setup backs the case for the emergence of dip-buying at lower levels\nThe daily Relative Strength Index (RSI) remains close to the overbought zone and holds back traders from placing fresh bullish bets around the USD/JPY pair. Any subsequent pullback, however, is likely to attract fresh buyers and remain cushioned near the 152.00 round figure. This is followed by the overnight swing "
            },
            {
                "title": "USD/JPY Price Forecast - Dollar to Yen Rockets to 153.00 as Dollar Dominance Persists - TradingNEWS",
                "source": "TradingNEWS",
                "url": "https://www.tradingnews.com/news/usd-jpy-price-forecast-dollar-to-yen-blasts-past-153",
                "body": "France’s Political Crisis Adds to Global Dollar Bid\nCompounding the yen’s weakness is Europe’s instability. The resignation of French Prime Minister Sébastien Lecornu and the resulting political vacuum have intensified volatility in European markets. The EUR/USD pair has fallen toward 1.1600, adding further tailwinds to the dollar. The twin crises — in Paris and Tokyo — have amplified global demand for dollar liquidity, particularly as the U.S. government shutdown drags into its second week, freezing parts of financial regulation but not affecting Treasury operations.\nThe combination of risk aversion, policy divergence, and yield differentials has created the perfect setup for extended dollar strength. Market data shows leveraged funds increasing net long USD/JPY positions by 21,000 contracts last week, the highest build-up since March.\nEconomic Divergence: Japan’s Fragile Inflation and U.S. Resilience\nJapan’s inflation remains far below target, with core CPI growth slowing to 1.8% YoY, down from 2.3% earlier in the summer. Wage pressures have stalled, reducing the BoJ’s confidence in achieving sustainable price growth. Conversely, U.S. core PCE inflation remains above 2.6%, and GDP projections for 2025–2028 were revised higher by the Fed, reflecting robust consumption and business investment. This divergence keeps the real yield gap firmly in the dollar’s favor.\nEven with the Fed signaling potential cuts later in 2025, the U.S. Treasury yield curve remains supportive of dollar carry trades. As of this week, the 10-year yield sits at 4.29%, while Japan’s 10-year government bond yields just 0.95%, a spread exceeding 330 bps — ensuring continued yen outflows unless Tokyo intervenes.\nJapan’s Policy Dilemma: Intervention Risks and Timing\nThe BoJ now faces a policy dilemma. Any attempt to tighten monetary conditions risks derailing the fragile recovery, while further inaction may accelerate capital flight and destabilize the yen. Market chatter suggests that Japanese authorities could intervene verbally or directly if USD/JPY breaches 155.00, a level previously described by the Finance Ministry as “excessive.” However, with the U.S. economy still outperforming, direct intervention might only offer temporary relief.\nTraders recall that last year’s coordinated interventions around 152.00 temporarily pushed the pair lower by 400 pips — but gains were quickly erased within weeks. For now, Tokyo appears more focused on stabilizing internal fiscal plans than defending the currency, especially amid leadership change.\nTradingNews Verdict: USD/JPY – STRONG BUY (Target 155.00, Support 150.50)\nThe balance of data — political divergence, yield spreads, Fed flexibility, and Japanese policy paralysis — points to continued upside in USD/JPY. The pair’s technical breakout above 150.00 signals the resumption of a long-term bull trend, supported by strong U.S. macro resilience and yen underperformance.\nTradingNews assigns USD/JPY: STRONG BUY, with target 155.00 short-term and support at 150.50. Momentum remains decisively in favor of the dollar as investors recalibrate around Japan’s political uncertainty and the Fed’s cautious easing cycle. While overbought signals may trigger intraday pullbacks, the fundamental setup continues to justify a bullish stance through Q4 2025."
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0039",
            "open": "1.3947",
            "close": "1.3950",
            "high": "1.3970",
            "low": "1.3931"
        },
        "market_summary": "### USD/CAD Market Briefing\n\n* **Key Drivers:** The **Canadian dollar**'s weakness is driven by **trade disputes**, **job losses**, and **interest rate cuts**, while the **US Federal Reserve**'s recent rate cut has taken some shine off the **US dollar**.\n* **Price Action:** The **USD/CAD** exchange rate is climbing toward its highest point since May, with the loonie dipping 0.1% against the **US dollar** and trading in a range of **1.3932** to **1.3971**.\n* **Technical Outlook:** Immediate resistance is near the **1.40** level, where analysts see a ceiling for the pair, with support at **1.3932**.\n\n---\n**Overall Sentiment:** **Bullish** for the **US dollar** 🚀",
        "source_articles": [
            {
                "title": "Canadian Dollar Sinks As Economic Woes Stack Up - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/canadian-dollar-sinks-as-economic-woes-stack-up",
                "body": "Trade disputes, job losses, and rate cuts have weighed on the loonie, and easing from the Bank of Canada plus soft oil prices could keep pressure on through year-end.\nabout 13 hours ago • 2 mins\nJoin the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nCanada’s currency has fallen to the bottom of the G10 pile this fall, with the USD/CAD exchange rate climbing toward its highest point since May as a mix of trade tensions, job losses, and interest rate cuts ripple through the economy.\nWhat does this mean?\nMUFG data shows the loonie has shed 6.3% against its G10 peers this year, trailing only the US dollar. That weakness lines up with doubts about Canada’s growth outlook – trade scuffles with the US sparked more than 106,000 job losses in July and August, lifting unemployment to 7.1%, up 2.3 percentage points from mid-2022 lows. Meanwhile, the Bank of Canada’s September rate cut to 2.50% was the G10’s most aggressive move this year. Markets are eyeing more easing ahead, and the new government’s wider budget deficit ($62.3 billion versus $42.2 billion last year) isn’t calming nerves. Even recent steps to ease trade frictions have made little difference, with tariffs sticking around for steel and autos. Sluggish oil prices are icing on the cake – if they tumble further, the loonie could slide to new lows.\nWhy should I care?\nFor markets: Canada’s currency journey shakes up global flows.\nThe loonie’s slide is stirring up volatility in global markets, especially around commodities and cross-border trades. With the Bank of Canada trimming rates, investors are extra cautious – they’re closely tracking labor reports and oil prices to gauge where the currency heads next. Hedge funds have ramped up short bets on the loonie, though they’re still shy of this year’s records.\nThe bigger picture: Policy pivots meet broader economic headwinds.\nCanada’s policymakers are juggling rising unemployment, bigger deficits, and shifting US trade priorities. More rate cuts could pile on the challenges, especially if oil prices remain weak. Unless there’s a turnaround in trade or growth, the pressure on the loonie looks set to stick around – keeping both businesses and governments on the defensive.\nYou read that right: you can win two return flights to London, a three-night stay at a hotel in the capital, and in-person tickets to our Modern Investor Summit. Even better, your trip will be created in partnership with Echo Bravo – the experts in hassle-free business travel and round-the-clock human support.\nSo not only can you skip the bill, but you can leave the planning to the pros, too.\nAll you need to do is register for the Summit… and decide who you’d share that room with, of course.\nT&C's apply. Click here for details.\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nQuick Take\nAberdeen Group x Finimize • about 18 hours ago\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article is based on reporting by MT Newswires. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies."
            },
            {
                "title": "Canadian dollar sticks to sideways pattern ahead of key jobs report - Mint",
                "source": "Mint",
                "url": "https://www.livemint.com/market/stock-market-news/canadian-dollar-sticks-to-sideways-pattern-ahead-of-key-jobs-report/amp-11759946614512.html",
                "body": "*\nLoonie dips 0.1% against the greenback\n*\nTrades in a range of 1.3932 to 1.3971\n*\nPrice of oil increases 1.5%\n*\nBond yields were little changed across the curve\nBy Fergal Smith\nTORONTO, Oct 8 (Reuters) - The Canadian dollar edged lower against its U.S. counterpart on Wednesday but the move was limited as oil prices rose and investors awaited domestic jobs data at the end of the week.\nThe loonie was trading 0.1% lower at 1.3958 per U.S. dollar, or 71.64 U.S. cents, after moving in a range of 1.3932 to 1.3971. The currency has been in a holding pattern since last Thursday when it hit a 4-1/2-month low at 1.3986.\n\"The pair continues to trade sideways as opposing fundamental forces keep it in balance,\" said Tony Valente, a senior FX dealer at AscendantFX.\n\"The Fed’s (U.S. Federal Reserve) recent rate cut is exerting downward pressure on the USD, while Canada’s weaker trade data and growing expectations that the Bank of Canada could follow with additional easing are limiting upside for the loonie.\"\nThe Canadian central bank cut interest rates last month for the first time since March, lowering the benchmark rate to 2.50%.\nCanada's trade deficit widened in August to its second-highest level on record as exports declined in the face of U.S. tariffs on Canadian goods, data on Tuesday showed. Also on Tuesday, U.S. President Donald Trump promised to treat Canada fairly in talks over tariffs but was less committed about a continental trade deal that also includes Mexico. Canada sends about 75% of its exports to the United States, including oil. U.S. crude futures rose 1.5% to $62.57 a barrel on worries the U.S. and Europe would keep sanctions on Russia for longer.\nCanada's employment report for September, due on Friday, is expected to show the economy adding 5,000 jobs and the unemployment rate edging up to 7.2% from 7.1% in August.\n\"A weak print would likely cement expectations for a December BoC cut and push USD-CAD towards the 1.40 level, where we see a ceiling for the pair,\" strategists at Monex Europe said in a note.\nCanadian bond yields were little changed across the curve, with the 10-year trading at 3.185%. (Reporting by Fergal Smith in Toronto; Editing by Nia Williams)"
            },
            {
                "title": "Canadian Dollar Holds Steady Before Key Jobs Report - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/canadian-dollar-holds-steady-before-key-jobs-report",
                "body": "The loonie slipped as traders await new jobs data, fresh rate cut talk, and ongoing questions over trade with the US.\nabout 12 hours ago • 2 mins\nJoin the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nThe Canadian dollar slid near a 4.5-month low, dipping 0.1% against the US dollar as traders geared up for a key Canadian jobs report that could stir up expectations for rates and trade flows.\nWhat does this mean?\nInvestors are caught between clashing economic signals. The US Federal Reserve’s recent rate cut has taken some shine off the dollar, but the loonie hasn’t been able to capitalize thanks to lackluster Canadian trade data and talk of more rate cuts from the Bank of Canada. Last month’s move by Canada’s central bank – lowering its policy rate to 2.50%, the first cut since March – set the tone, while Canada’s trade deficit in August swelled to its second-highest level ever, in part because of fresh US tariffs that hit exports. With oil prices ticking up 1.5% as global tensions rise, the loonie’s getting mixed signals. All eyes are now on Canada’s labor report: economists expect a 5,000-job gain and joblessness nudging up to 7.2%. If hiring comes up short, bets will likely rise on another rate cut in December, adding more downward pressure on the loonie.\nWhy should I care?\nFor markets: Rate suspense keeps currencies in check.\nCurrency traders are jittery, watching for signs of where rates, jobs, and trade talks might go next. Monex Europe analysts warn that if Friday’s jobs numbers disappoint, the USD-CAD exchange rate could jump toward 1.40—a level last seen in 2020. With Canadian bond yields steady around 3.2%, investors seem to be holding back, waiting for a clearer signal before shifting their positions.\nThe bigger picture: Trade ties make or break Canada’s outlook.\nAbout three-quarters of Canada’s exports—from energy to autos—head straight to the US, leaving the Canadian economy super-sensitive to US policy shifts and global trade riffs. With new tariffs and unresolved North American trade issues, Canada faces heightened uncertainty. The interplay of wider deficits, shifting rates, and unpredictable oil prices highlights just how closely Canada’s fortunes are tied to its neighbor’s every move.\nYou read that right: you can win two return flights to London, a three-night stay at a hotel in the capital, and in-person tickets to our Modern Investor Summit. Even better, your trip will be created in partnership with Echo Bravo – the experts in hassle-free business travel and round-the-clock human support.\nSo not only can you skip the bill, but you can leave the planning to the pros, too.\nAll you need to do is register for the Summit… and decide who you’d share that room with, of course.\nT&C's apply. Click here for details.\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nQuick Take\nAberdeen Group x Finimize • about 18 hours ago\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies.\nGet the two biggest stories in finance, and the reasons why you should care, delivered to "
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "1.5790",
            "open": "203.9060",
            "close": "204.6310",
            "high": "205.3150",
            "low": "203.7360"
        },
        "market_summary": "### GBP/JPY Market Briefing\n\n* **Key Drivers:** Fading **hawkish** bets on the Bank of Japan (BoJ) due to Sanae Takaichi's win in Japan's ruling LDP leadership race, and **monetary policy divergence** between the BoE and BoJ, are driving the **GBP/JPY** pair higher.\n* **Price Action:** The pair has broken above the key psychological level of **204.00**, reaching a fresh year-to-date high near **204.50**, driven by sustained **Yen weakness** and **bullish momentum**.\n* **Technical Outlook:** Immediate support is near **203.50**, with resistance at **205.00**, as investors await BoE Chief Economist Huw Pill's speech for fresh cues on the **monetary policy outlook**.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "GBP/JPY climbs to 205.00 as markets push back BoJ hike bets - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-climbs-to-20500-as-markets-push-back-boj-hike-bets-202510081531",
                "body": "GBP/JPY climbs to 205.00 as markets push back BoJ hike bets\n- GBP/JPY rises for a fourth consecutive day, driven by sustained Yen weakness.\n- Sanae Takaichi’s win in Japan’s ruling LDP leadership race fuels expectations of a slower BoJ tightening path.\n- Monetary policy divergence between the BoE and BoJ continues to underpin the Pound’s strength.\nThe British Pound (GBP) continues to climb against the Japanese Yen (JPY) on Wednesday, with GBP/JPY extending its winning streak for a fourth consecutive day as the Yen remains broadly pressured in the wake of Sanae Takaichi’s victory in Japan’s ruling party leadership race.\nAt the time of writing, the cross is trading around 204.65, setting a fresh year-to-date high and marking its strongest level since July 17, 2024, up roughly 3.0% so far this week. Investors view Takaichi’s pro-stimulus policy stance as a sign that the Bank of Japan (BoJ) may delay further tightening, keeping the Yen on the defensive.\nThe yen’s latest slump underscores how politics and monetary policy remain tightly intertwined as traders trimmed expectations for a rate hike at the Bank of Japan's (BoJ) October 29-30 monetary policy meeting. Markets had previously been positioning for an October move after a run of firmer economic data and hawkish hints from policymakers, but the focus has now shifted to the December meeting.\nFresh data released earlier in the day added to the cautious mood. Government figures released earlier on Wednesday showed Japan’s nominal Labor Cash Earnings rose just 1.5% YoY in August, well below expectations of 4.1% and down sharply from 2.6% in July. Meanwhile, inflation-adjusted real wages fell 1.4% YoY, marking the eighth straight month of decline as rising prices continue to erode household purchasing power. The weak wage backdrop complicates the BoJ’s efforts to normalize policy, even as a weaker Yen threatens to fuel further imported inflation.\nFormer BoJ officials have cautioned that if the Yen’s slide accelerates toward the 152.00 mark against the US Dollar (USD), policymakers could be forced to act sooner to curb imported inflation. Japan’s Finance Minister Katsunobu Kato has also reiterated that authorities are prepared to address “excessive volatility” in the currency market, though traders remain skeptical about the likelihood of intervention unless the Yen’s slide accelerates further.\nOn the UK side, attention remains on the Bank of England’s (BoE) monetary policy path as it seeks to balance persistent inflation with slowing growth. While the BoE maintains a cautious stance, it keeps the door open to further tightening if price pressures remain sticky, whereas the BoJ is expected to delay additional moves amid weak wage growth and political pressure for fiscal support.\nJapanese Yen Price Today\nThe table below shows the percentage change of Japanese Yen (JPY) against listed major currencies today. Japanese Yen was the strongest against the Euro.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Japanese Yen from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent JPY (base)/USD (quote).\nAuthor\nVishal Chaturvedi\nFXStreet\nI’m a macro-focused research analyst with over four years of experience covering forex and commodities market."
            },
            {
                "title": "GBP/JPY trades firmly near yearly high above 204.00 on fading BoJ hawkish bets - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-trades-firmly-near-yearly-high-above-20400-on-fading-boj-hawkish-bets-202510080552",
                "body": "GBP/JPY trades firmly near yearly high above 204.00 on fading BoJ hawkish bets\n- GBP/JPY refreshes yearly high near 204.50 on Wednesday amid continued weakness in the Japanese Yen.\n- Traders pare bets supporting interest rate hikes by the BoJ in the policy meetings remaining this year.\n- Investors await BoE Pill’s speech for fresh cues on the monetary policy outlook.\nThe GBP/JPY pair exhibits strength near a fresh yearly high around 204.50 during Wednesday’s European trading session, posted earlier in the day. The pair strengthens as underperformance from the Japanese Yen (JPY), with investors anticipating that the Bank of Japan (BoJ) will not tighten its monetary policy further in the near term.\nJapanese Yen Price This week\nThe table below shows the percentage change of Japanese Yen (JPY) against listed major currencies this week. Japanese Yen was the weakest against the US Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Japanese Yen from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent JPY (base)/USD (quote).\nBoJ hawkish bets have disappeared since the election of Sanae Takaichi as Japan’s Prime Minister who has favoured higher fiscal spending and tax cuts, and argued against tight monetary policy conditions.\nAnalysts at MUFG have stated that Japan's rates markets have priced out a central bank rate hikes for this calendar year, following Takaichi's win, and now see the next hike possibly coming only in March 2026.\nFading BoJ hawkish bets have resulted in weakness in the Japanese Yen, which was outperforming in past few months as Japan’s central bank was keeping the door open for further interest rate hikes.\nThough investors have underpinned the Pound Sterling (GBP) against the Japanese Yen, the former is exhibiting a mixed performance against its other peers. Meanwhile, investors seek fresh cues about whether the Bank of England (BoE) will cut interest rates in the remainder of the year.\nMarket experts are mixed about whether the BoE will loosen monetary policy conditions further this year as inflationary pressures remain almost double the central bank’s target of 2%, and the job market continues to deteriorate. In Wednesday’s session, investors will focus on the speech from BoE Chief Economist Huw Pill, which is scheduled at 15:00 GMT.\nEconomic Indicator\nBoE's Pill speech\nHuw Pill is the Chief Economist and Executive Director for Monetary Analysis and Research of the Bank of England. He is a member of the Monetary Policy Committee. Huw is responsible for the analysis the BoE uses to make monetary policy decisions. He also leads the research that supports all other functions.\nRead more.Next release: Wed Oct 08, 2025 15:00\nFrequency: Irregular\nConsensus: -\nPrevious: -\nSource: Bank of England\nAuthor\nSagar Dua\nFXStreet\nSagar Dua is associated with the financial markets from his college days. Along with pursuing post-graduation in Commerce in 2014, he started his markets training with chart analysis."
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "3,162.0000",
            "open": "122,000.5000",
            "close": "122,882.5000",
            "high": "124,235.5000",
            "low": "121,073.5000"
        },
        "market_summary": "### BTC/USD Market Briefing\n\n* **Key Drivers:** Institutional demand for **Bitcoin** is on the rise, with **$36 billion** in expected **Q4 2025** ETF inflows, driven by a potential **debasement trade** and growing recognition of **Bitcoin** as a hedge against currency debasement.\n* **Price Action:** Currently trading near **$121,841**, just **3.6%** below its all-time high of **$126,198**, with **bullish momentum** supported by strong ETF inflows, including **$1.2 billion** added on Monday and **$875.6 million** on Tuesday.\n* **Technical Outlook:** Immediate support is near the **$120,000** level, with resistance at **$126,198**, and a potential surge in **Q4 2025** inflows could push **Bitcoin** to new highs, driven by a strong **institutional appetite** and a growing **long leverage bias**.\n\n---\n**Overall Sentiment:** Positive spep",
        "source_articles": [
            {
                "title": "Congresswoman Violates STOCK Act With Late Trade Disclosures: Purchases Include Bitcoin ETF - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/congresswoman-violates-stock-act-trade-203542058.html",
                "body": "Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\nAs legislation in Congress heats up to ban elected officials from buying and selling stocks, several members have violated the STOCK Act in 2025, failing to disclose their transactions in a timely fashion. Here's the latest violation.\nWhat Happened: Stocks and options bought by members of Congress continue to gain attention from retail traders, as trades can sometimes be based on inside information or committee assignments.\nOther times, the transactions end up showing losses or are done by spouses or portfolio managers, with Congress members having less insight into why trades were made.\nTrending: If there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it?\nFor Congresswoman Sheri Biggs (R-S.C.), she may not have been aware of all of the trades made in 2025 by her husband and portfolio managers, but her recent disclosure violated the STOCK Act.\nBenzinga reached out to Biggs for comment and did not hear back.\nThe STOCK Act makes it mandatory for members of Congress to disclose their transactions within 45 days. Violations lead to a $200 late fee for the first offense.\nA look at the Benzinga Government Trades page shows Biggs recently disclosing multiple transactions dating back to March 2025.\nAmong the transactions were selling stocks like Apple Inc (NASDAQ:AAPL), Johnson & Johnson (NYSE:JNJ), Microsoft Corporation (NASDAQ:MSFT) and Berkshire Hathaway (NYSE: BRK-B) in March, along with buying U.S. Treasury notes in March and May.\nAlso included in the disclosure was a transaction from Biggs for buying $100,000 to $250,000 worth of the iShares Bitcoin Trust ETF (NASDAQ:IBIT) on July 9, 2025. The transaction and many others list the spouse, which could mean it was the congresswoman's husband who made the trade.\nSee Also: An EA Co-Founder Shapes This VC Backed Marketplace—Now You Can Invest in Gaming's Next Big Platform\nWhy It's Important: Waiting months to disclose buying and selling stocks leads to more distrust from the public in members of Congress when it comes to their trading activity.\n\"We just came across new STOCK Act violations. Representative Sheri Biggs filed dozens of trades made past the reporting deadline. Her husband bought up to $250K of Bitcoin, $IBIT, on July 9th. Pro-crypto legislation was passed a week later,\" Quiver Quantitative tweeted.\nBenzinga previously shared transactions made by Sen. Markwayne Mullin (R-Okla.) that were disclosed two or more years after they were made.\nRep. Lisa McClain (R-Mich.) also disclosed stock transactions late, including a trade of Palantir Technologies (NASDAQ:PLTR), which is up over 600% since the transaction.\nBenzinga will continue monitoring the trading activity of members of Congress.\nPhoto: Shutterstock\nTrending Now:\nBuilding a resilient portfolio means thinking beyond a single asset or market trend. Economic cycles shift, sectors rise and fall, and no one investment performs well in every environment. That's why many investors look to diversify with platforms that provide access to real estate, fixed-income opportunities, professional financial guidance, precious metals, and even self-directed retirement accounts. By spreading exposure across multiple asset classes, it becomes easier to manage risk, capture steady returns, and create long-term wealth that isn't tied to the fortunes of just one company or industry.\nBacked by Jeff Bezos, Arrived Homes makes real estate investing accessible with a low barrier to entry. Investors can buy fractional shares of single-family rentals and vacation homes starting with as little as $100. This allows everyday investors to diversify into real estate, collect rental income, and build long-term wealth without needing to manage properties directly.\nFor those seeking fixed-income style returns without Wall Street complexity, Worthy Property Bonds offers SEC-qualified, interest-bear"
            },
            {
                "title": "Bitcoin ETF inflows could serve as potential tailwind for Q4 gains - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/cryptocurrencies/news/bitcoin-etf-inflows-could-serve-as-potential-tailwind-for-q4-gains-202510090131",
                "body": "Bitcoin ETF inflows could serve as potential tailwind for Q4 gains\n- Bitwise's Matt Hougan says Bitcoin ETFs could attract massive inflows, surpassing their 2024 record.\n- Bitcoin could stretch its rally further if strong ETF inflows continue in Q4.\n- Futures open interest has also risen sharply, as traders exhibit a long leverage bias.\nBitcoin (BTC) is trading near $123,000 on Wednesday and could be set for a strong Q4 rally amid a resurgence in institutional appetite for spot BTC exchange-traded funds (ETFs).\nBitcoin ETFs to see strong inflows in Q4 as institutional demand accelerates\nBitcoin ETFs are on track to surpass their 2024 record of $36 billion, according to Bitwise Chief Investment Officer (CIO) Matt Hougan in a note on Tuesday.\nHe clarified that although the current inflows appear minor, with only $22.5 billion in the first nine months of 2025, there's still much room for an end-of-year surge.\n\"From where I sit, the stars are aligned for a very strong Q4 for flows — more than enough to push us to a new record (and a new all-time high in bitcoin's price),\" Hougan wrote.\nHougan cited three major catalysts for a bullish final quarter for Bitcoin ETFs, including BTC's price returns, debasement trade and growing institutional approvals. He stated that Bitcoin is seeing more institutional recognition, with Morgan Stanley advising up to 4% BTC allocation for risk-tolerant clients.\nAnother catalyst is that gold and Bitcoin are the best-performing major assets this year, fueling what Wall Street has dubbed the \"debasement trade.\" The term implies betting on assets that thrive when fiat currencies lose value.\nWith the US money supply expanding by 44% since 2020 and JPMorgan's acknowledgement of the debasement trade trend, Hougan suggests that the narrative is going mainstream, which is profitable for Bitcoin.\nHe highlighted that the bullish potential could fuel spot BTC ETF inflows, citing Bitcoin's surge to a new all-time high of $126,199 on Monday, fueled by over $3.5 billion ETF inflows last week.\nThe wave of inflows constitutes one of the strongest buying momentum since April, indicating renewed institutional appetite, according to on-chain analytics firm Glassnode in a report on Wednesday.\nGlassnode stated that a sustained trend of inflows between October and November could spur a further rally for BTC, with Q4 historically being Bitcoin's strongest quarter.\nThe recent resurgence in inflows pushed Bitcoin's spot volume to its highest level since April, suggesting increased liquidity and strength backing the top crypto's momentum.\nThe rebound in spot volume was accompanied by a surge in futures open interest, which reached a new all-time high of nearly $50 billion as Bitcoin climbed above $120,000, according to Glassnode. Annualized funding rates also rose above 8%, reflecting strong demand for leveraged longs and growing speculative momentum.\nGlassnode stated that although the rise does not yet signal overheating, rising funding costs have historically preceded brief market pullbacks as excess leverage unwinds.\nBitcoin trades near $123,000 on Wednesday, with US spot BTC ETFs attracting over $2 billion in the past two days, setting the stage for potential record inflows by the end of the week.\nAuthor\nMichael Ebiekutan\nFXStreet\nWith a deep passion for web3 technology, he's collaborated with industry-leading brands like Mara, ITAK, and FXStreet in delivering groundbreaking reports on web3's transformative potential across diverse sectors. In addi"
            },
            {
                "title": "Bitwise Predicts Record $36B Surge in U.S. Bitcoin ETF Inflows by Year-End 2025 - Crypto News Australia",
                "source": "Crypto News Australia",
                "url": "https://cryptonews.com.au/news/bitwise-predicts-record-36b-surge-in-u-s-bitcoin-etf-inflows-by-year-end-2025-131189/",
                "body": "Bitwise Predicts Record $36B Surge in U.S. Bitcoin ETF Inflows by Year-End 2025\n- US spot Bitcoin ETFs are experiencing unprecedented inflows, with Monday alone seeing US$1.2 billion added after BlackRock’s figures were included.\n- Tuesday brought an additional US$875.6 million in net inflows, driven primarily by BlackRock’s IBIT, despite outflows from Grayscale’s GBTC.\n- Bitcoin currently trades at US$121,841, just 3.6% below its all-time high of US$126,198 recorded on 7 October 2025.\n- Bitwise’s CIO forecasts US$36 billion in Q4 2025 ETF inflows, with Bitcoin ETFs significantly outperforming gold ETFs in their first two years of trading.\nAfter a record week of net inflows, the US spot Bitcoin exchange-traded funds (ETFs) are on track for an even better week. While last week saw US$3.23 billion (AU$4.89 billion) added to the ETFs, we reported that Monday brought another US$220.1 million (AU$332.2 million).\nHowever, those numbers were incomplete, as BlackRock’s US$970 million (AU$1.47 billion) inflows hadn’t yet been reported — bringing Monday’s total net inflows to US$1.2 billion (AU$1.8 billion).\nTuesday was a similarly strong day for IBIT, with US$899.4 million (AU$1.36 billion) added, while most other ETFs remained flat, bringing the day’s tally to US$875.6 million (AU$1.32 billion) in net inflows — as Grayscale’s GBTC saw US$28.6 million (AU$43.3 million) in outflows.\nWednesday’s numbers are not fully available at the time of writing, but the trend suggests buying is still strong, with Bitcoin hovering near record highs. Currently, BTC trades at US$121,841 (AU$184,582), just 3.6% below its all-time high of US$126,198 (AU$191,206) from 7 October 2025.\nRelated: Sen. Lummis Says U.S. Bitcoin Reserve Could Launch ‘Anytime’ Amid Policy Push\nExpect Strong ETF Flows for Rest of 2025, Says Analyst\nBitwise CIO Matt Hougan forecasts that US ETFs will smash records in Q4 2025, with inflows expected to exceed US$36 billion (AU$54.4 billion) amid a continued Bitcoin rally and surging institutional demand.\nFrom where I sit, the stars are aligned for a very strong Q4 for flows — more than enough to push us to a new record (and a new all-time high in bitcoin’s price).\nBacked by approvals from major wealth managers and renewed faith in Bitcoin as a hedge against currency debasement, the asset is set to lead global investment flows into 2026, the analyst believes.\nThe Bitcoin ETFs have also performed well compared to gold ETFs, as Bitwise’s chart shows. In their first year of trading, BTC ETFs easily outperformed their gold counterparts — and in year two, despite it only being October, they’re already taking the lead again.\nRelated: S&P Unveils ‘Digital Markets 50’ – A New Index Bridging Wall Street and Web3"
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "146.8400",
            "open": "4,509.3900",
            "close": "4,503.4500",
            "high": "4,558.5900",
            "low": "4,411.7500"
        },
        "market_summary": "### ETH/USD Market Briefing\n\n* **Key Drivers:** Institutional demand for **ETH** is increasing, with over **$307 million** in **ETH ETF** inflows, and the transition to a deflationary model post-merge is fueling **scarcity**.\n* **Price Action:** **ETH** has surged past **$4,600**, gaining nearly **12%** in a single week, driven by renewed institutional interest and technological advancements.\n* **Technical Outlook:** immediate support is near the **20-day EMA** at **$4,500**, with resistance at **$4,800**. However, **$11B staking withdrawal delays** may ignite concerns over **systemic vulnerabilities** and impact **ETH**'s price stability.\n\n---\n**Overall Sentiment:** **Bullish** 🚀",
        "source_articles": [
            {
                "title": "RWA Chain Plume Acquiring Dinero to Expand Institutional DeFi Yield Offering - CoinDesk",
                "source": "CoinDesk",
                "url": "https://www.coindesk.com/business/2025/10/08/rwa-chain-plume-acquiring-dinero-to-expand-institutional-defi-yield-offering",
                "body": "- Back to menuPrices\n- Back to menuResearch\n- Back to menu\n- Back to menu\n- Back to menu\n- Back to menuWebinars\nRWA Chain Plume Acquiring Dinero to Expand Institutional DeFi Yield Offering\nThe deal aims to boost Plume's institutional push offering a broader set of yield strategies including liquid staking, co-founder Teddy Pornprinya said.\nWhat to know:\n- Plume Network, a blockchain protocol for real-world assets, is acquiring Dinero Protocol to broaden its product suite with institutional-grade yield products for ETH, SOL and BTC.\n- Backed by firms like Galaxy, Haun, Apollo, Plume aims to connect retail and institutional investors with decentralized finance (DeFi) and real-world asset yields. It has attracted $360 million in asset on the protocol since its June mainnet launch.\n- It recently secured SEC approval as a regulated transfer agent, allowing it to handle tokenized securities onchain.\nPlume Network, a blockchain focused on tokenized real-world assets (RWAs), is acquiring Dinero Protocol to bring institutional-grade yield products for ether\nDinero’s flagship staking product, the ipxETH yield-bearing token that has drawn $125 million in total value locked, will become a key anchor for Plume’s expanded decentralized finance (DeFi) yield offering. The token gives institutional investors access to Ethereum staking yields in a compliant way in partnerships with firms like Galaxy (GLXY) and Laser Digital, the digital asset arm of Japan's Nomura bank.\nPlume, backed by investors such as Brevan Howard, Galaxy, Haun Ventures and Apollo Global Management, offers a wide range of yield-generating strategies including tokenized assets like private credit, aiming to bridge DeFi and RWAs for retail and institutional investors. Assets on the protocol has swelled over $360 million since its mainnet launch in June, DeFiLlama data shows.\nThe latest news comes just days after Plume secured approval as an SEC-regulated transfer agent, allowing it to handle tokenized securities onchain and integrate with U.S. traditional finance infrastructure like DTCC's settlement network.\nThe Dinero acquisition will bring more tools and engineering talent in-house as the team is expanding globally eyeing institutional demand for crypto exposure, Teddy Pornprinya, Plume co-founder said in an interview with CoinDesk.\n\"Right now, we're doing a pretty large institutional push in the U.S., Asia and breaking into the UAE market,\" he said. \"What we wanted to do [with the Dinero acquisition] is to open up our product suit onboard all types of institutional users.\"\nIn addition to ipxETH, Plume will fold Dinero's staking products pxSOL, pxBTC and branded liquid staking token architecture used across eight blockchains. Some of these assets will transition to native Plume products like plumeETH.\nThe deal has not closed yet but the parties signed a definitive agreement and binding term sheet, a spokesperson said.\nRead more: PLUME Rises 25% as Network Registered by SEC as Transfer Agent for Tokenized Securities\nMore For You\nShayne Coplan Becomes Youngest Self-Made Billionaire After Polymarket's $2B Investment: BBG\nShayne Coplan’s net worth reportedly passed $1 billion after the New York Stock Exchange's owner valued Polymarket at $8 billion.\nWhat to know:\n- Intercontinental Exchange announced it will invest up to $2 billion in Polymarket at an $8 billion valuation.\n- Bloomberg named Polymarket CEO Shayne Coplan the world’s youngest self-made billionaire.\n- Polymarket is now legally operating in the U.S. after acquiring a CFTC-licensed exchange this year."
            },
            {
                "title": "Ethereum Holds $4,600, XRP Tests Support, BullZilla Roars Past $840K Presale Mark - DailyCoin",
                "source": "DailyCoin",
                "url": "https://dailycoin.com/ethereum-holds-4600-xrp-tests-support-bullzilla-roars-past-840k-presale-mark/",
                "body": "Ethereum and XRP are once again at the heart of the crypto conversation. Ethereum’s price surge past $4,600 has reinvigorated institutional optimism, while XRP battles a crucial support zone near $2.90, a make-or-break point that could define its next major rally. Amid these developments, a new Ethereum-based DeFi powerhouse, BullZilla, is rewriting the rules of presale economics with its Roarblood Vault and HODL Furnace staking system to become the hottest crypto coin to watch for 2025.\nSponsored\nTogether, these three cryptocurrencies illustrate the evolution of the digital asset landscape, Ethereum driving utility, XRP advancing scalability, and BullZilla redefining decentralized wealth creation. For analysts and investors searching for the hottest crypto coin to watch for 2025, these assets form the perfect trinity of innovation, opportunity, and exponential potential.\nBullZilla: The Roarblood Vault Ignites the Next DeFi Revolution\nBullZilla ($BZIL) crypto presale is quietly building a legacy of its own. Designed as a hybrid of meme culture and decentralized finance, BullZilla transforms traditional presales into living ecosystems of engagement, loyalty, and growth. Its centerpiece, the Roarblood Vault, fuels both the project’s economy and community expansion, while the HODL Furnace delivers an unmatched 70% APY staking reward for long-term holders.\nBuilt on Ethereum and powered by BlockchainFX technology, BullZilla merges entertainment and economics.\nCurrent Presale Details\n- Presale Stage: Stage 5\n- Phase: 5D\n- Current Price: $0.0001324\n- Total Raised: $840,000+\n- Token Holders: 2,700+\nEach stage change reflects tangible growth, either every 48 hours or once $100,000 is raised, ensuring consistent upward momentum and rewarding early entry.\nHow to Acquire BullZilla Coins\n- Set Up a Wallet: Install a Web3 wallet such as MetaMask or Trust Wallet.\n- Buy Ethereum (ETH): Purchase ETH via exchanges like Binance or Coinbase and transfer it to your wallet.\n- Visit the Presale Site: Connect your wallet to the official BullZilla ($BZIL) presale portal.\n- Swap ETH for $BZIL: Select your desired amount, confirm the transaction, and secure your allocation. Tokens can be claimed once the presale concludes.\nEthereum Surges Above $4,600 as Institutional Demand Soars\nEthereum has stormed past $4,600, gaining nearly 12% in a single week, marking one of its strongest starts to October in recent memory. Fueled by over $307 million in ETH ETF inflows last Thursday, the rally underscores renewed institutional interest that had softened in September. According to data from CoinShares, these inflows represent the second-highest weekly total of 2025, highlighting Ethereum’s dominance in smart contracts and decentralized finance infrastructure.\nBeyond ETFs, Ethereum’s transition to a deflationary model post-merge continues to fuel scarcity. With each transaction burning ETH, supply pressure strengthens long-term valuation. As on-chain data from Glassnode indicates, active addresses are at a 14-month high, showing a growing user base even during market consolidation. These fundamentals reinforce why Ethereum remains a cornerstone of the best crypto coin to buy for 2025, balancing institutional strength with technological advancement.\nXRP Battles for Breakout Momentum\nXRP is currently fighting to maintain its crucial support near $2.90, contrasting sharply with the broader market strength seen in Bitcoin and Ethereum. The altcoin slipped about 4% over the past 24 hours after failing to break above the $3 resistance, now hovering just below its 20-day EMA at $2.94.\nMarket sentiment remains divided. Analyst Lark Davis warns that sustained weakness could trigger a correction toward $2.77 or even $2.22 if key supports fail. However, others, like Egrag Crypto, remain bullish, expecting a breakout if XRP maintains its consolidation between $2.6 and $3.6 within its ascending triangle pattern.\nDespite short-term turbulence, XRP’s broader fundamentals, instit"
            },
            {
                "title": "Ethereum’s $11B staking withdrawal delays ignite concerns over systemic vulnerabilities - CryptoSlate",
                "source": "CryptoSlate",
                "url": "https://cryptoslate.com/ethereums-11b-staking-withdrawal-delays-ignite-concerns-over-systemic-vulnerabilities/",
                "body": "Ethereum’s $11B staking withdrawal delays ignite concerns over systemic vulnerabilities\nWith Ethereum validator exits delayed up to 42 days, ecosystem analysts warn of potential DeFi ripple effects.\nEthereum’s staking network is under growing strain as validator withdrawals climb to record levels, testing the system’s balance between liquidity and network security.\nRecent validator data shows that over 2.44 million ETH, valued at more than $10.5 billion, are now queued for withdrawal as of Oct. 8, the third-highest level in a month.\nThis backlog trails only the 2.6 million ETH peak recorded on Sept. 11 and 2.48 million ETH on Oct. 5.\nAccording to Dune Analytics data curated by Hildobby, withdrawals are concentrated among the leading liquid staking token (LST) platforms like Lido, EtherFi, Coinbase, and Kiln. These services allow users to stake ETH while maintaining liquidity through derivative tokens such as stETH.\nAs a result, ETH stakers now face average withdrawal delays of 42 days and 9 hours, reflecting an imbalance that has persisted since CryptoSlate first identified the trend in July.\nNotably, Ethereum co-founder Vitalik Buterin has defended the withdrawal design as an intentional safeguard.\nHe compared staking to a disciplined form of service to the network, arguing that delayed exits reinforce stability by discouraging short-term speculation and ensuring validators remain committed to the chain’s long-term security.\nHow does this impact Ethereum and its ecosystem?\nThe prolonged withdrawal queue has sparked debate within the Ethereum community, fueling concerns that it could become a systemic vulnerability for the blockchain network.\nPseudonymous ecosystem analyst Robdog called the situation a potential “time bomb,” noting that longer exit times amplify duration risk for participants in liquid staking markets.\nHe said:\n“The problem is that this could trigger a vicious unwinding loop which has massive systemic impacts on DeFi, lending markets and the use of LSTs as collateral.”\nAccording to Robdog, queue length directly affects the liquidity and price stability of tokens like stETH and other liquid staking derivatives, which typically trade at a slight discount to ETH, reflecting redemption delays and protocol risks. However, as the validator queues lengthen, these discounts tend to deepen.\nFor instance, when stETH trades at 0.99 ETH, traders can earn roughly 8% annually by buying the token and waiting 45 days for redemption. However, if the delay period doubles to 90 days, their incentive to buy the asset falls to about 4%, which could further widen the peg gap.\nAdditionally, because stETH and other liquid staking tokens are collateral across DeFi protocols such as Aave, any significant deviation from ETH’s price can ripple through the broader ecosystem. For context, Lido’s stETH alone anchors around $13 billion in total value locked, much of it tied to leveraged looping positions.\nRobdog cautioned that a sudden liquidity shock, such as a large-scale deleveraging event, could force rapid unwinds, pushing borrowing rates higher and destabilizing DeFi markets.\nHe wrote:\n“If for example the market environment suddenly shifts, such that many ETH holders would like to rotate out of their positions (eg another Terra/Luna or FTX level event), there will be a significant withdrawal of ETH. However, only a limited amount of ETH can be withdrawn because the majority is lent out. This may cause a run on the bank.”\nConsidering this, the analyst cautioned that vaults and lending markets need stronger risk management frameworks to account for growing duration exposure.\nAccording to him:\n“If an asset’s exit duration stretches from 1 day to 45, it’s no longer the same asset.”\nHe further urged developers to factor in discount rates for the duration when pricing collateral.\nRondog wrote:\n“Since LSTs are fundamentally a useful and systemic infrastructure to DeFi, we should consider making upgrades to the throughput of the exit queue. Ev"
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "12.2600",
            "open": "223.3500",
            "close": "227.6200",
            "high": "229.5800",
            "low": "217.3200"
        },
        "market_summary": "### SOL/USD Market Briefing\n\n* **Key Drivers:** The launch of **JupUSD**, a new native stablecoin on the Solana network, is expected to increase adoption and **bullish momentum** for **SOL/USD**. The total stablecoin market cap has grown by more than **75%** in the last year, reaching over **$303 billion**.\n* **Price Action:** The current price of **SOL/USD** is experiencing **volatility**, but the introduction of **JupUSD** could lead to increased **liquidity** and a potential price increase towards the **$30** level.\n* **Technical Outlook:** Immediate support for **SOL/USD** is near the **$20** level, with resistance at **$35**. The launch of **JupUSD** and its integration into the Jupiter ecosystem could lead to a **bullish breakout** above **$35**.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Solana DeFi Exchange Jupiter to Launch Native Stablecoin - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/solana-defi-exchange-jupiter-launch-175747504.html",
                "body": "Jupiter, a popular decentralized exchange aggregator and DeFi platform on the Solana network, is launching its own stablecoin—JupUSD—together with stablecoin issuer Ethena.\nExpected to launch sometime in Q4, JupUSD will initially be fully collateralized by Ethena’s USDtb, a product which is itself blacked by BlackRock’s BUIDL, a tokenized fund that represents investments in short-term U.S. treasuries. Later, Ethena’s flagship stablecoin USDe—the third largest stablecoin on the market next to Tether’s USDT and Circle’s USDC—will be added as collateral.\n“Jupiter aims to serve every person on this planet using DeFi rails,” said Jupiter Chief Operating Officer Kash Dhanda in a release video for the stablecoin. “Stablecoins are a critical component of that.”\nDeFi, a multi-billion-dollar sector, refers to the collection of financial applications that allow their users to transact natively on blockchain networks, without third-party intermediaries. Stablecoins, which largely function as digital dollar equivalents, enable crypto traders to enter and exit positions in markets where dollars are restricted or inaccessible—such as DeFi markets.\nJupiter aims to usher JupUSD into all facets of its growing DeFi stack, including as collateral for perpetual futures trading, liquidity in its lending protocol, and for trading via its swap products on desktop and mobile. Jupiter is by far the largest DEX aggregator on Solana, notching close to $20 billion in trading volume in the last 30 days and $1.2 million in revenue in the last 24 hours, per DefiLlama.\nContracts for the mint and issuance of JupUSD are currently being built and prepared for audits ahead of launch.\n“We’re always trying to work with winners across the entire space,” said Ethena founder Guy Young in the release’s promotional video. “For us it was a very obvious candidate for the first stablecoin partnership that we have within Solana.”\nEthena’s core stablecoin products USDe and USDtb make up just more than 5% of the total stablecoin market cap, which has ballooned to more than $303 billion at the time of writing. That marks a jump of around 75% from its $173 billion market cap at this time last year.\nStablecoin Legislation Could Unleash 1,000 Tether and USDC Rivals, Expert Says\nStablecoins, which are often backed 1:1 with fiat currencies like the U.S. dollar, earned a major victory earlier this year with the passing of the GENIUS Act, which provides a regulatory framework for their trading and issuance.\nIn February, experts told Decrypt that the passing of legislation could lead to 1,000s of stablecoin products from notable companies."
            },
            {
                "title": "Ethena and Jupiter join forces to launch JupUSD stablecoin on Solana - Coinspot.io",
                "source": "Coinspot.io",
                "url": "https://coinspot.io/en/analysis/ethena-and-jupiter-join-forces-to-launch-jupusd-stablecoin-on-solana/",
                "body": "Ethena Labs and Jupiter have announced a strategic partnership to launch JupUSD—a new stablecoin native to the Solana network. The token launch is scheduled for the fourth quarter, and its integration will cover the entire Jupiter ecosystem stack, including trading interfaces, lending products, and decentralized futures.\n$750M in liquidity to move from USDC to JupUSD\nAs part of the agreement, Jupiter plans to gradually convert about $750 million in USDC from its liquidity pool into the new JupUSD stablecoin. Thus, the project will effectively create an internal dollar ecosystem fully based on Solana.\nEthena, known for its decentralized synthetic dollar USDe, is expanding its line of solutions in the stable token segment. Previously, the company released USDtb—the first stablecoin created in collaboration with Anchorage Digital bank and compliant with GENIUS Act standards.\n“JupUSD is another addition to our portfolio of White Label products, which are already used by partners such as SUI and MegaETH,” noted Ethena founder Guy Young.\nIntegration of JupUSD into the Jupiter ecosystem\nJupUSD will become a central element of Jupiter’s DeFi infrastructure. According to the project, the token will be used in five key areas:\n- as collateral on Jupiter’s decentralized futures platform\n- as the main stablecoin in trading interfaces and the Jup Mobile app\n- as a base liquidity asset on the Jupiter Lend platform\n- as a liquid pair on the DEX platform Meteora, a key Jupiter partner\n- in all new products the company plans to launch in the coming months\nAccording to Jupiter co-founder Sion Ong, stablecoins have proven their viability in the on-chain environment:\n“We are confident that this segment will grow 10–100 times. JupUSD will be a key step for Jupiter to create additional value for users and secure its role as the DeFi hub on Solana.”\nFinancial backing and collateralization of the token\nAt launch, JupUSD will be 100% backed by the USDtb stablecoin, which invests funds in the tokenized BlackRock USD Institutional Digital Liquidity Fund (BUIDL). In the future, the project is considering switching to USDe as collateral.\nRecall, USDe is the largest decentralized stablecoin with a capitalization of about $14.8 billion, using delta-hedging with ETH collateral and derivatives. It has already surpassed DAI and USDS in supply volume.\nFor comparison, centralized giants USDT and USDC have market capitalizations of $177 billion and $74 billion, respectively, but JupUSD will be the first major native solution for Solana with institutional support.\nA new stage for Solana and DeFi\nSolana is actively increasing its share of the stablecoin market, which currently accounts for only 9.3% of Ethereum’s volume, according to The Block. The emergence of JupUSD could be a growth catalyst—especially considering that Jupiter has already become the largest DEX aggregator on Solana and is developing lending and AI integration directions.\nInvestors boost confidence in Ethena\nIn September, UAE-based M2 Capital fund invested $20 million in the ENA governance token, joining a list of investors that includes Binance Labs, Bybit, Dragonfly, Fidelity, and Franklin Templeton.\nThis support underscores the desire of major institutional players to secure positions in the fast-growing decentralized stablecoin segment.\nWhat’s next?\nThe launch of JupUSD could be a turning point for Solana, which until now has been dominated by USDC and USDT. The new token will unite liquidity, infrastructure, and decentralization, creating the foundation for the next stage of growth in the network’s DeFi sector.\nRead more: Gold breaks $4,000, bitcoin declines amid dollar index growth"
            },
            {
                "title": "Solana DeFi Exchange Jupiter to Launch Native Stablecoin - Decrypt",
                "source": "Decrypt",
                "url": "https://decrypt.co/343416/solana-defi-jupiter-ethena-stablecoin-jupusd",
                "body": "In brief\n- Solana DEX aggregator Jupiter has tapped Ethean to launch its own stablecoin.\n- JupUSD is expected to launch in Q4 and will initially be collateralized by USDtb, Ethena's short-term treasury-backed stablecoin.\n- The total stablecoin market cap has grown by more than 75% in the last year and now sits above $300 billion.\nJupiter, a popular decentralized exchange aggregator and DeFi platform on the Solana network, is launching its own stablecoin—JupUSD—together with stablecoin issuer Ethena.\nExpected to launch sometime in Q4, JupUSD will initially be fully collateralized by Ethena’s USDtb, a product which is itself blacked by BlackRock’s BUIDL, a tokenized fund that represents investments in short-term U.S. treasuries. Later, Ethena’s flagship stablecoin USDe—the third largest stablecoin on the market next to Tether’s USDT and Circle’s USDC—will be added as collateral.\n“Jupiter aims to serve every person on this planet using DeFi rails,” said Jupiter Chief Operating Officer Kash Dhanda in a release video for the stablecoin. “Stablecoins are a critical component of that.”\nDeFi, a multi-billion-dollar sector, refers to the collection of financial applications that allow their users to transact natively on blockchain networks, without third-party intermediaries. Stablecoins, which largely function as digital dollar equivalents, enable crypto traders to enter and exit positions in markets where dollars are restricted or inaccessible—such as DeFi markets.\nJupiter aims to usher JupUSD into all facets of its growing DeFi stack, including as collateral for perpetual futures trading, liquidity in its lending protocol, and for trading via its swap products on desktop and mobile. Jupiter is by far the largest DEX aggregator on Solana, notching close to $20 billion in trading volume in the last 30 days and $1.2 million in revenue in the last 24 hours, per DefiLlama.\nContracts for the mint and issuance of JupUSD are currently being built and prepared for audits ahead of launch.\n“We’re always trying to work with winners across the entire space,” said Ethena founder Guy Young in the release’s promotional video. “For us it was a very obvious candidate for the first stablecoin partnership that we have within Solana.”\nEthena’s core stablecoin products USDe and USDtb make up just more than 5% of the total stablecoin market cap, which has ballooned to more than $303 billion at the time of writing. That marks a jump of around 75% from its $173 billion market cap at this time last year.\nStablecoins, which are often backed 1:1 with fiat currencies like the U.S. dollar, earned a major victory earlier this year with the passing of the GENIUS Act, which provides a regulatory framework for their trading and issuance.\nIn February, experts told Decrypt that the passing of legislation could lead to 1,000s of stablecoin products from notable companies.\nThat trend has started to accelerate.\nRecently, crypto wallets like MetaMask and Phantom have unveiled their own stablecoin products. Firms like Amazon, Walmart, and Expedia have mulled the proposition as well, according to a June report from the Wall Street Journal.\nRepresentatives for Jupiter and Ethena did not immediately respond to Decrypt’s request for comment."
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "327.250",
            "open": "46,647.480",
            "close": "46,638.360",
            "high": "46,844.580",
            "low": "46,517.330"
        },
        "market_summary": "### US30 Market Briefing\n\n* **Key Drivers:** The **US30** index has been driven by a delicate balance of strong corporate earnings, particularly from the **artificial intelligence** sector, and persistent macroeconomic headwinds, including evolving **Federal Reserve** policy and volatile **geopolitical** trade relations.\n* **Price Action:** The index has demonstrated remarkable resilience, reaching multiple record highs, including surpassing **45,000** for the first time in December 2024 and reaching **45,631.74** by August 2025, before experiencing significant turbulence and fluctuations.\n* **Technical Outlook:** Immediate support is near the **46,900** level, with resistance at **47,000**, as the market awaits the **FOMC Meeting Minutes** and further signals from the **Federal Reserve** regarding interest rate paths.\n\n---\n**Overall Sentiment:** **Bullish** 🚀",
        "source_articles": [
            {
                "title": "Futures: Markets Hit New Highs; Taiwan Semi On Tap - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-nvidia-huang-ai-market-tesla-buy-point/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #c7d9fa2f-a4d3-11f0-a25f-9d94830c04ff"
            },
            {
                "title": "Dow Rides Rollercoaster to Record Highs Amidst Policy Shifts and Trade Tensions - FinancialContent",
                "source": "FinancialContent",
                "url": "https://markets.financialcontent.com/wral/article/marketminute-2025-10-8-dow-rides-rollercoaster-to-record-highs-amidst-policy-shifts-and-trade-tensions",
                "body": "The Dow Jones Industrial Average has navigated a turbulent yet ultimately upward trajectory from late 2024 through October 2025, demonstrating remarkable resilience despite significant slips and periods of flat trading. This period has been characterized by a delicate balance of strong corporate earnings, particularly from the burgeoning artificial intelligence sector, and persistent macroeconomic headwinds, including evolving Federal Reserve policy and volatile geopolitical trade relations. The index's journey to multiple record highs, including surpassing 45,000 for the first time in December 2024 and reaching 45,631.74 by August 2025, underscores a market grappling with uncertainty while finding catalysts for growth.\nThese fluctuations indicate a market highly sensitive to shifts in monetary policy expectations and global trade dynamics. While robust corporate fundamentals and technological advancements have provided a strong underlying current, investor sentiment has been quick to react to signals from the Federal Reserve regarding interest rate paths and pronouncements on international trade. The immediate implication is a continued environment of heightened volatility, where investors must remain agile and informed, discerning between temporary corrections and more fundamental shifts in market direction. The Dow's performance offers a microcosm of the broader economy's struggle to maintain momentum amidst a complex global landscape.\nA Year of Peaks and Troughs: The Dow's Eventful Journey\nThe period spanning late 2024 to October 2025 has been nothing short of a dramatic narrative for the Dow Jones Industrial Average, marked by unprecedented highs, sharp corrections, and swift rebounds. The index first breached the 45,000 mark on December 4, 2024, propelled by a technology-led rally and optimistic signals from the Federal Reserve. This bullish momentum continued, culminating in a new all-time high closing value of 45,631.74 by August 22, 2025, with impressive gains of 4.98% in Q2 2025 and 5.2% in Q3 2025.\nHowever, this ascent was not without significant turbulence. December 2024 saw a notable slip when the Dow shed 1,000 points on December 18, closing at 42,326.87, after the Fed projected fewer rate cuts for 2025, sparking investor concern. Early 2025 continued this volatility, with a 0.62% dip on January 2 due to lingering trade war fears and a 1.6% drop on January 10 following a hotter-than-expected jobs report that further dampened rate cut expectations. The most severe downturn occurred in April 2025, dubbed \"Liberation Day,\" when President Trump's announcement of sweeping tariffs caused the Dow to plummet by 1,679 points (4%) on April 3 and an additional 2,231 points (5.5%) on April 4, totaling over 4,000 points lost in two days. This panic selling was swiftly followed by a historic rebound of 7.9% on April 9, after a 90-day pause on the reciprocal tariffs was announced.\nKey players influencing these movements included the Federal Reserve, whose evolving stance on interest rates—from aggressive cuts in late 2024 to a more cautious outlook for 2025, then resuming cuts in July and September 2025—directly impacted market sentiment. Geopolitical events, specifically the U.S.-China trade relations and the Trump administration's tariff policies, also proved to be powerful market movers, as evidenced by the dramatic April 2025 swings. Furthermore, robust corporate earnings, particularly from the technology sector, consistently provided a strong underlying support for the market, enabling rapid recoveries from downturns. As of October 7, 2025, the Dow closed slightly lower, with futures indicating flat trading, reflecting the ongoing equilibrium between growth drivers and cautionary factors.\nShifting Fortunes: Winners and Losers in a Volatile Market\nThe tumultuous period from late 2024 to October 2025 has reshaped the landscape for many companies, creating distinct winners and losers within and beyond the Dow Jones Industrial"
            },
            {
                "title": "Dow Jones futures edge up ahead of FOMC Meeting Minutes - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/amp/news/dow-jones-futures-edge-up-ahead-of-fomc-meeting-minutes-202510080918",
                "body": "Dow Jones futures edge up ahead of FOMC Meeting Minutes\n|- US index futures gain ahead of the FOMC Minutes for September’s meeting.\n- US index futures receive support from the increased likelihood of further Fed rate cuts.\n- Oracle slipped 2.5% after ‘The Information’ reported that its cloud business margins came in weaker than expected.\nDow Jones futures add 0.12% to trade above 46,900 during European hours on Wednesday, ahead of the regular session opening in the United States (US). The S&P 500 futures rise 0.17% to trade above 6,750, while Nasdaq 100 futures gain 0.21% to remain around 25,100.\nUS index futures edge up ahead of the Federal Open Market Committee (FOMC) Minutes for September’s meeting. Investors’ sentiment may improve amid a rising dovish tone surrounding the US Federal Reserve (Fed) policy outlook. The CME FedWatch Tool suggests that markets are now pricing in nearly a 95% chance of a Fed rate cut in October and an 83% possibility of another reduction in December.\nOn Tuesday’s regular session, Wall Street slid as renewed worries emerged over the sustainability of the artificial intelligence rally and the ongoing government shutdown. The Dow Jones fell 0.2%, the S&P 500 lost 0.38%, and the Nasdaq 100 fell 0.67%.\nOracle fell 2.5% after ‘The Information’ reported margins from the cloud business are weaker than forecasts. Also, the enterprise software company is losing money on some of its deals to rent out Nvidia’s chips. Mounting fears of a potential reversal in the AI rally, reminiscent of the late-1990s dot-com bubble, further weighed on stocks.\nThe market sentiment weakens amid the ongoing government shutdown, with President Donald Trump threatening mass federal worker layoffs as prospects for a resolution dim. However, Democrats insist it will not sway them in the increasingly bitter shutdown standoff.\nDow Jones FAQs\nThe Dow Jones Industrial Average, one of the oldest stock market indices in the world, is compiled of the 30 most traded stocks in the US. The index is price-weighted rather than weighted by capitalization. It is calculated by summing the prices of the constituent stocks and dividing them by a factor, currently 0.152. The index was founded by Charles Dow, who also founded the Wall Street Journal. In later years it has been criticized for not being broadly representative enough because it only tracks 30 conglomerates, unlike broader indices such as the S&P 500.\nMany different factors drive the Dow Jones Industrial Average (DJIA). The aggregate performance of the component companies revealed in quarterly company earnings reports is the main one. US and global macroeconomic data also contributes as it impacts on investor sentiment. The level of interest rates, set by the Federal Reserve (Fed), also influences the DJIA as it affects the cost of credit, on which many corporations are heavily reliant. Therefore, inflation can be a major driver as well as other metrics which impact the Fed decisions.\nDow Theory is a method for identifying the primary trend of the stock market developed by Charles Dow. A key step is to compare the direction of the Dow Jones Industrial Average (DJIA) and the Dow Jones Transportation Average (DJTA) and only follow trends where both are moving in the same direction. Volume is a confirmatory criteria. The theory uses elements of peak and trough analysis. Dow’s theory posits three trend phases: accumulation, when smart money starts buying or selling; public participation, when the wider public joins in; and distribution, when the smart money exits.\nThere are a number of ways to trade the DJIA. One is to use ETFs which allow investors to trade the DJIA as a single security, rather than having to buy shares in all 30 constituent companies. A leading example is the SPDR Dow Jones Industrial Average ETF (DIA). DJIA futures contracts enable traders to speculate on the future value of the index and Options provide the right, but not the obligation, to buy or sell the index at a p"
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "96.450",
            "open": "9,491.670",
            "close": "9,557.170",
            "high": "9,584.620",
            "low": "9,488.170"
        },
        "market_summary": "### UK100 Market Briefing\n\n* **Key Drivers:** The **FTSE 100** has been driven higher by a rotating cast of sectors, with **banks** and **miners** being the current drivers, and a **risk-on atmosphere** prevailing across UK, European, and US bourses.\n* **Price Action:** The **FTSE 100** has broken out to new highs, rising **71 points** to **9,555**, with an intraday high of **9,577.08**, showing significant **bullish momentum**.\n* **Technical Outlook:** Immediate support is near the previous resistance level of **9,500**, with resistance at the new intraday high of **9,577.08**.\n\n---\n**Overall Sentiment:** Positive 🚀",
        "source_articles": [
            {
                "title": "FTSE 100 Live: London blue-chips on a tear as Lloyds and gold jump - Proactive Investors",
                "source": "Proactive Investors",
                "url": "https://www.proactiveinvestors.co.uk/companies/news/1079904/ftse-100-live-blue-chips-called-higher-with-motor-finance-compensation-in-focus-1079904.html",
                "body": "FTSE 100 Live: London blue-chips on a tear as Lloyds and gold jump\nLast updated: 16:38 08 Oct 2025 BST, First published: 07:07 08 Oct 2025 BST\n- FTSE 100 rises 71 points to 9,555\n- Index hit new intraday high of 9,577.08\n- Lloyds rises as motor finance compensation less than expected\n- Gold price smashes past $4K an ounce\n4.38pm: Record day for FTSE\nThe FTSE 100 finished Wednesday’s session up 65 points at 9,548 points.\n\"Recent trading has seen the FTSE 100 driven higher by a rotating cast of sectors, today’s drivers being banks and miners, long the stalwarts of the London market,\" IG chief market analyst Chris Beauchamp said.\n\"UK, European and US bourses have advanced in lockstep as investors continue to pile into risk assets.\"\n4.14pm: FTSE head held high\nIt's been another good day for the FTSE 100, striding 0.7% higher thanks to gains for copper and precious metals miners, as well as lenders, Lloyds in particular.\nOnly five shares of the index's largest 40 companies are in the red (Shell, BAT, National Grid, Tesco and AB Foods).\nInvestors have been keeping an eye on trade developments as Prime Minister Keir Starmer embarked on a two-day visit to India, says market analyst Patrick Munnelly at Tickmill.\nHe notes that the PM \"emphasised the need to implement the trade deal agreed upon in July as quickly as possible\".\nFollowing last week string of record highs in four out of five trading sessions, fuelled by a resurgence in healthcare stocks, today's gains were from a wider array of names, Munnelly noted.\nThe FTSE 250 index is flat, held back by the real estate sector, he said.\nChris Beauchamp at IG said the BoE's warning about a potential correction \"failed to halt the risk-on atmosphere\", which has seen gains in European and US stocks, along with oil, metals, bitcoin and the dollar too, confirming the \"broad nature of the recent gains\".\nHe also noted that French stocks have recouped almost all the losses seen earlier in the week, \"though the atmosphere in French politics remains febrile\".\n3.17am: City vote tension builds\nWH Ireland Group PLC (AIM:WHI), a well-known name in the City, shares rebounded 200% earlier today, as the company noted press speculation about proxy voting for the upcoming shareholder vote over the sale of its wealth management arm.\nCurrent levels of proxy investor votes on the sale \"indicate that the resolutions will fail\", though buyer Oberon Investments Group PLC (AQSE:OBE) says in its own statement that is keen to work out a way of making the deal work.\nWHI stressed that the \"outcome of the upcoming general meeting will not be known until the meeting has been held\".\nOberon, meanwhile, said if the vote to approve the sale is not passed tomorrow, it \"remains committed to working constructively with WH Ireland to pursue a successful outcome that serves the best interests of clients, staff, and stakeholders of both businesses\".\nSky News reported that its sources indicated other buyers had expressed interest in acquiring the division, \"but said WH Ireland's directors had made it clear that they would be unable to share material information about it with rival suitors\".\nWH Ireland's biggest shareholders include Guernsey-based TFG Asset Management, which owns 29.9%, and former Punch Group and PizzaExpress director Hugh Osmond, with a 9.9% stake, and serial investor Melvin Lawson, with 9.7%.\n2.50pm: Nasdaq and S&P climb\nA mixed start on Wall Street.\nOn one side, the Dow Jones is down 0.2%, and on the other, the S&P 500 has risen 0.15% and the Nasdaq is up 0.45%.\nNvidia is up almost 2%, boosting the latter, though half the Mag 7 tech giants are in the red.\nDragging down the Dow, there are falls for Salesforce, IBM, Goldman Sachs, Chevron and Coca Cola.\n2.42pm: UK drug pricing tweak\nUK government ministers have a plan to step up how much the National Health Service pays pharmaceutical firms for drugs, according to a report in Politico.\nThis comes as President Trump has launched tariffs against the pharma sector, "
            },
            {
                "title": "New records for the FTSE 100 and Gold - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/analysis/new-records-for-the-ftse-100-and-gold-202510081618",
                "body": "New records for the FTSE 100 and Gold\nWhile French stocks recoup their losses, the FTSE 100 and gold have both pushed to new highs, says Chris Beauchamp, Chief Market Analyst at investing and trading platform IG.\nFTSE 100 shrugs off BoE warning to hit new peak\nThe Bank of England’s warning about a correction in stocks has failed to halt the risk-on atmosphere. UK, European and US bourses have advanced in lockstep as investors continue to pile into risk assets. Oil, metals and bitcoin have rallied too, confirming the broad nature of the recent gains. Recent trading has seen the FTSE 100 driven higher by a rotating cast of sectors, today’s drivers being banks and miners, long the stalwarts of the London market. Notably French stocks have recouped almost all the losses seen earlier in the week, though the atmosphere in French politics remains febrile.\nOngoing government shutdown fails to halt Wall Street\nThe US government shutdown goes on with no sign of a resolution, but stocks continue to ignore the standoff. Nvidia’s bullish commentary on demand has been the icing on the cake, but for most investors concerns about tariffs and inflation seem very distant. Perhaps tonight’s Fed minutes will change that, but beyond that investors can look towards the start of another earnings season that is expected to deliver further strong earnings growth.\nAuthor"
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "272.500",
            "open": "24,381.140",
            "close": "24,635.140",
            "high": "24,646.390",
            "low": "24,373.890"
        },
        "market_summary": "### GER40 Market Briefing\n\n* **Key Drivers:** Anticipated **fiscal stimulus** in Germany and broader **equity sentiment** in Europe and the US are supporting the GER40, despite **weak German economic data** and **political uncertainty** in France.\n* **Price Action:** The GER40 has broken out of its consolidation phase, reaching a new record high of **24,624**, driven by **bullish momentum** and fueled by gains in **industrials**, **retailers**, and **banks**.\n* **Technical Outlook:** Immediate resistance is near **25,000**, with **24,650** acting as a breakout zone. Support is at **24,300**, and a move below **23,750** could challenge the **bullish** trend.\n\n---\n**Overall Sentiment:** Positive 🚀",
        "source_articles": [
            {
                "title": "DAX outlook positive despite growth concerns - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/dax-outlook-positive-despite-growth-concerns/?amp=true",
                "body": "DAX outlook positive despite growth concerns\n- DAX outlook remains bullish as poor data boosts stimulus expectations\n- Traders eye new records as index attempts to end multi-month consolidation\n- A sustained break above 24,650 could open the path towards 25,000 and possibly beyond\nThe DAX outlook remains upbeat even as economic data from Germany continues to disappoint. Despite lingering growth concerns and a sluggish German industrial sector, the benchmark index has managed to hold its ground, hinting that traders are still comfortable betting on further gains. With the US government shutdown failing to dampen global sentiment, it’s no surprise to see equities holding firm, and the DAX has done just that, building on last week’s impressive rally with another push higher.\nEconomic fog thickens, but risk appetite holds even with gold above $4K\nThis morning’s German Industrial Production data was grim — output slumped by 4.3% month-on-month, stoking renewed fears of recession in Europe’s largest economy. Over in the US, things don’t look much better, with patchy employment figures and the government shutdown halting the release of official data, leaving investors reliant on private estimates.\nAdd to that the political tension in France, and you’d expect markets to be on the defensive. Yet, here we are: the DAX is climbing while gold breaks new records above $4,000. Some argue that gold’s rise signals fear, but others see it as part of a wider speculative trend — traders chasing performance in every asset class, from equities to crypto. It’s an odd mix of risk-taking and risk-hedging, but for now, the German index remains resilient.\nSo, why, then, is the DAX rising? Partly because of the global A.I.-hype, but more to the point for German stocks, it is Germany’s anticipated fiscal stimulus, which is giving markets hope, even as macro data weakens. Broader equity sentiment in both Europe and the US remains constructive, and that tailwind continues to lift the DAX.\nTechnical DAX outlook: Traders eyes breakout to new ATHs\nLast week’s surge broke the DAX cleanly out of a months-long consolidation phase — a breakout that carries weight after such a long coiling period. The index then paused early this week, giving overbought conditions a chance to cool before buyers stepped back in. That pause seems to have reset the market nicely, as today’s climb brought the index close to July’s peak around 24,650 at the time of writing.\nFrom a technical standpoint, the structure looks encouraging. The resistance near 24,650 has acted as a ceiling for months, and a decisive push above that zone could spark short-covering and fresh momentum towards the next logical target: 25,000. Above that level and we could potentially see the index extend towards 25,800–26,280 based on technical projections from its multi-month consolidation.\nOn the downside, 24,300 remains the key short-term support. It’s the level that has already seen buyers step in, and holding above it keeps the trend intact. Should the market slip below, the 23,950–24,000 area becomes the next zone of interest, followed by the more critical 23,750 mark — the line in the sand for bulls.\nKey takeaway\nThe DAX outlook remains bullish. Recent consolidation appears to have recharged momentum, and as long as support at 24,300 holds, dips look defendable. A convincing move above July’s high would likely ignite a fresh leg higher, putting 25,000 firmly in sight — and possibly more beyond that. For now, the bulls are still very much in control.\n-- Written by Fawad Razaqzada, Market Analyst\nFollow Fawad on Twitter @Trader_F_R\nThe information on this web site is not targeted at the general public of any particular country. It is not intended for distribution to residents in any country where such distribution or use would contravene any local law or regulatory requirement. The information and opinions in this report are for general information use only and are not intended as an offer or solicitation w"
            },
            {
                "title": "DAX Ends at Fresh Record High - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/te_news:491445:0-dax-ends-at-fresh-record-high/",
                "body": "DAX Ends at Fresh Record High\nFrankfurt's DAX closed about 0.9% firmer at 24,624 on Wednesday, a new record high, in line with other European peers.\nMarket sentiment was boosted by the EU's new trade measures and the European Commission's plans to reduce the amount of steel imported into the bloc.\nHowever, weak German economic data and political uncertainty in France have limited the gains.\nGerman industrial output slumped 4.3% mom in August 2025, far exceeding expectations of a 1% decline and marking the steepest drop since March 2022.\nTraders now await the release of the latest Fed minutes, which could provide clues about the direction of monetary policy amid a data shortage due to the US federal government's shutdown.\nOn the corporate front, gains in industrials, retailers and banks were offset by losses in autos and chipmakers.\nShares of German industrial conglomerate Thyssenkrupp surged more than 5% on EU's steel measures.\nOther top gainers included Zalando (+5.3%), Siemens Energy (+3.3%) and Adidas (+3.3%)."
            },
            {
                "title": "DAX Stalls As German Factories Stumble And Data Dries Up - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/dax-stalls-as-german-factories-stumble-and-data-dries-up",
                "body": "German factory orders missed forecasts, while the US government shutdown makes it tough for markets to gauge the economic outlook.\n1 day ago • 1 min\nJoin the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nThe DAX barely budged on Tuesday—up just 0.03%—after new data showed German factory orders unexpectedly fell in August, leaving traders on edge amid a murkier global outlook and a lingering US government shutdown.\nWhat does this mean?\nFactory orders in Germany—a go-to gauge for Europe’s manufacturing muscle—slipped 0.8% from July when experts had called for a decent rebound. That miss signaled more trouble for key German industries, with orders for cars, pharmaceuticals, and tech all falling. Annual figures looked brighter, up 2.7% after last month’s drop, but ING warned that earlier demand from the US is fading and manufacturers now have thinner order books. Meanwhile, the US government shutdown has jammed up the flow of fresh economic data, leaving markets in limbo and policymakers flying blind. Still, there were glimmers: wind energy firm Nordex stood out by clinching a major contract for 21 new turbines, turning heads even as the main index stalled.\nWhy should I care?\nFor markets: When investors lose visibility they hit the brakes.\nSoft German factory numbers are keeping the DAX in check and signaling that Europe’s biggest economy isn’t out of rough waters. With less fresh data from the US, markets are treading lightly—trading activity is subdued and short-term gambles are tougher to justify. Even so, success stories like Nordex show that green investments can still turn heads when broader markets stall.\nThe bigger picture: Blind spots make decision-making tricky everywhere.\nWith the US government shutdown clogging the flow of key numbers, central banks like the Federal Reserve are left guessing their next moves. Meanwhile, weak German manufacturing adds to concerns about global growth—especially as European leaders juggle political uncertainty at home. For investors, slimmer info pipelines often mean rockier markets and a stronger need for patience and perspective.\nYou read that right: you can win two return flights to London, a three-night stay at a hotel in the capital, and in-person tickets to our Modern Investor Summit. Even better, your trip will be created in partnership with Echo Bravo – the experts in hassle-free business travel and round-the-clock human support.\nSo not only can you skip the bill, but you can leave the planning to the pros, too.\nAll you need to do is register for the Summit… and decide who you’d share that room with, of course.\nT&C's apply. Click here for details.\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nQuick Take\nAberdeen Group x Finimize • about 18 hours ago\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article is based on reporting by MT Newswires. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies."
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "338.000",
            "open": "24,870.740",
            "close": "25,163.150",
            "high": "25,175.860",
            "low": "24,837.860"
        },
        "market_summary": "### NDX100 Market Briefing\n\n* **Key Drivers:** The tech-heavy Nasdaq Composite, which the **NDX100** tracks, is driven by a **bullish momentum** fueled by the prospect of more **rate cuts** as hinted by the Federal Reserve minutes, and the ongoing rally in the artificial intelligence trade.\n* **Price Action:** The **NDX100** has broken above **23,000**, showing significant **upward momentum** with the Nasdaq Composite leading the way higher, up over **1%**.\n* **Technical Outlook:** Immediate support for the **NDX100** is near its previous resistance levels, now acting as support, with key psychological levels at **22,500** and **23,000** acting as benchmarks for its **bullish** run.\n\n---\n**Overall Sentiment:** Positive 📈",
        "source_articles": [
            {
                "title": "Stock market today: S&P 500, Nasdaq resume record rally as gold jumps, Fed minutes point to more rate cuts - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/live/stock-market-today-sp-500-nasdaq-resume-record-rally-as-gold-jumps-fed-minutes-point-to-more-rate-cuts-200208111.html",
                "body": "Stock market today: S&P 500, Nasdaq resume record rally as gold jumps, Fed minutes point to more rate cuts\nUS stocks marched higher on Wednesday as Wall Street returned to rally mode while investors digested the latest Federal Reserve minutes to provide hints to future policy amid a shutdown-driven dearth of data.\nThe tech-heavy Nasdaq Composite (^IXIC) led the way higher, up over 1% to close above 23,000 for the first time. The S&P 500 (^GSPC) climbed 0.6% as Wall Street shook off a rare losing day. The Dow Jones Industrial Average (^DJI) lagged, finishing just below the flatline.\nMeanwhile, gold (GC=F) futures continued their record-breaking rally after topping $4,000 per ounce for the first time on Tuesday. Investors have piled into the haven asset as a \"debasement trade\" alternative to the dollar (DX=F).\n(^DJI)\nMarkets marched to session highs in afternoon trading following the release of the Federal Reserve's minutes from its last policy meeting. The minutes signaled more rate cuts could be in play for the rest of 2025 even as they also hinted at steep divisions within the central bank.\n\"Participants expressed a range of views about the degree to which the current stance of monetary policy was restrictive and about the likely future path of policy. Most judged that it likely would be appropriate to ease policy further over the remainder of this year,\" the minutes said.\nAn air of caution has seeped into the markets this week as questions bubble on the AI trade, with questions on AI spending and a potential dot-com-style bubble. At the same time, the federal stoppage continued to breed uncertainty, with no end to the gridlock in sight as President Trump threatens to withhold back pay for furloughed government workers.\nThe shutdown, which is now a week old, has deprived Wall Street and the Federal Reserve of the crucial economic data needed to shape their thinking.\nLIVE COVERAGE IS OVER 24 updates"
            },
            {
                "title": "Stock Market News From Oct. 8, 2025: S&P 500 and Nasdaq Notch New Records - Barron's",
                "source": "Barron's",
                "url": "https://www.barrons.com/livecoverage/stock-market-news-today-100825?gaa_at=eafs&gaa_n=ASWzDAhEK5oIIKeQp7JLdCOo04rVT7ybSEvUy5TMmtBEa-37IceYAk9hE2Cp&gaa_ts=68e750f6&gaa_sig=1rm6Bn_scLNHDxNtlmpjL8BQ6GA-IoWGVg6XmZWIGybEHMXjBDgvMp4vv5h3BQPeufP-AzGhk0UmjAEZ5iD77w%3D%3D",
                "body": "CONCLUDED\nStock Market News From Oct. 8, 2025: S&P 500 and Nasdaq Notch New Records\nThe Dow struggled and closed flat.\nLast Updated:\nOct. 8, 2025 at 7:12 PM ET\nKey Events\n10 hours ago\n13 hours ago\n14 hours ago\n18 hours ago\n20 hours ago\nPinned Post\nThe S&P 500 and Nasdaq Composite were back to their record-setting ways on Wednesday as the government shutdown entered its second week.\nThe S&P 500 was up 0.6%. The Nasdaq Composite was up 1.1%. The S&P marked its 33rd record close of the year, while the Nasdaq hit its 32nd closing high. The Dow Jones Industrial Average was flat.\nThe yield on the 2-year Treasury note was up to 3.58%. The 10-year yield was 4.13%.\nWall Street’s appetite for risk resumed following a brief detour on Tuesday. The Invesco S&P 500 High Beta ETF, which features the S&P’s riskier stocks, outperformed the broader market. Funds focused on growth, momentum, and small-caps were also in on the action.\nDividend stocks, value stocks, and low volatility stocks were among the laggards. At the sector level, the S&P’s energy, real estate, and consumer staples struggled, which explains why the Dow was behind the major indexes.\nThe top sectors were tech, industrials, utilities, and consumer discretionary. Despite some market commentators calling out froth, the artificial intelligence trade was rallying.\nThe government shutdown also means Wall Street hasn’t had to deal with government data releases that could conflict with the bullish view that lower interest rates and a somewhat resilient economy are in the cards. The dollar also continued to rise.\n“The dollar bounce is likely to persist as long as its main drivers remain in place: lack of information about the US economy due to the Federal shutdown; concerns about the attraction of the euro because of its trade-weighted appreciation, worries about French politics and recent mixed economic data; and last but by no means least, fears of yen-unfriendly policies in Japan,” writes Kit Juckes, chief FX Strategist at Société Générale.\nMinutes from the Federal Open Market Committee's September meeting did little to challenge the market's views. Traders see a 77.6% chance of a half-point in cuts through the end of the year and a 21.2% chance of just one more quarter-point cut, according to the CME FedWatch Tool. Odds of no cuts ticked up to 1.2%, compared to 0.7% on Tuesday."
            },
            {
                "title": "Stocks Mixed; Two Space Firms Rocket - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-sp500-nasdaq-rocket-lab-ast-spacemobile-nvidia-xai-tesla/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #163fe1aa-a4d4-11f0-a215-2cc7bcf52868"
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "49.000",
            "open": "6,721.690",
            "close": "6,758.350",
            "high": "6,763.320",
            "low": "6,714.320"
        },
        "market_summary": "### SPX500 Market Briefing\n\n* **Key Drivers:** The **government shutdown** and its potential impact on the economy, along with the **hawkish** stance of the Federal Reserve, are driving market sentiment.\n* **Price Action:** The SPX500 is experiencing **bearish** momentum, with a potential break below the key psychological level of **$4,200**.\n* **Technical Outlook:** Immediate support is near the 50-day moving average at **$4,080**, with resistance at **$4,200**.\n\n---\n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "Video: Opinion | The G.O.P.’s ‘Cynical, Ridiculous’ Shutdown Attack - The New York Times",
                "source": "The New York Times",
                "url": "https://www.nytimes.com/video/opinion/100000010441604/the-gops-cynical-ridiculous-shutdown-attack.html",
                "body": "new video loaded: The G.O.P.’s ‘Cynical, Ridiculous’ Shutdown Attack\ntranscript\nThe G.O.P.’s ‘Cynical, Ridiculous’ Shutdown Attack\nHealth care premiums are expected to double for millions of Americans on Obamacare next year if the law doesn’t change in time. Neera Tanden walks Ezra Klein through the policy stakes of the government shutdown.\nThe other Republican argument is that what Democrats are really trying to do here is give health care subsidies to, as they put it, illegal aliens. What is that argument they are making? OK, I mean, I just need to say this is like the most deeply cynical, ridiculous thing, but I will —— I watched your shoulders actually fall. Like [laughs]: I can’t believe I have to deal with this [expletive]. I mean, it is just like, I mean, it’s really funny to me. It’s like, you can —— I mean, I worked in the White House, and I could just imagine them dialing up an illegal immigration argument as they have to deal with a confrontation on health care, which, of course, they know that they have to deal with anyway. So it’s just totally odd, but OK. The best case of their argument is that during the One Big Beautiful Bill Act, the Republicans limited Medicaid coverage to legal immigrants in the United States. It took — they made it more difficult for legal immigrants. No illegal aliens, no undocumented people. Nobody crossing the border. We’re talking about people like Afghan refugees, Ukrainian refugees, people subject to domestic violence who get protected status. So these are all people who have legal status in the United States. Now, they are doing a card trick to call them illegal aliens. They have legal status in the United States. They are not illegally here. They’ve like shown themselves to the government. We know who they are. And Democrats put forward and basically they said: We’d like to undo everything you did in the Medicaid — on your attacks on Medicaid. And this was one part of it. But really, the substance of their argument was: Undo the massive cuts to the Medicaid program. So that is like just false that it is covering illegal aliens. They are not illegal aliens. It is currently illegal under federal law for federal dollars to go to health care subsidies for people here illegally. So that is like the No. 1 point to just say about this, which is the truth is that for those of us who are old enough to remember, and I have some battle scars over this issue, having worked on the legislation, was a big, robust debate about whether people were legally here, illegal aliens, undocumented people could get access to the A.C.A., and there is literally a provision that says, by statute, you cannot receive health care and the premium tax credit cannot go to any illegal aliens, undocumented people, whatever you want to call them, that is illegal. And that is why they’ve had to do this mental gymnastics to get — to basically transform people who are legally here into illegal aliens, like that is just, this is like two different words. They have two different meanings, and they’re just conglomerating them in order to have some shred of making a lie true, but it is still a lie.\nThe G.O.P.’s ‘Cynical, Ridiculous’ Shutdown Attack\nHealth care premiums are expected to double for millions of Americans on Obamacare next year if the law doesn’t change in time. Neera Tanden walks Ezra Klein through the policy stakes of the government shutdown.Advertisement"
            },
            {
                "title": "The Problem(s) with “LGBTQ Catholic” - First Things",
                "source": "First Things",
                "url": "https://firstthings.com/the-problems-with-lgbtq-catholic/",
                "body": "The late Fr. Richard John Neuhaus had a love-hate relationship with the New York Times.\nRichard was a passionate partisan of New York City, which he sometimes described as a preview of the New Jerusalem, but the Gray Lady’s parochialism nonetheless led him to occasionally dismiss New York’s most prestigious daily as a “parish newsletter.” He regularly castigated the Times’s editorials for their air of smug infallibility. And then there was RJN’s annoyance (and more) with the Times’s knee-jerk liberalism, which, by its embrace of every imaginable left-of-center cause, accelerated the decay of liberal politics into the promotion of lifestyle libertinism. Richard was thus years ahead of Joseph Ratzinger in issuing warnings about a dictatorship of relativism, the unavoidable political outcome of the Times’s cultural lurch leftward.\nOn the other hand, Richard Neuhaus could no more imagine skipping the New York Times in the morning than he could imagine beginning the day without numerous cups of coffee, a bowl of Honey Nut Cheerios, and a smoke.\nThat love-hate relationship was crystallized in an incident during Richard’s days as a Lutheran pastor in the then-impoverished Bedford-Stuyvesant neighborhood of Brooklyn, when the Times declined to refer to a local black pastor (from Christendom’s entrepreneurial Protestant subdivision) as “Bishop” so-and-so. In high dudgeon, RJN wrote A. M. Rosenthal, then the Times’s managing editor, and asked what was going on. The man referred to himself as “Bishop.” His people called him “Bishop.” The sign on the front of his ecclesiastical establishment identified him as “Bishop.” Who did the Times think it was, and what did the Times think it was doing, denying this man the title he and his people used?\nAbe Rosenthal eventually wrote Richard a harrumphing letter, stating that, after the painstaking deliberation appropriate to the nation’s newspaper of record, the Times would henceforth refer to the gentleman in question as “Bishop” so-and-so. The letter then concluded with a sentence that would cause Richard Neuhaus to laugh uproariously for decades: “And so, Pastor Neuhaus, you may take some satisfaction from knowing that, in drawing this matter to our attention, you have made a small contribution to the history of our times.”\nOr words to that effect, if I may be pardoned for quoting the loathsome Richard Rich in A Man for All Seasons.\nOver thirty-plus years of friendship and collaboration, I must have heard Richard tell that story a dozen times, but I don’t think I’d thought of it more than once or twice since his death in 2009. Then, recently, I read an article indicating that a churchman I admire, who indicated some sympathy with the charge that the Catholic Church in the West is “obsessed” with questions of sexual morality, nonetheless himself used the term “LGBTQ Catholic.”\nNow, as a matter of good manners, I agree with the substance of Richard’s complaint to Abe Rosenthal: People should usually be identified the way they identify themselves, and in any event, it was not up to the New York Times to decide who is and who isn’t a bishop. But a churchman using the term “LGBTQ Catholic” of any member of the Catholic Church seems to me a different matter.\nFirst, it strikes me as incoherent to give at least a nod of credibility to the charge that certain sectors of the world Church are obsessed with sexual morality and then use the hypersexualized term “LGBTQ Catholic”—which, whatever its provenance, reduces an individual to their sexual desires, confusions, or both.\nSecond, as was pointed out at several synods beginning with Synod 2018, this usage has no warrant in Catholic history, for the Church has never identified its members by libido. Which means it’s just as untoward to speak of “heterosexual Catholics” as it is of “LGBTQ Catholics.” Why? Because “you are all one in Christ Jesus” (Gal. 3:28) and subdividing Catholics this way fractures the unity of the Church.\nFinally, in this political and "
            },
            {
                "title": "The U.S.'s strongest tornado in 12 years hit North Dakota in June, National Weather Service says - CBS News",
                "source": "CBS News",
                "url": "https://www.cbsnews.com/minnesota/news/first-us-ef5-tornado-12-years-north-dakota/",
                "body": "The U.S.'s strongest tornado in 12 years hit North Dakota in June, National Weather Service says\nA deadly tornado that ripped through a rural city in North Dakota in June has been upgraded to an EF-5, the National Weather Service said Monday, marking the first U.S. twister with an EF-5 rating in 12 years.\nThe federal agency's Grand Forks, North Dakota, facility estimates the twister that touched down in the southeast city of Enderlin on June 20 had a maximum wind speed of over 210 mph. Wind speeds in a tornado need to reach at least 200 mph for it to be classified as an EF-5, the highest rating on the Enhanced Fujita Scale.\nThe initial estimate in the days after it happened was an EF-3.\nAuthorities said two men and a woman died during the tornado, which caused extensive tree damage, tipped several train cars fully loaded with grain and lifted tanker cars. The NWS said one tanker car was thrown just over 475 feet.\nThe severe weather event also destroyed a farm in the area, with the foundation of at least one of its buildings \"considered to be swept clean,\" according to the NWS.\nAccording to officials, the tornado lasted just under 20 minutes, from 11:02 p.m. to 11:21 p.m., and created a 12-mile path of destruction from Enderlin to Alice, North Dakota.\nEnderlin is around 57 miles southwest of Fargo, North Dakota.\nThe last confirmed EF-5 tornado in the U.S. touched down in Moore, Oklahoma, on May 20, 2013, according to the National Oceanic and Atmospheric Administration.\nThe 2013 tornado had wind speeds of up to 200 mph. According to the NWS, it traveled over 14 miles, killed 24 people, injured over 200 others and damaged many structures."
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "490.000",
            "open": "47,995.400",
            "close": "48,129.690",
            "high": "48,185.400",
            "low": "47,695.400"
        },
        "market_summary": "### JPN225 Market Briefing\n\n* **Key Drivers:** Foreign investors' continued buying and the **Japanese yen**'s plunge to its lowest level in weeks are driving the **Nikkei 225 Index**'s relentless **bull run**.\n* **Price Action:** The index has jumped to a high of **¥48,465**, up by over **57%** from the lowest level this year, and has broken above the important resistance level at **¥40,227**.\n* **Technical Outlook:** The index remains above the **50-day** and **100-day Exponential Moving Averages (EMA)**, with top oscillators like the **Relative Strength Index (RSI)** and the **MACD** continuing to rise, targeting the key resistance at **¥50,000**.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Yen dips to 153; analysts expect further fall as Takaichi's time nears - Nikkei Asia",
                "source": "Nikkei Asia",
                "url": "https://asia.nikkei.com/business/markets/currencies/yen-dips-to-153-analysts-expect-further-fall-as-takaichi-s-time-nears",
                "body": "TOKYO -- The Japanese yen is set to weaken further, according to market experts, as new ruling party leader Sanae Takaichi's support for expansionary spending and loose monetary policy pushes investors to sell the currency.\nFiscal worries and BOJ pause could prompt the currency to test the 155 level\nDespite some positive economic data, investors have backpedaled on their expectations that the Bank of Japan will raise interest rates soon. (Photo by Akira Kodaka)\nTOKYO -- The Japanese yen is set to weaken further, according to market experts, as new ruling party leader Sanae Takaichi's support for expansionary spending and loose monetary policy pushes investors to sell the currency."
            },
            {
                "title": "Nikkei 225 Index forecast as foreigners buy, Japanese yen crashes - Invezz",
                "source": "Invezz",
                "url": "https://invezz.com/news/2025/10/09/nikkei-225-index-forecast-as-foreigners-buy-japanese-yen-crashes/",
                "body": "Nikkei 225 Index forecast as foreigners buy, Japanese yen crashes\n- The Nikkei 225 Index has been in a relentless bull run this year.\n- The index jumped as foreign investors continued buying.\n- It also jumped as the Japanese yen continued falling.\nThe Nikkei 225 Index continued its strong rally this week as foreign investors continued buying and the Japanese yen plunged to its lowest level in weeks. It jumped to a high of ¥48,465, up by over 57% from the lowest level this year.\nForeign investors are buying Japan stocks\nCopy link to sectionThe Nikkei Index and other Japanese indices, like the Topix have been in a strong uptrend this year. One reason for this is that foreign investors have continued buying these shares.\nData released on Thursday showed that these investors bought shares worth over ¥2.46 trillion, which is equivalent to $16.3 billion. These purchases happened after the victory of Sanae Takaichi, who has favored Abenomics-like policies.\nMost notably, inflows into Japanese stocks happened after three weeks of intensive selling as investors anticipated that a more hawkish official would win the seat.\nThe ongoing Nikkei 225 Index jump is being led by companies in the defense and technology industries. Some of the most notable gainers are companies like Mitsubishi Heavy, Japan Steel Works, and IHI Corp. Technology companies like those in the semiconductor industry have also had substantial inflows.\nForeign investors have been buying Japanese stocks in the past few year after Warren Buffett moved into the market. He invested in five trading houses – Mitsui, Itochu, Mitsubishi, Sumitomo, and Marubeni – during the pandemic and then added to their position.\nJapanese yen crash continues\nCopy link to sectionThe Nikkei 225 Index has also jumped as investors reacted to the relatively weak Japanese yen. Data shows that the USD/JPY exchange rate has soared from a low of 139.95 in May this year to the current 152.50, its highest point since February.\nThe Japanese yen has slumped partly because of the ongoing US dollar rebound. It also plunged as investors reacted to Takaichi’s victory, which they believe will lead to more stimulus and an easy-money policy.\nThe yen slump coincided with the soaring Japanese bond yields. Data shows that the 30-year rose to 3.30%, while the ten-year jumped to 1.70%.\nLooking ahead, the next major catalyst for the Nikkei 225 Index will be the earnings season. Fast Retailing and Seven & I Holdings have already published their earnings.\nLater this month, companies like Hitachi, Chugai Pharma, Fujitsu, Canon, and Tokyo Gas will publish their financial results.\nNikkei 225 Index technical analysis\nCopy link to sectionThe daily timeline chart shows that the Nikkei Index has been in a strong bull run in the past few months. It has jumped from a low of ¥30,690 on April 7 to the current ¥48,403.\nThe index has jumped above the important resistance level at ¥40,227, the highest point in October and November last year. It was also the highest level in January.\nThe Nikkei 225 Index has remained above the 50-day and 100-day Exponential Moving Averages (EMA). Also, top oscillators like the Relative Strength Index (RSI) and the MACD have continued rising.\nThe RSI has formed a broadening wedge pattern. Therefore, the index will likely continue rising as bulls target the key resistance at ¥50,000."
            },
            {
                "title": "The Nikkei average rose by approximately 700 yen, with SoftBank Group, Yaskawa Electric, and Ebara among the top gainers in terms of percentage increase. - 富途牛牛",
                "source": "富途牛牛",
                "url": "https://news.futunn.com/en/post/63030705/the-nikkei-average-rose-by-approximately-700-yen-with-softbank",
                "body": "At around 11 a.m. on the 9th, the Nikkei Stock Average was trading approximately 700 yen higher than the previous day, near 48,430 yen. Trading began with a strong buying trend from the morning, and at 10:57 a.m., it reached a high of 48,481.09 yen, up 746.10 yen from the previous close. The index has continued to move within a higher price range since then. The U.S. dollar-yen exchange rate is hovering around the mid-152 yen level.\nAmong the stocks included in the Nikkei Average, SoftBank Group <9984.T>, Yaskawa Electric <6506.T>, Ebara Corporation <6361.T>, SHIFT <3697.T>, and Fuji Electric <6504.T> ranked among the top gainers in terms of percentage increase. Meanwhile, IHI Corporation <7013.T>, Screen Holdings <7735.T>, Toyota Motor <7203.T>, Honda Motor <7267.T>, and Asahi <2502.T> were among the top losers in terms of percentage decline.\nProvided by: Wealth Advisor Co."
            }
        ]
    }
]