[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "71.600",
            "open": "4,457.530",
            "close": "4,477.430",
            "high": "4,479.510",
            "low": "4,407.910"
        },
        "market_summary": "### Gold (XAU/USD) Market Briefing\n* **Key Drivers:** Ongoing central bank purchases, lower interest rates, and persistent fiscal deficits are supporting **gold** prices, with investors maintaining their positions despite a historic surge in 2025.\n* **Price Action:** Spot **gold** rose 0.5% to **$4,496.09** an ounce, heading for a weekly gain of about 3.9% after hitting a record late December, showing **bullish momentum**.\n* **Technical Outlook:** Immediate support is near the recent lows at **$4,400**, with resistance at the record high of **$4,549.71**, as investors watch for the next catalyst, including U.S. **CPI** on Jan. 13 and Barrick's full-year results on Feb. 5.\n--- \n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Gold Traders Enter Late — Here’s Why for OANDA:XAUUSD by XAU_EMPIRE - TradingView — Track All Markets",
                "source": "TradingView — Track All Markets",
                "url": "https://www.tradingview.com/chart/XAUUSD/PDEoudz6-Gold-Traders-Enter-Late-Here-s-Why/",
                "body": "🟡 Gold Traders Enter Late — Here’s Why | XAUUSD Market Psychology 💛\nGold (XAUUSD) often traps traders ❌\nnot because the market is random,\nbut because most traders enter after the move is already obvious ⏳\nProfessional traders understand that gold price action is driven by liquidity and psychology, not excitement 🧠💧\n🔍 Why Most Gold Traders Are Late\nThe initial move in gold usually starts quietly 🤫\nLow volatility\nSmall candles\nUnclear direction\nThis is when smart money builds positions 🏦\nwhile retail traders stay on the sidelines 👀\n⏳ Confirmation Causes Delay\nRetail traders prefer safety ✔️\nThey wait for:\nStrong bullish candles\nBreakout confirmation\nNews alignment\n📌 The problem:\nBy the time confirmation appears, price is already extended 📈\n😰 FOMO Creates Poor Entries\nWhen momentum becomes obvious,\nFOMO (fear of missing out) takes control 🔥\nTraders enter near highs ⬆️\nIgnoring risk and market context ⚠️\nThis area often becomes a liquidity zone 💧\n💧 Late Buyers Become Liquidity\nMarkets need liquidity to function 🔄\nLate retail buyers:\nProvide exit liquidity for institutions 🏦\nFuel pullbacks or reversals\nResult:\n📉 Stop-losses get hit\n⏸️ Price pauses or retraces\n🎯 Smart Money vs Retail Traders\nSmart Money 🧠\nEnters early\nWaits patiently\nManages risk professionally\nRetail Traders 😵\nEnter late\nChase momentum\nTrade emotions\n🧠 Key Lesson for Gold Traders\n❌ Chasing breakouts\n❌ Trading emotions\n✅ Waiting for liquidity\n✅ Reading market structure\n✅ Letting price come to you\n🏆 Final Thought\nGold rewards patience, not excitement. ✨\nWhen you stop chasing moves\nand start understanding psychology,\nyou stop entering late — and start trading smarter 💛📊\nGold (XAUUSD) often traps traders ❌\nnot because the market is random,\nbut because most traders enter after the move is already obvious ⏳\nProfessional traders understand that gold price action is driven by liquidity and psychology, not excitement 🧠💧\n🔍 Why Most Gold Traders Are Late\nThe initial move in gold usually starts quietly 🤫\nLow volatility\nSmall candles\nUnclear direction\nThis is when smart money builds positions 🏦\nwhile retail traders stay on the sidelines 👀\n⏳ Confirmation Causes Delay\nRetail traders prefer safety ✔️\nThey wait for:\nStrong bullish candles\nBreakout confirmation\nNews alignment\n📌 The problem:\nBy the time confirmation appears, price is already extended 📈\n😰 FOMO Creates Poor Entries\nWhen momentum becomes obvious,\nFOMO (fear of missing out) takes control 🔥\nTraders enter near highs ⬆️\nIgnoring risk and market context ⚠️\nThis area often becomes a liquidity zone 💧\n💧 Late Buyers Become Liquidity\nMarkets need liquidity to function 🔄\nLate retail buyers:\nProvide exit liquidity for institutions 🏦\nFuel pullbacks or reversals\nResult:\n📉 Stop-losses get hit\n⏸️ Price pauses or retraces\n🎯 Smart Money vs Retail Traders\nSmart Money 🧠\nEnters early\nWaits patiently\nManages risk professionally\nRetail Traders 😵\nEnter late\nChase momentum\nTrade emotions\n🧠 Key Lesson for Gold Traders\n❌ Chasing breakouts\n❌ Trading emotions\n✅ Waiting for liquidity\n✅ Reading market structure\n✅ Letting price come to you\n🏆 Final Thought\nGold rewards patience, not excitement. ✨\nWhen you stop chasing moves\nand start understanding psychology,\nyou stop entering late — and start trading smarter 💛📊\n👑 XAU_EMPIRE – XAU/USD Specialist\n📊 Professional Forex Trader Gold Signals Provider\n⚡ Smart Money Technicals Fundamentals\n📈 Daily Accurate Trade Setups Market Outlook\n🔥 Join Exclusive VIP Premium Telegram Channel\nt.me/+pzfvHNBV6jAxMmM0\n📊 Professional Forex Trader Gold Signals Provider\n⚡ Smart Money Technicals Fundamentals\n📈 Daily Accurate Trade Setups Market Outlook\n🔥 Join Exclusive VIP Premium Telegram Channel\nt.me/+pzfvHNBV6jAxMmM0\nDisclaimer\nThe information and publications are not meant to be, and do not constitute, financial, investment, trading, or other types of advice or recommendations supplied or endorsed by TradingView. Read more in the Terms of Use.\n👑 XAU_EMPIRE – XAU/USD Specialist\n📊 Professional Forex Trader Gold Signals Provider\n"
            },
            {
                "title": "Gold investors remain optimistic following the historic surge in 2025 - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605140379",
                "body": "Photo by Kerem Uzel/Bloomberg\nFollowing an extraordinary rally that captured the attention of global markets, most investors are not anticipating gold to repeat its dramatic performance in 2026. Nevertheless, many leading asset managers remain optimistic about the metal’s prospects, believing that the same factors that drove gold to new heights are still at play.\nIn 2025, gold soared by 65%—its most impressive annual gain in nearly fifty years—as both individual and institutional investors, along with central banks, increased their holdings. The precious metal benefited from a convergence of supportive conditions, including declining interest rates and heightened geopolitical uncertainty, even surpassing its inflation-adjusted peak from 1980.\nBloomberg interviewed over a dozen investment professionals managing trillions in assets to assess their views after gold’s historic year. The majority indicated they are maintaining their positions, confident in gold’s enduring appeal.\nIan Samson, a portfolio manager at Fidelity International, commented, “We still foresee gold climbing in 2026, as the underlying drivers remain strong.” Samson reduced his exposure during a particularly volatile period in October but has since increased his holdings, citing ongoing central bank purchases, lower interest rates, and persistent fiscal deficits as key reasons.\nMany investors also highlighted diminishing trust in major developed-world currencies, fueled by challenges to central bank independence and mounting government debt, as a crucial factor supporting gold. Rising public debt in advanced economies contributed to political tensions last year, from legislative gridlock in the US and political deadlock in France to scrutiny of Japan’s record budget.\nMike Wilson, Morgan Stanley’s chief investment officer and strategist, described gold as “essentially a hedge against fiat currencies now more than ever.” This perspective gained momentum in late 2025, as concerns about currency devaluation grew and prominent investors like Ken Griffin and Ray Dalio pointed to gold’s rally as a warning sign.\nWilson recommends allocating 20% of portfolios to real assets such as gold to guard against inflation, suggesting a shift from the traditional 60/40 stocks and bonds mix to a 60/20/20 split. He emphasized that the currency debasement narrative has become widely accepted.\n“When everyone is aware of the story, you have to wonder: Is it already reflected in the price?” Wilson remarked. “I don’t believe it is, because I haven’t seen any significant changes in fiscal behavior globally. In fact, the opposite seems true.”\nDarwei Kung, head of commodities and portfolio manager at DWS Group, noted that his firm is holding a slightly above-average allocation to gold-related assets and plans to maintain this stance into 2026. He anticipates a moderate increase in gold prices by year-end, along with short-term trading opportunities as broader market dynamics influence the metal.\nAccording to Massimiliano Castelli, head of global sovereign markets strategy at UBS Asset Management, pension and insurance funds showed growing interest in gold throughout 2025. Some institutions that had never previously invested in gold allocated around 5% of their strategic portfolios to the metal, attracted by its strong returns and its ability to offset risks elsewhere.\n“Naturally, we don’t expect the same explosive gains as last year, when gold outperformed all other asset classes,” Castelli said. “However, we remain optimistic about gold’s prospects.”\nHistory suggests caution. Exceptional rallies have often been followed by extended periods of subdued returns. For example, after gold reached a record $1,921 per ounce in 2011 due to the global financial crisis, it took nine years to revisit that level. Similarly, a prolonged bear market followed the metal’s 127% surge in 1979.\nDespite the recent rally, gold remains underrepresented in US investment portfolios. According to a December analys"
            },
            {
                "title": "Barrick stock hangs near highs as gold steadies; CPI and Feb. 5 results loom - TechStock²",
                "source": "TechStock²",
                "url": "https://ts2.tech/en/barrick-stock-hangs-near-highs-as-gold-steadies-cpi-and-feb-5-results-loom/",
                "body": "New York, January 10, 2026, 12:25 EST — Market closed\n- Barrick Mining closed up 0.8% on Friday, tracking firmer bullion after a softer U.S. jobs print. (Zacks)\n- Spot gold rose 0.5% and was headed for a weekly gain of about 3.9% after hitting a record late December. (Reuters)\n- Next on the calendar: U.S. CPI on Jan. 13, then Barrick’s full-year results on Feb. 5. (Bureau of Labor Statistics)\nBarrick Mining shares ended Friday modestly higher, a quiet finish to a week when gold swung around U.S. data and policy headlines. The stock closed up 0.8% at $47.81. (Zacks)\nThat matters now because the trade has turned simple: bullion up, miners up — until it isn’t. With gold close to record territory, investors are watching whether next week’s inflation numbers keep rate-cut bets alive and, by extension, keep a floor under the group. (Reuters)\nGold typically draws support when interest rates are expected to fall because it yields nothing. On Friday, traders leaned that way after payrolls missed forecasts and markets continued to price at least two Federal Reserve cuts this year. (Reuters)\nSpot gold was up 0.5% at $4,496.09 an ounce by early afternoon in New York, and U.S. gold futures settled 0.9% higher at $4,500.90, Reuters reported. Bullion hit a record $4,549.71 on Dec. 26. (Reuters)\n“Payrolls are showing us a poor job creation environment,” Bart Melek, global head of commodity strategy at TD Securities, said, pointing to a mix of uncertainty and an “easing Fed” as supportive for precious metals. (Reuters)\nPeers moved with the tape. Newmont gained 2.0% to $108.99, while Agnico Eagle climbed 2.5% to $191.14; the VanEck Gold Miners ETF rose 1.1%. (MarketWatch)\nSome banks are leaning into the move, with caveats. HSBC said this week gold could reach $5,000 an ounce in the first half of 2026, but warned a correction later in the year was possible if tensions ease or the Fed pauses cuts. (Reuters)\nFor Barrick specifically, the next hard catalyst is its earnings date. The company said it will release full-year and fourth-quarter 2025 results before markets open on Feb. 5, with a management webcast later that morning. (Barrick)\nUntil then, traders tend to focus on what moves the metal and the dollar. The near-term risk is straightforward: a hotter inflation print could lift Treasury yields and the greenback, pressuring gold and the miners that have ridden it higher. (Reuters)\nThe next test comes quickly. U.S. CPI data for December are due on Tuesday, Jan. 13, and a U.S. Supreme Court ruling tied to Trump’s sweeping tariffs is expected on Jan. 14; beyond that, markets will look to the Fed’s Jan. 27-28 meeting and Barrick’s Feb. 5 results. (Bureau of Labor Statistics)"
            }
        ]
    },
    {
        "asset_name": "Silver",
        "symbol": "EIGHTCAP:XAGUSD",
        "status": "Success",
        "data": {
            "day_range": "5.179",
            "open": "78.079",
            "close": "76.953",
            "high": "78.994",
            "low": "73.815"
        },
        "market_summary": "### Silver (SI/USD) Market Briefing\n\n* **Key Drivers:** Renewed **safe haven demand** and **industrial demand** are driving the price of silver, with **COMEX silver futures** jumping over **6%** to around **$79.79** per ounce.\n* **Price Action:** Broke out from its recent consolidation range, re-entering a strong **bullish channel**, with **MCX Silver contracts** for March expiry surging to **Rs 2,52,002** per kg.\n* **Technical Outlook:** Immediate support is near the recent breakout level of **$75**, with resistance at **$80**.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "14 Reasons Silver Isn't Second Place to Gold When It Comes to Investing - AOL.com",
                "source": "AOL.com",
                "url": "https://www.aol.com/articles/14-reasons-silver-isnt-second-174200299.html",
                "body": "14 Reasons Silver Isn't Second Place to Gold When It Comes to Investing\nHistorically, gold has been seen as a more valuable investment than silver, with 26% of Americans saying gold is the strongest investment.\nBut that doesn't mean silver isn't without its benefits. While it can be seen as volatile, particularly over a short period, silver is often considered an inflation-proof option for investors looking to boost their bank accounts.\nTo get to the facts on silver and whether it's a wise investment, here are 14 considerations before you add this shiny commodity to your portfolio.\nCan you retire early? Take this quiz and find out.\n1. Silver is more affordable than gold\nSilver is significantly more affordable than gold at $51 per ounce as opposed to $4,095 per ounce, making it appealing to investors looking to enter the precious metals market at a lower price point. Just think of how much a gold bar is worth.\nYou'll still get some of the benefits of gold if you're buying a hard asset that you can hold, but you won't pay thousands of dollars for a tiny physical amount the way you would with gold.\nWho really has the cheapest auto insurance in your area? Check your zip code here.\n2. Silver can be easier to sell\nDue to its lower cost, silver can be easier to offload quickly in small sums, which is a plus for those needing to free up liquid assets quickly, particularly for everyday spending.\nGiven its low price, you may not be able to use silver as a down payment for a house, but it could be helpful for day-to-day purchases.\n3. Silver makes a wonderful gift\nWant to start a tradition of gifting an investment to a younger relative? Silver is a great place to begin since it's more affordable and can easily be given in amounts you can hold in your hand. Look at coins or bullion for a physical investment that can be gifted.\n14 benefits seniors are entitled to but often forget to claim\n4. You have options to invest in silver\nWhile coins, jewelry, or bullion might be the first items that come to mind when you think of silver, there are several options for investing in silver.\nThere are futures, ETFs that own silver or silver miners, and silver mining stocks. Each of these comes with risks beyond silver's volatility, so do thorough research on the securities you're considering.\n5. Silver has a strong industrial demand\nThroughout your day, you probably use multiple items made with silver and don't even realize it. And we don't just mean jewelry. Silver is known for its industrial demand, from batteries and solar panels to auto parts.\nIn fact, 56% of silver's total supply goes to industrial uses, which means during booming economic times when industrial demand and manufacturing are high, silver prices may get a boost.\n6. Lower premiums on silver\nWhen buying silver bullion, you won't pay a raw price or what dealers call a spot price. Instead, you'll pay a premium, which is the price you pay over the spot price. However, on silver, these premiums tend to be lower than gold, creating a lower entry barrier.\n$1,000,000 saved? Download this free guide to learn 7 ways to generate retirement income.\nAdvertisement\n7. Silver has a smaller market share than gold\nWhile the total amount of new silver each year is close to 1 billion ounces, compared to gold's mere 120 million ounces, its value is so much lower that its market share is dwarfed by gold's.\nGold's overall market value is 80 times bigger than silver's. This smaller value leads to greater volatility, as market swings are felt more significantly.\n8. The use of silver at home is rebounding\nDemand for the silver you use on your table is rebounding after a dip during the pandemic. Silver bowls, silverware, vases, and more are being used again for entertaining, which could help drive silver prices up.\n9. Silver doesn't follow the stock market\nSilver is often seen as a hedge against inflation and the stock market because it tends to follow its own rhythm and has historically performed well over long "
            },
            {
                "title": "Video Trump pushes for cap on credit card interest rates - abcnews.go.com",
                "source": "abcnews.go.com",
                "url": "https://abcnews.go.com/Politics/video/trump-pushes-cap-credit-card-interest-rates-129090882",
                "body": "Trump pushes for cap on credit card interest rates\nCaleb Silver, the editor in chief of Investopedia, discusses President Donald Trump’s proposed cap on credit card interest rates.\nJanuary 10, 2026\nAdditional Live Streams\nTop Stories\nTop Stories\nTrump threatens military land action against drug cartels inside Mexico\nJan 10, 2026US military launches strikes targeting ISIS in Syria\nJan 10, 2026Ex-husband charged in Ohio dentist, wife murder investigation\nJan 10, 2026Flu deaths surging: CDC\nJan 10, 20266 killed in Mississippi mass shooting\nJan 10, 2026Growing unrest inside Iran\nJan 10, 2026Banks push back on Trump’s credit card cap\nJan 10, 2026First-ever medical evacuation from International Space Station\nJan 10, 2026Organizer outlines motivation for protests after fatal Minneapolis ICE shooting\nJan 10, 2026Actor and director Timothy Busfield faces child abuse charge\nJan 10, 2026Urgent search for missing Oklahoma 12-year-old\nJan 10, 2026Luigi Mangione fights the death penalty\nJan 10, 2026Minneapolis police chief addresses ICE shooting\nJan 10, 2026Protests grow after fatal ICE shooting in Minneapolis\nJan 10, 2026Oil executives meet as US forces board 5th tanker tied to Venezuela\nJan 10, 2026New details in murders of Ohio dentist and wife\nJan 10, 2026Oregon and Indiana face off in Peach Bowl\nJan 10, 2026Anti-government protests escalate in Iran\nJan 10, 2026Nevada construction worker accused of ramming police vehicles with front loader\nJan 10, 2026Tri-fold phones and humanoid robots: Top innovations at CES 2026\nJan 09, 2026Newly released video shows Minneapolis shooting from ICE agent's perspective\nJan 09, 2026Trump says US will do something on Greenland 'whether they like it or not'\nJan 09, 2026Mother, stepfather arrested for alleged child abuse amid search for missing boy\nJan 09, 2026Protests in Iran intensify as demonstrators defy government threat to crack down\nJan 09, 2026Tanker seized in the Caribbean as oil executives meet over oil industry in Venezuela\nJan 09, 2026Ohio officers did wellness check on wrong home before murders of dentist and his wife\nJan 09, 2026Police: Stolen construction vehicle used in attack on police in Nevada\nJan 09, 2026American killed in shark attack whale vacationing in US Virgin Islands\nJan 09, 2026World News Tonight' honors those who lived through California wildfires\nJan 09, 2026What to know as this flu season breaks records\nJan 09, 2026\nABC News Live Presents\nABC News Live Presents\nDaddy Yankee: A Higher Note\nNov 20, 2025Gut Check: The Foods We Eat\nNov 19, 2025All Access With Linsey Davis: Stevie Van Zandt\nNov 18, 2025All Access with Linsey Davis: Andrew Cuomo\nOct 30, 2025All Access With Linsey Davis: Zohran Mamdani\nOct 27, 2025Springsteen: Deliver Me from Nowhere - A Conversation with the Cast\nOct 21, 2025All Access With Linsey Davis: Jeremy Allen White\nOct 20, 2025The Children of Gaza\nOct 11, 2025Glen Powell and Eli Manning: ABC News Live Prime with Linsey Davis\nOct 06, 2025The Playlist Presents: Dale Play!\nSep 26, 2025The Queens: Chaka Khan, Patti LaBelle & Stephanie Mills\nSep 18, 2025War or Peace: The Zelenskyy Interview | Martha Raddatz Reports\nSep 08, 2025Linsey Davis Reports: The Epstein Survivors Speak Out\nSep 03, 2025Backstage Pass - The Fantastic Four: First Steps\nJul 25, 2025After the Ashes: Rebuilding from the LA Wildfires\nJul 10, 2025Celebrating 20 Years of Shondaland\nJul 04, 2025Operation Babylift: The 50-Year Journey – A Special Edition of 20/20\nMay 08, 2025Our Home: Local Action and Global Impact\nApr 22, 2025America’s Care Crisis\nFeb 13, 2025Immigration Crackdown\nFeb 12, 2025Shot in the Dark: Weight Loss Injection Wars\nNov 25, 2024October 7th: The Race to Survive\nOct 07, 2024January 6th: The Fight to Rewrite History\nOct 03, 2024The President and First Lady of Ukraine | Robin Roberts Reporting\nSep 25, 2024Maui Strong 808: Rising from the Ashes\nAug 08, 202410 Million Names\nJun 19, 2024Generation Swipe\nMay 23, 2024Amplified: Asian American Native Hawaiian Pacific Islander Voices\nMay 1"
            },
            {
                "title": "Gold, silver sustain rally in 2026 amid renewed safe haven demand - India Tribune - Chicago",
                "source": "India Tribune - Chicago",
                "url": "https://www.indiatribune.com/public/index.php/gold-silver-sustain-rally-in-2026-amid-renewed-safe-haven-demand",
                "body": "New Delhi, Jan 10 (IANS) Gold and silver continued their structural bull run into the start of 2026 on the back of enhanced safe haven demand and industrial demand, analysts said on Saturday.\nGold futures with February expiry gained significantly during the week touching Rs 1,38,875 per 10 grams, up from Rs 1,35,752 at last week's close. The price of 10 grams of 24-carat gold closed the week at Rs 1,37,122 up from Rs 1,34,782 of the prior week, according to data published by the India Bullion and Jewellers Association (IBJA).\nMCX Silver contracts for March expiry showed significant surge during the week surging to Rs 2,52,002 per kg, confirming a decisive breakout from its recent consolidation range and re-entering a strong bullish channel.\n\"COMEX gold remained firm near $4,500 per ounce, gaining over 1 per cent and consolidating just below record highs after its strong multi-week rally,\" said Ponmudi R, CEO of Enrich Money.\nMeanwhile, COMEX silver futures jumped over 6 per cent to around $79.79 per ounce, rebounding from $75 as industrial demand revived alongside renewed safe-haven buying, he added.\nInvestor sentiment in silver remains firmly constructive, supported by persistent supply deficits, record central bank buying as well as rising green-energy demand linked to solar, EVs and AI infrastructure.\nLooking ahead, near-term volatility cannot be ruled out, driven by profit-taking, dollar movements and high-frequency macro data from US and other major economies, analysts said.\nRecent pullbacks in precious metals were largely seen as healthy profit-taking rather than signs of trend fatigue, and the speed of subsequent rebounds has reinforced confidence in the longer-term uptrend.\nGold surged nearly 66 per cent in CY25, surpassing $4,500 per ounce, while silver outperformed with a 171 per cent rise.\nAnalysts said that the ongoing surge in gold and silver is being driven by structural demand rather than short-term speculative activity. Sustained central-bank gold purchases, elevated geopolitical uncertainty, and expectations of global monetary easing continue to reinforce gold’s role as a core portfolio hedge."
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "3.060",
            "open": "60.480",
            "close": "62.878",
            "high": "63.235",
            "low": "60.175"
        },
        "market_summary": "### Spot Brent Crude Oil Market Briefing\n* **Key Drivers:** Geopolitical tensions and **supply-side factors** are influencing oil prices, with the US aiming to control **30% of the global raw materials market**. The arrest of Venezuelan President Nicolas Maduro has introduced **political uncertainty**.\n* **Price Action:** **$60-61** per barrel, with prices almost unchanged and stabilized despite the arrest of Maduro, reflecting **skepticism** that political upheaval will translate into sustained supply shocks.\n* **Technical Outlook:** The market is expected to be dominated by a **surplus bias**, with forecasts suggesting a **3-4 mb/d surplus** if OPEC+ and rivals continue adding more supply than demand can absorb. **Demand growth** remains modest, with the IEA projecting an increase of roughly **1.2 mb/d**, concentrated in Asia.\n\n--- \n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "Trump's control over Venezuela's oil threatens OPEC's influence, Washington to own 30% of market - WSJ - Українські Національні Новини",
                "source": "Українські Національні Новини",
                "url": "https://unn.ua/en/news/trumps-control-over-venezuelas-oil-threatens-opecs-influence-washington-to-own-30percent-of-market-wsj",
                "body": "Trump's control over Venezuela's oil threatens OPEC's influence, Washington to own 30% of market - WSJ\nKyiv • UNN\nDonald Trump plans to resume oil production in Venezuela to lower global prices to $50 per barrel. This would allow the US to control about 30% of the world's raw materials market.\nDonald Trump's ambition to establish control over Venezuela's oil industry poses critical risks for the OPEC cartel. The US president's initiative to restore Venezuelan oil fields aims to lower global prices to $50 per barrel, which directly threatens the revenues of traditional oil exporters. This is stated in an article by The Wall Street Journal, writes UNN.\nDetails\nAccording to JPMorgan's estimates, the consolidation of US, Guyanese, and Venezuelan capacities will allow Washington to control about 30% of the global raw materials market.\nNew White House Strategy and Market Reaction\nTrump's inner circle is considering increasing Venezuela's oil production from the current 1 million to 3 million barrels per day within the next three years. This will require massive investments, but even the short-term expectation of increased supply is putting pressure on a market already suffering from an oil surplus.\nAgainst this backdrop, OPEC and Russia have already changed tactics. At a meeting on Sunday, January 11, the alliance members decided to suspend any increase in production during the first quarter of 2026 to prevent prices from falling further.\nPosition of Saudi Arabia and China\nSaudi Arabia maintains a wait-and-see approach, citing the critical state of Venezuelan infrastructure, the restoration of which will take years. At the same time, some OPEC members see potential benefits in Trump's actions: if the US cuts off Venezuelan oil supplies to China, Beijing will be forced to increase purchases from Persian Gulf countries.\nThis shift could give the US greater influence over oil markets, potentially keeping prices historically lower and altering the balance of power on the international stage.\nUS may lift some oil sanctions against Venezuela as early as next week11.01.26, 04:22 • 1168 views"
            },
            {
                "title": "Oil market dynamics: Factors that will drive prices in 2026 - The Economic Times",
                "source": "The Economic Times",
                "url": "https://economictimes.indiatimes.com/markets/commodities/news/oil-market-dynamics-factors-that-will-drive-prices-in-2026/articleshow/126461269.cms?from=mdr",
                "body": "Periodic geopolitical flare-ups (Israel–Iran in June, Russia–Ukraine infrastructure strikes) briefly supported crude oil prices, but the market’s structural surplus prevailed. As per the US Energy Information Administration data, implied stock builds in the previous year were among the largest since 2020.\nSupply exceeds demand\nCrude oil prices in 2025 were pressured by a confluence of supply-side and structural factors. OPEC+ began unwinding earlier production cuts, adding barrels to an already soft macroeconomic backdrop, while robust non-OPEC growth—led by U.S. output at record levels—further diluted any geopolitical risk premium. Tariff and sanctions adjustments by the U.S. toward Russia, Iran, and Venezuela shifted trade flows but failed to create lasting shortages, allowing inventories to swell.Meanwhile, China’s strong import activity largely fed strategic reserves rather than immediate consumption. This muted demand signals and cushioned sharper price declines. Adding to the imbalance, refined product inventories climbed faster than crude in several regions, compressing margins and weakening the pull on upstream demand.\nMaduro’s arrest possible impact\nOn January 3, 2026, U.S. forces captured Venezuelan President Nicolas Maduro, flying him and his wife to New York to face narco-terrorism and drug-trafficking charges, both pleaded not guilty. The episode jolted global oil politics because Venezuela—an OPEC founder with the world’s largest proven reserves—has been constrained by sanctions, underinvestment, and operational decay.Though the arrest may introduce political uncertainty, the immediate impact on global crude supplies remains limited. Venezuela currently produces just under 1 mb/d -less than 1% of global output- and ongoing U.S. sanctions and tanker blockades have already sharply constrained its exports.\nIn the short term, there may be modest supply disruption, but global inventories remain ample and projects a 3.8 mb/d surplus well into 2026. Brent oil almost unchanged and stabilized near $60–61, reflecting skepticism that political upheaval will translate into sustained supply shocks. In fact, the arrest may open doors for eventual U.S. and European investment.\nMaduro’s removal may introduce short-lived volatility, but structural oversupply and constrained Venezuelan capacity will likely neutralize any significant price spike. If political stabilization and investment unfold, Venezuela’s crude output may gradually increase, which may pressure oil prices in the medium term, but the path remains slow and uncertain.\nSupply – Demand dynamics\nForecasts diverge, but most agree on surplus conditions in 2026. The EIA expects production to exceed consumption, with global inventory builds of more than 2 mb/d on average. There is a forecast that OPEC+ will hold output steady into Q1’26, which helps limit volatility but doesn’t erase the surplus. Meanwhile, the IEA has warned of a possible “super-glut”, a surplus of 3–4 mb/d, if OPEC+ and rivals continue adding more supply than demand can absorb.Persistent oversupply is expected to be the dominant theme, driven by strong output from OPEC+ and non-OPEC producers such as the U.S., Brazil, and Guyana. Inventory builds projected by the EIA and IEA reinforce the view that the market will struggle to absorb additional barrels, even as OPEC+ holds production steady in early 2026. Unless the group pivots to deeper cuts, the surplus bias will likely cap any sustained price rally.\nOn the demand side, growth remains modest, with the IEA projecting an increase of roughly 1.2 mb/d, concentrated in Asia. However, global economic uncertainty, slower-than-expected recovery in China, and cautious monetary policies in major economies are tempering the bullish sentiment. These factors, combined with high stock levels, suggest that demand alone will not be sufficient to tighten balances significantly. As a result, price movements will hinge more on supply discipline than on consumption trends."
            },
            {
                "title": "Trump signs order to protect Venezuelan oil revenue held in US accounts - Al Arabiya English",
                "source": "Al Arabiya English",
                "url": "https://english.alarabiya.net/News/united-states/2026/01/10/trump-signs-order-to-protect-venezuelan-oil-revenue-held-in-us-accounts",
                "body": "-\n-\n- Live\nTrump signs emergency order to protect US-held revenue from Venezuela oil\nUS President Donald Trump has signed an executive order protecting US-held money derived from sales of Venezuelan oil, after the ouster of Nicolas Maduro, the White House said.\nIn an order signed Friday, Trump - who has made clear that tapping Venezuela’s vast oil reserves was a key goal in the US ouster of Maduro - is acting “to advance US foreign policy objectives,” the White House said in a fact sheet accompanying the order.\nFor all the latest headlines, follow our Google News channel online or via the app.\nThe action follows a meeting Friday in Washington where Trump pressed top oil executives to invest in Venezuela, and was met with a cautious reception - with the chief executive of ExxonMobil describing the country as “uninvestable” without sweeping reforms.\nExxonMobil and ConocoPhillips exited in 2007 after refusing demands by then-president Hugo Chavez to cede majority control to the state. They have been fighting to recoup billions of dollars they say Venezuela owes them.\nChevron is currently the only US firm licensed to operate in Venezuela.\nTrump’s executive order signed Friday declares a national emergency “to safeguard Venezuelan oil revenue held in US Treasury accounts from attachment or judicial process,” the White House fact sheet said.\nIn effect, it places those revenues under special protection in order to prevent them from being seized by courts or creditors. The action is decreed to be necessary for US national security and foreign policy.\n“President Trump is preventing the seizure of Venezuelan oil revenue that could undermine critical US efforts to ensure economic and political stability in Venezuela,” the fact sheet said.\nSanctioned by Washington since 2019, Venezuela sits on about a fifth of the world’s oil reserves and was once a major crude supplier to the United States.\nBut it produced only around one percent of the world’s total crude output in 2024, according to OPEC, having been hampered by years of underinvestment, sanctions and embargoes.\nTrump sees the country’s massive oil reserves as a windfall in his fight to further lower US domestic fuel prices.\nThe executive order comes one week after US forces seized authoritarian leader Maduro in a nighttime operation in the Venezuelan capital that killed dozens of Venezuelan and Cuban security forces.\nRead more:\nTrump says US will deal with Greenland ‘easy way’ or ‘hard way’\nFour tankers that had left Venezuela in ‘dark mode’ are back in its waters\nNumber of prisoners released in Venezuela rises to 18, rights groups say"
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "2.755",
            "open": "56.376",
            "close": "58.391",
            "high": "58.761",
            "low": "56.006"
        },
        "market_summary": "### Spot WTI Crude Oil Market Briefing\n* **Key Drivers:** Geopolitical tensions, particularly in Iran and Venezuela, are influencing oil prices, while **supply exceeds demand**, leading to a market surplus.\n* **Price Action:** Currently trading near **$60**, with **bullish momentum** driven by escalating protests in Iran and optimism in the US economic outlook.\n* **Technical Outlook:** Immediate support is near **$57.50**, with resistance at **$62**. The **crude crack spread** is supportive of oil prices, encouraging refiners to boost their crude purchases.\n\n--- \n**Overall Sentiment:** Neutral",
        "source_articles": [
            {
                "title": "Trump's control over Venezuela's oil threatens OPEC's influence, Washington to own 30% of market - WSJ - Українські Національні Новини",
                "source": "Українські Національні Новини",
                "url": "https://unn.ua/en/news/trumps-control-over-venezuelas-oil-threatens-opecs-influence-washington-to-own-30percent-of-market-wsj",
                "body": "Trump's control over Venezuela's oil threatens OPEC's influence, Washington to own 30% of market - WSJ\nKyiv • UNN\nDonald Trump plans to resume oil production in Venezuela to lower global prices to $50 per barrel. This would allow the US to control about 30% of the world's raw materials market.\nDonald Trump's ambition to establish control over Venezuela's oil industry poses critical risks for the OPEC cartel. The US president's initiative to restore Venezuelan oil fields aims to lower global prices to $50 per barrel, which directly threatens the revenues of traditional oil exporters. This is stated in an article by The Wall Street Journal, writes UNN.\nDetails\nAccording to JPMorgan's estimates, the consolidation of US, Guyanese, and Venezuelan capacities will allow Washington to control about 30% of the global raw materials market.\nNew White House Strategy and Market Reaction\nTrump's inner circle is considering increasing Venezuela's oil production from the current 1 million to 3 million barrels per day within the next three years. This will require massive investments, but even the short-term expectation of increased supply is putting pressure on a market already suffering from an oil surplus.\nAgainst this backdrop, OPEC and Russia have already changed tactics. At a meeting on Sunday, January 11, the alliance members decided to suspend any increase in production during the first quarter of 2026 to prevent prices from falling further.\nPosition of Saudi Arabia and China\nSaudi Arabia maintains a wait-and-see approach, citing the critical state of Venezuelan infrastructure, the restoration of which will take years. At the same time, some OPEC members see potential benefits in Trump's actions: if the US cuts off Venezuelan oil supplies to China, Beijing will be forced to increase purchases from Persian Gulf countries.\nThis shift could give the US greater influence over oil markets, potentially keeping prices historically lower and altering the balance of power on the international stage.\nUS may lift some oil sanctions against Venezuela as early as next week11.01.26, 04:22 • 1168 views"
            },
            {
                "title": "Oil market dynamics: Factors that will drive prices in 2026 - The Economic Times",
                "source": "The Economic Times",
                "url": "https://economictimes.indiatimes.com/markets/commodities/news/oil-market-dynamics-factors-that-will-drive-prices-in-2026/articleshow/126461269.cms?from=mdr",
                "body": "Periodic geopolitical flare-ups (Israel–Iran in June, Russia–Ukraine infrastructure strikes) briefly supported crude oil prices, but the market’s structural surplus prevailed. As per the US Energy Information Administration data, implied stock builds in the previous year were among the largest since 2020.\nSupply exceeds demand\nCrude oil prices in 2025 were pressured by a confluence of supply-side and structural factors. OPEC+ began unwinding earlier production cuts, adding barrels to an already soft macroeconomic backdrop, while robust non-OPEC growth—led by U.S. output at record levels—further diluted any geopolitical risk premium. Tariff and sanctions adjustments by the U.S. toward Russia, Iran, and Venezuela shifted trade flows but failed to create lasting shortages, allowing inventories to swell.Meanwhile, China’s strong import activity largely fed strategic reserves rather than immediate consumption. This muted demand signals and cushioned sharper price declines. Adding to the imbalance, refined product inventories climbed faster than crude in several regions, compressing margins and weakening the pull on upstream demand.\nMaduro’s arrest possible impact\nOn January 3, 2026, U.S. forces captured Venezuelan President Nicolas Maduro, flying him and his wife to New York to face narco-terrorism and drug-trafficking charges, both pleaded not guilty. The episode jolted global oil politics because Venezuela—an OPEC founder with the world’s largest proven reserves—has been constrained by sanctions, underinvestment, and operational decay.Though the arrest may introduce political uncertainty, the immediate impact on global crude supplies remains limited. Venezuela currently produces just under 1 mb/d -less than 1% of global output- and ongoing U.S. sanctions and tanker blockades have already sharply constrained its exports.\nIn the short term, there may be modest supply disruption, but global inventories remain ample and projects a 3.8 mb/d surplus well into 2026. Brent oil almost unchanged and stabilized near $60–61, reflecting skepticism that political upheaval will translate into sustained supply shocks. In fact, the arrest may open doors for eventual U.S. and European investment.\nMaduro’s removal may introduce short-lived volatility, but structural oversupply and constrained Venezuelan capacity will likely neutralize any significant price spike. If political stabilization and investment unfold, Venezuela’s crude output may gradually increase, which may pressure oil prices in the medium term, but the path remains slow and uncertain.\nSupply – Demand dynamics\nForecasts diverge, but most agree on surplus conditions in 2026. The EIA expects production to exceed consumption, with global inventory builds of more than 2 mb/d on average. There is a forecast that OPEC+ will hold output steady into Q1’26, which helps limit volatility but doesn’t erase the surplus. Meanwhile, the IEA has warned of a possible “super-glut”, a surplus of 3–4 mb/d, if OPEC+ and rivals continue adding more supply than demand can absorb.Persistent oversupply is expected to be the dominant theme, driven by strong output from OPEC+ and non-OPEC producers such as the U.S., Brazil, and Guyana. Inventory builds projected by the EIA and IEA reinforce the view that the market will struggle to absorb additional barrels, even as OPEC+ holds production steady in early 2026. Unless the group pivots to deeper cuts, the surplus bias will likely cap any sustained price rally.\nOn the demand side, growth remains modest, with the IEA projecting an increase of roughly 1.2 mb/d, concentrated in Asia. However, global economic uncertainty, slower-than-expected recovery in China, and cautious monetary policies in major economies are tempering the bullish sentiment. These factors, combined with high stock levels, suggest that demand alone will not be sufficient to tighten balances significantly. As a result, price movements will hinge more on supply discipline than on consumption trends."
            },
            {
                "title": "Palmetto Grain Brokerage - - Palmetto Grain Brokerage",
                "source": "Palmetto Grain Brokerage",
                "url": "https://www.palmettograin.com/news/story/36970764/crude-rallies-as-iranian-protests-escalate",
                "body": "Crude Rallies as Iranian Protests Escalate\nFebruary WTI crude oil (CLG26) today is up +1.79 (+3.10%), and February RBOB gasoline (RBG26) is up +0.0352 (+2.00%).\nCrude oil and gasoline prices are up sharply today, posting 1-month highs. Rising tensions in Iran, the fourth-largest producer in OPEC, are supporting crude prices as protests against the government escalate. Also, optimism in the US economic outlook is supportive for energy demand and crude prices after the US Dec unemployment rate fell and Jan consumer sentiment increased. Crude prices are moving higher today despite a rally in the dollar index to a 4-week high.\nUnrest in Iran is boosting crude prices after the Iranian government said \"rioters\" who damage public property or clash with security forces will face the death penalty. President Trump warned the country's regime would \"pay hell\" if protesters were killed. Iran produces more than 3 million bpd, and its crude production could be disrupted if the protests against the government worsen.\nSigns of strength in the US economy are supportive for energy demand and crude prices. The Dec unemployment rate fell -0.1 to 4.4%, showing a stronger labor market than expectations of 4.5%. Also, the University of Michigan US Jan consumer sentiment index rose +1.1 to 54.0, stronger than expectations of 53.5.\nStrength in the crude crack spread is supportive of oil prices, as the crack spread rose to a 3-week high today. The increase in the crack spread encourages refiners to boost their crude purchases and refine the crude into gasoline and distillates.\nThe upcoming annual rebalancing of commodity indexes will see buying of oil contracts, a bullish factor for crude. Citigroup projects that the BCOM and S&P GSCI indexes, the two largest commodity indexes, will see inflows of $2.2 billion in futures contracts over the next week to rebalance the indexes.\nConcerns about energy demand are negative for crude prices after Saudi Arabia on Monday cut the price of its Arab Light crude for February delivery to customers for a third month.\nMorgan Stanley predicted that a global oil market surplus is likely to expand further and peak mid-year, pressuring prices, as it cut its crude price forecast for Q1 to $57.50/bbl from a prior forecast of $60/bbl, and cut its Q2 crude price forecast to $55/bbl from $60/bbl.\nVortexa reported Monday that crude oil stored on tankers that have been stationary for at least 7 days fell -3.4% w/w to 119.35 million bbl in the week ended January 2.\nStrength in Chinese crude demand is supportive for prices. According to Kpler data, China's crude imports in December are set to increase by 10% m/m to a record 12.2 million bpd as it rebuilds its crude inventories.\nCrude garnered support after OPEC+ on Sunday said it would stick to its plan to pause production increases in Q1 of 2026. OPEC+ at its November 2025 meeting announced that members would raise production by +137,000 bpd in December, but will then pause the production hikes in Q1-2026 due to the emerging global oil surplus. The IEA in mid-October forecasted a record global oil surplus of 4.0 million bpd for 2026. OPEC+ is trying to restore all of the 2.2 million bpd production cut it made in early 2024, but still has another 1.2 million bpd of production left to restore. OPEC's December crude production rose by +40,000 bpd to 29.03 million bpd.\nUkrainian drone and missile attacks have targeted at least 28 Russian refineries over the past four months, limiting Russia's crude oil export capabilities and reducing global oil supplies. Also, since the end of November, Ukraine has ramped up attacks on Russian tankers, with at least six tankers attacked by drones and missiles in the Baltic Sea. In addition, new US and EU sanctions on Russian oil companies, infrastructure, and tankers have curbed Russian oil exports.\nLast month, the IEA projected that the world crude surplus will widen to a record 3.815 million bpd in 2026 from a 4-year high of over 2.0 million bpd i"
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0040",
            "open": "1.1673",
            "close": "1.1657",
            "high": "1.1683",
            "low": "1.1642"
        },
        "market_summary": "### EUR/USD Market Briefing\n* **Key Drivers:** The **US dollar's strength**, fueled by a stable job market and steady yields, continues to pressure the **EUR/USD** pair, despite improved Eurozone data. The **Federal Reserve's** potential to maintain current policy due to stable labor market indicators and **inflation concerns** also contributes to the dollar's strength.\n* **Price Action:** The **EUR/USD** pair has broken below the **1.1680** hurdle, extending its **bearish** momentum, with prices now trading around **1.1630**. The pair has lost approximately **0.7%** over the week, indicating a clear downside bias.\n* **Technical Outlook:** Immediate support for **EUR/USD** is near the **1.1620-1.1600** zone, a critical demand area. If this zone breaks clearly, it could lead to deeper losses, potentially targeting **1.1500**. Resistance is noted at **1.1680**, and a move back above this level would be needed to ease immediate **bearish pressure**.\n\n--- \n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "EUR/USD Weekly Forecast: Dollar Strength Keeps Euro Under Pressure as Key Inflation Data Loom - Forex Crunch",
                "source": "Forex Crunch",
                "url": "https://www.forexcrunch.com/blog/2026/01/10/eur-usd-weekly-forecast-dollar-strength-keeps-euro-under-pressure-as-key-inflation-data-loom/",
                "body": "- The EUR/USD weekly forecast remains tilted to the downside, as US data shows resilience and fading odds of a January rate cut by the Fed.\n- Markets ignored the improved Eurozone data, maintaining the selling pressure.\n- Technically, the EUR/USD price needs to overcome the 1.1680 hurdle to relieve the selling pressure.\nThe EUR/USD pair struggled throughout the week, losing approximately 0.7%. Although there were some positive data points from the Eurozone, the pair struggled to gain ground due to the US dollar’s strength as the job market remained stable and yields were steady.\n–Are you interested in learning more about forex tools? Check our detailed guide-\nThe US NFP report was the most significant event of the week. The headline job growth of 50,000 was disappointing, but the other details told a more balanced story. The unemployment rate dropped to 4.4%, and wage growth accelerated, which supports the idea that the underlying labor market remains stable. This combination helped to fade expectations of a quick change in Federal Reserve policy, keeping the dollar strong.\nEarlier this week, US data sent mixed signals. Some housing indicators showed signs of slowing down, but consumer sentiment surprised, which helped keep risk appetite stable and prevent the dollar from falling sharply. Richmond Fed President Tom Barkin also sounded cautious, saying that job growth is slow but steady and that inflation progress is likely to stay sluggish. That message made it clear that rates will remain unchanged for now.\nThe markets mostly ignored data from the Eurozone. Retail sales increased 2.3% YoY and 0.2% MoM, which was significantly better than expected. The same happened with German industrial production. However, these positive developments could not benefit the euro, as traders were more concerned with the impact of policy changes than with reviewing past growth data. The euro didn’t have an apparent reason to stop declining, as the ECB’s guidance was still mostly neutral.\nNext week’s outlook for EUR/USD remains cautious. Inflation signals and central bank communication are likely to have a significant effect on the markets.\nEUR/USD Major Events Next Week:\n- Sentix Investor Confidence\n- ECB policymakers’ commentaries\n- US CPI and PPI inflation\n- US retail sales and weekly jobless claims\nIf US inflation remains high, the dollar could strengthen, pushing EUR/USD below the 1.1600 level. If inflation data comes in lower or the Fed shows more caution, the EUR/USD pair could stabilize. However, unless US data clearly disappoints, any recovery is likely to remain limited.\nEUR/USD Weekly Technical Forecast: Bearish Below 1.1680\nThe daily chart for the EUR/USD indicates the pair staying under pressure, with prices trading below all major moving averages. The pair has pulled back from the late-December highs near 1.1800 and is now holding steady around 1.1630. The 20-, 50-, 100-, and 200-period MAs are stacked in a bearish manner, adding to the short-term negative bias.\nMomentum indicators also show signs of weakness. The RSI is close to the oversold region below 35, indicating that bearish momentum remains strong. However, selling pressure could start to slow down near key support. Recent attempts to recover have been feeble, suggesting a limited demand for dips thus far.\nFrom a structural perspective, the price is testing a clear demand zone between 1.1620 and 1.1600. If this area breaks clearly, it could lead to deeper losses. On the contrary, if it holds steady, the pair could start a corrective rebound.\n–Are you interested in learning more about the best crypto exchange? Check our detailed guide-\nKey Support Levels:\n- 1620–1.1600\n- 1550\nKey Resistance Levels:\n- 1660–1680\n- 1720\nA move back above 1.1680 would be needed to ease immediate bearish pressure.\nLooking to trade forex now? Invest at eToro!\n68% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the hig"
            },
            {
                "title": "EUR/USD Price Forecast - Eur Slides Toward 1.16 Support as Dollar Jumps on 4.4% Jobs Data - TradingNEWS",
                "source": "TradingNEWS",
                "url": "https://www.tradingnews.com/news/eur-usd-price-forecast-eur-near-116-dollar-strengthand-4-percent-unemployment",
                "body": "EUR/USD Price Forecast - Eur Near 1.16: Dollar Strength And 4.4% Unemployment Put 1.1598 Support In Play\nEuro drops more than 1.6% from the 1.1747 peak as DXY pushes toward 100; traders focus on the 1.1615–1.1598 zone and upcoming US CPI to see if EUR/USD extends toward 1.1500 or squeezes back toward 1.17.\nEUR/USD: Pressure Builds Near 1.16 As Dollar Regains Control\nCurrent EUR/USD Trading Zone And Immediate Pressure\nEUR/USD has unwound more than 1.6% from the December peak around 1.1747–1.1775 and now trades heavy in the 1.16–1.17 band. The pair has logged nine down sessions out of the last eleven and two consecutive negative weeks, which is not noise but a meaningful correction from the late-year breakout. On the dollar side, the December Non-Farm Payrolls report showed 50,000 new jobs versus expectations of 60,000, but the unemployment rate fell from 4.5% (revised from 4.6%) to 4.4%. That single line item was enough to support the greenback because it reinforces the “still-tight” labor narrative and keeps the Federal Reserve under less pressure to rush into aggressive cuts. The U.S. Dollar Index has pushed through the 98.85–99.00 resistance band and opened room toward 100.25–100.40, while U.S. 2-year yields trade above roughly 3.5% and 10-year yields above 4.15%. Against that backdrop, EUR/USD naturally trades on the back foot despite a slightly better-than-expected euro area retail sales print at +0.2% month-on-month versus +0.1% forecast. The euro has domestic support, but the cleaner impulse right now comes from the U.S. side.\nRead More\n-\nVOO ETF At $638 With The S&P 500 At 6,966: How Jobs Data, $37.6T U.S. Debt And Trump’s $1.5T Defense Plan Hit The ETF\n10.01.2026 · TradingNEWS ArchiveStocks\n-\nXRP ETFs XRPI, XRPR and Bitwise XRP Hold $1.47B as XRP-USD Price Hovers Near $2\n10.01.2026 · TradingNEWS ArchiveCrypto\n-\nNatural Gas Price Forecast: NG=F Near $3.13 As Warm Winter Smashes The Winter Premium\n10.01.2026 · TradingNEWS ArchiveCommodities\n-\nUSD/JPY Price Forecast: Dollar Near 158 As Fed Hold Bets Grow And BoJ Stays Cautious, 161.94 High Back In Play\n10.01.2026 · TradingNEWS ArchiveForex\nWeekly EUR/USD Structure And Major Levels\nOn the weekly chart, EUR/USD broke higher in December after defending the early-month line in the sand near 1.1589. From the November low, the pair rallied almost 3% before stalling exactly at the 1.1747–1.1775 resistance cluster. That band is defined by the 2025 high-week close, the 61.8% retracement of the September decline, and the 2025 high daily close. Price then spent roughly four weeks failing to clear this ceiling, turning it into a clear distribution zone. The subsequent decline has dragged spot down toward initial weekly support at 1.1598, which is the 61.8% retracement of the November advance and also where a key internal trendline (“75% parallel”) converges over the next few weeks. As long as EUR/USD holds 1.1598 on a weekly closing basis, the move can still be classified as a standard pullback within a broader up-leg. A clean weekly close below 1.1598 would confirm that a more significant high has been set at 1.1747–1.1775 and would reframe this move as the start of a broader down phase.\nDownside Grid: 1.1598, 1.1500, 1.1394 And 1.1254\nIf EUR/USD loses 1.1598, the next technical magnet is the 1.1497–1.1505 band, which blends the 78.6% retracement of the July rally with the March 2020 and March 2022 highs. A break of that area exposes 1.1394, the April high close that acts as the final line separating a controlled retracement from a full reset of the 2025 advance. Beneath 1.1394 sits a deeper structural pivot at 1.1254–1.1276, combining the 38.2% retracement of the 2025 range with the 2023 swing high. If price ever trades and holds below that zone, the current bullish phase in EUR/USD is effectively cancelled and the market returns to a broad, choppy range with a heavier bearish bias. In other words, 1.1598 is the first decision point, 1.1497–1.1505 is the confirmation of a more aggr"
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0050",
            "open": "1.3455",
            "close": "1.3438",
            "high": "1.3465",
            "low": "1.3415"
        },
        "market_summary": "### GBP/USD Market Briefing\n\n* **Key Drivers:** The **US dollar** is gaining strength due to **better-than-expected US economic data**, such as the **ISM Services PMI** and **ADP Employment Report**, which has lifted expectations for the **Federal Reserve** to keep interest rates unchanged.\n* **Price Action:** The **GBP/USD** pair has fallen below the **1.3450** level, showing significant **bearish momentum**, and is currently trading near the critical **1.3400** zone, with a potential downside risk toward **1.3350**.\n* **Technical Outlook:** The **100-day MA** and **200-day MA** are key levels to watch, with the price holding near the **1.3400** demand zone, and a breakout could push the price further lower towards the **1.3350** level, while finding support around **1.3400** could push the price higher to test the **1.3450** resistance.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "GBP/USD Weekly Forecast: Extends Weakness Amid Resilient US Data - Forex Crunch",
                "source": "Forex Crunch",
                "url": "https://www.forexcrunch.com/blog/2026/01/10/gbp-usd-weekly-forecast-extends-weakness-amid-resilient-us-data/",
                "body": "- The GBP/USD weekly forecast edges lower as the US dollar gains on upbeat economic data.\n- US services PMI and employment data revealed sufficient resilience to lift the dollar.\n- The coming week’s US CPI, PPI, and UK GDP are the events to watch.\nGBP/USD fell last week as a string of better-than-expected US economic data indicated the dollar was strong and pushed back expectations for Federal Reserve rate cuts in the near future. The pair fell after failing to maintain its early-week gains. US services and labor data, not any UK developments, drove the move.\n–Are you interested in learning more about forex tools? Check our detailed guide-\nThe first pressure arose when the US ISM Services PMI came in higher than expected, indicating that the services sector is still growing despite high interest rates. The new orders and prices paid for parts stayed the same, which supports the idea that inflation risks in the service economy are still high. This helped the dollar and pushed US Treasury yields higher, which in turn pushed the GBP/USD down.\nThe ADP Employment Report, released mid-week, showed that hiring in the private sector remained stronger than expected. The data made markets less likely to expect aggressive easing and more likely to want the dollar ahead of Friday’s jobs report, even though it isn’t always a good predictor of official payrolls.\nFollowing Friday’s Nonfarm Payrolls report, which showed that job growth remained strong and unemployment was lower than expected, the GBP/USD pair fell even faster. Wage growth also remained strong, which alleviated concerns about a rapid decline in the job market. The data made it less likely that the Fed would cut rates early, which helped the dollar end the week strong and put sterling on the defensive.\nThe market’s direction next week will hinge on whether the new data on inflation and activity reinforce the notion of a robust US economy or pave the way for earlier policy easing.\nGBP/USD Major Events Next Week:\n- The US CPI inflation report will show whether price pressures are easing or staying the same\n- US PPI data, which shows how inflation is changing upstream\n- US retail sales, to gauge consumer demand\n- Weekly unemployment claims for unemployment benefits in the US provide insight into the job market in the near future.\n- UK GDP numbers, which could change expectations about the Bank of England’s policy outlook\nIf US inflation or consumer data worsens, the dollar will likely remain strong, and the GBP/USD will remain under pressure. On the other hand, lower prices or spending, along with weak UK GDP risks, could alter the market’s direction and allow sterling to stabilize or bounce back.\nGBP/USD Weekly Technical Forecast: Critical Demand Zone at 1.3400\nThe daily chart for GBP/USD suggests a strong bearish momentum after falling below the 100-day MA with a bearish crossover of 20- and 50-day MAs. However, the price holds near the demand zone at 1.3400, while a breakout could push the price further lower towards the 200-day MA at 1.3350.\n–Are you interested in learning more about the best crypto exchange? Check our detailed guide-\nAlternatively, finding adequate buying around 1.3400 could push the price higher to test the confluence of 20- and 100-day MAs around 1.3450 ahead of 1.3500.\nLooking to trade forex now? Invest at eToro!\n68% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money."
            },
            {
                "title": "Dollar Strengthens as Jobs Miss and Fed Pause Odds Rise - prismedia.ai",
                "source": "prismedia.ai",
                "url": "https://www.prismedia.ai/news/dollar-strengthens-as-jobs-miss-and-fed-pause-odds-rise",
                "body": "Dollar Strengthens as Jobs Miss and Fed Pause Odds Rise\nThe U.S. dollar gained on Jan. 9 and was poised for a second consecutive weekly rise after December payrolls came in weaker than expected, even as the unemployment rate \"ticked down.\" Markets are parsing the mixed labor picture alongside growing odds the Federal Reserve will hold rates and a pending Supreme Court decision on presidential tariff powers that could unsettle trade flows and FX volatility.\nThe dollar rallied on Jan. 9 after U.S. labor-market data showed payrolls disappointed while the unemployment rate \"ticked down,\" reinforcing market expectations that the Federal Reserve will keep interest rates unchanged at its late-January meeting. The dollar index rose to about 98.883 in early Asian trade and later climbed toward the 99 area, reaching roughly 99.15 as the greenback extended gains across major currencies. The move positioned the currency to record a second straight weekly advance.\nLabor Department figures showed nonfarm payrolls increased by 50,000 in December, below consensus estimates near 60,000. Weekly initial jobless claims were around 208,000 and announced job cuts fell to 35,553 in December, the lowest monthly total since July 2024. Market participants parsed the soft payroll print as noisy rather than definitive: Steve Englander, head of global G10 FX research at Standard Chartered, highlighted that the standard error for nonfarm payrolls is about 20,000 and suggested markets may not overreact to the headline miss.\nTraders moved quickly to price the monetary-policy implications. Fed-funds futures implied roughly an 89 percent probability that the Fed will hold rates at its Jan. 27-28 meeting, up from about 68 percent a month earlier. That shift in expectations has supported the dollar by reducing near-term prospects for further policy tightening and reinforcing a premium on U.S. safe-haven assets as investors weigh the timing of eventual rate cuts later in the year.\nAcross spot markets, USD/JPY traded around the mid-150s, quoted near 156.9 in early Asian trade and reported nearer 158 at times, while EUR/USD sat around $1.1633 and GBP/USD near $1.3403. The offshore yuan changed little around 6.98 per dollar, USD/CAD was about C$1.39 and USD/CHF near 0.801-0.802. Commodity-linked currencies underperformed, with AUD/USD at roughly $0.6675. Bitcoin was trading near $91,300.\nBeyond labor data and Fed pricing, markets marked a high-stakes legal variable: the Supreme Court is considering whether the president can use the International Emergency Economic Powers Act to impose tariffs without congressional approval. A ruling against that authority could complicate U.S. trade policy, upend negotiations and potentially prompt companies and customs brokers to seek as much as $150 billion in refunds for duties already collected. Timing of a decision remained uncertain, leaving firms and markets on alert for an outcome that could materially affect trade flows and FX volatility.\nGlobal developments added nuance. Japanese household spending surprised to the upside for November and the Bank of Japan has tightened policy, with Governor Kazuo Ueda saying \"the central bank would continue raising borrowing costs if economic and price developments moved in line with its forecasts.\" Chinese inflation data due this week and signs of easing inflation in Europe are additional near-term catalysts.\nIn the coming days, markets will track follow-up U.S. labor and inflation releases, any Supreme Court statement or ruling, and further shifts in Fed-rate pricing. Together, those data and policy events will determine whether the dollar's recent strength endures or reverses as investors recalibrate growth, inflation and policy risk.\nSources:\nKnow something we missed? Have a correction or additional information?\nSubmit a Tip"
            },
            {
                "title": "GBP/USD Price Forecast - Pound Near 1.34 as Strong US Data Lifts Dollar Ahead of US CPI & UK GDP - TradingNEWS",
                "source": "TradingNEWS",
                "url": "https://www.tradingnews.com/news/gbp-usd-price-forecast-pound-slides-toward-1-34",
                "body": "GBP/USD Price Forecast - Pound Slides Toward 1.34 Floor as Hot US Data and Fed–BoE Gap Hit Sterling\nSterling trades near 1.3420 with downside risk toward 1.3350 as stronger US jobs, sticky services inflation and key US CPI and UK GDP releases dictate the next move | That's TradingNEWS\nGBP/USD: Dollar Strength Pins Sterling Near 1.34 as Fed–BoE Divergence Widens\nUS Data Rebuilds Support Under the USD and Pressures GBP/USD\nGBP/USD is trading around 1.3420, very close to its weekly low and the critical 1.3400 zone, after failing to hold early-week gains toward 1.3567, where a clear short-term top formed before a sharp reversal. The latest leg down is driven almost entirely by USD strength. A run of stronger-than-expected US data has reset Fed expectations and pushed the US Dollar Index (DXY) back to a four-week high around 99.00, while GBP has offered little resistance. The US side delivered a series of upside surprises: ISM Services PMI beat expectations, confirming ongoing expansion in the US services sector, with new orders and prices paid still elevated – a combination that keeps services inflation sticky. The ADP report showed private-sector hiring stronger than forecast, reinforcing the notion that labor demand is still resilient. Across the official labor data, one recent Nonfarm Payrolls print showed a headline gain of 50,000 versus 60,000 expected, but the unemployment rate fell to 4.4% from 4.5%, and average hourly earnings rose 3.8% year-on-year versus 3.6% expected. Another major jobs release highlighted 210,000 new jobs, underscoring how noisy but persistently firm the US labor market remains. The result is simple: markets have scaled back expectations for near-term Fed cuts. The probability of a March cut has dropped from above 70% to roughly 40%, US yields have moved higher, and the USD has repriced up across the board. That macro repricing is what pulled GBP/USD off 1.3567 and drove it into the 1.34 handle.\nBoE Under Pressure as UK Data and Inflation Undermine Sterling\nOn the UK side, the story is the opposite. UK inflation has cooled to around 2.5%, just above the BoE’s 2% target, while the growth profile remains fragile. The upcoming UK GDP print will be watched closely, but unless it comes in significantly above expectations it only reinforces a familiar narrative: the BoE is under pressure to cut earlier than the Fed. That policy divergence – a Fed delayed by strong data versus a BoE dragged toward easing – is a structural headwind for GBP/USD. Markets already see UK as the weaker macro leg in the pair: softer inflation, lacklustre growth and fiscal concerns keep UK asset risk premia higher than the US. That is why, despite no major UK shock last week, GBP/USD has traded as a passenger to the US side and slid from above 1.35 to the 1.34 area.\nDXY, Cross-Market Risk Tone and Why GBP Is the Weak Side\nThe broader USD backdrop reinforces the downside bias in GBP/USD. The US Dollar Index found strong support at a key Fibonacci level near 97.94, then built an ascending triangle from the Christmas lows and broke higher as the latest data hit. The break above the 98.85–99.00 resistance band has opened the way toward the heavy 100.00–100.22 resistance zone. As long as DXY trades above 98.85, the dollar has the technical and macro justification to stay bid. Cross-asset signals are risk-off: Gold trades around $4,500, a very high level given a firmer dollar and rising US yields, which confirms strong hedging and fear in the system. Crypto has rolled over, with Bitcoin struggling to sustain levels below $90,000, and the institutional appetite for high-beta risk is clearly fading. In that environment, high-beta currencies like GBP are naturally weaker against a defensive USD, and GBP/USD becomes a preferred short on any rallies rather than a buy on dips.\nShort-Term Structure in GBP/USD: From 1.3567 Top to the 1.3400–1.3360 Support Band\nTechnically, the short-term picture in GBP/USD is clearly bearish. Price rejected 1.3567"
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0044",
            "open": "0.6719",
            "close": "0.6697",
            "high": "0.6725",
            "low": "0.6681"
        },
        "market_summary": "### AUD/USD Market Briefing\n* **Key Drivers:** The Australian dollar surged to a **14-month high** against the US dollar, reaching **US67¢**, driven by improving economic conditions and a slight weakening of the US dollar.\n* **Price Action:** The AUD/USD pair broke out of its **US65-67¢** range, where it had been trading for **9 months**, showing signs of **bullish momentum**.\n* **Technical Outlook:** Immediate support is near the **US65¢** level, with resistance at **US68¢**, a critical level that could determine the pair's next direction.\n--- \n**Overall Sentiment:** Positive 📈",
        "source_articles": [
            {
                "title": "The $A doldrums are finally ending (but don’t get your passport out yet) - AFR",
                "source": "AFR",
                "url": "https://www.afr.com/policy/economy/the-a-doldrums-are-finally-ending-but-don-t-get-your-passport-out-yet-20260105-p5nrr3",
                "body": "The Australian dollar hit a 14-month high against the US dollar on Tuesday when it cracked US67¢. But holidaymakers would be forgiven for being disappointed by the development.\nDespite its improvement from a low of US61¢ in January last year, the Aussie, as the currency is known in market circles, has traded stubbornly in the US65-67¢ range for nine months.\nLoading..."
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "0.6110",
            "open": "156.7280",
            "close": "156.8480",
            "high": "157.0660",
            "low": "156.4550"
        },
        "market_summary": "### USD/JPY Market Briefing\n* **Key Drivers:** The **hawkish** stance of the Federal Reserve, combined with a cautious Bank of Japan, is driving the **bullish momentum** in USD/JPY, with the dollar pushing near **158**.\n* **Price Action:** The pair has broken through **157.88**, extending the recovery leg that started from the **142.66–145.47** region, with the current swing working toward a Fibonacci projection at **158.80**.\n* **Technical Outlook:** Immediate support is near the **156.10** level, with resistance at **158.80**, and a sustained break of **158.80** opening the way to the **200%** projection near **161.95**, essentially a retest of the **161.94** peak, with the ultimate target at **176.55**. --- \n**Overall Sentiment:** Positive 🚀",
        "source_articles": [
            {
                "title": "USD/JPY Price Forecast: Dollar Near 158 As Fed Hold Bets Grow And BoJ Stays Cautious, 161.94 High Back In Play - TradingNEWS",
                "source": "TradingNEWS",
                "url": "https://www.tradingnews.com/news/usdjpy-price-forecast-dollar-near-158-fed-hold-best-grow-and-boj-stays-cautios",
                "body": "USD/JPY Price Structure: From 139.87 Reset Back Toward 158.80\nThe USD/JPY structure is back in clear upside mode after the correction from the 161.94 high washed out to 139.87 and stalled. That three-wave drop down to 139.87 looks completed, and the pair has now pushed back through 157.88, extending the recovery leg that started from the 142.66–145.47 region. The current swing is working toward a Fibonacci projection at 158.80, defined as the 161.8% extension of the 142.66 → 150.90 rally measured from 145.47. As long as price holds above the near-term support band around 156.10, the market is treating this as a trend continuation phase rather than a topping pattern. A sustained break of 158.80 opens the way to the 200% projection near 161.95, essentially a retest of the 161.94 peak. The message from price is straightforward: the correction from 161.94 to 139.87 is likely over, and the larger uptrend from 102.58 is trying to reassert itself through the 158–162 zone.\nMulti-Timeframe Trend: Long-Term Uptrend From 75.56 And 102.58 Still Favors Dollar Strength\nOn the higher timeframes, USD/JPY is still riding a secular bull market that began at 75.56 in 2011 and was reinforced by the 102.58 low in 2020. The advance off 102.58 into 161.94 created a powerful primary up leg. The subsequent drop to 139.87 fits as a corrective phase within that bigger structure, not a full trend reversal. If the market pushes decisively through 158.85–161.94, the technical roadmap starts pointing to the next major projection zone near 176.55, calculated as the 61.8% extension of the 102.58 → 161.94 move, measured from 139.87. That level is a medium-term concept rather than an immediate target, but it explains why dip-buyers have been so aggressive above 140 and why every pullback toward the mid-150s is being treated as opportunity rather than danger. From a structural point of view, the bullish thesis only starts to erode if USD/JPY breaks back below the 154.38–154.30 region and turns the recent range into another leg of a wider consolidation instead of a launchpad.\nUSD/JPY And NFP: Four-Day Dollar Run As Labor Data Keeps Fed In “Hold” Mode\nThe latest U.S. jobs report reinforced the dollar side of USD/JPY. Non-farm payrolls for December printed around 50,000, softer than the 66,000 consensus, but not weak enough to signal acute labor stress or force immediate rate cuts. The market read this as “slower but still functional” employment rather than the start of a recessionary slide. Rate expectations adjusted accordingly. The probability of the Federal Reserve holding rates unchanged at the January 28 meeting is now above 95%, and the odds of no move in March stand near 70.9%, with April still showing a majority leaning toward a neutral stance rather than rapid easing. That repricing has pushed the dollar higher against the yen, driving a four-session winning streak in USD/JPY and a short-term gain of more than 1%, with spot back above 157. The DXY index has climbed above 99 and is probing the psychological 100 area, confirming that flows are rotating back toward U.S. assets rather than away from them. For USD/JPY, this combination—labor that is cooling but not collapsing and a central bank comfortable staying on hold—keeps the interest-rate spread firmly in favor of the dollar.\nRate Differentials And DXY: Why The Dollar Leg Of USD/JPY Still Has The Initiative\nThe backdrop across U.S. macro data continues to justify higher-for-longer expectations. A prior 6.4% monthly rebound in building permits, after a −3.7% reading, hinted early that the housing slowdown was stabilizing instead of spiraling. Real activity data into late 2025 then confirmed that the economy had more momentum than bears were pricing, with growth revised up to around 4.3% annualized in Q3 against earlier expectations near 3.3%. That kind of upside revision makes it difficult for the Fed to pivot quickly into a cutting cycle. Markets have already shifted from aggressively discounting multip"
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0038",
            "open": "1.3854",
            "close": "1.3864",
            "high": "1.3888",
            "low": "1.3850"
        },
        "market_summary": "### USD/CAD Market Briefing\n\n* **Key Drivers:** The pair's strong rise suggests that the fall from **1.4139** has completed at **1.3641**, with the current rise seen as the third leg of the corrective pattern from **1.3538**.\n* **Price Action:** Broke above the key level of **1.3849**, showing **bullish momentum** with an initial bias on the upside for **1.4139** and potentially targeting **1.4242**.\n* **Technical Outlook:** Immediate support is near **1.3849**, with resistance at **1.4139**. A break below **1.3538** could target the **61.8% retracement** of **1.2005** to **1.4791** at **1.3069**.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "USD/CAD Weekly Outlook - Action Forex",
                "source": "Action Forex",
                "url": "https://www.actionforex.com/technical-outlook/usdcad-outlook/625243-usd-cad-weekly-outlook-441/",
                "body": "USD/CAD’s strong and accelerated rise last week suggests that fall from 1.4139has completed at 1.3641. rise from there is currently seen as the third leg of the corrective pattern from 1.3538. Initial bias stays on the upside this week for 1.4139 first. Break there will target 100% projection of 1.3538 to 1.4139 from 1.3641 at 1.4242. On the downside, below 1.3849 minor support will turn intraday bias neutral first.\nIn the bigger picture, price actions from 1.4791 are seen as a corrective pattern to the whole up trend from 1.2005 (2021 low). Deeper fall could be seen as the pattern extends, and break of 1.3538 will target 61.8% retracement of 1.2005 to 1.4791 at 1.3069. For now, medium term outlook will be neutral until there are signs that the correction has completed.\nIn the long term picture, rising 55 M EMA (now at 1.3567) remains intact. Thus, up trend from 0.9056 (2007 low) should still be in progress. However, considering bearish divergence condition M MACD, sustained trading below 55 M EMA will argue that the up trend has completed with five waves up to 1.4791, and turn medium term outlook bearish for correction to 38.2% retracement of 0.9056 to 1.4791 at 1.2600."
            },
            {
                "title": "(XEB) Trading Report (XEB:CA) - Stock Traders Daily",
                "source": "Stock Traders Daily",
                "url": "https://news.stocktradersdaily.com/canada/xeb-trading-report_20260111_57cd4a",
                "body": "(XEB) Trading Report\nTrading Plans (Long Term)\nBuy near 16.23, target n/a, stop loss @ 16.15\nNo Short plans offered at this time.\nCheck the time stamp on this data. Updated AI-Generated Signals for iShares J.P. Morgan USD Emerging Markets Bond Index ETF (CAD-Hedged) (XEB:CA) available here.\nXEB:CA Ratings for January 11:\nâ Triggers may have already come\nGet Real Time Triggers Here."
            },
            {
                "title": "Equities Weekly Outlook: US Q4 Banks Earnings, TSMC, Delta Air - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-ca/news-and-analysis/equities-weekly-outlook-us-q4-banks-earnings-tsmc-delta-air/?amp=true",
                "body": "Equities Weekly Outlook: US Q4 Banks Earnings, TSMC, Delta Air\nU.S. banks kick off earnings season this week with Q4 results from top lenders, including JPMorgan, Goldman Sachs, and Citigroup. According to FactSet, Q4 2025 S&P 500 earnings growth is expected at 8.3%, marking the tenth consecutive quarter of expansion.\n2025 was a strong year for U.S. financials, and earnings season is likely to be another positive catalyst for the sector, supported by a stronger-than-expected U.S. economy.\nU.S. GDP was upwardly revised, while consumer spending remained strong, inflation cooled, and concerns about a slowing labor market persisted. The strong growth is expected to support loan growth in Q4.\nInvestors will also be watching NIMs. The Fed cut rates three times in the last three meetings of the year. Rate cuts would usually exert downward pressure on NIMs; however, they also reduce liabilities by lowering interest paid on deposits.\nIn Q3, investment banking revenues continued their strong rebound, driven by rising dealmaking activity. IB fees will remain a key focus in Q4, given their influence on revenue growth in previous quarters.\nTrading activity is also likely to perform well in Q4, driven by increased market volatility, including a sharp decline in November amid concerns about the AI bubble, followed by record highs in December.\nJPMorgan reports on Tuesday, with Bank of America, Citigroup, and Wells Fargo on Wednesday. This is followed by Goldman Sachs and Morgan Stanley reporting on Thursday or before the opening bell.\nJP Morgan (Tuesday)\nJPMorgan’s share price is at a record high. Strength in its trading and investment banking segments drove strong Q3 results, which the company reported in October. While the share price initially fell 4%, it quickly pared those losses to less than 2% by the close.\nIn Q3, profit increased 16% to $5.07 EPS. Revenue rose 9% to $46.4 billion, with fixed income trading up 21% and equity trading up 33% to $33 billion. Investment banking also showed signs of growth, increasing 16%, and this area could see further growth in 2026, with IPO;s expected to see heightened activity.\nExpectations are for Q4 profits to increase 3% to $4.94 per share, with revenue up 7% to $ 46.2 billion.\nHow to trade JPM Q4 earnings\nThe share price has trended higher since the April low, forming a series of higher highs and higher lows, reaching a record high of 335 last week. The RSI supports further upside while it remains out of overbought territory.\nBuyers will look to rise above 335 to fresh record levels, bringing 350 into focus.\nSupport can be seen at 320, the January low, and November high. Below here, the rising trendline support at 310 comes into play ahead of 300, the December low.\nDelta Airlines (Tuesday)\nDelta Air Lines' share price is surging as the stock market anticipates stronger growth prospects for the airline group, which is typically cyclical.\nThe share price broke out of consolidation around the end of November, taking the stock up to record highs, where it remains.\nThe 18% decline in oil prices across 2025 also supported the stock.\nIn Q3 earnings, reported on October 9, the share price saw a significant day move but still rallied 4.3% after the company posted a 14% rise in quarterly profits and a 6% rise in revenue.\nMain cabin revenue dipped in the quarter. However, investors cheered an 8% increase in corporate revenue and a 9% rise in premium revenue, which includes first-class and economy seats.\nThe company is forecasting EPS of $1.60 to $1.90, with a midpoint of $1.75, above the $1.65 estimate.\nHow to trade DAL earnings\nAfter falling to a low of 34.40 in April, Delta Air Lines has trended higher, reaching a peak of 73.10. The price trades above its 50 and 200 SMA. The bearish RSI divergence could be a reason to be cautious.\nBuyers will look to push above 73.10 to fresh record highs, with 75 and 80 as the next levels to watch.\nSupport is at 68.90, the January low, with a break below here opening the "
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "0.8520",
            "open": "210.8660",
            "close": "210.8050",
            "high": "211.1500",
            "low": "210.2980"
        },
        "market_summary": "### GBP/JPY Market Briefing\n\n* **Key Drivers:** The pair is expected to continue its **bullish** momentum as long as the **210.02** support holds, with a potential target at the **61.8% projection** of **220.90**.\n* **Price Action:** Currently in a sideways consolidation below **212.13**, with a decisive break of **211.98** needed to extend the current up trend to **219.99**.\n* **Technical Outlook:** Immediate support is at **210.02**, with a break below this level potentially leading to a decline to the **55 D EMA** at **207.19**. Resistance is at **211.98**, with a break above this level extending the up trend.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "GBP/JPY Weekly Outlook - Action Forex",
                "source": "Action Forex",
                "url": "https://www.actionforex.com/technical-outlook/gbpjpy-outlook/625237-gbp-jpy-weekly-outlook-438/",
                "body": "GBP/JPY stayed in sideway consolidations below 212.13 last week. Initial bias stays neutral this week first, and further rally is in favor as long as 21.02 support holds. On the upside, decisive break of 61.8% projection of 184.35 to 205.30 from 199.04 at 211.98 will extend current up trend to 100% projection at 219.99 next. Nevertheless, firm break of 210.02 support should confirm short term topping. Deeper decline would be seen to 55 D EMA (now at 207.19) as a correction.\nIn the bigger picture, up trend from 123.94 (2020 low) is in progress. Next target is 61.8% projection of 148.93 (2022 low) to 208.09 (2024 high) from 184.35 at 220.90. On the downside, break of 205.30 resistance turned support is needed to indicate medium term topping. Otherwise, outlook will stay bullish even in case of deep pullback.\nIn the long term picture, up trend from 116.83 (2011 low) is resuming. Next target is 251.09 (2007 high). This will remain the favored case as long as 55 M EMA (now at 182.91) holds."
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "473.0000",
            "open": "90,457.0400",
            "close": "90,365.5000",
            "high": "90,690.5000",
            "low": "90,217.5000"
        },
        "market_summary": "### BTC/USD Market Briefing\n* **Key Drivers:** Strong institutional demand, **bullish** technical signals, and supportive macro conditions are driving the price of Bitcoin, with a potential move to **$150,000**.\n* **Price Action:** Currently trading near **$92,000**, with a recent decline of about **19.7%** over the past three months, but seeing **inflows** into ETFs like Bitwise's BITB, indicating a vote of confidence in the market.\n* **Technical Outlook:** Immediate support is near the current price level, with resistance at **$150,000**, and a potential decline to as low as **$40,000** if the four-year cycle model plays out, but **institutional adoption** and **regulatory clarity** are expected to support the price.\n\n--- \n**Overall Sentiment:** **Bullish** 🚀",
        "source_articles": [
            {
                "title": "Bitcoin Price Forecast 2026: Institutions, Halving Set Stage for $150K BTC Price - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/bitcoin-price-forecast-2026-institutions-halving-set-stage-for-150k-btc-price-1572107",
                "body": "Bitcoin heads into 2026 with strong institutional demand, supportive macro conditions, and bullish technical signals pointing toward a potential move to $150,000.\nBitcoin (BTC) is trading near $92,000 as markets digest a wave of institutional validation, including fresh Bitcoin-linked ETF filings from Morgan Stanley and MSCI’s decision to retain crypto-exposed companies in its flagship indexes.\nIn my view, this backdrop sets the stage for a renewed upside push toward $150,000 during 2026.\nIn this article, I’ll outline the macro backdrop, key levels, and the core scenarios shaping Bitcoin’s outlook for the year ahead.\nAmong the top arguments favoring a Bitcoin bull market in 2026 include the end of “four-year halving cycle,” US debt crises, favorable regulations, and a growing institutional adoption.\nFor most of Bitcoin’s history, prices followed a fairly predictable four-year rhythm tied to the halving, an event that cuts new BTC supply in half roughly every four years.\nHistorically, Bitcoin tended to peak about 12–18 months after a halving, followed by a sharp correction as speculative excess faded.\nThe April 2024 halving has followed a similar script so far.\nBitcoin experienced a post-cycle blow-off and subsequent correction, reinforcing the idea that the price may decline to as low as $40,000 if the four-year cycle model plays out as intended.\nNonetheless, such bearish setups have discounted positive fundamentals such as the ongoing BTC supply absorption by digital asset treasurys (DATS) and exchange-traded funds (ETF).\nHere’s some statistics to shed light on the matter. As of January 2026, all the US-based spot Bitcoin ETFs were collectively managing nearly 1.3 million BTC worth $117.86 billion, almost double since their debut two years ago.\nAt the same time, DATS have amassed over 1.09 million BTC (~$109.72 billion as of the time of writing) in the past five years. That includes accumulation even during BTC’s price dips, hinting at a long-term bullish scenario shared by these public firms.\nSuch a strong demand for Bitcoin didn’t exist during the previous four-year cycles. And it won’t pare back in 2026, as well, justifying a sustained uptrend toward the $150,000 price target by the year’s end.\nUS. monetary policy has turned notably more dovish than at prior Bitcoin cycle peaks.\nThe Federal Reserve delivered three interest-rate cuts in 2025, and CME FedWatch data shows bond traders pricing in up to two additional cuts in 2026.\nRates rose substantially in 2018 and 2022 bear cycles, hurting prices. The 2026 2026 Fed rate outlook contrasts with previous crypto bull-market tops, suggesting sufficient liquidity to pump riskier assets like Bitcoin.\nIn 2026, Bitcoin’s “store-of-value” narrative is being reinforced by fiscal conditions, increasing the odds of BTC price hitting $200,000.\nElevated public debt and longer-term currency debasement risks are keeping investor attention on scarce assets, including Bitcoin, as alternative monetary hedges.\nRising debt increases pressure on policymakers to manage financing costs, often by keeping interest rates lower for longer, tolerating higher inflation, or relying on financial repression.\nOver time, these policies tend to weaken the real purchasing power of fiat currencies. For instance, the US dollar index (DXY) closed 2025 at over a 9.50% loss under debt pressure, worsened further by Donald Trump’s seesaw economic policies.\nAs confidence in fiscal discipline erodes, capital gradually moves toward scarce alternatives such as gold—and, increasingly, Bitcoin—particularly among institutions seeking long-duration protection instead of cyclical exposure.\nThe regulatory path for Bitcoin and a broader crypto market has become clearer in the US. In my view, this further supports the case for a $150,000 BTC price by the year’s end.\nGrayscale’s 2023 court win against the US Securities and Exchange Commission (SEC) helped open the door for regulated spot products. The US then approved spot Bitcoin"
            },
            {
                "title": "Bitcoin ETF Buyers Step In as Prices Slide: Bitwise’s BITB Draws New Cash Amid Market Chill - TipRanks",
                "source": "TipRanks",
                "url": "https://www.tipranks.com/news/cryptocurrencies/bitcoin-etf-buyers-step-in-as-prices-slide-bitwises-bitb-draws-new-cash-amid-market-chill",
                "body": "Bitcoin Chill Deepens as Bitwise’s BITB Sees Fresh Inflows Despite Price Slump\nClaim 70% Off TipRanks Premium\n- Unlock hedge fund-level data and powerful investing tools for smarter, sharper decisions\n- Stay ahead of the market with the latest news and analysis and maximize your portfolio's potential\nThe Bitwise Bitcoin ETF Trust, ticker BITB, attracted a fresh $2,955,780 in net inflows on January 09, 2026, even as its underlying asset continues to struggle. The latest move represents roughly 0.08% of the fund’s $3.53 billion in assets under management (AUM), a modest but notable vote of confidence in a market still digesting steep Bitcoin losses.\nThe related asset, BTC-USD, is currently trading at $90,635.99, having shed about 19.7% over the past three months. Short-term sentiment remains fragile, with the 1-day technical signal flashing Sell, underscoring continued downside pressure in spot trading.\nYet the inflow into BITB hints at a different narrative among ETF investors: some appear willing to use the drawdown as an opportunity to add exposure through regulated vehicles rather than capitulate. While the flow is small in percentage terms relative to AUM, it suggests that institutional and sophisticated retail holders are still treating the recent weakness as cyclical rather than structural, positioning for a potential rebound once macro conditions or regulatory clarity improve.\nFor a more detailed analysis and real-time sentiment trends, check the live cryptocurrency prices here."
            },
            {
                "title": "Bitcoin ETF Outflows May Hit $1.2B This Month as Institutions Exit - CoinMarketCap",
                "source": "CoinMarketCap",
                "url": "https://coinmarketcap.com/academy/article/bitcoin-etf-outflows-may-hit-dollar12b-this-month-as-institutions-exit",
                "body": "Institutional investors have largely withdrawn during the summer months, creating sustained pressure on Bitcoin ETFs.\nBitcoin exchange-traded funds may eperience their second-largest monthly outflow in history, with approximately $1.2 billion leaving the market this August. Only February's massive $3.5 billion exodus surpassed current levels.\nInstitutional investors have largely withdrawn during the summer months, creating sustained pressure on Bitcoin ETFs. The funds have now recorded net outflows for five consecutive months, despite Ethereum continuing to attract fresh capital from investors.\nMatrixport analysts emphasize that while seasonal patterns explain some weakness, fund flow direction remains critical. They note that macroeconomic conditions and liquidity factors may still support Bitcoin, but recommend market participants maintain caution amid ongoing institutional retreat.\nThis article contains links to third-party websites or other content for information purposes only (“Third-Party Sites”). The Third-Party Sites are not under the control of CoinMarketCap, and CoinMarketCap is not responsible for the content of any Third-Party Site, including without limitation any link contained in a Third-Party Site, or any changes or updates to a Third-Party Site. CoinMarketCap is providing these links to you only as a convenience, and the inclusion of any link does not imply endorsement, approval or recommendation by CoinMarketCap of the site or any association with its operators. This article is intended to be used and must be used for informational purposes only. It is important to do your own research and analysis before making any material decisions related to any of the products or services described. This article is not intended as, and shall not be construed as, financial advice. The views and opinions expressed in this article are the author’s [company’s] own and do not necessarily reflect those of CoinMarketCap."
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "29.8500",
            "open": "3,082.4500",
            "close": "3,079.1500",
            "high": "3,098.1500",
            "low": "3,068.3000"
        },
        "market_summary": "### ETH/USD Market Briefing\n\n* **Key Drivers:** Proposed **Clarity Act** for crypto regulation and increased **institutional participation** with over **$35 billion** worth of ETH held in exchange-traded funds and strategic reserves.\n* **Price Action:** Shows **bullish momentum** with increased usage across the Ethereum network, driven by lower transaction costs and expanding infrastructure, but faces potential impact from the **Truebit hack** laundering **$26 million** in ETH.\n* **Technical Outlook:** Support is near the **$1,800** level, with resistance at **$2,000**, and potential for an **altseason** driven by Ethereum's price movements.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Key facts: Clarity Act proposed for crypto regulation; Ethereum sees shifts - TradingView — Track All Markets",
                "source": "TradingView — Track All Markets",
                "url": "https://www.tradingview.com/news/tradingview:7a4682c5df3f9:0-key-facts-clarity-act-proposed-for-crypto-regulation-ethereum-sees-shifts/",
                "body": "Key facts: Clarity Act proposed for crypto regulation; Ethereum sees shifts\nLess than 1 min read\n- The Clarity Act is proposed in Congress to create a regulatory framework for cryptocurrencies, seen as vital for institutional investment in digital assets like Ethereum.1\n- Ethereum's on-chain data shows a 47% drop in coins held for 1 week to 1 month and a 65% rise in those held for 1 day to 1 week, indicating increased short-term selling.2\n- Ethereum may drive an altseason, as past trends indicate large-cap tokens typically follow its price movements in a market with selective liquidity shifts.3"
            },
            {
                "title": "Ethereum Dominates 2025: DeFi TVL Tops $99B, Stablecoin Volume Hits $18.8T - CryptoPotato",
                "source": "CryptoPotato",
                "url": "https://cryptopotato.com/ethereum-dominates-2025-defi-tvl-tops-99b-stablecoin-volume-hits-18-8t/",
                "body": "Ethereum Dominates 2025: DeFi TVL Tops $99B, Stablecoin Volume Hits $18.8T\nEthereum reported strong growth across decentralized finance (DeFi) and stablecoin activity in 2025.\nThis was mainly because lower transaction costs and expanding infrastructure contributed to increased usage across the network.\nDeFi and Stablecoin Activity Increase\nIn a New Year’s post shared via X, the chain revealed that it recorded over $99 billion in total value locked during 2025, according to data from DefiLlama. This figure places Ethereum’s DeFi TVL at more than 9 times that of the next largest Layer 1 ecosystem. Stablecoin usage also remained high throughout the year, with $18.8 trillion settled on the network.\nThese figures coincided with a decline in transaction costs across the ecosystem. Fees on Ethereum Layer 1 fell to 5-year lows, while Layer 2 networks recorded transaction costs below $0.01, lowering expenses for payments, remittances, and savings-related activity. At the same time, expanded paymaster infrastructure enabled applications to cover the fees for users, often removing the need to hold ETH for gas.\nCrypto platforms also expanded their use of Ethereum during 2025. Robinhood, Gemini, and Kraken all launched tokenized stocks on the chain using Layer 1 and Layer 2 networks, therefore providing extended access to United States equities beyond standard market hours. Robinhood also announced plans to build its own Layer 2 network using Arbitrum’s Orbit technology.\nMeanwhile, regulatory clarity supported the launch of new crypto-focused neobanks, which introduced payment cards and rewards programs while reporting millions of dollars in daily spending volume.\nNetwork Upgrades and Ecosystem Expansion\nBeyond DeFi and stablecoins, Ethereum’s ecosystem continued to expand across institutional and technical fronts. Institutional participation increased through the expansion of ETH digital asset treasuries, with more than $35 billion worth of ETH held in exchange-traded funds and strategic reserves.\nYou may also like:\n- Truebit Suffers $26.5M Loss in First Major DeFi Hack of 2026\n- The Highway Analogy: Vitalik Buterin’s Plan to Scale Ethereum 1000x\n- CNBC Crowns XRP Hottest Crypto Trade of 2026 Over BTC and ETH: Here’s Why\nAdditionally, more institutions used Ethereum smart contracts to manage capital on-chain, access DeFi-based yield strategies, and distribute over $12 billion in real-world assets.\nThe network’s rollup-focused roadmap also progressed during the year. Combined throughput across Layer 2 networks reached an average of 5,600 transactions per second, while the Fusaka upgrade, deployed in December, increased blob capacity and reduced Layer 2 costs. The Layer 1 gas limit was also raised to 60 million, expanding settlement capacity by approximately 33%.\nEthereum celebrated 10 years of being live in July 2025, which was marked by a record of more than 88 million smart contracts deployed, while daily transactions reached a new high of 1.74 million. Developer activity also remained elevated, with 32,000 active developers across the ecosystem and over 16,000 new ones joining between January and September."
            },
            {
                "title": "Truebit hacker launders $26 million in ETH via Tornado Cash - Crypto Briefing",
                "source": "Crypto Briefing",
                "url": "https://cryptobriefing.com/truebit-hacker-launders-eth-via-tornado-cash/",
                "body": "Truebit hacker launders $26 million in ETH via Tornado Cash\nThe attack marks the first major incident targeting a DeFi protocol this year.\nKey Takeaways\n- The hacker behind the Truebit exploit fully laundered 8,535 ETH through Tornado Cash.\n- The Truebit team is coordinating with law enforcement and conducting a protocol review following the attack.\nShare this article\nThe Truebit hacker has laundered all 8,535 ETH stolen, valued at approximately $26 million, through Tornado Cash after exploiting a smart contract vulnerability in the Truebit Protocol on January 8, according to data tracked by Lookonchain.\nThe #Truebit hacker has deposited all 8,535 $ETH($26.44M) they stole into #TornadoCash and laundered it.https://t.co/nYUNcqv46vhttps://t.co/JLPKkMjkUP pic.twitter.com/0unM8sK3h5\n— Lookonchain (@lookonchain) January 11, 2026\nThe exploit marks the year’s first major DeFi breach. The attacker abused an integer overflow in a legacy smart contract to mint millions of TRU tokens at near-zero cost, then sold them back into the protocol to drain its liquidity.\nToday, we became aware of a security incident involving one or more malicious actors. The affected smart contract is 0x764C64b2A09b09Acb100B80d8c505Aa6a0302EF2 and we strongly advise the public not to interact with this contract until further notice. We are in contact with law…\n— Truebit (@Truebitprotocol) January 8, 2026\nThe attack crashed TRU by more than 99.9%, wiping out investor value.\nBlockchain security firms later linked the wallet to a prior Sparkle Protocol hack, suggesting a highly sophisticated actor.\nIn response, the Truebit team urged users to halt interactions with the compromised contract, engaged law enforcement, and launched a comprehensive review to assess potential recovery options."
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "1.4252",
            "open": "135.7912",
            "close": "135.5278",
            "high": "136.8067",
            "low": "135.3815"
        },
        "market_summary": "### SOL/USD Market Briefing\n\n* **Key Drivers:** Solana's ecosystem growth, including the surge of meme coin WhiteWhale and the launch of the SKR token, is increasing **bullish momentum**. Additionally, the urgent validator update v3.0.14 and plans for mainnet deployment of the Alpenglow upgrade are supporting **network reliability**.\n* **Price Action:** SOL traded near **$135.31**, posting a mild daily decline while maintaining a weekly gain above **2%**. The price shows near-term caution despite structural optimism, with **$187** emerging as a key resistance level ahead of February.\n* **Technical Outlook:** Immediate support is near the **$135–$138** demand zone, with resistance at **$260**. The weekly price compression within a symmetrical triangle suggests prolonged **accumulation**, and sustained strength above **$180** could unlock higher targets, including **$400** as a potential upside target.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Solana Ecosystem Meme Coin WhiteWhale Market Cap Surges Temporarily Past $2 Billion, Hits New All-Time High - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605140644",
                "body": "BlockBeats News, January 11th, according to GMGN market data, the Solana ecosystem meme coin WhiteWhale briefly surpassed a $200 million market cap, currently standing at $174 million, with a 24-hour trading volume exceeding $11.4 million and a 24-hour price increase of 47.38%."
            },
            {
                "title": "Solana Urges Validators to Install v3.0.14 Update as Analysts Eye $187 Before February - Coinpaper",
                "source": "Coinpaper",
                "url": "https://coinpaper.com/13667/solana-urges-validators-to-install-v3-0-14-update-as-analysts-eye-187-before-february",
                "body": "Solana has rolled out an urgent validator update, v3.0.14, now recommended for general use across Mainnet-Beta. The release targets both staked and unstaked validators, including test nodes, and signals the network’s continued focus on operational resilience.\nAccording to Solana Status, validators should apply the patch immediately to reduce exposure to potential disruptions. Consequently, the update reinforces Solana’s approach of deploying preventative fixes before issues affect users or applications.\nValidator Update Reinforces Network Reliability\nThe v3.0.14 release continues a pattern of rapid maintenance updates across Solana’s v3 validator client series. Besides addressing potential vulnerabilities, these patches aim to strengthen long-term performance and stability.\nDevelopers often push such updates quietly, ensuring validators install them before any network impact becomes visible. Hence, the absence of a detailed changelog aligns with Solana’s emphasis on proactive defense.\nAdditionally, rising on-chain activity has increased the importance of validator reliability. The recent launch of the SKR token highlights growing demand across DeFi, NFTs, and tokenized real-world assets.\nStable validator layer supports higher throughput and smoother user experiences. Consequently, the network continues prioritizing infrastructure hardening alongside ecosystem growth.\nMajor Upgrades Shape Solana’s Roadmap\nMoreover, Solana’s broader roadmap includes structural upgrades designed to address congestion and decentralization concerns. The Alpenglow upgrade, introduced in September 2025, replaced legacy consensus components with Votor and Rotor.\nThese changes target faster finality and parallel execution, improving scalability. The network plans mainnet deployment this year, expanding capacity for complex applications.\nSignificantly, the Firedancer validator client also plays a central role. Released in Q1 2025 by Jump Crypto, Firedancer runs alongside the Agave client. Its modular design enables parallel processing and targets extremely high throughput.\nThe Agave 3.0.6 release, recommended in October, further supported validator efficiency. Together, these upgrades aim to future-proof Solana’s infrastructure.\nSOL Price Structure Reflects Compression and Accumulation\nSource: CoinCodex\nHowever, SOL price action shows near-term caution despite structural optimism. Solana traded near $135.31, posting a mild daily decline while maintaining a weekly gain above 2%. Market capitalization hovered near $76.3 billion, supported by steady circulation levels.\nAccording to moonbag, SOL’s long-term chart structure supports a breakout toward higher psychological levels, with $400 emerging as a potential upside target. Weekly price compression within a symmetrical triangle suggests prolonged accumulation. Resistance near $260 remains critical, while sustained strength above $180 could unlock higher targets.\nSource: X\nEljaboom highlighted improving short-term structure after SOL reclaimed the $135–$138 demand zone. Additionally, higher lows continue forming, which limits downside risk. Analysts see $145 as a near-term pivot, with $187 emerging as a key resistance level ahead of February."
            },
            {
                "title": "Solana News: Bit Mining Stock Surges 350% After Announcing Solana Ecosystem Pivot Strategy - CoinMarketCap",
                "source": "CoinMarketCap",
                "url": "https://coinmarketcap.com/academy/article/solana-news-bit-mining-stock-surges-350percent-after-announcing-solana-ecosystem-pivot-strategy",
                "body": "Bitcoin mining firm Bit Mining plans to raise 200–300 million to build a substantial Solana token treasury.\nSolana News: Bitcoin mining firm Bit Mining plans to raise 200–300 million to build a substantial Solana token treasury.\nThe company will convert existing crypto holdings into Solana and adopt long-term holding strategies.\nStock prices surged to 11 in pre-market trading, up 350% from Wednesday's 2 closing price.\nThe company plans to operate validator nodes on Solana to support network decentralization and security.\nCEO Xianfeng Yang called the move a bold step into one of blockchain's most dynamic ecosystems.\nBit Mining ranks as the 17th-largest Bitcoin miner globally by market capitalization.\nThe pivot follows Bit Digital's similar move to abandon Bitcoin mining for Ethereum-focused strategies.\nBit Digital's stock initially declined 15% but recovered to surge 80% since their pivot announcement.\nThis article contains links to third-party websites or other content for information purposes only (“Third-Party Sites”). The Third-Party Sites are not under the control of CoinMarketCap, and CoinMarketCap is not responsible for the content of any Third-Party Site, including without limitation any link contained in a Third-Party Site, or any changes or updates to a Third-Party Site. CoinMarketCap is providing these links to you only as a convenience, and the inclusion of any link does not imply endorsement, approval or recommendation by CoinMarketCap of the site or any association with its operators. This article is intended to be used and must be used for informational purposes only. It is important to do your own research and analysis before making any material decisions related to any of the products or services described. This article is not intended as, and shall not be construed as, financial advice. The views and opinions expressed in this article are the author’s [company’s] own and do not necessarily reflect those of CoinMarketCap."
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "599.900",
            "open": "49,010.770",
            "close": "49,326.150",
            "high": "49,360.270",
            "low": "48,760.370"
        },
        "market_summary": "### US30 Market Briefing\n\n* **Key Drivers:** The **Dow Jones Industrial Average** closed at a record high near **50,000**, driven by a cooler U.S. jobs report and anticipation of upcoming **inflation data** and **bank earnings**.\n* **Price Action:** The **US30** index rose **0.5%** to **49,504.07**, with the **S&P 500** gaining **0.6%** and the **Nasdaq** rising **0.8%**.\n* **Technical Outlook:** Immediate support is near the **50-day moving average**, with resistance at the **50,000** psychological level. The **Shiller P/E Ratio** is at its **2nd highest level in history**, indicating **overvalued** markets.\n\n---\n**Overall Sentiment:** Cautiously **bullish**",
        "source_articles": [
            {
                "title": "Stock Market At Highs But Big News Ahead - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-jpmorgan-goldman-delta-taiwan-semi-earnings/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #59d2ad76-eeb2-11f0-b628-056e5c4a2229"
            },
            {
                "title": "Dow Jones closes at record high near 50,000 as jobs data cools; CPI and JPM earnings loom - TechStock²",
                "source": "TechStock²",
                "url": "https://ts2.tech/en/dow-jones-closes-at-record-high-near-50000-as-jobs-data-cools-cpi-and-jpm-earnings-loom/",
                "body": "New York, Jan 10, 2026, 12:13 EST — Market closed\n- The Dow ended Friday up 0.5% at a record close after a cooler U.S. jobs report\n- Investors now turn to Tuesday’s U.S. inflation data and the start of big-bank earnings\n- Rate-cut timing remains the swing factor for stocks and bonds\nThe Dow Jones Industrial Average clocked a fresh record close on Friday, rising 237.96 points, or 0.5%, to 49,504.07, capping a strong week for U.S. stocks. The S&P 500 gained 0.6% and the Nasdaq rose 0.8% on the day. (AP News)\nWith Wall Street shut for the weekend, traders head into Monday’s open trying to square two competing signals: hiring is slowing, but stocks keep pushing to new highs. A softer labor market can bring rate cuts closer, yet it can also hint at a broader cooling that hits profits.\nFriday’s rally followed a government report that pointed to slower job growth in December, while the jobless rate ticked down. The mix kept investors in the game and left bond yields moving in opposite directions across maturities, a familiar pattern when the rate outlook is still in flux. (Investopedia)\nNonfarm payrolls rose by 50,000 in December and the unemployment rate held at 4.4%, the Labor Department said. The report showed job gains in food services and drinking places, health care and social assistance, while retail trade lost jobs. (Bureau of Labor Statistics)\nThe next test is inflation. The consumer price index (CPI), the government’s main monthly read on price pressures, is due on Tuesday; “core” CPI strips out food and energy and is watched for underlying trends.\nS&P Global Market Intelligence economists said the December CPI is getting extra scrutiny after data collection issues in prior months and noted that “a cut in US interest rates is not widely expected until June.” They also said the Fed has cut by 25 basis points — a quarter of a percentage point — at each of the last three meetings. (S&P Global)\nEarnings add another lever. JPMorgan Chase is scheduled to report fourth-quarter results on Tuesday, with the bank set to host a conference call at 8:30 a.m. ET, it said. (JPMorgan Chase)\nCitigroup is due a day later, saying it plans to release results around 8 a.m. ET on Wednesday, followed by a webcast and teleconference. (Citi)\nFor Dow watchers, the index is now within striking distance of 50,000 — a round-number level that can draw extra attention even when the news flow is thin. Monday’s first move will likely come from rates, not headlines.\nBut a downside scenario is easy to sketch. A hotter-than-expected CPI could push yields up and force investors to reprice the path for Fed cuts, while early bank results could revive worries about credit costs or a slower consumer.\nWhat markets watch next is Tuesday’s CPI report and JPMorgan’s results the same morning, a one-two punch that could set the tone for the first full earnings week of 2026."
            },
            {
                "title": "The Stock Market Has Done This Only 3 Times in 155 Years -- and History Couldn't Be Any Clearer About What Comes Next - The Globe and Mail",
                "source": "The Globe and Mail",
                "url": "https://www.theglobeandmail.com/investing/markets/stocks/COMP/pressreleases/36980823/the-stock-market-has-done-this-only-3-times-in-155-years-and-history-couldnt-be-any-clearer-about-what-comes-next/",
                "body": "Key Points\nThe Dow Jones Industrial Average, S&P 500, and Nasdaq Composite were unstoppable in 2025, with respective gains of 13%, 16%, and 20%.\nAccording to one time-tested valuation tool, this is the second priciest stock market in history, when back-tested to January 1871.\nAlthough stock market cycles are inevitable, bull markets last significantly longer than bear markets.\nWhen the curtain closed on 2025, investors had every reason to smile. The iconic Dow Jones Industrial Average (DJINDICES: ^DJI), broad-based S&P 500(SNPINDEX: ^GSPC), and growth stock-driven Nasdaq Composite (NASDAQINDEX: ^IXIC) gained 13%, 16%, and 20%, respectively. It marked the third time in nearly a century that the S&P 500 had gained at least 15% for three consecutive years.\nThis overwhelming optimism on Wall Street has been fueled by the prospect of future interest rate cuts, the rise of artificial intelligence, the advent of quantum computing, and a resilient U.S. economy.\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\nBut when things seem too perfect for the stock market is precisely when investors should be concerned.\nAlthough no forecasting model, data point, or correlative event can guarantee short-term directional moves in the Dow, S&P 500, and Nasdaq Composite, select models, data points, and events have uncanny track records of foreshadowing what's to come for stocks. One ultra-rare event, which has been observed only three times in 155 years, offers an ominous warning for Wall Street and investors in 2026 (and beyond).\nThis has only been witnessed three times since January 1871\nAt any given time, there are headwinds that threaten to upend the stock market. But there's arguably no greater hurdle for Wall Street to overcome than pricey equity valuations.\nValue is, itself, a subjective term that's going to vary from one investor to the next. With no ideal blueprint for evaluating public companies, what one investor finds to be pricey might be viewed as a screaming bargain by another. This subjectivity is one of the reasons why short-term directional moves in the Dow, S&P 500, and Nasdaq Composite are so unpredictable.\nHowever, one historically accurate valuation tool, which has been back-tested 155 years, has done a phenomenal job of cutting through this subjectivity and providing investors with apples-to-apples valuation comparisons for the S&P 500. This time-tested valuation yardstick is the Shiller Price-to-Earnings (P/E) Ratio, which is also known as the cyclically adjusted P/E Ratio, or CAPE Ratio.\nMost investors turn to the traditional P/E ratio when evaluating whether a public company is cheap, fairly valued, or pricey. The P/E ratio is arrived at by dividing a company's share price by its trailing 12-month earnings per share (EPS). While this valuation measure works well for mature businesses, it often falls short with growth stocks and loses its usefulness during recessions, when EPS can turn negative.\nIn comparison, the S&P 500's Shiller P/E Ratio is based on average inflation-adjusted EPS over the previous 10 years. Accounting for a decade's worth of EPS history minimizes the impact of recessions and shock events and ensures that the Shiller P/E remains useful during all economic climates.\nSince the beginning of 1871, the Shiller P/E has averaged a multiple of 17.33. However, it's spent most of the last 30 years above this 155-year average. This is the result of the internet breaking down information barriers between Wall Street and Main Street, as well as interest rates hovering at or near historic lows throughout much of the 2010s. In other words, investors were willing to accept more risk and higher valuation premiums.\nBut based on what history tells us, there comes a point where valuations become too extended.\nS&P 500 Shiller PE Ratio hits 2nd highest level in history 🚨 The highest was the Dot Com Bubble 🤯"
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "80.750",
            "open": "10,027.160",
            "close": "10,075.660",
            "high": "10,076.610",
            "low": "9,995.860"
        },
        "market_summary": "### UK100 Market Briefing\n* **Key Drivers:** The **FTSE 100** has reached a record high, spurred by the performance of the 100 largest companies listed on the London Stock Exchange, with a rise of more than a fifth in 2025, indicating **bullish momentum**.\n* **Price Action:** The index has climbed above **10,000** points for the first time since its creation in 1984, showcasing significant **upward momentum**.\n* **Technical Outlook:** Immediate support is near the **9,500** level, with resistance at **10,500**, as investors watch for signs of a potential correction or continuation of the **bullish trend**.\n\n--- \n**Overall Sentiment:** Positive 🚀",
        "source_articles": [
            {
                "title": "The FTSE 100 has hit a record high. Is now the time to start investing? - BBC",
                "source": "BBC",
                "url": "https://www.bbc.com/news/articles/cy0958w1y1go",
                "body": "The FTSE 100 has hit a record high. Is now the time to start investing?\nAs the new year got into its stride, so did the UK's index of leading shares.\nThe FTSE 100 climbed above 10,000 points for the first time since it was created in 1984, cheering investors - and the chancellor, who wants more of us to move money out of cash savings and into investments.\nThe index tracks the performance of the 100 largest companies listed on the London Stock Exchange and rose by more than a fifth in 2025.\nBut with many people still struggling with everyday costs, and with talk of some stocks being overvalued, does the FTSE's success really make it a good time to encourage first-time investors?\nInvesting v saving\nPeople can invest their money in many different ways and in different things. Various apps and platforms have made it easy to do.\nCrucially, the value of investments can go up and down. Invest £100 and there is no guarantee that the investment is still worth £100 after a month, a year, or 10 years.\nBut, in general, long-term investments can be lucrative. The rise of the FTSE 100 is evidence of that. Shareholders may also receive dividends, which they could take as income or reinvest.\nFor years, the advice has been to treat investments as a long-term strategy. Give it time, and your pot of money will grow much bigger than if it was in a savings account.\nIn contrast, cash savings are much more steady and safe. The amount of interest varies between account providers, but savers know what returns will be. Savings rates have held up quite well over the last year, but interest rates are generally thought to be on the way down.\nSavings accounts are popular when putting money aside for emergencies, or for holidays, a wedding or a car - for one predominant reason: you can usually withdraw the money quickly and easily.\n\"It is important that everyone has savings. It gives you access when you need it,\" says Anna Bowes, savings expert at financial advisers The Private Office (TPO).\n\"It means you do not need to cash out your investments at the wrong time.\"\nEvangelists for investing agree that savings are an important part of the mix for everyone managing their money.\n\"People starting out should have a cash buffer in case of emergency before going into investing,\" says Jema Arnold, a voluntary non-executive director at the UK Individual Shareholders Society (ShareSoc).\nOne in 10 people have no cash savings, and another 21% have less than £1,000 to draw on in an emergency, according to the regulator, the Financial Conduct Authority (FCA).\nBut Arnold and others point out that cash is not without risk either. As time goes on, the spending power of savings is eroded by the rising cost of living, unless the savings account interest rate beats inflation.\nRisk and reward\nOur brains make a judgement about risk and reward thousands of times every day. We consider the risk of crossing the road against the reward of getting to the other side and so on.\nWith money, those who are more risk-averse have tended to stick with savings, while others have moved into investments. It also helps if you have money you can afford to lose.\nIt is worth remembering that millions of people already have money for their pension invested, although it is often managed for them and they may not pay much attention to it.\nThe FCA says seven million adults in the UK with £10,000 or more in cash savings could receive better returns through investing.\nChancellor Rachel Reeves has advocated more risk-taking from consumers. For those with the money, she says the benefit of long-term investing for them, and the UK economy as a whole, is clear.\nShe is altering rules on tax-free Isas (Individual Savings Accounts) in a much-debated move aimed at encouraging investing.\nIt is also why, in a couple of months' time, we are all going to be blitzed with an advertising campaign (funded by the investment industry) telling us to give investing some thought.\nIt will be a modern version of the Tell Sid c"
            },
            {
                "title": "In 2026, £5,000 invested in the stock market could grow to… - Yahoo Finance UK",
                "source": "Yahoo Finance UK",
                "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_dcb9d1ec-1d40-44ff-9296-f3fa5a5d636d",
                "body": "Yahoo is part of the Yahoo family of brands.\nWhen you use our sites and apps, we use cookies to:\n- provide our sites and apps to you\n- authenticate users, apply security measures, and prevent spam and abuse, and\n- measure your use of our sites and apps\nIf you click '\nAccept all', we and\nour partners, including 245 who are part of the IAB Transparency & Consent Framework, will also store and/or access information on a device (in other words, use cookies) and use precise geolocation data and other personal data such as IP address and browsing and search data, for analytics, personalized advertising and content, advertising and content measurement, and audience research and services development.\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\nIf you would like to customise your choices, click 'Manage privacy settings'.\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy & Cookie Settings' or 'Privacy Dashboard' links on our sites and apps. Find out more about how we use your personal data in our Privacy Policy and Cookie Policy."
            },
            {
                "title": "How Recent Analyst Moves Are Shaping The NEXT LSE NXT Investment Story - Yahoo Finance UK",
                "source": "Yahoo Finance UK",
                "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_7e80f023-3e14-49d1-9b9b-99d96bbc2898",
                "body": "Yahoo is part of the Yahoo family of brands.\nWhen you use our sites and apps, we use cookies to:\n- provide our sites and apps to you\n- authenticate users, apply security measures, and prevent spam and abuse, and\n- measure your use of our sites and apps\nIf you click '\nAccept all', we and\nour partners, including 245 who are part of the IAB Transparency & Consent Framework, will also store and/or access information on a device (in other words, use cookies) and use precise geolocation data and other personal data such as IP address and browsing and search data, for analytics, personalized advertising and content, advertising and content measurement, and audience research and services development.\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\nIf you would like to customise your choices, click 'Manage privacy settings'.\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy & Cookie Settings' or 'Privacy Dashboard' links on our sites and apps. Find out more about how we use your personal data in our Privacy Policy and Cookie Policy."
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "213.250",
            "open": "25,105.320",
            "close": "25,183.920",
            "high": "25,225.170",
            "low": "25,011.920"
        },
        "market_summary": "### GER40 Market Briefing\n\n* **Key Drivers:** Softer US jobs data has increased bets on a more **dovish** Federal Reserve, supporting global equities and lifting the **GER40** to new highs.\n* **Price Action:** The **GER40** broke out to a new record high, driven by **bullish momentum** in cyclical and quality growth names, with **exporters** and **quality tech** gaining.\n* **Technical Outlook:** Immediate support is near the 50-day moving average, with resistance at the **record high** level.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "^GSPC Today, January 10: Soft US Jobs Data Lifts Rate-Cut Bets - Meyka",
                "source": "Meyka",
                "url": "https://meyka.com/blog/gspc-today-january-10-soft-us-jobs-data-lifts-rate-cut-bets-1001/",
                "body": "^GSPC Today, January 10: Soft US Jobs Data Lifts Rate-Cut Bets\nUS jobs data came in softer, with slower payroll growth but a lower unemployment rate. That mix firmed Fed rate cut bets and supported global equities. The S&P 500 (^GSPC) hovered near 6,900 as traders weighed policy easing odds and earnings setup. For Germany, the move fed fresh risk appetite, with the DAX edging to a new peak. We break down what the labor signal means, key S&P 500 today levels to watch, why a DAX record high matters, and how investors in Germany can position.\nWhat softer US jobs mean for rates and stocks\nThe mixed US jobs data cooled hiring momentum while the jobless rate dipped, a combination that often nudges the Fed toward easier policy. Markets raised the odds of earlier cuts, easing pressure on valuations. Lower rate expectations tend to support growth stocks and long-duration assets. That backdrop steadied risk sentiment and kept major indices near recent highs, even as investors wait for earnings to confirm margins.\nFor Germany, US policy drives global funding costs and demand. Easing expectations and soft US jobs data helped push the DAX to fresh records, supported by exporters and quality tech. Autos and industrials benefit if the US outlook stays resilient while financing costs trend lower. Local coverage highlighted the upbeat tone as the index advanced to new highs Marktbericht: DAX in Rekordlaune.\nS&P 500 today: levels and momentum\nThe index traded near 6,902, with a session range of 6,892 to 6,920 and a prior close of 6,921. The 50-day average at 6,816 is first support, followed by the middle Bollinger band near 6,866. The 200-day average at 6,317 is the longer-term floor. On the upside, the year high at 6,978 and the upper Bollinger band around 6,980 mark resistance.\nMomentum stayed constructive but not stretched. RSI sits at 57.5, while the MACD histogram is positive at 2.78. ADX near 12 signals a weak trend, so breakouts need volume confirmation. Stochastic at 87 flags near-term froth, and ATR around 59 points implies typical daily swings. Together, that favors buying pullbacks over chasing strength.\nDAX record high: spillovers and sectors\nA softer US growth pulse with lower joblessness tends to reduce rate fears, helping German shares. The DAX moved to a record as cyclical and quality growth names caught a bid, supported by cooling policy risk and improving earnings visibility. Local market reports noted US jobs data as a key driver Aktien Frankfurt: Dax bleibt auf Rekordkurs – US-Jobdaten stützen – boerse.de.\nGerman multinationals are tightly linked to US demand. When US jobs data softens without signaling recession, it can lift margins through cheaper capital while keeping revenues stable. That mix helps exporters, semis, and industrial suppliers. Banks can also benefit from tighter spreads and improving credit quality if growth holds. Watch sector breadth to judge the strength behind a DAX record high.\nStrategy: how to position from Germany\nWe prefer quality growth with solid cash flow and select cyclicals that benefit from lower funding costs. Use the 6,816 50-day average as a risk marker for S&P 500 exposure, and trim into tests of 6,980 resistance if breadth fades. Earnings revisions will be key. If guidance holds, soft US jobs data plus easing odds can support a grind higher.\nA path toward rate cuts favors extending duration gradually. Core euro government or investment-grade bond ETFs can balance equity risk. Keep some dry powder for volatility spikes, given ADX shows no strong trend. For US exposure, consider euro-hedged share classes if currency swings rise. Reassess after major US data prints and central bank meetings.\nFinal Thoughts\nSofter US jobs data shifted the focus back to policy easing, lifting risk appetite and setting a supportive tone for equities. For Germany, that meant a DAX record high as exporters and quality tech gained. In the US, S&P 500 today levels show support near 6,816 and resistance around 6,98"
            },
            {
                "title": "Stocks jump, dollar higher in wake of U.S. jobs numbers - The Spokesman-Review",
                "source": "The Spokesman-Review",
                "url": "https://www.spokesman.com/stories/2026/jan/09/stocks-jump-dollar-higher-in-wake-of-us-jobs-numbe/",
                "body": "Stocks jump, dollar higher in wake of U.S. jobs numbers\nNEW YORK – Stock indexes gained and the dollar was higher on Friday after data showed the U.S. economy created fewer jobs than expected in December, supporting the view the Federal Reserve would leave interest rates unchanged this month.\nThe S&P 500 hit an intraday high and the STOXX 600 ended at a record. Chip stocks rose and helped to boost the S&P 500, with Intel gaining after U.S. President Donald Trump said he had a “great meeting” with the chipmaker’s Chief Executive Officer, Lip-Bu Tan.\nThe Bureau of Labor Statistics monthly report showed 50,000 workers were added to nonfarm payrolls in December, compared with expectations in a Reuters poll for a rise of 60,000, just above November’s downwardly revised increase of 56,000. The unemployment rate eased, as expected, to 4.4%.\nFed funds futures traders are now pricing in only a 4.8% chance of a rate cut at the Fed’s Jan. 27-28 meeting, down from 11.6% before the data. The next cut is unlikely before at least April.\n“Payrolls were a little bit light relative to consensus, but still fairly strong numbers,” said Tim Ghriskey, senior portfolio strategist at Ingalls & Snyder in New York.\n“We are back to normal in terms of economic reporting so that’s a bit of a relief for everyone.”\nBefore now, the release of U.S. economic data had been delayed because of the long federal government shutdown.\nThe Dow Jones Industrial Average rose 252.84 points, or 0.51%, to 49,518.95, the S&P 500 rose 53.23 points, or 0.77%, to 6,974.69 and the Nasdaq Composite rose 216.38 points, or 0.92%, to 23,696.40.\nAll three indexes are set for weekly gains in the first full trading week of 2026, with the Dow on track for its biggest weekly gain since the last week of November.\nMSCI’s gauge of stocks across the globe rose 6.01 points, or 0.58%, to 1,035.46.\nEuropean shares ended at a record high. A jump in Glencore helped put the STOXX 600 on its longest weekly winning streak since May. The pan-European STOXX 600 index rose 0.97%.\nDollar, two-year yields up\nAfter the jobs report the dollar initially gave up almost all the day’s gains versus a basket of major currencies, having risen by nearly 0.2% earlier. The dollar index, which measures the greenback against a basket of currencies including the yen and the euro, was last up 0.26% at 99.13.\nInterest rate sensitive two-year Treasury yields were higher after the data, while 10-year yields were last down slightly. The 2-year note yield, which typically moves in step with interest rate expectations for the Fed, rose 5 basis points to 3.538%, from 3.488% late on Thursday. The yield on benchmark U.S. 10-year notes fell 1.2 basis points to 4.171%.\nIn commodities, crude oil ended sharply higher. Brent futures rose $1.35, or 2.18%, to settle at $63.34 per barrel, while U.S. West Texas Intermediate (WTI) crude gained $1.36, or 2.35%, to $59.12.\nInvestors have become more convinced that production in Venezuela, even under U.S. control, may not rise meaningfully for some time.\nSupreme Court didn’t rule on Trumps’ tariffs Friday\nInvestors had been bracing for a possible U.S. Supreme Court ruling on the legality of Trump’s tariffs.\nBut the court is expected to issue its next rulings on Wednesday. The court indicated on its website on Friday that it could release decisions in argued cases when the justices take the bench during a scheduled sitting next Wednesday."
            },
            {
                "title": "LEG Immobilien SE: German Residential Landlord Navigates A Nervous Rate Plateau - AD HOC NEWS",
                "source": "AD HOC NEWS",
                "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/leg-immobilien-se-german-residential-landlord-navigates-a-nervous-rate/68476934",
                "body": "LEG Immobilien SE: German Residential Landlord Navigates A Nervous Rate Plateau\n11.01.2026 - 04:57:00LEG Immobilien SE is currently trading in a fragile middle ground, where the panic of surging interest rates has faded but conviction is still in short supply. The stock has eased slightly over the past few sessions after a strong multi month recovery, suggesting that investors are weighing relief about stabilizing bond yields against enduring concerns over German housing regulation and refinancing risk.\nOn the latest close, LEG Immobilien SE finished around the mid 90 euro range, after drifting lower over the last five trading days with a modest single digit percentage pullback. That soft step back contrasts with the much stronger ninety day performance, where the stock has rallied sharply off its autumn lows, recouping a significant share of the brutal drawdown that had pushed many European landlords into deep value territory.\nMarket data from multiple sources such as Yahoo Finance and Börse Frankfurt indicate that the current quote sits well above the recent 52 week low in roughly the mid 60s, yet still meaningfully below the 52 week high in the low 110s. In other words, the stock now trades in the upper half of its yearly range, a classic zone of consolidation where both bullish and bearish narratives can plausibly claim the upper hand.\nOver the last week of trading the daily candles have been tight, with relatively low volatility compared to the wild swings seen during the peak of the rate shock. Short term traders will note that the five day curve has a slight downward tilt, but without the kind of heavy volume or aggressive pricing that signals capitulation. This looks more like profit taking after a sharp multi month rise than the start of a new structural selloff.\nLooking further back, the ninety day trend has been decisively positive. From depressed levels in early autumn the share price climbed by several tens of percent into late year, tracking the sharp pullback in European yields and a broader rotation back into interest rate sensitive assets. That rally helped narrow the valuation gap versus net asset value and eased fears of a prolonged downward spiral in the German residential sector.\nFrom a sentiment standpoint, the slightly negative move over the most recent week feels more like a pause for breath than a verdict against the company’s fundamentals. Rate expectations have stabilized, the worst case scenarios on regulation have not materialized, and equity analysts are increasingly focused on balance sheet resilience rather than existential risk.\nLearn more about LEG Immobilien SE and its German residential portfolio strategy\nOne-Year Investment Performance\nFor investors who stepped into LEG Immobilien SE roughly one year ago, the ride has been anything but smooth, yet the destination now looks surprisingly rewarding. Based on market data from German exchanges, the stock closed in the low 80s one year ago and has since climbed into the mid 90s, implying a gain in the low to mid teens percentage range before dividends.\nPut differently, a hypothetical 10,000 euro investment at that time would now be worth around 11,000 to 11,500 euros, excluding any reinvested payouts. Given the bruising macro backdrop for European property owners, this positive outcome feels almost counterintuitive. Investors were forced to endure high volatility, stretches of pronounced drawdown and an almost nonstop flow of negative headlines about rates, valuations and regulation.\nThe emotional arc for those buy and hold investors has been intense. Early on, as yields surged and property valuations were slashed, it likely felt as if the market was on a one way street toward distress, with every bounce an invitation to sell. Yet those who resisted the urge to capitulate have now been paid for their courage with a respectable double digit gain and a healthier looking balance between risk and reward. It is a vivid reminder that in rate sensitive "
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "278.500",
            "open": "25,663.350",
            "close": "25,525.520",
            "high": "25,664.730",
            "low": "25,386.230"
        },
        "market_summary": "### NDX100 Market Briefing\n\n* **Key Drivers:** The NDX100 remains **rangebound** with a **bullish bias**, as traders await key US data, including the US NFP report, to determine the next direction. The **inflation** narrative continues to underpin stocks, but the Fed's **dovish reaction function** is constrained by inflation worries.\n* **Price Action:** The index is currently trading within a **rising wedge** pattern on the daily chart, with a potential **upside breakout** leading to a strong rally or a **downside breakout** taking the price to the base of the wedge around **$24,900**. The **bullish momentum** is supported by the minor upward trendline on the 1-hour chart.\n* **Technical Outlook:** Immediate support is near the bottom trendline of the rising wedge, with resistance at the top trendline. The **average daily range** for today is defined by the red lines on the 1-hour chart, and buyers will likely continue to lean on the trendline to keep pushing into the top trendline of the wedge.\n\n---\n**Overall Sentiment:** Cautiously **bullish**",
        "source_articles": [
            {
                "title": "Did Rising Volumes and Fintech Expansion Just Reframe Nasdaq’s (NDAQ) Earnings Story? - simplywall.st",
                "source": "simplywall.st",
                "url": "https://simplywall.st/stocks/us/diversified-financials/nasdaq-ndaq/nasdaq/news/did-rising-volumes-and-fintech-expansion-just-reframe-nasdaq",
                "body": "- United States\n- /\n- Capital Markets\n- /\n- NasdaqGS:NDAQ\nDid Rising Volumes and Fintech Expansion Just Reframe Nasdaq’s (NDAQ) Earnings Story?\nReviewed by Sasha Jovanovic\n- Nasdaq, Inc. recently reported its December 2025 trading volumes and Q4 operational metrics, while also setting January 29, 2026, for its fourth-quarter and full-year 2025 earnings release and investor conference call, which will feature senior management commentary and Q&A.\n- These disclosures, alongside increased equity trading activity and expanding technology offerings such as Verafin and broader fintech solutions, have intensified attention on how Nasdaq’s business mix and transaction volumes may shape its upcoming financial results.\n- We’ll now examine how the upcoming Q4 and full-year 2025 earnings release, against rising trading volumes, influences Nasdaq’s investment narrative.\nThe best AI stocks today may lie beyond giants like Nvidia and Microsoft. Find the next big opportunity with these 28 smaller AI-focused companies with strong growth potential through early-stage innovation in machine learning, automation, and data intelligence that could fund your retirement.\nNasdaq Investment Narrative Recap\nTo own Nasdaq, I think you need to believe in its evolution from a traditional exchange into a broader technology and data provider, while accepting exposure to market activity and deal timing. The latest volume update and the scheduled January 29 results call sharpen the near term focus on trading-driven revenues and progress in the Financial Technology division, but they do not materially change the key near term catalyst, which is how convincingly management updates on fintech growth versus deal delays, or the main risk of slower client decisions.\nThe December 2025 trading and revenue capture disclosure is most relevant here, because it gives investors a real time read on U.S. and European equity and options activity just ahead of the Q4 and full year 2025 earnings release. With U.S. equity volumes up 8.1 percent quarter on quarter and ongoing expansion in offerings like Verafin, this dataset frames expectations for how much of Nasdaq’s story is still tied to cyclical market volumes versus the more recurring, software and compliance driven parts of the business.\nYet even with rising trading activity, investors should be aware that extended decision cycles for large Financial Technology deals could still...\nRead the full narrative on Nasdaq (it's free!)\nNasdaq's narrative projects $6.1 billion revenue and $2.0 billion earnings by 2028.\nUncover how Nasdaq's forecasts yield a $104.00 fair value, a 6% upside to its current price.\nExploring Other Perspectives\nSeven members of the Simply Wall St Community place Nasdaq’s fair value anywhere between US$32.07 and US$256.45, showing very different expectations. When you set those views against the risk of deal delays in Nasdaq’s Financial Technology division, it underlines why many market participants are watching upcoming earnings commentary on client spending very closely.\nExplore 7 other fair value estimates on Nasdaq - why the stock might be worth less than half the current price!\nBuild Your Own Nasdaq Narrative\nDisagree with existing narratives? Create your own in under 3 minutes - extraordinary investment returns rarely come from following the herd.\n- A great starting point for your Nasdaq research is our analysis highlighting 2 key rewards and 1 important warning sign that could impact your investment decision.\n- Our free Nasdaq research report provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate Nasdaq's overall financial health at a glance.\nReady To Venture Into Other Investment Styles?\nThe market won't wait. These fast-moving stocks are hot now. Grab the list before they run:\n- Trump's oil boom is here - pipelines are primed to profit. Discover the 22 US stocks riding the wave.\n- Rare earth metals are the new gold rush. Find out wh"
            },
            {
                "title": "Fastenal's (NASDAQ:FAST) three-year earnings growth trails the decent shareholder returns - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/fastenals-nasdaq-fast-three-earnings-140014476.html",
                "body": "Vanguard founder Jack Bogle helped spearhead the low-cost index fund, putting average returns within reach of every investor. But you can make superior returns by picking better-than average stocks. For example, the Fastenal Company (NASDAQ:FAST) share price is up 72% in the last three years, slightly above the market return. Zooming in, the stock is up a respectable 17% in the last year.\nSince it's been a strong week for Fastenal shareholders, let's have a look at trend of the longer term fundamentals.\nWhile the efficient markets hypothesis continues to be taught by some, it has been proven that markets are over-reactive dynamic systems, and investors are not always rational. One imperfect but simple way to consider how the market perception of a company has shifted is to compare the change in the earnings per share (EPS) with the share price movement.\nFastenal was able to grow its EPS at 4.6% per year over three years, sending the share price higher. In comparison, the 20% per year gain in the share price outpaces the EPS growth. This indicates that the market is feeling more optimistic on the stock, after the last few years of progress. It's not unusual to see the market 're-rate' a stock, after a few years of growth.\nThe company's earnings per share (over time) is depicted in the image below (click to see the exact numbers).\nIt's probably worth noting we've seen significant insider buying in the last quarter, which we consider a positive. That said, we think earnings and revenue growth trends are even more important factors to consider. Before buying or selling a stock, we always recommend a close examination of historic growth trends, available here..\nWhat About Dividends?\nIt is important to consider the total shareholder return, as well as the share price return, for any given stock. Whereas the share price return only reflects the change in the share price, the TSR includes the value of dividends (assuming they were reinvested) and the benefit of any discounted capital raising or spin-off. It's fair to say that the TSR gives a more complete picture for stocks that pay a dividend. In the case of Fastenal, it has a TSR of 85% for the last 3 years. That exceeds its share price return that we previously mentioned. And there's no prize for guessing that the dividend payments largely explain the divergence!\nA Different Perspective\nFastenal shareholders have received returns of 20% over twelve months (even including dividends), which isn't far from the general market return. That gain looks pretty satisfying, and it is even better than the five-year TSR of 13% per year. It is possible that management foresight will bring growth well into the future, even if the share price slows down. I find it very interesting to look at share price over the long term as a proxy for business performance. But to truly gain insight, we need to consider other information, too. To that end, you should be aware of the 1 warning sign we've spotted with Fastenal ."
            },
            {
                "title": "Nasdaq remains rangebound as traders await key US data before picking a direction - investingLive",
                "source": "investingLive",
                "url": "https://investinglive.com/stocks/nasdaq-remains-rangebound-as-traders-await-key-us-data-before-picking-a-direction-20260109/",
                "body": "KEY POINTS:\n- Nasdaq price action remains rangebound but with a bullish bias\n- Pullback in Fed support turned the focus heavily towards data\n- Reaction to negative labour market data likely to reverse in 2026 as inflation remains a constraint for the Fed\nFUNDAMENTAL OVERVIEW\nSince the peak in late October, the Nasdaq has been bouncing around as the overstretched long positioning was met with a less dovish Fed. The market maintains the bullish bias amid a strong economy and the Fed’s dovish reaction function, but lacks the momentum seen in 2025 when Trump pulled back on aggressive tariffs and the Fed was in a clear easing mode.\nThis year the main risk for the bullish outlook is inflation. The “run it hot” narrative continues to underpin stocks, and we’ve seen from the latest GDP report and the Atlanta Fed GDPNow how the economy looks to be accelerating. That hasn’t translated into persistent inflationary pressures besides the tariff driven spike in the summer.\nI have a feeling that US CPI will be more important in the next months because inflation worry is what is constraining the Fed from acting more quickly and with more conviction on rate cuts. In fact, while weak labour market data was seen as positive for the stock market on expectations of more Fed cuts, this year it might be seen as negative if it comes with higher CPI data due to the above-mentioned constraint.\nNASDAQ TECHNICAL ANALYSIS – DAILY TIMEFRAME\nOn the daily chart, we can see that the Nasdaq has been compressing into a rising wedge. These types of patterns can resolve into a downside breakout taking the price to the base of the wedge or an upside breakout leading to a strong rally after the consolidation.\nNASDAQ TECHNICAL ANALYSIS – 4 HOUR TIMEFRAME\nOn the 4 hour chart, we can see more clearly the recent choppy price action that formed the rising wedge. From a risk management perspective, the buyers will have a better risk to reward setup around the bottom trendline to position for a rally into new all-time highs. The sellers, on the other hand, will want to see the price breaking lower to pile in for a drop into the base of the wedge around the 24900 level.\nNASDAQ TECHNICAL ANALYSIS – 1 HOUR TIMEFRAME\nOn the 1 hour chart, we can see that we have a minor upward trendline defining the current bullish momentum on this timeframe. The buyers will likely continue to lean on the trendline to keep pushing into the top trendline of the wedge, while the sellers will look for a break lower to extend the drop into the bottom trendline. The red lines define the average daily range for today.\nUPCOMING CATALYSTS\nToday we conclude the week with the US NFP report and potential US Supreme Court decision on Trump’s tariffs."
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "42.250",
            "open": "6,926.370",
            "close": "6,928.520",
            "high": "6,935.370",
            "low": "6,893.120"
        },
        "market_summary": "### SPX500 Market Briefing\n\n* **Key Drivers:** The new federal dietary guidelines, which emphasize **protein-rich foods** and **full-fat dairy**, may impact the restaurant industry, potentially benefiting fast-casual chains like **Chipotle** and **Sweetgreen**.\n* **Price Action:** The **SPX500** has shown **bullish momentum** in recent days, with the index nearing its **$4,200** resistance level.\n* **Technical Outlook:** Immediate support is near the 50-day moving average at **$4,100**, with resistance at **$4,200**.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Parents on RFK Jr.’s advice on sweets: ‘Completely unrealistic’ - Politico",
                "source": "Politico",
                "url": "https://www.politico.com/news/2026/01/10/rfk-sugar-dietary-guidelines-children-00720472",
                "body": "Parents on RFK Jr.’s advice on sweets: ‘Completely unrealistic’\nThe health secretary’s new dietary guidelines tell parents to cut the added sugar until their kids turn 11.\nThe new guidelines are the government’s declaration of war on added sugar, Kennedy said this week. Brandon Bell | Getty Images\nNew dietary guidelines from the Trump administration have some big asks of Americans, from prioritizing protein to avoiding highly processed food. The most onerous directive, though, was probably for moms and dads.\nHealth Secretary Robert F. Kennedy Jr. and Agriculture Secretary Brooke Rollins want them to stop giving their kids sugar until they turn 11.\nThat, says Keri Rodrigues, a mother of five boys and the president of the National Parents Union, is “completely unrealistic.” Her group, which has been critical of other administration policies, represents 1.7 million parents.\n“Sugar is everywhere,” she said. “It’s in bread, it’s in all kinds of other things,” she said.\nNo one is saying kids can’t eat foods that contain natural sugar, such as bananas and fresh mango, but avoiding added sugar — which most everyone agrees should be limited — would require incredible diligence. The old rules, which most parents failed to abide by, only asked them to hold the line till their kids turned 2.\nThe new guidance, strictly followed, would mean a wholesale overhaul of most kids’ diets and the traditions of childhood. There’d be no more Halloween candy, ice cream cones at the county fair, Cracker Jack at the ballgame or even a peanut-butter and jelly sandwich.\nThe guidelines are the government’s declaration of war on added sugar, Kennedy said when announcing the new recommendations Wednesday, pointing to the high rates of obesity among American children. Approximately 1 in 5 American children and teens are obese, according to 2024 data from the Centers for Disease Control and Prevention.\nThe new guidelines, spearheaded by Kennedy and Rollins, say that no amount of added sugar is recommended or considered part of a healthy diet.\nThe American Academy of Pediatrics, the American Medical Association and other health groups have praised the guidelines’ recommendations for Americans to avoid added sugar.\nThe new guidelines tell parents to avoid any added sugar for children 4 and under and stress that “no amount of sugar is recommended” for kids between 5 and 10. The previous guidelines, in addition to asking parents to avoid giving kids sugar till 2, recommended that added sugars remain under 10 percent of daily calories for kids older than that.\nConsuming too much added sugar is linked to conditions such as weight gain and obesity, type 2 diabetes, and heart disease, according to the Centers for Disease Control and Prevention, which in 2024 pointed to a 2021 survey showing that a majority of one-to-five year olds had consumed at least one sugary drink in the week prior to the survey.\nA Department of Health and Human Services official said highly processed foods, which often contain added sugar, trigger something akin to addiction, and early exposure can make it difficult to resist eating too much sugar later in life. POLITICO granted the official anonymity because they were not allowed to speak publicly.\nHHS spokesperson Andrew Nixon said the dietary guidelines “are a guideline and recommendation for Americans.” He stressed that they were only a recommendation.\nDietary guidelines affect how federal programs like school meals are run, but Americans have never faithfully adhered to them.\nTina Descovich, a mother of five and the co-founder of Moms for Liberty, a conservative parents’ rights organization, said she thought it would be hard to comply with the new guidance once children start to attend school and play dates.\nDescovich recalled her time as a Brevard County, Fla., school board member between 2016 and 2020. Parents often complained about sugar-laden breakfast foods the kids were served, she said, adding that she agreed that getting such foods "
            },
            {
                "title": "RFK Jr.'s new dietary guidelines emphasize red meat, full-fat dairy. How healthy are they? - abcnews.go.com",
                "source": "abcnews.go.com",
                "url": "https://abcnews.go.com/Health/rfk-jrs-new-dietary-guidelines-emphasize-red-meat/story?id=129012897",
                "body": "RFK Jr.'s new dietary guidelines emphasize red meat, full-fat dairy. How healthy are they?\nSome experts say red meat and full-fat dairy can be high in saturated fats.\nHealth and Human Services Secretary Robert F. Kennedy Jr. announced updated federal dietary guidelines on Tuesday, though some of the recommendations are being challenged by health experts.\nThe Dietary Guidelines for Americans, which are updated every five years, recommended that Americans limit highly processed foods and refined carbohydrates.\nSome nutrition and diet experts, however, questioned other recommendations, including consuming red meat and full-fat dairy, a reversal of past nutrition guidance.\nThey told ABC News that while red meat and full-fat dairy can be part of a heathy diet, they also can be high in sodium and saturated fats, which can raise the risk of cardiovascular disease.\nEmphasis on red meat and protein\nIn a factsheet released along with the guidelines, the administration said it was recommending that American prioritize eating protein-rich foods with every meal including red meat, poultry, seafood and eggs in addition to plant-sourced protein foods.\nThis is a stark contrast from past years in which guidelines have encouraged Americans to limit the amount of red meat being consumed.\nNutrition experts contend that red meat is high in protein and contains several nutrients including iron, zinc, potassium, vitamin B6 and vitamin B12.\nHowever, some experts add that red meat is also high in saturated fats, which has been shown to increase levels of \"bad\" cholesterol and increase the risk of heart disease, according to the American Heart Association.\nAdditionally, the 2025 Scientific Report -- an independent report written by the Dietary Guidelines Advisory Committee that helps the HHS and Department of Agriculture develop the next set of dietary guidelines -- found that reducing items with saturated fats, such as processed and unprocessed red meat with plant-based protein foods, can lower cardiovascular disease risk.\n\"I'm concerned about the focus on protein and if we're telling people to have protein at every meal that might increase overall meat consumption, and for many Americans that could also increase saturated fat intake, especially if people lean toward red meat rather than lean cuts of meat, seafood beans, nuts, and seeds as their protein sources,\" Maya Feller, a registered dietitian based in New York City, told ABC News.\nThe factsheet also claimed that previous federal dietary guidelines have \"demonized\" protein in favor of carbohydrates.\n\"Protein was never demonized in U.S. dietary guidelines. As it is, Americans are consuming protein in amounts well above the amount that is necessary to sustain health and development,\" Marie-Pierre St-Onge, a professor of nutritional medicine at Columbia University Vagelos College of Physicians and Surgeons, told ABC News.\nThe guidelines also advise adults to consume between 1.2 to 1.6 grams of protein per kilogram of body weight per day.\nFeller said there isn't enough evidence to suggest that all Americans need to be consuming that much protein, and that a variety of protein sources is beneficial.\n\"The majority of the population has one or more non-communicable diseases, which require thoughtful meal planning to adjust macronutrient needs,\" she said. \"Increasing protein intake should include a variety of proteins from both plant and animal sources.\"\nThe American Heart Association said in a statement on Wednesday that it welcomes the new dietary guidelines and its emphasis on fruits and vegetables while limiting highly processed foods and added sugars.\nHowever, regarding protein, the AHA said it encourages prioritizing plant-based proteins, seafood and lean meats and to limit high-fat animal products including \"red meat, butter, lard and tallow, which are linked to increased cardiovascular risk.\"\nMixed views on full-fat dairy\nU.S. health officials said during a press conference on Wednesday that full"
            },
            {
                "title": "RFK Jr.'s new food guidelines could boost beaten down fast-casual chains like Chipotle and Sweetgreen - CNBC",
                "source": "CNBC",
                "url": "https://www.cnbc.com/2026/01/08/rfk-jr-food-guidelines-chipotle-sweetgreen.html",
                "body": "New federal dietary recommendations have sparked mixed reactions from the embattled restaurant industry, as changing guidelines could encourage Americans to dine out less often or choose from a smaller pool of restaurants when they do leave home.\nThe departments of Health and Human Services and Agriculture unveiled the nutrition guidelines on Wednesday. The recommendations, which are updated every five years, pushed for higher consumption of protein and full-fat dairy and reduced intake of processed foods and sugary drinks.\nThe guidelines are primarily a public health tool for federal agencies, health-care providers and nutrition experts, so it's unclear how much they will influence individual consumer choices. Although the recommendations largely focus on eating at home, they lightly touched on the restaurant industry as well.\n\"When dining out, choose nutrient-dense options,\" the guidelines advise.\nWhile the recommendations could discourage Americans from spending at restaurants — especially at a time when high inflation has curbed trips to dine out — some pockets of the industry had a positive reaction to the changes. The changes could give a particular boost to struggling fast-casual chains like Sweetgreen and Chipotle, which have long touted the type of natural ingredients championed by HHS Secretary Robert F. Kennedy Jr.'s \"Make American Healthy Again\" movement.\nOne lobbying executive who represents restaurant companies, whose organization was involved in meetings with the White House on the new guidelines, said the outcome could have been \"far worse\" for the sector. The person, who declined to be named because their organization was involved in private discussions, said the end result was better for the industry than proposed guidance from earlier in 2025 was.\nHowever, the executive said they are still concerned the guidelines could encourage Americans to eat at home when diners have affordable options to incorporate those foods at restaurants. That implication could also ruffle feathers among restaurant chains and their franchisees.\nDespite those potential concerns from some, industry lobbying group the National Restaurant Association backed the new guidelines.\n\"Now, more than ever, restaurant operators are offering a wider variety of options, allowing consumers to choose what best fits their dietary needs, preferences, and lifestyles. We congratulate Secretary Kennedy and the Trump Administration on the release of the new guidelines and look forward to continued collaboration with policymakers to ensure that nutrition guidance remains practical, flexible, and supportive of access and innovation,\" National Restaurant Association spokesman Sean Kennedy said in a statement to CNBC.\nRestaurant franchise lobbyist the International Franchise Association, called the approach \"nuanced\" and said it may limit the number of price increases restaurants have to make.\n\"Fortunately, the more nuanced approach of these guidelines helps ensure our members will not have to raise prices and that consumers can continue to make their own choices,\" the group said. \"Any future regulations or guidance must keep potential cost increases top of mind, as restaurant owners already face numerous regulatory burdens and supply chain challenges, which most often disproportionately affect small business owners, like franchisees, and ultimately, American consumers.\"\nHow fast casual could benefit\nSome of the most supportive reactions came from chains that had been beaten down in 2025, including Chipotle and Sweetgreen. Both fast-casual names saw pullbacks from younger consumers who continue to struggle in a K-shaped economy, where spending has concentrated more among the highest earners.\nLoading chart...\nSweetgreen, which was the biggest restaurant sector laggard last year with a nearly 80% stock decline, cheered the new guidelines.\nA spokesperson told CNBC in a statement: \"We keep ultra-processed ingredients and added sugars out of our restaurants, sour"
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "871.680",
            "open": "51,828.460",
            "close": "51,517.760",
            "high": "51,901.950",
            "low": "51,030.270"
        },
        "market_summary": "### JPN225 Market Briefing\n\n* **Key Drivers:** The possibility of Japanese Prime Minister Takaichi Sanae dissolving the National Assembly and holding an early general election has introduced uncertainty, while the yen's weakness and expectations of a rise in stock prices are **bullish** for the JPN225.\n* **Price Action:** The Nikkei average futures surged on expectations of a rise in stock prices, nearing a **record high**, with the index showing significant **bullish momentum**.\n* **Technical Outlook:** Immediate support is near the **50-day moving average** at **28,500**, with resistance at **30,000**.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Yen slides versus dollar, Nikkei 225 nears record high - news.cgtn.com",
                "source": "news.cgtn.com",
                "url": "https://news.cgtn.com/news/2026-01-10/Yen-slides-versus-dollar-Nikkei-225-nears-record-high-1JOJADUC8ZG/p.html",
                "body": "By continuing to browse our site you agree to our use of cookies, revised Privacy Policy and Terms of Use. You can change your cookie settings through your browser.\nContent is automatically generated by Microsoft Azure Translator Text API. CGTN is not responsible for any of the translations.\nEditor's note: Fawad Razaqzada is a senior market analyst from Forex.com. The article reflects the author's opinions and not necessarily the views of CGTN.\nThe US dollar (USD) has had a slightly choppy start to the year. What's notable, though, is how quickly markets have brushed aside the geopolitical noise – not just from Venezuela, but also from Greenland.\nWith geopolitics taking a back seat, attention turns firmly to the US data calendar. This week's employment indicators could influence the USD or Japanese yen (JPY) forecast and the near-term direction of other major pairs.\nGeopolitics fail to rattle risk appetite\nFollowing the weekend's dramatic headlines out of Venezuela, the dollar started the first full trading week of 2026 on the front foot. The euro and Swiss franc softened, while gold, silver, and equity markets all pushed higher. Oil prices were more volatile, swinging sharply before slipping back on Tuesday amid concerns about additional supply entering the market. Oil prices softened after US President Donald Trump suggested the US could take control of up to 50 million barrels of Venezuelan crude.\nBut the broader market reaction has been notably muted. The dollar has clawed back some ground, though this appears more likely to be due to seasonal inflows and weakness in the euro (hit by weaker data) than any geopolitical premium.\nAs mentioned, the market response has been mixed rather than defensive. That suggests investors are not expecting immediate escalation, instead weighing short-term uncertainty against longer-term implications for Venezuelan oil production. While deeper US involvement in Venezuela, or any form of military action linked to Greenland, would be more market-moving – potentially driving some flows back into the yen – risk appetite remains intact for now. That backdrop continues to underpin USD/JPY.\nAll eyes back on US labor data\nA raft of US employment reports is due for the rest of this week, which could help shape market expectations for the early part of January.\nHistorically, the dollar often struggles in December before finding its feet again as the new year gets underway. With a large chunk of Federal Reserve easing already priced in, dollar bears may find it hard going unless the data takes a clear turn for the worse. Any upside surprises, therefore, should help support the USD/JPY forecast, particularly with the yen still under pressure amid a lack of meaningful pushback from either the Bank of Japan or the Japanese government.\nAdmittedly, it hasn't been the strongest start to the year for US macro numbers, with this week's ISM manufacturing purchasing managers' index coming in on the soft side. That said, it followed a run of stronger-than-expected data towards the end of 2025, including jobless claims, pending home sales, and Q3 GDP. Growth in Q3 was revised up to an annualized 4.3 percent, well above the 3.3 percent consensus, which complicates the argument for aggressive Fed rate cuts this year.\nAt present, markets aren't fully pricing in the next 25 basis point cut until June, with a second one pencilled in for September. Those expectations could easily be pared back if the upcoming labor market data come in firm.\nWith the Fed now more focused on employment than inflation, labor market data carries added significance for the dollar. For now, the near-term outlook for the greenback remains neutral to mildly constructive.\nTechnical USD or JPY forecast: Price action still favors the upside\nFrom a technical point of view, despite this week's pullback from the 157.00 area, the path of least resistance for USD or JPY still looks higher. The main bearish argument at this stage is that the pair failed"
            },
            {
                "title": "Robotic software firm Mujin tops Japan startup fundraising ranks - Nikkei Asia",
                "source": "Nikkei Asia",
                "url": "https://asia.nikkei.com/business/startups/robotic-software-firm-mujin-tops-japan-startup-fundraising-ranks",
                "body": "TOKYO -- Robotics software developer Mujin took the fundraising crown among Japanese startups last year, underscoring the excitement over the emerging physical artificial intelligence field.\nAI, autonomous driving and entertainment sectors fill 2025 rankings\nMujin develops software to control robots for manufacturers and warehouse operators. (Mujin)\nTOKYO -- Robotics software developer Mujin took the fundraising crown among Japanese startups last year, underscoring the excitement over the emerging physical artificial intelligence field."
            },
            {
                "title": "There is a possibility that Japanese Prime Minister Takaichi Sanae will dissolve the National Assemb.. - 매일경제",
                "source": "매일경제",
                "url": "https://www.mk.co.kr/en/world/11929207",
                "body": "The number of seats in the House of Representatives reset by believing in approval ratings\nThe yen's lowest in a year due to concerns over the prime minister's active fiscal policy\nThe Nikkei average futures surged on expectations of a rise in stock prices\nThere is a possibility that Japanese Prime Minister Takaichi Sanae will dissolve the National Assembly this month and hold an early general election. He intends to change the political situation based on his high approval rating for the Cabinet. With the news of the early general election, the Japanese financial market seems to be fluctuating.\nMajor Japanese media, including the Yomiuri Shimbun, reported on the 11th that Prime Minister Takaichi has begun a review to dissolve the House of Representatives (House of Representatives) at the beginning of the regular session of the National Assembly, which is scheduled to convene on the 23rd.\nThe Japanese National Assembly consists of the upper house (the upper house) with a term of six years and the lower house with a term of four years. The upper house is guaranteed a term of office, but the lower house can be dissolved by the prime minister at any time. If the dissolution of the House of Representatives is carried out, the election schedule is likely to be \"voting on February 8 after the election announcement on January 27\" and \"voting on February 15 after the election announcement on February 3.\"\nPrime Minister Takaichi is considering dissolving the House of Representatives because of his high approval rating for the Cabinet. According to surveys by the Yomiuri Shimbun and the Nihon Keizai Shimbun (Nikkei), it has maintained 70% since its inception.\nThe total number of seats in the House of Representatives is 465. The Liberal Democratic Party has 199 seats, with 34 seats in the ruling coalition, the Japan Restoration Congress, barely meeting its majority (233 seats). The Liberal Democratic Party is trying to bring the People's Democratic Party (27 seats) into the coalition for a more stable political operation, but it is not easy.\nNikkei said, \"Prime Minister Takaichi is still below the majority in the upper house, so cooperation with opposition parties is essential for political management,\" adding, \"The intention is to gain public trust in his policies through elections.\"\nDissolution of the House of Representatives is the prime minister's greatest authority. There have been a total of 22 dissolution since the formation of the Liberal Democratic Party in 1955. Within one year of taking office, it was the highest, reaching 60%. Prime Minister Takaichi also took office on October 21 last year, and it has not yet been 100 days.\nAfter the dissolution of the House of Representatives, the election did not necessarily help the prime minister at the time. Of the nine cases dissolved within a year after taking office, only six have been secured by the ruling party.\nIn 2024, when political donations were a problem, in 2009, when the government was replaced by the Democratic Party, and in 1979, when the general consumption tax was newly established, the backlash was released to the ruling party, resulting in election defeat. Currently, the approval rating for the Takaichi Cabinet is high, but the approval rating for the ruling Liberal Democratic Party is only 30%, which is also considered worrisome.\nNews of the early general election is also affecting the Japanese financial market. The yen fell to 158 yen per dollar in the New York foreign exchange market on the 9th (local time), the lowest level in about a year since mid-January last year.\nNikkei said, \"The yen plunged as news of the dissolution of the House of Representatives became known to the market,\" adding, \"It is because of concerns that if Prime Minister Takaiichi accelerates his finances actively, the fiscal deterioration will continue.\"\nOn the other hand, the Nikkei futures (March) surged to 53,860 yen at one point on the Osaka Stock Exchange on the 9th. The number exceeds th"
            }
        ]
    }
]