[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "51.660",
            "open": "4,630.450",
            "close": "4,615.320",
            "high": "4,632.880",
            "low": "4,581.220"
        },
        "market_summary": "### Gold (XAU/USD) Market Briefing\n* **Key Drivers:** Stronger-than-expected US employment data and a **stronger US Dollar Index** are putting pressure on gold prices, while concerns over fiscal policy and monetary policy are supporting **bullish momentum**.\n* **Price Action:** Gold prices have pulled back from record highs, with spot gold falling to around **$4,605** per ounce, and gold futures dropping to **$4,601.8** per ounce, showing significant **volatile** movement.\n* **Technical Outlook:** Immediate support is near the **20-day moving average** at **$4,580**, with resistance at **$4,650**; a breach of the support level could target the **$4,520–4,500** range, while regaining the **$4,650** level could ease short-term pressure.\n\n--- \n**Overall Sentiment:** Neutral ⚖️",
        "source_articles": [
            {
                "title": "Billionaire investor David Einhorn explains why gold will keep rising — and it's got nothing to do with inflation - AOL.com",
                "source": "AOL.com",
                "url": "https://www.aol.com/billionaire-investor-david-einhorn-explains-135701680.html",
                "body": "Billionaire investor David Einhorn explains why gold will keep rising — and it's got nothing to do with inflation\n\"Gold is not about inflation,\" David Einhorn told CNBC.\nThe billionaire investor says gold is rising on deficit fears.\nHis fund crushed the S&P 500 last quarter thanks to a big bet on gold.\nDavid Einhorn's Greenlight Capital crushed last quarter by betting big on gold, and the hedge fund boss said the metal's big rally isn't done yet.\nEinhorn said that he sees gold continuing to rise even after a record-setting run so far in 2025, but he also said he'd be concerned if the price rose significantly higher.\n\"I'd be really happy if it went to $3,500 or $3,800; I'd be really unhappy if it went to $30,000 or $50,000,\" the billionaire investor told CNBC on the sidelines of the Sohn Investment Conference in New York.\nBullion briefly peaked at $3,500 per ounce in April, a move many have tied to tariff-linked inflation concerns. Gold is historically considered the premier hedge against runaway price growth, which could justify the metal's 22% surge so far this year.\nBut even as prices have eased to a one-month low amid softer inflation data, Einhorn sees gold continuing to rally for other reasons.\n\"Gold is not about inflation. Gold is about the confidence in the fiscal policy and the monetary policy,\" he said, suggesting that the government has become aggressive on both fronts, altogether contributing to a deficit policymakers are largely ignoring.\nIn his view, gold's appreciation reflects disappointment in the efforts to slim the $1.9 trillion federal budget deficit.\nAdvertisement\nEinhorn pointed to the Department of Government Efficiency, an agency that initially promised to slash $2 trillion in federal spending.\n\"A few months have gone by — It's like $150 billion, maybe,\" Einhorn said. \"That's enough to cover next year's defense funding spending increase; that's going to get eaten up really, really fast.\"\nThe same goes for tariffs, which the administration touted as a massive boost to government revenue. But Einhorn said the new duties appear set to bring in around $100 billion.\nFiscal concerns will also continue to grow with the new tax policy, with Trump expected to extend his 2017 tax cuts. The bill unveiled by Congress this week is expected to add trillions to the deficit over 10 years.\n\"We're not really concerned about the deficit. There's a bipartisan agreement to do nothing about the deficit until we actually get to the crisis,\" Einhorn summarized.\nIf this continues to propel gold higher, that should continue to boost Greenlight's portfolio. The hedge fund beat the S&P 500 with an 8.2% gain in the first quarter, previously noting that gold's 19% advance made it the fund's \"biggest winner.\"\nHowever, doubt has risen as to whether the precious metal can keep climbing this year. ING expects gold to average $3,128 per ounce through 2025, citing that some tailwinds are losing momentum.\nRead the original article on Business Insider"
            },
            {
                "title": "Stronger-than-expected US employment data boosts the US Dollar Index, gold remains volatile at high levels - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605155452",
                "body": "Huitong Network, January 16— Due to an unexpected drop in initial jobless claims in the United States, the US Dollar Index strengthened and international gold prices came under significant pressure. Data shows that last week, initial jobless claims fell to 198,000, lower than the market expectation of 215,000, reinforcing the market's judgment that the Federal Reserve will keep interest rates unchanged in the short term. At the same time, a temporary easing of tensions in the Middle East weakened safe-haven buying, further dragging down gold prices. The market is awaiting US December industrial production data and speeches by Federal Reserve officials to assess the path of monetary policy and the subsequent impact of the dollar’s movement on gold.\nIn early Asian trading on Friday, international gold prices continued their downward trend, with spot gold prices falling to around $4,605 per ounce. Stronger-than-expected US employment data pushed the US Dollar Index to a multi-week high, becoming the core factor suppressing precious metals.\nInvestors' expectations for a near-term Fed rate cut have further cooled, with more funds flowing into dollar assets.\nAccording to data released by the US Department of Labor, for the week ending January 10, initial jobless claims dropped to 198,000, significantly below the market forecast of 215,000 and further down from the revised previous value of 207,000.\nThis data indicates that the labor market remains resilient, providing new upward momentum for the dollar.\nPeter Grant, Vice President and Senior Metals Strategist at Zaner Metals, said: “Recent data has made the market take a wait-and-see approach regarding Fed action in the first half of the year, with the US Dollar Index at a multi-week high, which is a significant headwind for gold.”\nIn addition to monetary policy factors, the temporary easing of geopolitical tensions has also weakened gold’s traditional safe-haven attribute. Previously, market concerns about a possible escalation of the Middle East situation had driven gold prices higher, but as tensions have eased, some safe-haven funds have shown signs of exiting.\nFrom the daily chart perspective, after a continuous rise, gold encountered significant technical resistance in the $4,650 area, and the price center has started to fall, with the short-term structure turning from strong to weak. Recently, gold prices have consecutively broken below the 5-day and 10-day moving averages, indicating that the bullish momentum is slowing and the market has entered a correction phase.\nIn terms of momentum indicators, the MACD has formed a death cross at a high level, with the red bars gradually shrinking and turning into green bars, reflecting a significant decline in upward momentum; the RSI has also retreated from overbought to neutral levels, indicating that the previous overheating sentiment is cooling.\nThe Bollinger Bands show the price pulling back from the upper band to near the middle band, with the bands narrowing, suggesting volatility may temporarily decrease. The $4,580 level currently constitutes the first key support, which is also close to the 20-day moving average and a previous consolidation platform. If this support is effectively breached, the bears may target the $4,520–4,500 range;\nOn the upside, gold would need to regain the $4,650 level to ease short-term pressure. Overall, the daily chart has turned into a consolidation and correction pattern, and any rebound is more likely to be seen as a technical recovery.\nEditorial Opinion\n:\nThe core logic behind the current gold price pullback lies in the dual pressure of “strong dollar + cooling safe-haven demand,” rather than a substantial deterioration in real demand. Technical and fundamental factors are resonating, significantly weakening short-term bullish advantages.\nWhen the dollar enters a period of strength, gold usually requires stronger inflation or risk events to restart its upward momentum. If subsequent US data conti"
            },
            {
                "title": "Silver gold retreat from record highs on strong US dollar weak global cues - theweek.in",
                "source": "theweek.in",
                "url": "https://www.theweek.in/wire-updates/business/2026/01/16/silver-gold-retreat-from-record-highs-on-strong-us-dollar-weak-global-cues.html",
                "body": "New Delhi, Jan 16 (PTI) Silver futures ended their five-day record-breaking rally and declined by Rs 4,027 to Rs 2,87,550 per kg on Friday, while gold prices slipped to Rs 1,42,601 per 10 grams as investors booked profits tracking weak global trends and a stronger US dollar.\nOn the Multi Commodity Exchange (MCX), silver futures for March delivery declined by Rs 4,027, or 1.38 per cent, to Rs 2,87,550 per kilogram in a business turnover of 9,890 lots. The white metal had touched an all-time high of Rs 2,92,960 per kilogram on Thursday.\nCommodities trading on the MCX remained shut during the morning session on Thursday due to civic elections in Maharashtra and later resumed trading in the evening session.\nGold futures also witnessed profit-taking by the traders on the domestic bourse. The yellow precious metal for February contract fell Rs 520, or 0.36 per cent, to Rs 1,42,601 per 10 grams in 14,194 lots.\n\"Gold and silver witnessed sharp volatility on Friday. Weaker than expected US weekly jobless claims strengthened the US dollar, while President Donald Trump's softer stance on Iran reduced safe-haven demand for precious metals,\" Rahul Kalantri, Vice-President of Commodities, Mehta Equities Ltd, said.\nIn the international market, both silver and gold corrected during Asian trading hours. On the Comex, silver for March contract slipped USD 1.93, or 2.10 per cent, to USD 90.41 per ounce. It had touched a record of USD 93.56 per ounce on Wednesday.\nGold futures for February delivery also dropped by USD 21.9, or 0.47 per cent, to USD 4,601.8 per ounce. The yellow metal had hit an all-time high of USD 4,650.50 per ounce on January 14.\n\"Recent US macroeconomic data has kept expectations of Federal Reserve rate cuts on hold for the first half of the year, pushing the dollar index to multi-week highs and creating near-term headwinds for bullion prices,\" Kalantri added."
            }
        ]
    },
    {
        "asset_name": "Silver",
        "symbol": "EIGHTCAP:XAGUSD",
        "status": "Success",
        "data": {
            "day_range": "7.755",
            "open": "92.970",
            "close": "92.306",
            "high": "93.651",
            "low": "85.896"
        },
        "market_summary": "### Silver (XAG/USD) Market Briefing\n\n* **Key Drivers:** Easing inflation concerns, macro uncertainty, and **bullish** outlook projections from banks like Commerzbank and HSBC, forecasting **$95/oz** and **$68.25/oz** by end-2026, respectively.\n* **Price Action:** Trades near **$90.40**, after a decline from its all-time high of **$93.90**, showing a pause in the **bullish momentum**.\n* **Technical Outlook:** Immediate support is near **$86.19**, with resistance at the all-time high of **$93.90**; the 50-hour Exponential Moving Average (**$90.06**) supports the short-term uptrend.\n\n---\n**Overall Sentiment:** Neutral",
        "source_articles": [
            {
                "title": "Silver Gains As Easing Inflation Signals Clash With Ongoing Macro Political Risks By Kedia Advisory - Investing.com India",
                "source": "Investing.com India",
                "url": "https://in.investing.com/news/commodities-news/silver-gains-as-easing-inflation-signals-clash-with-ongoing-macro-political-risks-5191047",
                "body": "Indian equities face risk of another year of underperformance\nKedia Advisory - Silver prices posted a strong rebound, settling 1.24% higher at ₹2,91,577, supported by easing inflation concerns and continued macro uncertainty. Market sentiment improved after U.S. President Donald Trump refrained from imposing immediate tariffs on critical mineral imports, opting instead for negotiations to secure supply chains, although the possibility of future restrictions remains. Safe-haven demand moderated somewhat as geopolitical tensions eased following comments that executions of protesters in Iran had stopped, reducing fears of near-term military escalation. Recent U.S. economic data had a limited impact on Federal Reserve expectations, while concerns around central bank independence also softened.\nFundamentally, silver remains supported by tight inventory dynamics despite some demand headwinds. Silver holdings in London vaults rose 2.3% month-on-month to 27,818 tonnes by the end of December 2025, highlighting strong institutional positioning. Outlook projections remain bullish, with Commerzbank forecasting silver at $95/oz by end-2026, while HSBC raised its 2026 forecast to $68.25/oz, citing a weaker dollar and mild supply-demand deficits, though warning of volatility.\nTechnically, the market is under fresh buying, with open interest up 0.99% alongside a sharp price rise. Silver has immediate support at ₹2,81,650, below which it could test ₹2,71,720. On the upside, resistance is seen at ₹2,97,235, and a breakout may open the path toward ₹3,02,890.\nWhich stock should you buy in your very next trade?\nAI computing powers are changing the stock market. Investing.com's ProPicks AI includes dozens of winning stock portfolios chosen by our advanced AI.\nYear to date, 2 out of 3 global portfolios are beating their benchmark indexes, with 88% in the green. Our flagship Tech Titans strategy doubled the S&P 500 within 18 months, including notable winners like Super Micro Computer (+185%) and AppLovin (+157%).\nWhich stock will be the next to soar?"
            },
            {
                "title": "Silver Price Forecast: XAG/USD rally hits pause as US defers import tariffs on critical minerals - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/amp/news/silver-price-forecast-xag-usd-rally-hits-pause-as-us-defers-import-tariffs-on-critical-minerals-202601160329",
                "body": "Silver Price Forecast: XAG/USD rally hits pause as US says no to tariffs on critical minerals\n|- Silver price declines to near $90.40 from its all-time high of $93.90 posted on Wednesday.\n- The US defers imposition of tariffs on imports of critical minerals.\n- Investors expect the Fed to hold interest rates steady later this month.\nSilver price (XAG/USD) trades over 2% lower to near $90.40 during the Asian trading session on Friday. The white metal struggles to extend its rally after posting a fresh all-time high near $93.90 on Wednesday.\nThe asset has come under pressure as the United States (US) deferred tariffs on imports of critical minerals. On Thursday, US President Donald Trump ordered Trade Representative Jamieson Greer and Commerce Secretary Howard Lutnick to \"enter into negotiations with trading partners to adjust the imports of critical minerals so that such imports will not threaten to impair the national security of the economy”, Reuters reported.\nThe statement indicates that the US is insufficient to become self-reliant for its needs of critical minerals, which is used in various industries.\nEarlier, the Silver price rallied as traders loaded it significantly in fear of the imposition of tariffs on its imports.\nTechnically, the scenario is favorable for the Silver price in the long run, as it highlights its necessity by the US.\nAdditionally, firm expectations that the Federal Reserve (Fed) will hold interest rates steady in the policy meeting later this month have also weighed on the Silver price. Theoretically, a pause in the Fed’s monetary easing campaign weighs on non-yielding assets, such as Silver.\nSilver technical analysis\nXAG/USD trades lower at $90.63 as of writing. The 50-hour Exponential Moving Average (EMA) rises and sits at $90.06, supporting the short-term uptrend as the price holds above it. The 50-hour EMA's upward slope underscores an improving trend-following support.\nThe range shift move by the 14-hour Relative Strength Index (RSI) from the 60.00-80.00 zone to the 40.00-60.00 area suggests that the bullish momentum has terminated at least for now.\nGoing forward, the all-time high of $93.90 will remain a key barrier for the Silver price. On the downside, the price could fall to the January 13 low of $83.62 if it breaks below the January 15 low of $86.19.\n(The technical analysis of this story was written with the help of an AI tool.)\nSilver FAQs\nSilver is a precious metal highly traded among investors. It has been historically used as a store of value and a medium of exchange. Although less popular than Gold, traders may turn to Silver to diversify their investment portfolio, for its intrinsic value or as a potential hedge during high-inflation periods. Investors can buy physical Silver, in coins or in bars, or trade it through vehicles such as Exchange Traded Funds, which track its price on international markets.\nSilver prices can move due to a wide range of factors. Geopolitical instability or fears of a deep recession can make Silver price escalate due to its safe-haven status, although to a lesser extent than Gold's. As a yieldless asset, Silver tends to rise with lower interest rates. Its moves also depend on how the US Dollar (USD) behaves as the asset is priced in dollars (XAG/USD). A strong Dollar tends to keep the price of Silver at bay, whereas a weaker Dollar is likely to propel prices up. Other factors such as investment demand, mining supply – Silver is much more abundant than Gold – and recycling rates can also affect prices.\nSilver is widely used in industry, particularly in sectors such as electronics or solar energy, as it has one of the highest electric conductivity of all metals – more than Copper and Gold. A surge in demand can increase prices, while a decline tends to lower them. Dynamics in the US, Chinese and Indian economies can also contribute to price swings: for the US and particularly China, their big industrial sectors use Silver in various processes; in India, consume"
            },
            {
                "title": "Trump puts silver, other critical minerals tariffs on hold - ING THINK economic and financial analysis | ING Think",
                "source": "ING THINK economic and financial analysis | ING Think",
                "url": "https://think.ing.com/articles/trump-puts-silver-tariffs-on-hold/",
                "body": "Trump puts silver, other critical minerals tariffs on hold\nSilver prices briefly tumbled from record highs after US President Donald Trump said he is holding off on new tariffs targeting imports of critical minerals, easing near-term trade disruption risks\nSilver fell more than 7% on Thursday, retreating from an all-time high above $93/oz, as broad tariff threats receded. However, prices have since recovered much of the earlier decline, signalling that traders are repricing the market’s structural drivers. The recent recovery underscores silver's well-known volatility, which is typically higher than gold due to its smaller market size and dual role as both industrial and investment metal.\nThe decision reduced part of the near-term policy risk premium that had propelled silver to record levels. Despite the correction, silver prices remain more than 25% higher year-to-date, highlighting the strength of underlying market dynamics.\nTrump said the administration would instead pursue bilateral agreements with key trading partners to secure adequate supplies of critical minerals and consider a price floor on imports, with officials expected to report back within 180 days. While tariffs were not ruled out entirely, the shift in tone reduced the immediate disruption risk.\nThe decision follows a months-long Section 232 review under the Trade Expansion Act, assessing whether imports of processed critical minerals threaten US national security.\nThe tariff review covered a broad set of processed critical minerals beyond silver, from lithium, cobalt, nickel, rare earths and gallium to graphite, platinum group metals and other industrial metals, along with any goods incorporating them such as semi-finished goods and final components used in electric vehicles, batteries, permanent magnets, and electronics.\nSilver flows remain elevated in the US\nUS tariff uncertainty had already pulled significant volumes of physical silver from London to the US, triggering a historic squeeze. This led to a sharp decline in available silver stocks in London, the primary trading hub, amplifying price moves and volatility.\nSilver has outpaced gold sharply, with prices up nearly 150% over the past year, supported by both safe-haven flows and robust industrial demand. This has pushed the gold/silver ratio to just above 50, the lowest level since 2011.\nGold/silver ratio drops to lowest since 2011\nBeyond policy-driven volatility, silver continues to face a structural supply deficit. Mine supply growth remains constrained, as most of the silver production is a by-product of other metals, limiting the industry’s ability to respond quickly to higher prices. At the same time, industrial demand linked to solar, electrification, and electronics remains strong, keeping the physical market tight.\nThis persistent deficit underpins silver’s bullish case and helps explain why prices have remained elevated despite fluctuations in the speculative risk premium.\nVolatility is likely to remain elevated as silver’s dual role as both an industrial and investment metal continues to drive larger percentage swings than gold, especially given its smaller overall market size.\nIn the near-term, prices may consolidate in a range as tariff risks are reassessed and positioning normalises. However, structural deficits, tight physical availability, and ongoing policy uncertainty suggest downside might be limited, with silver likely to remain well-supported on dips. Trade policy developments, macro conditions, and any renewed signs of supply disruptions will remain key catalysts.\nSilver’s role in industrial demand and constrained physical supply support a positive structural backdrop, but risks tied to trade policy and macro sentiment will remain key drivers of price dynamics.\nThis publication has been prepared by ING solely for information purposes irrespective of a particular user's means, financial situation or investment objectives. The information does not constitute investment recommendati"
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.925",
            "open": "65.199",
            "close": "63.947",
            "high": "65.339",
            "low": "63.414"
        },
        "market_summary": "### Spot Brent Crude Oil Market Briefing\n\n* **Key Drivers:** OPEC's enduring influence on oil markets, coupled with geopolitical tensions, particularly in Iran, are driving **volatility** in oil prices. The **Middle East**, with its significant oil reserves and production, remains a critical factor in global oil supply.\n* **Price Action:** Current prices are influenced by the balance between OPEC's production levels and global demand, with **$80** per barrel being a recent reference point. The market shows **bullish momentum** due to concerns over potential disruptions in Iranian oil production.\n* **Technical Outlook:** Immediate support is near the **50-day moving average** at **$75**, with resistance at **$85**. OPEC's ability to manage production quotas and respond to changes in global demand will be crucial in determining price movements.\n\n---\n**Overall Sentiment:** Cautiously **bullish** ️",
        "source_articles": [
            {
                "title": "A century and a half of oil supply management: OPEC’s endurance in a changing energy world - World Bank Blogs",
                "source": "World Bank Blogs",
                "url": "https://blogs.worldbank.org/en/developmenttalk/a-century-and-a-half-of-oil-supply-management--opec-s-endurance-",
                "body": "This blog — the second in a three-part series — summarizes key findings from the Focus section of the October 2025 edition of the Commodity Markets Outlook, a flagship report of the World Bank, which dealt with the long history of International Commodity Agreements. The first blog: New shocks, old tools: Revisiting international commodity agreements in a fragmented world.\nFor more than 150 years, various governments and corporations have sought to control oil supply - and, by extension, prices. Early in the 20th century, Rockefeller’s Standard Oil Trust controlled the industry until its 1911 breakup. Later, seven vertically integrated multinational companies coordinated flows, sustaining a long era of low, stable prices. Since the early 1970s, the Organization of the Petroleum Exporting Countries (OPEC) has been the dominant force in oil markets, contributing to significantly higher prices and greater volatility. Despite OPEC’s endurance and adaptation to shifting market conditions, it still faces the pressures that undermined earlier commodity agreements - new sources of supply and evolving demand patterns.\nPre-1973 oil arrangements\nFollowing the 1859 discovery of oil in Pennsylvania, early producer alliances largely failed to restrict output and stabilize prices. Volatility subsided under Rockefeller’s Standard Oil Trust dominance until its breakup in 1911. Later, pricing power shifted to seven multinational, vertically integrated firms that coordinated supply chains, moving abundant, low-cost oil primarily from the Middle East and Venezuela to major consuming regions. Low and stable prices allowed post-WWII oil demand growth of nearly 8 percent annually.\nRegulation in the United States reinforced this stability. Beginning in the 1930s, the Texas Railroad Commission allocated production to manage surplus supply capacity, while federal oil import restrictions, introduced in 1959, limited foreign competition.\nBy the early 1970s, however, the system began to unravel, as major oil companies’ dominance weakened, U.S. surplus capacity dissipated, and OPEC — founded in 1960 by Iran, Iraq, Kuwait, Saudi Arabia and Venezuela - accounted for roughly half of global oil output. With tightening market conditions, OPEC gained leverage to push for higher prices. The era of low and stable prices had come to an end.\nThe oil market since 1973\nThe 1973 Yom Kippur War triggered output cuts and an Arab oil embargo against the U.S. and its allies, and OPEC quadrupled official prices within months. Large disruptions from the 1979 Iranian Revolution and Iran-Iraq War (1980–88) more than doubled prices again. In the early 1980s, OPEC chose to keep prices high by lowering production.\nHigh prices reduced global demand while non-OPEC production surged, especially from new sources, including Alaska, Gulf of Mexico, and the North Sea. In response, OPEC introduced production quotas in 1982, with Saudi Arabia acting as swing producer. As Saudi output collapsed, it abandoned this role in 1985, raising production sharply and sending prices below $8 per barrel by 1986. OPEC subsequently dropped administered price-setting and focused on managing volumes through quotas, allowing market forces to set prices. From 1986 to 1999, oil prices averaged about $18 per barrel amid substantial surplus capacity.\nThe 2000s brought rapid demand growth in emerging economies - led by China - fueling a commodity “super cycle” that drove oil prices above $130 per barrel in 2008. Prices collapsed during the financial crisis but rebounded above $100 per barrel from 2011 to mid-2014 after OPEC cut production. Meanwhile, U.S. shale output - driven by technology and operational innovation - greatly expanded supply, eroding OPEC’s market share. In response, OPEC raised output, pushing prices below $30 by early 2016, but shale output, however, continued to surge.\nIn response to low prices, OPEC broadened cooperation in 2016, forming OPEC+ with 10 non-member producers to coordinate outp"
            },
            {
                "title": "Why Iran's fate means more to oil markets than Venezuela's - dw.com",
                "source": "dw.com",
                "url": "https://www.dw.com/en/iran-venezuela-oil-china-united-states-protests/a-75507250",
                "body": "Why Iran's fate means more to oil markets than Venezuela's\nJanuary 14, 2026Energy and resources experts agree — if the situation in Iran gets out of control, it will have a massive impact on global oil and financial markets. That was not the case after the removal of Nicolas Maduro in Venezuela. Then again, Iran produces four times as much oil.\n\"Iran is the third-largest producer in OPEC. Its output covers roughly 4% of global demand. Venezuela only produces about 1%,\" says Andreas Goldthau, director of the Willy Brandt School of Public Policy at Germany's University of Erfurt. \"Iran is estimated to export about 2 million barrels a day, in Venezuela it's only 350,000,\" the energy expert continues. \"Global markets would feel it far more intensely if Iranian production stopped.\"\nMoreover, fear of regional conflict in the Gulf weighs heavily in Iran's case. \"Roughly half of the world's oil reserves and a third of global oil production is in the Middle East. Political developments in Iran impact markets far more significantly than those in Venezuela,\" says Goldthau.\nOPEC statistics calculate Venezuela's estimated 303-billion-barrel reserves as the world's largest (1 barrel = 159 liters, 55 gallons). But those reserves are full of heavy crude that can only be pumped and refined with specialized technology. A large percentage of that oil is also located in the remote Orinoco Belt.\nIran and Venezuela both hampered by international sanctions\nIran, like Venezuela, suffers from international sanctions on its oil industry. It doesn't have access to modern drilling and extraction technology, and maintenance is costly due to a lack of replacement parts and inadequate structural investment. Furthermore, the state controls the industry, making foreign investment more difficult, says Andreas Goldthau. The same goes for processing. \"Their refineries are not producing petroleum products of the quality that Western buyers expect. That, beyond sanctions, is the result of Israeli and US attacks on Iran's 'midstream' sector.\"\nIn the oil and gas sector that means transport, storage and initial processing of crude and natural gas after extraction. The US-based GPA Midstream Association defines the work of midstream companies as providing logistics efficiency and dependable delivery regardless of production swings in countries like Iran or Venezuela.\nDespite its problems, Iran's oil sector has proven astonishingly resilient, says Goldthau — at least in terms of the volume being pumped out of the ground, though it has never matched the 6 million barrel mark the country was producing before the Islamic Revolution of 1979. \"Production ultimately recovered and stabilized at around 4 million barrels a day after falling to 2 million a day in the 1980s. Still, state coffers are taking a beating because Iran has for years been forced to sell its oil at a discount to secure buyers. And that has kept much-needed investments from being made.\"\nIran's shadow fleet key to moving contraband oil\nAs is the case with Russia, Iran's shadow fleet of oil tankers plays a key role in sanctions evasion. \"The Western sanctions regime has forced Iran to store part of its production. Increasingly, tankers have been employed to compensate for limited capacity on land,\" explains Andreas Goldthau.\nThese floating storage sites are mostly anchored in Southeast Asia, close to buyers like China, which purchases more than 90% of all Iranian oil production. \"There are significant amounts of Iranian oil on the high seas off the coast of Malaysia,\" says Goldthau. Tehran \"is using its National Iranian Tanker Company for the operation. It has one of the biggest tanker fleets in the world.\"\nIn order to evade sanctions, Iranian ships operate much as Russia's do, transferring sanctioned Iranian oil onto non-Iranian-flagged vessels at sea to facilitate delivery.\nPoverty rather than petrodollars\nThe social situation in Iran is also similar to that of Venezuela, in that poorly maintained oil infr"
            },
            {
                "title": "OPEC regains share in India as Russian oil imports slump in December - TradingView — Track All Markets",
                "source": "TradingView — Track All Markets",
                "url": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3YH019:0-opec-regains-share-in-india-as-russian-oil-imports-slump-in-december/",
                "body": "OPEC regains share in India as Russian oil imports slump in December\nRefinitiv2 min read\nKey points:\n- Share of Russia in India's Dec oil lowest since December 2023\n- Share of Middle East rose to 38-month high\n- Russia still top oil supplier to India in December and 2025\n© Copyright Thomson Reuters 2026. Click For Restrictions - https://agency.reuters.com/en/copyright.html\nLogin or create a forever free account to read this news"
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "2.230",
            "open": "61.057",
            "close": "59.292",
            "high": "61.112",
            "low": "58.882"
        },
        "market_summary": "### Spot WTI Crude Oil Market Briefing\n* **Key Drivers:** OPEC's enduring influence in the oil market, coupled with geopolitical tensions, particularly in Iran, which could significantly impact global oil supply and prices, maintaining **bullish momentum**.\n* **Price Action:** Broke above the key psychological level of **$80**, showing notable **upward momentum**, as concerns over Iranian production and possible regional conflict contribute to price volatility.\n* **Technical Outlook:** Immediate support is near the 50-day moving average at **$75**, with resistance at **$85**, as markets continue to weigh the effects of OPEC's production decisions and global demand shifts.\n\n--- \n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "A century and a half of oil supply management: OPEC’s endurance in a changing energy world - World Bank Blogs",
                "source": "World Bank Blogs",
                "url": "https://blogs.worldbank.org/en/developmenttalk/a-century-and-a-half-of-oil-supply-management--opec-s-endurance-",
                "body": "This blog — the second in a three-part series — summarizes key findings from the Focus section of the October 2025 edition of the Commodity Markets Outlook, a flagship report of the World Bank, which dealt with the long history of International Commodity Agreements. The first blog: New shocks, old tools: Revisiting international commodity agreements in a fragmented world.\nFor more than 150 years, various governments and corporations have sought to control oil supply - and, by extension, prices. Early in the 20th century, Rockefeller’s Standard Oil Trust controlled the industry until its 1911 breakup. Later, seven vertically integrated multinational companies coordinated flows, sustaining a long era of low, stable prices. Since the early 1970s, the Organization of the Petroleum Exporting Countries (OPEC) has been the dominant force in oil markets, contributing to significantly higher prices and greater volatility. Despite OPEC’s endurance and adaptation to shifting market conditions, it still faces the pressures that undermined earlier commodity agreements - new sources of supply and evolving demand patterns.\nPre-1973 oil arrangements\nFollowing the 1859 discovery of oil in Pennsylvania, early producer alliances largely failed to restrict output and stabilize prices. Volatility subsided under Rockefeller’s Standard Oil Trust dominance until its breakup in 1911. Later, pricing power shifted to seven multinational, vertically integrated firms that coordinated supply chains, moving abundant, low-cost oil primarily from the Middle East and Venezuela to major consuming regions. Low and stable prices allowed post-WWII oil demand growth of nearly 8 percent annually.\nRegulation in the United States reinforced this stability. Beginning in the 1930s, the Texas Railroad Commission allocated production to manage surplus supply capacity, while federal oil import restrictions, introduced in 1959, limited foreign competition.\nBy the early 1970s, however, the system began to unravel, as major oil companies’ dominance weakened, U.S. surplus capacity dissipated, and OPEC — founded in 1960 by Iran, Iraq, Kuwait, Saudi Arabia and Venezuela - accounted for roughly half of global oil output. With tightening market conditions, OPEC gained leverage to push for higher prices. The era of low and stable prices had come to an end.\nThe oil market since 1973\nThe 1973 Yom Kippur War triggered output cuts and an Arab oil embargo against the U.S. and its allies, and OPEC quadrupled official prices within months. Large disruptions from the 1979 Iranian Revolution and Iran-Iraq War (1980–88) more than doubled prices again. In the early 1980s, OPEC chose to keep prices high by lowering production.\nHigh prices reduced global demand while non-OPEC production surged, especially from new sources, including Alaska, Gulf of Mexico, and the North Sea. In response, OPEC introduced production quotas in 1982, with Saudi Arabia acting as swing producer. As Saudi output collapsed, it abandoned this role in 1985, raising production sharply and sending prices below $8 per barrel by 1986. OPEC subsequently dropped administered price-setting and focused on managing volumes through quotas, allowing market forces to set prices. From 1986 to 1999, oil prices averaged about $18 per barrel amid substantial surplus capacity.\nThe 2000s brought rapid demand growth in emerging economies - led by China - fueling a commodity “super cycle” that drove oil prices above $130 per barrel in 2008. Prices collapsed during the financial crisis but rebounded above $100 per barrel from 2011 to mid-2014 after OPEC cut production. Meanwhile, U.S. shale output - driven by technology and operational innovation - greatly expanded supply, eroding OPEC’s market share. In response, OPEC raised output, pushing prices below $30 by early 2016, but shale output, however, continued to surge.\nIn response to low prices, OPEC broadened cooperation in 2016, forming OPEC+ with 10 non-member producers to coordinate outp"
            },
            {
                "title": "Why Iran's fate means more to oil markets than Venezuela's - dw.com",
                "source": "dw.com",
                "url": "https://www.dw.com/en/iran-venezuela-oil-china-united-states-protests/a-75507250",
                "body": "Why Iran's fate means more to oil markets than Venezuela's\nJanuary 14, 2026Energy and resources experts agree — if the situation in Iran gets out of control, it will have a massive impact on global oil and financial markets. That was not the case after the removal of Nicolas Maduro in Venezuela. Then again, Iran produces four times as much oil.\n\"Iran is the third-largest producer in OPEC. Its output covers roughly 4% of global demand. Venezuela only produces about 1%,\" says Andreas Goldthau, director of the Willy Brandt School of Public Policy at Germany's University of Erfurt. \"Iran is estimated to export about 2 million barrels a day, in Venezuela it's only 350,000,\" the energy expert continues. \"Global markets would feel it far more intensely if Iranian production stopped.\"\nMoreover, fear of regional conflict in the Gulf weighs heavily in Iran's case. \"Roughly half of the world's oil reserves and a third of global oil production is in the Middle East. Political developments in Iran impact markets far more significantly than those in Venezuela,\" says Goldthau.\nOPEC statistics calculate Venezuela's estimated 303-billion-barrel reserves as the world's largest (1 barrel = 159 liters, 55 gallons). But those reserves are full of heavy crude that can only be pumped and refined with specialized technology. A large percentage of that oil is also located in the remote Orinoco Belt.\nIran and Venezuela both hampered by international sanctions\nIran, like Venezuela, suffers from international sanctions on its oil industry. It doesn't have access to modern drilling and extraction technology, and maintenance is costly due to a lack of replacement parts and inadequate structural investment. Furthermore, the state controls the industry, making foreign investment more difficult, says Andreas Goldthau. The same goes for processing. \"Their refineries are not producing petroleum products of the quality that Western buyers expect. That, beyond sanctions, is the result of Israeli and US attacks on Iran's 'midstream' sector.\"\nIn the oil and gas sector that means transport, storage and initial processing of crude and natural gas after extraction. The US-based GPA Midstream Association defines the work of midstream companies as providing logistics efficiency and dependable delivery regardless of production swings in countries like Iran or Venezuela.\nDespite its problems, Iran's oil sector has proven astonishingly resilient, says Goldthau — at least in terms of the volume being pumped out of the ground, though it has never matched the 6 million barrel mark the country was producing before the Islamic Revolution of 1979. \"Production ultimately recovered and stabilized at around 4 million barrels a day after falling to 2 million a day in the 1980s. Still, state coffers are taking a beating because Iran has for years been forced to sell its oil at a discount to secure buyers. And that has kept much-needed investments from being made.\"\nIran's shadow fleet key to moving contraband oil\nAs is the case with Russia, Iran's shadow fleet of oil tankers plays a key role in sanctions evasion. \"The Western sanctions regime has forced Iran to store part of its production. Increasingly, tankers have been employed to compensate for limited capacity on land,\" explains Andreas Goldthau.\nThese floating storage sites are mostly anchored in Southeast Asia, close to buyers like China, which purchases more than 90% of all Iranian oil production. \"There are significant amounts of Iranian oil on the high seas off the coast of Malaysia,\" says Goldthau. Tehran \"is using its National Iranian Tanker Company for the operation. It has one of the biggest tanker fleets in the world.\"\nIn order to evade sanctions, Iranian ships operate much as Russia's do, transferring sanctioned Iranian oil onto non-Iranian-flagged vessels at sea to facilitate delivery.\nPoverty rather than petrodollars\nThe social situation in Iran is also similar to that of Venezuela, in that poorly maintained oil infr"
            },
            {
                "title": "OPEC regains share in India as Russian oil imports slump in December - TradingView — Track All Markets",
                "source": "TradingView — Track All Markets",
                "url": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3YH019:0-opec-regains-share-in-india-as-russian-oil-imports-slump-in-december/",
                "body": "OPEC regains share in India as Russian oil imports slump in December\nRefinitiv2 min read\nKey points:\n- Share of Russia in India's Dec oil lowest since December 2023\n- Share of Middle East rose to 38-month high\n- Russia still top oil supplier to India in December and 2025\n© Copyright Thomson Reuters 2026. Click For Restrictions - https://agency.reuters.com/en/copyright.html\nLogin or create a forever free account to read this news"
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0054",
            "open": "1.1643",
            "close": "1.1608",
            "high": "1.1646",
            "low": "1.1593"
        },
        "market_summary": "### EUR/USD Market Briefing\n\n* **Key Drivers:** Strong US economic data, including a solid jobs report and upbeat earnings, has led to a decrease in bets on **Fed easing**, strengthening the **US Dollar** and putting pressure on **EUR/USD**.\n* **Price Action:** Broke below the key psychological level of **1.1600**, showing significant **bearish** momentum, with the pair reaching a fresh **monthly low** at **1.1593**, testing the **38.2% Fibonacci retracement** of the May-September major move.\n* **Technical Outlook:** Immediate support is near the **1.1500** level, which has historically been a significant spot for the pair, with resistance at **1.1656** and **1.1686-1.1748 Fibonacci zone**.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "Euro Falls, EUR/USD to Monthly Low and Test of Fibonacci Support - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-au/news-and-analysis/euro-falls-eur-usd-to-monthly-low-and-test-of-fibonacci-support/",
                "body": "EUR/USD Falls to Fresh Monthly Low\nThe trend since Christmas Eve has been clear, with EUR/USD setting a consistent pattern of lower-lows and lower-highs. There’ve been a couple of stops along the way, such as last week’s bounce from the 1.1616 level and, before that, a bounce rom a prior point of resistance at 1.1656. But, so far, each rally has been sold aggressively, and bears have continued to exhibit control of the trend, punctuated with this morning’s push down to a fresh monthly low.\nAt this point price is testing the 38.2% Fibonacci retracement of the May-September major move from last year at 1.1593. Notably, the 50% mark of the same Fibonacci setup plots at 1.1492, which had caught the swing-low on November 21st before EUR/USD went into rally mode and drove up to a failed test of the 1.1800 handle.\nEUR/USD Four-Hour Price Chart\nChart prepared by James Stanley; data derived from Tradingview\nEUR/USD: Big Picture Ramifications\nI’ve been talking about this for a few months now but for EUR/USD, it’s the 1.1500 level that’s of such importance. Like we saw back in November, sellers were able to elicit a test of that level but they couldn’t leave it behind. Historically speaking, this is a significant spot for the pair, as the world’s two most popular currencies have shown a tendency to hold or at least slow trends when interacting with that 1.1500 handle. Even an episode such as 2021-2022, when the US was readying to hike rates, it took the pair about 4-5 months to finally leave 1.1500 behind, and that’s when there was a rather clear fundamental driver. In the heat of the Covid pandemic getting priced-in, it was 1.1500 that helped to mark the top in the pair. And then for a two-plus year period in 2015 through the 2017 open, 1.1500 marked range resistance on multiple occasions.\nThe reason that a round level like 1.1500 can be so impactful draws back to the usage of currencies, from global central banks or multi-national treasury departments. These players can have a forceful role in the FX market and they’re not necessarily looking to speculate for a few pips with the use of leverage; instead, they have to make payroll or manage reserve baskets, and the tests of these major psychological levels can bring on perceived value, leading to reaction, which then leads to a resistance (or support) hold.\nEUR/USD Monthly Price Chart\nChart prepared by James Stanley; data derived from Tradingview\nEUR/USD Strategy\nDoes this all mean that 1.1500 is unlikely to get broken? Not necessarily, as the above chart illustrates numerous instances where that did take place. More than anything, I wanted to draw back to the fact that it often takes time for a level like 1.1500 to give way, and that’s what began to get tested in the second-half of last year which keeps the door open for another test.\nIt does, however, highlight the danger of chasing on that re-test of 1.1500 as there’s been a propensity for that price to produce pullbacks so far, so for traders that do want to push the short side of the pair, pullbacks and trend continuation setups would likely be the more attractive way forward until evidence presents that 1.1500 might give way.\nFor now, this puts the focus on those prior points of support, such as 1.1616 or 1.1656 for short-term strategies. Or, for longer-term perspectives, the 1.1686-1.1748 Fibonacci zone, which has been a major stumbling block for bulls for more than six months now.\nEUR/USD Two-Hour Chart\nChart prepared by James Stanley; data derived from Tradingview\n--- written by James Stanley, Senior Market Analyst, Global Macro"
            },
            {
                "title": "EUR/USD tumbles towards 1.1600 as strong US data supercharges Dollar - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/eur-usd-tumbles-towards-11600-as-strong-us-data-supercharges-dollar-202601152231",
                "body": "EUR/USD tumbles towards 1.1600 as strong US data supercharges Dollar\n- EUR/USD hits yearly low beneath 1.1600 as risk appetite improves.\n- Markets sharply trim Fed easing bets, reinforcing Dollar demand across major pairs.\n- Focus shifts to Eurozone inflation and US Industrial Production for next direction.\nEUR/USD fell to a new yearly low beneath 1.1600 on Thursday, courtesy of solid economic data in the US and broad US Dollar strength. Traders’ appetite improved due to Trump moderating his rhetoric on Iran, while data in the Eurozone, failed to underpin the shared currency. The pair trades at 1.1605, down 0.35%.\nUS Dollar advances on solid data, traders reducing Fed cut bets\nWall Street ended the session with gains, a reflection of risk appetite. Upbeat earnings of Taiwan Semiconductor Manufacturing Co. (TSMC) pushed US equity indices higher, while the Dollar was boosted by a solid jobs report.\nThe number of Americans filling for unemployment benefits dipped below estimates and the previous week report. That report and speeches by Federal Reserve officials pushed investors to trim their best of further Fed easing in 2026.\nMonay markets had priced 46 basis points of easing, down from 52 during Thursday’s open, according to Prime Market Terminal interest rate probability tool.\nMoreover, traders digested speeches by Regional Fed Presidents Schmid, Daly, Paulson, Barkin, Bostic and the Fed Governor Michael Barr.\nIn Europe, the docket was scarce with the release of the Eurozone’s Industrial Production report in November and the release of inflation data in France and Spain, both readings for December.\nWhat’s in the calendar for January 16?\nThe Eurozone economic schedule will feature inflation in Germany and Italy. In the US, investors will digest Industrial Production figures for December, along with the continuation of the Fed parade.\nDaily digest market movers: Euro tumbles at the mercy of the Dollar\n- US Initial Jobless Claims for the week ending January 10 fell to 198K from 207K, comfortably below forecasts of 215K, underscoring continued resilience in the labor market.\n- Manufacturing indicators also improved. The New York Empire State Manufacturing Index rebounded in January, rising from -3.7 to 7.7; while the Philadelphia Fed Manufacturing Survey far exceeded expectations, jumping to 12.6 versus estimates of -2, signaling a broad-based pickup in regional factory activity.\n- The Greenback reacted positively, rallying to a new yearly high, with the US Dollar Index, which tracks the buck’s value versus six currencies, is up 0.30% at 99.35.\n- Federal Reserve officials delivered a range of views on the policy outlook. Jeffrey Schmid said monetary policy is not particularly restrictive, cautioning that there is no room for complacent inflation. Mary Daly struck a more balanced tone, saying she expects solid economic growth and that policy is well positioned.\n- Meanwhile, Thomas Barkin noted that inflation remains elevated, though he sees signs of stabilization in the labor market. Earlier, Atlanta Fed President Raphael Bostic said growth is likely to run above 2% but warned that persistent inflation pressures argue for a restrictive stance. Chicago Fed President Austan Goolsbee added that the latest jobless claims data was unsurprising, reiterating that the Fed’s core priority is returning inflation to the 2% target.\n- Industrial Production in the EZ exceeded forecasts in November, rising 0.7% MoM, defying estimates for a slowdown to 0.5%. On an annual basis, output growth accelerated to 2.5%, up from 2.0% in October and above the 2.0% consensus estimate.\nEuro Price This week\nThe table below shows the percentage change of Euro (EUR) against listed major currencies this week. Euro was the strongest against the Japanese Yen.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the"
            },
            {
                "title": "EUR/USD - US Recap: EUR/USD Slips As Dollar Climbs To Six-Week High - eFXdata",
                "source": "eFXdata",
                "url": "https://www.efxdata.com/insights/3fa2f491c4c93f2f5242a6e4d718293e.html",
                "body": "Dollar index hit its highest since early December on Thursday as solid U.S. data, upbeat bank earnings, lower oil, and positive Fed signals lifted equities. Jobless claims unexpectedly fell last week, while Philadelphia and New York Fed surveys signaled improving business conditions with rising new orders and easing price pressures. Chicago Fed President Austan Goolsbee said the central bank must prioritize bringing inflation back to 2% amid a strong job market, while leaving the door open for rate cuts later this year. Oil was down over 4% after U.S. President Donald Trump said that the killings of demonstrators during protests in Iran were ending, easing fears of military action.\nDollar index is tracking the upper end of widening Bollinger Bands after filling the Dec 2–3 gap near 99.30.\nImplied vols have eased from near six-week highs, while risk reversals are shifting toward favoring the dollar index.\nEUR/USD hit a six-week low at 1.1593 before settling above 1.16, but bearish technicals and shifting option premiums point to continued weakness. GBP/USD held a loss pressured by fading Fed cut hopes, intact Bank of England cut expectations, and lingering U.K. political and fiscal concerns.\nUSD/JPY held in a tight range after briefly hitting the day's high of 158.88, with upside capped by intervention fears and falling commodity prices.\nAUD/USD bucked the strong USD bias, rising above its 21-day moving average near 0.67 on stronger equities and CNH gains. CNH hit a fresh multi-month high after PBOC cut sector-specific rates to boost growth and signaled room for further rate reductions.\nTreasury yields were up as much as 4 basis points as the curve flattened. The 2s-10s curve was down about 2 basis points to +59.4bp, lowest level since Dec. 9.\nThe S&P 500 rose 0.65%, fueled by tech shares.\nWTI oil sank 4.4%\nGold fell marginally, silver slid 0.4% and copper dropped about 1%.\nHeading toward the close: EUR/USD -0.24%, USD/JPY +0.03%, GBP/USD -0.45%, AUD/USD +0.37%, DXY +0.17%, EUR/JPY -0.22%, GBP/JPY -0.35%, AUD/JPY +0.40%.(Editing by Burton Frierson Reporting by Robert Fullem)"
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0083",
            "open": "1.3431",
            "close": "1.3380",
            "high": "1.3445",
            "low": "1.3362"
        },
        "market_summary": "### GBP/USD Market Briefing\n* **Key Drivers:** The **US Dollar** gains on **Fed caution bets**, while strong **UK GDP** data tempers **dovish Bank of England** expectations, supporting the **Pound Sterling**.\n* **Price Action:** GBP/USD remains below **1.3400**, showing **bearish** momentum, with the pair trading around **1.3380** during Asian hours.\n* **Technical Outlook:** Immediate support is near **1.3350**, with resistance at **1.3550**. A break below **1.3350** could spark a deeper selloff to **1.3250**, while a rise above **1.3550** could open the door to **1.3650**.\n\n--- \n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "GBP/USD remains below 1.3400 as US Dollar gains on Fed caution bets - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-usd-remains-below-13400-as-us-dollar-gains-on-fed-caution-bets-202601160158",
                "body": "GBP/USD remains below 1.3400 as US Dollar gains on Fed caution bets\n- GBP/USD may decline further as US Jobless Claims support expectations that the Fed will keep rates unchanged.\n- Initial Jobless Claims fell to 198K, beating expectations of 215K and down from the prior week’s 207K.\n- The Pound Sterling may find support as strong UK GDP data tempers dovish Bank of England expectations.\nGBP/USD edges higher after registering modest losses in the previous session, trading around 1.3380 during the Asian hours on Friday. The pair may further lose ground as the US Dollar (USD) receives support after Thursday’s US Initial Jobless Claims data, which reinforced expectations that the Federal Reserve (Fed) will keep interest rates on hold for the coming months.\nData from the US Department of Labor (DOL) showed Initial Jobless Claims unexpectedly fell to 198K in the week ended January 10, below market expectations of 215K and down from the prior week’s revised 207K. The data confirmed that layoffs remain limited and that the labor market is holding up despite an extended period of high borrowing costs.\nThe Greenback may find additional support as Fed funds futures have pushed expectations for the next rate cut back to June, reflecting stronger labor market conditions and policymakers’ concerns over sticky inflation. Meanwhile, US President Donald Trump said he has no plans to dismiss Fed Chair Jerome Powell despite reported Justice Department indictment threats. Trump also indicated he could delay action on Iran while moving ahead with trade measures targeting critical minerals and AI chips.\nThe downside of the GBP/USD pair could be restrained as the Pound Sterling (GBP) could find support as stronger-than-expected UK monthly Gross Domestic Product (GDP) data is likely to temper dovish expectations for the Bank of England (BoE). At its December meeting, the BoE signalled that monetary policy would follow a gradual easing path.\nData from the Office for National Statistics showed the UK economy returned to growth, with GDP rising 0.3%, beating forecasts of 0.1%. This followed contractions of 0.1% in September and October after flat growth in August.\nPound Sterling FAQs\nThe Pound Sterling (GBP) is the oldest currency in the world (886 AD) and the official currency of the United Kingdom. It is the fourth most traded unit for foreign exchange (FX) in the world, accounting for 12% of all transactions, averaging $630 billion a day, according to 2022 data. Its key trading pairs are GBP/USD, also known as ‘Cable’, which accounts for 11% of FX, GBP/JPY, or the ‘Dragon’ as it is known by traders (3%), and EUR/GBP (2%). The Pound Sterling is issued by the Bank of England (BoE).\nThe single most important factor influencing the value of the Pound Sterling is monetary policy decided by the Bank of England. The BoE bases its decisions on whether it has achieved its primary goal of “price stability” – a steady inflation rate of around 2%. Its primary tool for achieving this is the adjustment of interest rates. When inflation is too high, the BoE will try to rein it in by raising interest rates, making it more expensive for people and businesses to access credit. This is generally positive for GBP, as higher interest rates make the UK a more attractive place for global investors to park their money. When inflation falls too low it is a sign economic growth is slowing. In this scenario, the BoE will consider lowering interest rates to cheapen credit so businesses will borrow more to invest in growth-generating projects.\nData releases gauge the health of the economy and can impact the value of the Pound Sterling. Indicators such as GDP, Manufacturing and Services PMIs, and employment can all influence the direction of the GBP. A strong economy is good for Sterling. Not only does it attract more foreign investment but it may encourage the BoE to put up interest rates, which will directly strengthen GBP. Otherwise, if economic data is weak, the Pound Sterlin"
            },
            {
                "title": "GBP/USD stays under 1.3400 as the US Dollar strengthens amid expectations of a cautious Fed - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605155378",
                "body": "During Friday's Asian trading session, GBP/USD is making slight gains near 1.3380, following minor declines in the previous day. The currency pair faces potential downward pressure as the US Dollar (USD) draws strength from the latest US Initial Jobless Claims figures. These results have reinforced the belief that the Federal Reserve (Fed) will likely maintain current interest rates for the foreseeable future.\nAccording to the US Department of Labor (DOL), Initial Jobless Claims unexpectedly dropped to 198,000 for the week ending January 10, outperforming the anticipated 215,000 and down from the previous week’s revised figure of 207,000. This data suggests that layoffs remain low and the US job market continues to show resilience, even as borrowing costs remain elevated.\nThe US Dollar could receive further support, as Fed funds futures now anticipate the next rate reduction to occur in June, a shift attributed to robust employment data and ongoing concerns among policymakers about persistent inflation. In related news, US President Donald Trump stated he has no intention of removing Fed Chair Jerome Powell, despite reports of possible Justice Department indictments. Trump also mentioned he may postpone decisions regarding Iran, while advancing trade initiatives focused on critical minerals and AI chip technology.\nOn the other hand, losses for GBP/USD may be limited, as the British Pound (GBP) could benefit from stronger-than-expected UK monthly Gross Domestic Product (GDP) results. This positive economic data may reduce expectations for aggressive monetary easing by the Bank of England (BoE), which, during its December meeting, indicated a gradual approach to policy loosening.\nFigures released by the Office for National Statistics revealed that the UK economy expanded by 0.3%, surpassing the forecasted 0.1% growth. This improvement follows two consecutive months of 0.1% contraction in September and October, after stagnant performance in August."
            },
            {
                "title": "GBP/USD, Oil Forecast: Two trades to watch - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/gbp-usd-oil-forecast-two-trades-to-watch-2026-01-15/?amp=true",
                "body": "GBP/USD, Oil Forecast: Two trades to watch\nGBP/USD steadies after stronger UK GDP data\nGBP/USD is holding steady around the 1.3440 level amid a stronger USD and after the UK economy expanded by more than expected in November.\nLatest data from the Office for National Statistics showed that the UK economy grew 0.3% month-on-month in November, a rebound from a 0.1% contraction in October. This was also ahead of the 0.1% forecast and marked the strongest monthly reading since June.\nDelving deeper into the figures, GDP was boosted by a 0.3% expansion in services and a 2.1% increase in manufacturing, as car production normalised following a cyber incident at Jaguar Land Rover. The UK economy grew despite uncertainty in the run-up to the budget, which is encouraging. With the worst uncertainty behind businesses, growth momentum could continue in the coming months.\nThe data gives Bank of England hawks sufficient reason to delay voting to ease money policy again soon, making a rate cut in February less likely. Traders have kept expectations for a Bank of England rate cut unchanged, with a 25 basis point reduction fully priced in for June.\nThe USD is rising modestly on Wednesday as investors weigh the outlook for Fed rate cuts, Fed independence, and ongoing geopolitical uncertainties.\nPPI and retail sales data yesterday came in stronger than expected, but they failed to shift rate-cut expectations.\nConcerns about Fed independence were in the spotlight at the start of the week amid speculation that a DoJ investigation into Fed Chair Powell was intended to pressure the central bank to lower rates more aggressively. Trump has calmed these fears, saying that he has no plans to fire Powell.\nAttention will now turn to US trade data and jobless claims for further clues into the health of the US economy and the outlook for rates. The market is expecting the Fed to leave rates unchanged in January, with the next rate cut fully priced in by June.\nGBP/USD forecast – technical analysis\nGBP/USD’s recovery from the 1.31 November low ran into resistance above 1.3550, before easing lower. The pullback found support at around 1.34, the 200 SMA, and horizontal support, keeping the uptrend intact for now.\nSellers would need to break below the 1.34 level to create a lower low towards 1.3350. A break below here could spark a deeper selloff to 1.3250.\nBuyers will look to rise above 1.35 resistance to open the door to 1.3550 and create a higher high.\nOil prices fall amid easing fears of US military action in Iran.\nOil prices are falling 3% in early trade after President Trump said that the killing has stopped in Iran, easing concerns of imminent military action in the country.\nStrikes could have threatened Iranian crude oil output and key shipping routes, thereby significantly lifting the geopolitical risk premium. Oil prices had rallied 10% in just five days.\nAs the risk premium fades, oil prices are falling around 3%; however, regional tensions remain elevated.\nElsewhere, Venezuela has restarted oil exports, reversing oil production cuts made under a US embargo.\nFurther weighing on US crude and oil prices was data showing that oil and gasoline inventories rose more than expected last week. The EIA report shows crude stockpiles rose by 3.4 million barrels, ahead of expectations for a 1.7 million-barrel draw.\nOn the demand side, OPEC said oil demand is likely to rise at a similar pace in 2027 as in 2026, pointing to a balance between supply and demand that contrasts with other forecasts of a major oil supply glut.\nChina's crude oil imports rose 17% from a year earlier, with the total 2025 imports rising 4.4% according to government data.\nOil forecast - technical analysis\nOil broke out of the falling channel, rising to 62.35, the 200 SMA, and the late October high. The price has now eased lower and is testing support at 60.00, the round number. A break below here brings 58.50 into focus, the upper band of the falling channel, and the 50 SMA.\nBuyers would need "
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0043",
            "open": "0.6677",
            "close": "0.6697",
            "high": "0.6709",
            "low": "0.6667"
        },
        "market_summary": "### AUD/USD Market Briefing\n* **Key Drivers:** The **cautious RBA tone** and **firm US data** are offsetting each other, with the **US Dollar** gaining ground due to **strong labour market figures** and **elevated inflation expectations**. The **Reserve Bank of Australia's (RBA) policy outlook** and **Australian inflation expectations** are also influencing the pair.\n* **Price Action:** The AUD/USD pair is holding ground near **0.6700**, with a recent decline below **0.6700**. The pair is trading in a narrow range, with **0.6680** acting as a support level.\n* **Technical Outlook:** Immediate support is near **0.6620**, with resistance at **0.6720-0.6750**. A break above **0.6780** could lead to a rally, while a drop below **0.6620** could result in a pullback.\n\n--- \n**Overall Sentiment:** Neutral ⚖️",
        "source_articles": [
            {
                "title": "AUD/USD holds ground near 0.6700 due to cautious RBA tone - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/aud-usd-holds-ground-near-06700-due-to-cautious-rba-tone-202601160114",
                "body": "AUD/USD holds ground near 0.6700 due to cautious RBA tone\n- AUD/USD steadies as the Australian dollar finds support amid cautious sentiment over the RBA’s policy outlook.\n- Markets price a 27% chance of an RBA rate hike in February, rising to 76% by May.\n- Initial Jobless Claims fell to 198K, beating expectations of 215K and down from the prior week’s 207K.\nAUD/USD moves little after two days of gains, hovering around 0.6700 during the Asian hours on Friday. The pair steadies as the Australian Dollar (AUD) receives support amid cautious sentiment surrounding the Reserve Bank of Australia’s (RBA) policy outlook.\nAustralia’s Consumer Inflation Expectations remained elevated at 4.6% in January, indicating that households continue to anticipate elevated price pressures. Markets currently price a 27% probability of a quarter-point rate hike by the Reserve Bank in February, increasing to 76% by May.\nRBA policymakers acknowledged that inflation has eased markedly from its 2022 peak, although recent data point to renewed momentum. Headline inflation slowed to 3.4% YoY in November, the lowest since August, but it remains above the RBA’s 2–3% target range.\nThe AUD/USD pair holds ground as the US Dollar (USD) gains ground after Thursday’s US Initial Jobless Claims data reinforced expectations that the Federal Reserve (Fed) will keep interest rates on hold for the coming months. Fed funds futures have pushed expectations for the next rate cut back to June, as improving labour market conditions and policymakers’ concerns about sticky inflation persist.\nData from the US Department of Labor (DOL) showed Initial Jobless Claims unexpectedly fell to 198K in the week ended January 10, below market expectations of 215K and down from the prior week’s revised 207K.\nAustralian Dollar FAQs\nOne of the most significant factors for the Australian Dollar (AUD) is the level of interest rates set by the Reserve Bank of Australia (RBA). Because Australia is a resource-rich country another key driver is the price of its biggest export, Iron Ore. The health of the Chinese economy, its largest trading partner, is a factor, as well as inflation in Australia, its growth rate and Trade Balance. Market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – is also a factor, with risk-on positive for AUD.\nThe Reserve Bank of Australia (RBA) influences the Australian Dollar (AUD) by setting the level of interest rates that Australian banks can lend to each other. This influences the level of interest rates in the economy as a whole. The main goal of the RBA is to maintain a stable inflation rate of 2-3% by adjusting interest rates up or down. Relatively high interest rates compared to other major central banks support the AUD, and the opposite for relatively low. The RBA can also use quantitative easing and tightening to influence credit conditions, with the former AUD-negative and the latter AUD-positive.\nChina is Australia’s largest trading partner so the health of the Chinese economy is a major influence on the value of the Australian Dollar (AUD). When the Chinese economy is doing well it purchases more raw materials, goods and services from Australia, lifting demand for the AUD, and pushing up its value. The opposite is the case when the Chinese economy is not growing as fast as expected. Positive or negative surprises in Chinese growth data, therefore, often have a direct impact on the Australian Dollar and its pairs.\nIron Ore is Australia’s largest export, accounting for $118 billion a year according to data from 2021, with China as its primary destination. The price of Iron Ore, therefore, can be a driver of the Australian Dollar. Generally, if the price of Iron Ore rises, AUD also goes up, as aggregate demand for the currency increases. The opposite is the case if the price of Iron Ore falls. Higher Iron Ore prices also tend to result in a greater likelihood of a positive Trade Balance for Australia, whic"
            },
            {
                "title": "AUD/USD Holds Near 0.6680 as Firm US Data Offsets Australian Signals - FXDailyReport.Com",
                "source": "FXDailyReport.Com",
                "url": "https://fxdailyreport.com/aud-usd-holds-near-0-6680-as-firm-us-data-offsets-australian-signals/",
                "body": "AUD/USD is trading close to the 0.6680 area on Thursday, showing little net change on the day as markets balance solid US economic momentum against mixed domestic cues from Australia. Price action remains subdued, reflecting investor caution after a run of data that has reinforced the relative resilience of the US economy while offering limited fresh direction from Australia.\nIn the United States, the latest labour market figures continue to underline economic strength. Initial Jobless Claims fell sharply to 198,000 from the previous 207,000, beating market expectations by a wide margin. Continuing Claims also declined to 1.884 million, reinforcing the view that layoffs remain limited and labour demand is holding up well. These releases add to an already robust macro backdrop, following a notable rebound in US Retail Sales and a Producer Price Index that remains elevated. Together, these indicators suggest that inflationary pressures have not fully dissipated and that economic activity remains firm.\nAgainst this backdrop, Federal Reserve officials have reiterated a cautious and restrictive policy stance. Atlanta Fed President Raphael Bostic warned that inflation pressures could persist beyond the current year and argued that monetary policy should remain tight until there is clearer evidence that price growth is sustainably moving toward target. Such commentary, combined with upbeat data, has helped underpin the US Dollar, limiting upside momentum for AUD/USD despite the pair’s recent stabilization.\nOn the Australian side, domestic developments have offered a more nuanced picture. The latest Consumer Inflation Expectations reading for January edged down slightly to 4.6% from 4.7%. While this signals a modest easing in household inflation outlooks, expectations remain elevated by historical standards, highlighting that price pressures are still a concern. The Reserve Bank of Australia recently left its cash rate unchanged at 3.6%, noting that inflation has moderated substantially from its 2022 peak but remains above the 2%–3% target band.\nThis combination of a steady RBA stance and strong US data leaves AUD/USD caught in a narrow range. The Australian Dollar lacks a clear domestic catalyst for a sustained rally, while the US Dollar continues to draw support from resilient growth and cautious Fed messaging. As a result, near-term moves in the pair are likely to remain limited, with traders waiting for clearer signals from upcoming inflation and growth data on both sides of the Pacific.\nTrade Idea:\nConsider selling rallies toward 0.6720–0.6750, targeting a pullback to 0.6620, with a stop above 0.6780, as firm US data continues to support the Dollar."
            },
            {
                "title": "Following the release of Australia’s Consumer Inflation Expectations, AUD/USD trades near 0.6680, having declined - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/following-the-release-of-australias-consumer-inflation-expectations-aud-usd-trades-near-0-6680-having-declined/",
                "body": "AUD/USD falls to below 0.6700 as Australia’s inflation expectations decrease. The currency pair drops after Australia’s Consumer Inflation Expectations fall to 4.6% in January from 4.7% in December, suggesting continued high price pressures.\nThe Reserve Bank of Australia maintained the cash rate at 3.6%. Headline inflation slow-down to 3.4% year-on-year in November, yet it remains outside the RBA’s 2–3% target.\nUS Economic Developments\nIn the US, Retail Sales exceeded expectations, rising by 0.6% to $735.9 billion in November. The Producer Price Index (PPI) increased to 3% year-over-year, and the unemployment rate declined to 4.4% in December.\nThese developments support the likelihood that the US Federal Reserve will keep interest rates unchanged for the upcoming months, possibly strengthening the US Dollar.\nChinese economic conditions and the price of Iron Ore influence the Australian Dollar. The RBA’s interest rate decisions and the Trade Balance also play roles in determining the currency’s value.\nHigh interest rates typically bolster the AUD, and favourable economic conditions in China can increase demand for exports, providing further support for the currency.\nHistorical Context and Current Situation\nA year ago, in early 2025, we saw the AUD/USD pair slip as Australian inflation expectations eased and the US economy showed surprising strength. This combination of a patient Reserve Bank of Australia (RBA) and a strong US Dollar pushed the pair below the 0.6700 level. This outlook supported a bearish stance on the Australian dollar at the time.\nToday, the situation has become more complex, creating potential for volatility. While Australian inflation did cool for much of 2025, the latest data for the fourth quarter showed headline CPI unexpectedly rose to 3.5%, putting pressure back on the RBA. This renewed inflation concern contrasts sharply with the easing price pressures we were observing this time last year.\nOn the US side, the dynamic has also shifted, as the Federal Reserve did begin cutting rates in the latter half of 2025. The Fed has since delivered three quarter-point cuts, bringing the target rate to the 4.75-5.00% range. Now, the market’s focus is on the pace of future cuts, making every US jobs and inflation report critical for the dollar’s direction.\nMeanwhile, external factors are creating headwinds for the Aussie dollar. Iron ore, a key Australian export, has recently fallen from over $140 to around $125 per tonne amid ongoing uncertainty over Chinese property sector demand. This is a significant drag that was less of a concern in early 2025 when a stronger Chinese recovery was anticipated.\nGiven these conflicting signals, with a potentially more hawkish RBA but weakening commodity prices, traders should prepare for increased choppiness in the AUD/USD. The divergence between Australia’s domestic inflation picture and its external trade environment suggests the pair could see sharp moves in both directions. Derivative strategies that profit from a rise in volatility, such as long straddles or strangles, could be appropriate in the coming weeks."
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "0.6840",
            "open": "158.3910",
            "close": "158.5990",
            "high": "158.8740",
            "low": "158.1900"
        },
        "market_summary": "### USD/JPY Market Briefing\n* **Key Drivers:** Fears of **BOJ intervention** and concerns over **expanded fiscal spending** in Japan are keeping the **dollar/yen** below **160**, while the **U.S. Federal Reserve's independence** and **global economic growth** also influence the pair.\n* **Price Action:** The **USD/JPY** pair is trading near **158.40**, after hitting an 18-month low of **159.45**, showing **bearish** momentum due to **yen weakness** largely reflecting **domestic politics** and **fiscal stimulus expectations**.\n* **Technical Outlook:** Immediate resistance is near the **160.00** level, with a break above this or the high from July 2024 at **161.95** viewed as important potential lines in the sand, and support at the **50-day moving average**.\n\n--- \n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "Fears of BOJ intervention keeps dollar/yen below 160 - 朝日新聞",
                "source": "朝日新聞",
                "url": "https://www.asahi.com/ajw/articles/16288319",
                "body": "REUTERS\nJanuary 16, 2026 at 07:20 JST\nBanknotes of Japanese yen are seen in this illustration picture taken on Sept. 23, 2022. (Reuters/Illustration/File Photo)\nThe yen was little changed against the dollar on Thursday as investors expected a Bank of Japan intervention to shore up the currency near 160, amid concerns over expanded fiscal spending after the general election.\nA break above 160.00 or the high from July 2024 at 161.95 are viewed as two important potential lines in the sand. Prime Minister Sanae Takaichi plans to dissolve parliament's Lower House next week to capitalize on a surge in public support for a new leader who has promised to spur economic growth, tackle cost-of-living concerns and tighten immigration rules.\nThe prospect of an early election has triggered fiscal concerns amid worries about Japan's massive debt load, dragging the yen down and complicating the rate path for the Bank of Japan.\nHowever, this year, conditions may be more favorable to increase fiscal spending. \"In 2026, she (Takaichi) is likely to benefit from a favorable base effect in the consumer price index, as lower rice prices will drive headline inflation to moderate towards 2%,\" said Claire Huang, senior emerging markets macro strategist at Amundi Investment Institute.\n\"This benign inflation environment should buy Takaichi valuable time to advance her economic expansionism agenda.\" The yen was flat at 158.40 per dollar after firming 0.4% on Wednesday as Japanese Finance Minister Satsuki Katayama renewed a verbal warning on \"one-sided depreciation.\"\nU.S. Treasury Secretary Scott Bessent urged policy measures to address FX volatility. It hit its 18-month low of 159.45 on Wednesday. \"Risks are heavily skewed to the downside for the dollar/yen in 2026,” said Stephen Jen, CEO at Eurizon SLJ Capital, mentioning the divergence in policy rate outlook between Japan and the United States.\n“Interventions at the right moment could trigger such a correction,” he added, after arguing the risks are high for the Ministry of Finance to step in.\nFED INDEPENDENCE IN THE SPOTLIGHT\nThe dollar was knocked back on Monday after Federal Reserve Chair Jerome Powell called out the subpoena from the administration of President Donald Trump, saying it amounted to intimidating the Fed into delivering easier monetary policy, but the greenback recovered its losses the day after.\nAnalysts are split, with some saying the latest episode strengthens the case for global diversification away from the dollar, while others argue there’s a reasonable chance the greenback will ultimately emerge stronger.\n\"Powell could be viewed as more resolutely hawkish in an effort to reinforce Fed independence,\" said Francesco Pesole, forex strategist at ING.\nAgainst a basket of currencies, the dollar was up 0.10% at 99.169, not far from the one-month high it touched last Friday at 99.268, before the subpoena was issued to Powell.\nGERMAN DATA LENDS MILD SUPPORT TO EURO\nThe euro dropped 0.10% to $1.1634, after data showing the German economy edged back into growth after two years of recession. Meanwhile Trump reiterated on Wednesday that the U.S. needs Greenland and that Denmark cannot be relied upon to protect the island. French President Emmanuel Macron said a first team of French soldiers was already in place in Greenland and more military means will be deployed in the coming days.\n\"Potential Greenland implications are seen as negative for the euro, but may be less clear-cut if any concerns led to more defense spending and challenged U.S. asset correlations,\" he added. Trump's moves against U.S. major allies triggered a selloff in U.S. assets last April, including stocks and the dollar, raising doubts about the safe-haven status of the greenback. Most analysts see the euro rising against the dollar in 2026 as the Federal Reserve is expected to cut rates further, though some remain cautious for the near term amid anticipation of another European Central Bank rate cut this year. \"To a good ex"
            },
            {
                "title": "USD/JPY surge exposes Japan’s policy paradox on BOJ intervention - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-au/news-and-analysis/usd-jpy-surge-exposes-japan-s-policy-paradox-on-boj-intervention/",
                "body": "- Yen weakness largely reflects domestic politics and fiscal stimulus expectations\n- Steeper JGB curves highlight market bets on Abenomics-style reflation\n- Past interventions followed rapid moves, not particular levels\n- Intervention would counter Tokyo’s inflation and growth goals,\nSummary\nSpeculation over yen intervention is heating up again as USD/JPY creeps back toward the same danger zone that triggered action in 2024. But this time feels different. Back then, ballooning rate differentials between the U.S. and Japan were the villain. Now, the yen’s slide looks home grown, tied to domestic politics and policy expectations rather than global carry dynamics.\nTalk of a snap lower house election in Japan later this month has added fuel, with traders gaming out a landslide win for Prime Minister Sanae Takaishi and the prospect of aggressive fiscal stimulus. That has reignited chatter about an Abenomics 2.0 reboot, sending both the yen and JGBs, especially the long end, lower in tandem. The correlation between USD/JPY and the Japanese 2s10s curve has spiked, reflecting bets that reflationary policies could be back in vogue.\nAgainst that backdrop, the question is not just whether intervention would work beyond a short-term jolt. It is whether Tokyo even wants a stronger yen if the goal is to turbocharge growth and inflation.\nPrior Intervention Episodes: A Quick Primer\nSource: TradingView\nThe first chart provides context as to what happened prior to recent intervention episodes. It plots USD/JPY with markers showing how far the pair ran beforehand. The contrast is stark. Ahead of the 2024 action above 160, USD/JPY surged almost 10% in a matter of weeks, with later episode following a move of nearly 5%. Compare that to now: barely 3% so far. It is a tiddler, which raises the question of whether the move is big enough to force the Ministry of Finance’s hand.\nHistory from 2022 reinforces the point. Those interventions came after rapid run ups of 12% and 8% respectively, measured in weeks not months. If speed matters more than absolute levels, as recent MoF behaviour suggests, it may require a quick extension into the low 160s to trigger action.\nWe have heard plenty of jawboning from Japanese government officials lately, but most of it repeats the same lines: rapid one sided moves are undesirable, and price should reflect fundamentals. Nothing yet screams imminent intervention if history is any guide. Expect one more round of forceful language before any real move occurs.\nThat brings us to the bigger question: even if the BOJ is asked to act, would it work? The yen’s latest slide looks home grown, driven by domestic politics and reflation bets rather than global rate differentials. That makes any intervention a ultra short-term shock at best, not a trend changer in my opinion.\nDomestic Drivers: JGBs and Steeper Curves\nThe next two charts speak volumes. The first shows Japanese government bond yields across 2, 5, 10, 20, 30 and 40 year tenors over the past six months. Every line is pointing higher, led by the back end as term premium ratchets up. Traders are positioning for heavier fiscal outlays to spur growth alongside wage and inflation pressures.\nSource: TradingView\nThe second chart adds to the story. Both the 2s10s (LHS) and 2s30s (RHS) curves have steepened dramatically on Abenomics 2.0 speculation. 2s10s sits at 102 basis points, the widest since 2011. 2s30s is at 234 basis points, the most since 2004. These figures are simply the differential between short and longer-dated Japanese government bond yields. These moves underline growing concern about Japan’s already record sovereign debt burden. Prior reflationary pushes have delivered little lasting success, adding to an already ballooning debt to GDP ratio rather than fixing the structural challenge.\nSource: TradingView\nIt all drives home one point: domestic politics is exerting a major influence on Japanese borrowing costs. And as the next section shows, that same dynamic loo"
            },
            {
                "title": "Fears of BoJ intervention keeps dollar/yen below 160 - TradingView — Track All Markets",
                "source": "TradingView — Track All Markets",
                "url": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3YG0M8:0-fears-of-boj-intervention-keeps-dollar-yen-below-160/",
                "body": "Fears of BoJ intervention keeps dollar/yen below 160\nRefinitiv2 min read\nKey points:\n- Traders on watch for BoJ intervention to support yen near 160\n- Concerns over possible increased fiscal spending weigh on Japanese currency\n- Risks to Fed independence remain under the spotlight\n- German data offers mild support to euro, Greenland in focus\n© Copyright Thomson Reuters 2026. Click For Restrictions - https://agency.reuters.com/en/copyright.html\nLogin or create a forever free account to read this news"
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0044",
            "open": "1.3876",
            "close": "1.3891",
            "high": "1.3919",
            "low": "1.3875"
        },
        "market_summary": "### USD/CAD Market Briefing\n\n* **Key Drivers:** The USD/CAD pair is influenced by **robust US economic data**, including a **3% increase** in the US Producer Price Index (PPI) and a **0.6% rise** in Retail Sales, which may lead to the Federal Reserve keeping interest rates unchanged. Meanwhile, **falling oil prices** are pressuring the Canadian Dollar, with WTI crude oil prices dropping to around **$76** a barrel.\n* **Price Action:** The USD/CAD has broken above **1.3900**, nearing monthly highs around **1.3920**, but has since weakened below **1.3900** due to a rebound in crude oil prices. The pair is showing significant **bullish momentum**, with a growth of more than **0.2%**.\n* **Technical Outlook:** Immediate support is near **1.3650**, with resistance at **1.3920**. A break below **1.3650** could signal a temporary pause in the **bullish trend**.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Rising due to robust US data and falling oil prices, the USD/CAD trades above 1.3900 - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/rising-due-to-robust-us-data-and-falling-oil-prices-the-usd-cad-trades-above-1-3900/",
                "body": "The USD/CAD currency pair has climbed above 1.3900, nearing monthly highs around 1.3920. This increase is partly due to strong US economic data and a drop in oil prices affecting the Canadian Dollar. The USD/CAD saw a growth of more than 0.2%, recovering from recent lows of 1.3850.\nUS Economic Data Impact\nUS Producer Price Index (PPI) data showed growth, with a 3% increase year-on-year, defying expectations of a 2.7% rise. Additionally, Retail Sales in November rose by 0.6%, surpassing forecasts of a 0.4% increase, despite previous month’s decline. These results may suggest that the Federal Reserve’s current monetary policy is likely to stay unchanged in the near future.\nOil prices have dropped nearly 2% following news from US President Donald Trump about reduced repression in Iran, putting pressure on the Canadian Dollar. Key drivers of the Canadian Dollar include interest rates set by the Bank of Canada and oil prices, as oil is Canada’s largest export. Economic health, inflation, trade balance, and US economic conditions also influence the value of the CAD. Higher oil prices and strong economic data typically strengthen the Canadian Dollar.\nThe USD/CAD pair is showing significant strength, pushing above 1.3700 as we move through mid-January 2026. This move is driven by a familiar divergence between a robust US economy and a Canadian dollar weighed down by falling oil prices. We see this as a key trend for the coming weeks.\nRecent data confirms this view, as the December 2025 US Non-Farm Payrolls report came in strong, adding 210,000 jobs and keeping the unemployment rate at a low 3.8%. Furthermore, the latest US CPI data showed core inflation remaining sticky at 2.8%, reinforcing our belief that the Federal Reserve will hold interest rates steady. This contrasts with growing expectations that the Bank of Canada may need to consider rate cuts later this year to support a slowing economy.\nOil Prices and Canadian Dollar Impact\nAdding to the pressure on the Canadian dollar, WTI crude oil prices have fallen from over $85 a barrel in late 2025 to around $76 this week amid concerns about slowing global demand. This decline in Canada’s primary export directly weakens the currency. The economic policy divergence between the US and Canada is becoming more pronounced, creating a clear path for USD/CAD strength.\nWe saw a similar pattern last year when strong US producer price data combined with geopolitical news that eased oil prices, causing a sharp rally in the pair. History shows that when these two powerful drivers align, the trend can be swift and sustained. It appears this dynamic is reasserting itself now.\nFor derivative traders, this environment suggests establishing bullish positions on USD/CAD. Buying call options with a strike price around 1.3800, expiring in late February or March, would be a direct way to play the expected upward momentum. We are seeing implied volatility tick up, so these positions should be initiated promptly to capture the move before options become too expensive.\nA more conservative strategy could involve using bull call spreads to limit the upfront cost and define risk. For instance, buying a 1.3750 call and selling a 1.3900 call would offer a solid potential return if the pair continues its ascent as we forecast. Watching the 1.3650 level as a key support is critical, as a break below it could signal a temporary pause in this bullish trend."
            },
            {
                "title": "USD/CAD weakens below 1.3900 as crude oil rebound strengthens Canadian Dollar - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-cad-weakens-below-13900-as-crude-oil-rebound-strengthens-canadian-dollar-202601160300",
                "body": "USD/CAD weakens below 1.3900 as crude oil rebound strengthens Canadian Dollar\n- USD/CAD softens to around 1.3890 in Friday’s early Asian session.\n- High crude oil prices support the commodity-linked Canadian Dollar.\n- The upbeat US economic data boost the Fed rate hold expectation.\nThe USD/CAD pair loses ground to near 1.3890 during the Asian trading hours on Friday. The Canadian Dollar (CAD) strengthens against the Greenback amid the rebound in crude oil prices. Traders will take more cues from the US December Industrial Production report and the Fedspeak later on Friday.\nReuters reported on Friday that Ukraine has ramped up attacks on Russian tankers, with at least six tankers targeted by drones and missiles in the Baltic Sea. Rising geopolitical risks boost crude oil prices and provide some support to the commodity-linked Loonie. It is worth noting that Canada is a major oil-exporting country, and high crude oil prices generally have a positive impact on the CAD.\nOn the other hand, signs of improvement in the US labor market, along with the robust Retail Sales data released earlier this week, support the case that the US Federal Reserve (Fed) will keep rates on hold for the next several months. This, in turn, could underpin the Greenback in the near term. Morgan Stanley analysts pushed back their expectations for rate cuts to June and September, from January and April, after the US December jobs data.\nChicago Fed President Austan Goolsbee said Thursday that amid ample evidence of stability in the job market, the central bank should be focused on getting inflation down. Meanwhile, San Francisco Federal Reserve President Mary Daly stated that monetary policy is “in a good place” to respond to economic shifts.\nCanadian Dollar FAQs\nThe key factors driving the Canadian Dollar (CAD) are the level of interest rates set by the Bank of Canada (BoC), the price of Oil, Canada’s largest export, the health of its economy, inflation and the Trade Balance, which is the difference between the value of Canada’s exports versus its imports. Other factors include market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – with risk-on being CAD-positive. As its largest trading partner, the health of the US economy is also a key factor influencing the Canadian Dollar.\nThe Bank of Canada (BoC) has a significant influence on the Canadian Dollar by setting the level of interest rates that banks can lend to one another. This influences the level of interest rates for everyone. The main goal of the BoC is to maintain inflation at 1-3% by adjusting interest rates up or down. Relatively higher interest rates tend to be positive for the CAD. The Bank of Canada can also use quantitative easing and tightening to influence credit conditions, with the former CAD-negative and the latter CAD-positive.\nThe price of Oil is a key factor impacting the value of the Canadian Dollar. Petroleum is Canada’s biggest export, so Oil price tends to have an immediate impact on the CAD value. Generally, if Oil price rises CAD also goes up, as aggregate demand for the currency increases. The opposite is the case if the price of Oil falls. Higher Oil prices also tend to result in a greater likelihood of a positive Trade Balance, which is also supportive of the CAD.\nWhile inflation had always traditionally been thought of as a negative factor for a currency since it lowers the value of money, the opposite has actually been the case in modern times with the relaxation of cross-border capital controls. Higher inflation tends to lead central banks to put up interest rates which attracts more capital inflows from global investors seeking a lucrative place to keep their money. This increases demand for the local currency, which in Canada’s case is the Canadian Dollar.\nMacroeconomic data releases gauge the health of the economy and can have an impact on the Canadian Dollar. Indicators such as GDP, Manufacturing and Services PMI"
            },
            {
                "title": "Canadian Dollar Falls As Oil Prices Tumble - RTTNews",
                "source": "RTTNews",
                "url": "https://www.rttnews.com/amp/3610755/canadian-dollar-falls-as-oil-prices-tumble.aspx",
                "body": "The Canadian dollar weakened against other major currencies in the European session on Thursday, as the crude oil prices fell for the first time in six days amid easing geopolitical tensions.\nBenchmark Brent crude futures fell nearly 3 percent to $64.53 a barrel while WTI crude futures were down 3.1 percent at $60.12.\nFears of an imminent U.S. action against Iran ebbed as U.S. President Donald Trump appeared to soften rhetoric against Iran.\nTrump said he had received information \"on good authority\" that Iran has stayed fast trials and executions of protesters, signaling he may hold off on attacking the country for now.\nIran, however, has pushed back, threatening to strike U.S. military bases and Israel if Washington interferes.\nMeanwhile, Danish foreign minister Lars Lokke Rasmussen said that discussions at the White House with U.S. vice-president J.D. Vance and secretary of state Marco Rubio were \"frank but constructive\", stressing that any proposal undermining Danish sovereignty or Greenland's right to self-determination was \"totally unacceptable\".\nU.S. control of Greenland is \"vital\" for the country's planned Golden Dome air and missile defense system, Trump said in a social media post.\nElsewhere, the U.S. Senate on Wednesday voted against a resolution that was aimed at curbing President Trump's authority to launch strikes on Venezuela.\nVice President JD Vance cast the tie-breaking vote on a point of order that halted the war powers resolution.\nAdditionally, the worsening employment market has led to predictions of a short-term interest rate drop by the Bank of Canada, which has kept the Canadian dollar (CAD) relatively weak.\nLast week, Statistics Canada revealed that the unemployment rate had risen from 6.5% to 6.8% in December.\nIn the European trading today, the Canadian dollar fell to a 3-day low of 1.3908 against the U.S. dollar, from an early high of 1.3885. The loonie may test support near the 1.40 region.\nAgainst the yen and the Australian dollar, the loonie dropped to 2-day lows of 113.86 and 0.9314 from early highs of 114.20 and 0.9265, respectively. If the loonie extends its downtrend, it is likely to find support around 112.00 against the yen and 0.94 against the aussie.\nThe loonie edged down to 1.6184 against the euro, from an early high of 1.6158. On the downside, 1.62 is seen as the next support level for the loonie.\nLooking ahead, Canada manufacturing sales data, new motor vehicle sales data and wholesale sales data, all for November, U.S. export and import prices for November and U.S. weekly jobless claims data are slated for release in the New York session.\nby RTTNews Staff Writer\nFor comments and feedback: editorial@rttnews.com"
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "1.3160",
            "open": "212.7400",
            "close": "212.2220",
            "high": "213.3030",
            "low": "211.9870"
        },
        "market_summary": "### GBP/JPY Market Briefing\n\n* **Key Drivers:** The UK's **0.3%** GDP growth in November, beating estimates of **0.1%**, and stronger-than-expected factory data have boosted the **Pound Sterling (GBP)**, while the **Japanese Yen (JPY)** remains under pressure due to expectations of a looser fiscal and monetary policy.\n* **Price Action:** The **GBP/JPY** pair has recovered its early losses and turned slightly positive to near **213.20**, indicating **bullish momentum**.\n* **Technical Outlook:** Immediate support is near the recent low of **212.00**, with resistance at the psychological level of **214.00**.\n\n---\n**Overall Sentiment:** Positive ️",
        "source_articles": [
            {
                "title": "GBP/JPY recovers early losses as UK GDP returns to growth - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-recovers-early-losses-as-uk-gdp-returns-to-growth-202601150849",
                "body": "GBP/JPY recovers early losses as UK GDP returns to growth\n- GBP/USD recovers its early losses and turns slightly positive to near 213.20.\n- The UK economic growth turns positive after declining in the last two months.\n- Japan's PM Takaichi is expected to announce a snap election next week.\nThe GBP/JPY pair claws back its early losses and turns slightly positive to near 213.20 during the European trading session on Thursday. The pair attracts bids as the Pound Sterling (GBP) gains, following the release of the United Kingdom (UK) monthly Gross Domestic Product (GDP) data for November.\nThe Office for National Statistics (ONS) showed that the economy returned to growth after contracting 0.1% in both September and October. The UK GDP growth came in at 0.3%, faster than estimates of 0.1%.\nMeanwhile, factory data for November has also come in stronger than expected. Month-on-month (MoM) Manufacturing Production rose at a robust pace of 2.1% against estimates of 0.5% and the October reading of 0.4%. In the same period, Industrial Production rose 1.1%, strongly than expectations of 0.1%, but slower than the prior reading of 1.3%.\nGoing forward, the major trigger for the Pound Sterling will be the UK employment and Consumer Price Index (CPI) data scheduled for next week. Investors will pay close attention to the data to get fresh cues on the Bank of England’s (BoE) monetary policy outlook.\nDuring the European trading session, the Japanese Yen (JPY) struggles to hold ground regained earlier in the day. The Japanese currency attracted bids amid fears of intervention by Tokyo counter one-way excessive moves. However, the broader outlook of the JPY remains uncertain on expectations of a looser fiscal and monetary policy this year.\nAdditionally, hopes of the announcement of a snap election by Prime Minister Sanae Takaichi next week are also keeping Yen’s recovery capped. Market experts believe Japan’s budget to unveil big spending plans to boost economic growth.\nEconomic Indicator\nGross Domestic Product (MoM)\nThe Gross Domestic Product (GDP), released by the Office for National Statistics on a monthly and quarterly basis, is a measure of the total value of all goods and services produced in the UK during a given period. The GDP is considered as the main measure of UK economic activity. The MoM reading compares economic activity in the reference month to the previous month. Generally, a rise in this indicator is bullish for the Pound Sterling (GBP), while a low reading is seen as bearish.\nRead more.Last release: Thu Jan 15, 2026 07:00\nFrequency: Monthly\nActual: 0.3%\nConsensus: 0.1%\nPrevious: -0.1%\nSource: Office for National Statistics\nAuthor\nSagar Dua\nFXStreet\nSagar Dua is associated with the financial markets from his college days. Along with pursuing post-graduation in Commerce in 2014, he started his markets training with chart analysis."
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "2,446.4800",
            "open": "97,531.9800",
            "close": "95,551.5000",
            "high": "97,546.9800",
            "low": "95,100.5000"
        },
        "market_summary": "### BTC/USD Market Briefing\n\n* **Key Drivers:** Institutional demand for **Bitcoin** has seen a significant resurgence, with **$1.7 billion** in net inflows into U.S. spot Bitcoin ETFs over a three-day streak, indicating a shift from caution to strategic allocation.\n* **Price Action:** **BTC/USD** has reclaimed the **$96,000** level, showing **bullish momentum** driven by spot accumulation rather than derivatives positioning, with no corresponding spike in leverage metrics.\n* **Technical Outlook:** Immediate support is near the **$95,000** level, with resistance at **$100,000**, a major psychological and technical threshold. The structure of recent inflows suggests strategic allocation, which could tighten market liquidity and reinforce downside support.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Bitcoin ETF Inflows Rebound With $1.6B Added as Price Reclaims $96K - Bitcoinsensus",
                "source": "Bitcoinsensus",
                "url": "https://www.bitcoinsensus.com/news/bitcoin/bitcoin-etf-inflows-accelerate",
                "body": "Bitcoin ETF Inflows Accelerate: $1.6B Returns as Price Reclaims $96K\nThe cautious tone that defined the first week of 2026 has shifted materially.\nOver the past two trading sessions, institutional investors have added around $1.6 billion to U.S. spot Bitcoin ETFs, fully offsetting the prior week’s outflows and restoring upward momentum in the market.\nData from Farside Investors and Glassnode shows a clear reversal in positioning, led by sustained inflows into BlackRock’s iShares Bitcoin Trust (IBIT). The move suggests that sub-$90,000 levels were viewed as an opportunity rather than a breakdown in the broader trend.\nFrom Outflows to Reallocation\nThe opening days of January were marked by consistent ETF redemptions. Between January 6 and January 9, net outflows exceeded $1.3 billion, reflecting short-term risk reduction following year-end strength.\nThat dynamic changed decisively this week.\nOn January 13, spot Bitcoin ETFs recorded $753.8 million in net inflows, followed by an additional $840.6 million on January 14. The scale and speed of this reallocation indicate renewed institutional conviction rather than tactical short covering.\nAbove: ETF fund flows reverse sharply from early-January outflows to strong inflows on Jan 13–14.\nPrice Response Confirms Spot Demand\nThe relationship between ETF flows and price action has remained closely aligned. On-chain data from Glassnode highlights the timing of renewed demand entering the market.\nAs daily ETF inflows exceeded 8,700 BTC on January 14, Bitcoin’s spot price advanced steadily, reclaiming the $96,000–$97,000 range. Notably, this move occurred without a corresponding spike in leverage metrics, reinforcing the view that the rally is being driven by spot accumulation rather than derivatives positioning.\nAbove: ETF net inflows (green) align with Bitcoin’s recovery toward $96K on Jan 14.\nSource: Glassnode.\nBlackRock Continues to Absorb Supply\nBlackRock’s IBIT remains the dominant channel for institutional exposure. While flows across other ETFs were mixed, IBIT was the primary driver of net inflows during the two-day rebound.\nAs of January 14, IBIT’s net assets stood at approximately $75.5 billion, reinforcing its role as the primary conduit for large-scale Bitcoin allocation. At current levels, the fund alone represents a meaningful share of daily available liquidity in the spot market.\nAbove: BlackRock’s IBIT net assets exceed $75.5B as of Jan 14, 2026.\nSource: iShares.\nMarket Implications\nThe return of sustained ETF inflows suggests that selling pressure observed in early January has largely been absorbed. With ETFs now holding more than 6.5% of Bitcoin’s circulating supply, continued accumulation at this pace tightens market liquidity and reinforces downside support.\nWhile near-term volatility remains likely, the structure of recent inflows points to strategic allocation rather than short-term positioning. If this trend persists, attention will naturally shift back toward the $100,000 level as the next major psychological and technical threshold.\nThe content provided in this article is for informational and educational purposes only and does not constitute financial, investment, or trading advice. Any actions you take based on the information provided are solely at your own risk. We are not responsible for any financial losses, damages, or consequences resulting from your use of this content. Always conduct your own research and consult a qualified financial advisor before making any investment decisions. Read more\nGold Hits $3,447, Bitcoin Holds $105K as Middle East Conflict Fuels Flight to Safety\nJune 14, 2025\nPrevious ArticleFed Freezes Rate Cuts — Inflation and War Fears Keep Range at 4.25–4.50%\nJune 19, 2025\nNext ArticleCora\nMy name is Cora. With a background in finance and crypto, I’m passionate about digging beyond the headlines to uncover the why behind market-moving events. I enjoy exploring how blockchain, Web3 and crypto innovation are shaping the world we live in.\nRe"
            },
            {
                "title": "Largest Crypto ETFs: December 2025 - YCharts",
                "source": "YCharts",
                "url": "https://get.ycharts.com/resources/blog/largest-crypto-etfs/",
                "body": "Largest Crypto ETFs: December 2025\nUpdated as of: January 15, 2026\nDespite being considered a high-risk, speculative asset, the adoption of cryptocurrency continues to skyrocket. The last 10 years has been a period of parabolic and volatile growth for Bitcoin and Ethereum, the two largest cryptocurrencies by market capitalization:\nDownload Visual | Modify in YCharts\nFor advisors with clients who want to leverage cryptocurrency as an investment vehicle but don’t have easy access to direct crypto trading through a wallet or exchange, crypto ETFs provide advisors a convenient way to build an allocation to crypto within a client’s existing portfolio.\nCrypto ETFs have grown in both popularity and adoption in recent months. In January 2024, the SEC approved the first U.S.-listed spot Bitcoin ETFs, and proceeded to approve spot Ethereum ETFs six months later. Most recently, the SEC approved generic listing standards for spot crypto ETFs in September, opening the door for a wider range of ETFs to be represented and traded by investors and institutions alike.\nTo provide advisors with crypto-focused investment ideas for consideration in client portfolios, we compiled a list of the largest crypto ETFs based on share class assets under management (AUM) using the YCharts Fund Screener, which helps advisors navigate across a universe of over 85,000 funds.\nThe following data includes crypto ETF flows over the last month, three months, and one year, along with net expense ratio and one-year price returns.\nLooking for the best-performing ETFs overall? Check out our analysis on the Best Performing ETFs over the Last 10 Years here.\nTable of Contents\nLargest Bitcoin ETFs\nThese are the largest Bitcoin ETFs as of December 31, 2025.\nStart a Free Trial to See Full Rankings | View & Modify in Stock Screener\nBitcoin ETF Performance\nDownload Visual | Modify in YCharts\nBitcoin ETF Share Class Flows\nDownload Visual | Modify in YCharts\nLargest Ethereum ETFs\nThese are the largest Ethereum ETFs as of December 31, 2025.\nStart a Free Trial to See Full Rankings | View & Modify in Stock Screener\nEthereum ETF Performance\nDownload Visual | Modify in YCharts\nEthereum ETF Share Class Flows\nDownload Visual | Modify in YCharts\nWhat Was the Growth of $10,000 in the Top Crypto ETFs Over the Last Year?\nIf you invested $10,000 one year ago into any of the ten largest Bitcoin or Ethereum ETFs, your total return one year later would be in the red.\nData as of December 31st, 2025\n- Bitcoin 1 Year Price Growth: -4.55%\n- iShares Bitcoin Trust ETF (IBIT): -6.41%\n- Fidelity Wise Origin Bitcoin Fund (FBTC): -6.56%\n- Grayscale Bitcoin Trust ETF (GBTC): -7.65%\n- Grayscale Bitcoin Mini Trust ETF (BTC): -7.50%\n- Bitwise Bitcoin ETF (BITB): -6.47%\n- ARK 21Shares Bitcoin ETF (ARKB): -6.59%\n- ProShares Bitcoin ETF (BITO): -10.84%\n- Ethereum 1 Year Price Growth: -11.59%\n- iShares Ethereum Trust ETF (ETHA): -11.31%\n- Grayscale Ethereum Trust ETF (ETHE): -13.03%\n- Fidelity Ethereum Fund (FETH): -11.37%\nDownload Visual | Modify in YCharts\nWhenever you’re ready, there are 3 ways YCharts can help you:\n1. Looking for a best-in-class data & visualization tool?\nSend us an email at hello@ycharts.com or call (866) 965-7552. You’ll be directly in touch with one of our Chicago-based team members.\n2. Want to test out YCharts for free?\nStart a no-risk 7-Day Free Trial.\n3. Download a copy of The Top 10 Visuals for Client and Prospect Meetings slide deck:\nDisclaimer\n©2025 YCharts, Inc. All Rights Reserved. YCharts, Inc. (“YCharts”) is not registered with the U.S. Securities and Exchange Commission (or with the securities regulatory authority or body of any state or any other jurisdiction) as an investment adviser, broker-dealer or in any other capacity, and does not purport to provide investment advice or make investment recommendations. This report has been generated through application of the analytical tools and data provided through ycharts.com and is intended solely to assist you or your investment "
            },
            {
                "title": "Bitcoin ETF inflows reach $1.7 billion over three-day streak - The Block",
                "source": "The Block",
                "url": "https://www.theblock.co/post/385715/bitcoin-etf-inflows-three-day-streak",
                "body": "Bitcoin ETF inflows reach $1.7 billion over three-day streak\nQuick Take\n- Spot bitcoin ETFs reported $843.6 million worth of net inflows on Wednesday.\n- Ethereum, XRP, and Solana ETFs also reported net inflows for the day.\nWe'd love your feedback.\nU.S. spot bitcoin exchange-traded funds reported another day of sizable net inflows on Wednesday, extending the positive streak to its third day.\nAccording to data from SoSoValue, the spot bitcoin ETFs reported $843.6 million in net inflows on Wednesday, which is the highest daily total since Oct. 7. This overwrites Tuesday's three-month-high record inflows of $754 million. In the past three days, the bitcoin ETFs drew in $1.71 billion worth of funds.\nEight out of 12 bitcoin ETFs reported net inflows yesterday. BlackRock's IBIT, the largest bitcoin ETF in terms of net assets, saw $648 million in inflows, while Fidelity's FBTC had $125.4 million. Ark & 21Shares' ARKB reported $27 million worth of inflows alongside positive capital flows spotted in funds from Grayscale, Bitwise, VanEck, Valkyrie, and Franklin Templeton.\n\"The ETF inflows represent a resurgence of institutional demand, signaling that investors are aggressively reallocating capital after a period of year-end caution and de-risking late last year,\" Nick Ruck, director of LVRG Research, told The Block on Wednesday.\nSpot Ethereum ETFs posted $175 million in positive flows on Wednesday, marking their third consecutive net inflow day. Spot Solana ETFs and XRP ETFs posted inflows yesterday as well, worth $23.5 million and $10.6 million, respectively.\nKronos Research CIO Vincent Liu said that sustained net inflows into crypto ETFs will create a \"structural tailwind\" for crypto prices, which is also supported by improving regulatory clarity.\nBitcoin rose 1.79% in the past 24 hours to trade at $96,447, while ether is trading steady at $3,313, according to The Block's crypto price page.\nDisclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.\n© 2026 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "113.8500",
            "open": "3,371.0700",
            "close": "3,296.2000",
            "high": "3,382.7000",
            "low": "3,268.8500"
        },
        "market_summary": "### ETH/USD Market Briefing\n\n* **Key Drivers:** Significant investment by **Bitmine Immersion Technologies**, the largest **Ethereum** treasury, in **MrBeast's Beast Industries** for **$200 million**, indicating a strong bet on **DeFi** ambitions and potential growth in digital finance.\n* **Price Action:** The investment news may contribute to **bullish momentum** for **ETH/USD**, potentially pushing the price above the **$1,800** level, a key psychological resistance.\n* **Technical Outlook:** Immediate support for **ETH/USD** is near the **50-day moving average** at **$1,700**, with resistance at **$1,850**.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "MrBeast Eyes DeFi as Tom Lee's Ethereum Treasury BitMine Invests $200 Million - Decrypt",
                "source": "Decrypt",
                "url": "https://decrypt.co/354732/mrbeast-eyes-defi-ethereum-treasury-firm-bitmine-invests-200-million",
                "body": "In brief\n- BitMine will invest $200 million in Beast Industries, a firm founded by YouTuber MrBeast.\n- Beast Industries plans to debut a financial services platform.\n- MrBeast moved to trademark MrBeast Financial in October.\nBitMine Immersion Technologies, the Ethereum treasury firm chaired by Fundstrat’s Tom Lee, unveiled a $200 million investment on Thursday in Beast Industries, a company founded by YouTube creator Jimmy Donaldson, recognized worldwide as MrBeast.\nIn a press release shared with Decrypt, Lee described Donaldson, whose videos and social media posts generate millions of impressions and views daily, as a generational content creator “with a reach and engagement unmatched with GenZ, Gen Alpha, and Millennials.”\nLee also described Beast Industries as “largest and most innovative creator-based platform in the world,” which also oversees the creations and distribution of MrBeast-linked goods, including various merchandise and Feastables, a snacks and candy brand.\nBitMine said the deal, among the most novel a crypto treasury firm has inked since the trend intensified on Wall Street last year, is expected to close within the next week.\nIn a statement, Jeff Housenbold, CEO of Beast Industries, said the firm would explore ways to “incorporate DeFi into our upcoming financial services platform” moving forward. DeFi, or decentralized finance, entails the creation of blockchain-based financial services, such as trading or lending, that aren’t reliant on traditional financial intermediaries like banks.\nBitMine shares changed hands around $31.50 on Thursday, a more than 3% dip on the day, according to Yahoo Finance. Although the company is the largest corporate holder of Ethereum, with a stockpile that’s currently worth $13 billion, the company’s stock has fallen 21% in the past six months amid broader signs of investor fatigue toward crypto-buying firms.\nIn October, Beast Financial applied for several U.S. trademarks, indicating that the company would provide crypto exchange, payment processing, banking, and insurance services. At the time, not all of the 52 trademarks owned by the company had led to actual products.\nAlex Choi, Donaldson’s key thumbnail strategist, warned on X in December that social media posts touting “MrBeast coin” were not legitimate. The crypto industry has a lengthy track record of scams, stemming from celebrity endorsements or social media hacks.\nIt was unclear how BitMine’s investment would dovetail with its business, which includes the creation of a “Made in America Validator Network.” Validators serve an essential function on Ethereum’s network by validating blocks of transactions, while also earning rewards.\nEarlier this month, Rumble, which positions itself as a free-speech alternative to YouTube, integrated a crypto wallet into its platform for payments and tipping. The feature, backed by stablecoin issuer Tether, supports Bitcoin and tokenized gold.\nDonaldson has been involved in crypto since at least 2021, purchasing NFTs from the storied CryptoPunks collection during the height of the pandemic-era crypto boom. He also promoted a gaming league in 2023 that generated controversy over its use of digital assets.\nIn September, BitMine made its first “moonshot” purchase, investing $20 million into Eightco Holdings, a crypto treasury firm amassing Wolrdcoin—the native token of the World Chain network co-founded by OpenAI’s Sam Altman.\nMonths before, the company indicated in a shareholder presentation that it would make “select investments in bold ideas that enhance Ethereum Network Value.”"
            },
            {
                "title": "The biggest ethereum treasury in the world just made a $200 million bet on MrBeast's DeFi ambitions - businessinsider.com",
                "source": "businessinsider.com",
                "url": "https://www.businessinsider.com/mrbeast-bitmine-immersion-investment-youtube-jimmy-donaldson-crypto-tom-lee-2026-1",
                "body": "- Bitmine Immersion Technologies is investing $200 million in MrBeast's holding company.\n- The deal could help Jimmy Donaldson, the creator behind MrBeast, build planned financial services.\n- Bitmine Chairman Tom Lee said he believes MrBeast's future platform will play a key role in digital finance.\nThe biggest ethereum holding company in the world is betting big on the digital finance ambitions of one of the world's top online content creators.\nTom Lee, the cofounder of global investment advisory firm Fundstrat Global Advisors, announced on Thursday that Bitmine Immersion Technologies is investing $200 million in Beast Industries, the holding company founded by YouTube star MrBeast.\nJimmy Donaldson, better known by his social media moniker, announced plans to launch a financial services platform in December, and Lee said on Thursday that he believes it will play a pivotal role in one of the financial sector's fastest-growing markets.\nBeast Industries CEO Jeff Housenbold also hinted at a future partnership, saying in a statement: \"We look forward to exploring ways to further collaborate and incorporate DeFi into our upcoming financial services platform.\"\nIn June 2025, Lee led Bitmine's strategic pivot from operating as a bitcoin miner to becoming the world's largest ethereum treasury, helping usher in last year's investor craze for digital asset holding strategies.\n\"MrBeast and Beast Industries, in our view, is the leading content creator of our generation, with a reach and engagement unmatched with Gen Z, Gen Alpha and Millennials,\" he said. \"Beast Industries is the largest and most innovative creator based platform in the world and our corporate and personal values are strongly aligned.\"\nLee said on CNBC that he sees his bet on Beast Industries as a rising player in a broader movement to tokenize assets on the blockchain.\n\"Digitalization of not only dollars, but stocks and equities, is going to take place and over time, that really blurs what is a service versus what's digital money,\" he added. \"That's where a collaboration and investment into Beast Industries makes sense.\"\nCompanies such as Robinhood have recently embraced asset tokenization, viewing it as a way to offer investors exposure to companies that might still be private or to allow investors to more easily trade hard assets like real estate.\nBeast Industries, for its part, has been laying the groundwork for a financial services venture for a while. In a pitch deck shared in early 2025, which was viewed by Business Insider, it described customized offerings that would target MrBeast's audience, supported by financial literacy content. The deck listed nine potential offerings, including student loans, insurance, and credit insights. It said the company would launch by partnering with a fintech company to leverage its existing infrastructure \"while avoiding regulatory, credit risk, and capital requirement.\"\nDonaldson has also said he's looking to build a financial literacy-focused channel.\nBeast Industries took in over $400 million in revenue in 2024, according to investor materials viewed by Business Insider. The company lost money last year, mainly because of high costs in its media business. Recently, the company has been on a cost-cutting push as it looks to reduce media-related losses.\nIn 2025, the social media star sought to raise $200 million to extend a $300 million Series C round he'd raised in 2024 at a $5 billion valuation, according to investment materials viewed by Business Insider.\nDonaldson's company has been pitching investors on the idea of building the \"next Disney.\" Like Disney, Beast Industries is looking to expand well beyond video into different product categories."
            },
            {
                "title": "Liquid Staking Explained: From ETH to XRP with Firelight | Crypto 101 - thedefiant.io",
                "source": "thedefiant.io",
                "url": "https://thedefiant.io/news/defi/liquid-staking-explained-from-eth-to-xrp-with-firelight-or-crypto-101",
                "body": "Liquid Staking Explained: From ETH to XRP with Firelight | Crypto 101\nSponsoredWelcome back to Crypto 101, where we break down the core ideas shaping DeFi and Web3.\nIn this episode, we explore liquid staking, how it works, why it was created, and how it’s expanding beyond traditional proof-of-stake blockchains. We start with staking fundamentals, explain why locked capital became a problem, and show how liquid staking tokens (LSTs) unlock new utility across DeFi.\nWe then go deeper into how Flare and the Firelight Protocol are extending staking-like mechanics to assets that were never designed for staking, like XRP. Using Firelight, XRP holders can mint stXRP, a liquid token that enables idle XRP to back on-chain risk protection while remaining fully composable across DeFi.\nIn this video, you’ll learn:\n- How staking works on proof-of-stake networks like Ethereum\n- Why liquid staking tokens (LSTs) were created\n- How ETH liquid staking works with protocols like Lido and Rocket Pool\n- How Firelight enables XRP to participate in DeFi\n- How stXRP is used for on-chain coverage and yield\n- Key benefits and risks of liquid staking\nRelated Posts\nAdvertisement\nGet an edge in Crypto with our free daily newsletter\nKnow what matters in Crypto and Web3 with The Defiant Daily newsletter, Mon to Fri\n90k+ Defiers informed every day. Unsubscribe anytime."
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "6.1770",
            "open": "146.8306",
            "close": "141.9332",
            "high": "147.0206",
            "low": "140.8436"
        },
        "market_summary": "### SOL/USD Market Briefing\n\n* **Key Drivers:** Integration of Starknet's token STRK into Solana's ecosystem, increasing **cross-chain interoperability**, and a surge in **meme coin** trading activity within the Solana ecosystem.\n* **Price Action:** SOL is currently trading at **$143**, down **3%** on the day, with **STRK** trading at **$0.086**, also down about **6%** over the past 24 hours.\n* **Technical Outlook:** Immediate support for SOL is not explicitly mentioned, but the **total market capitalization of Solana meme coins** is approaching **$6.7 billion**, indicating potential **bullish momentum**. Resistance levels are not specified, but the integration of STRK and the surge in meme coin activity could influence **price volatility**.\n\n---\n**Overall Sentiment:** Neutral",
        "source_articles": [
            {
                "title": "These Solana Ecosystem Projects Lead Development Over the Past 30 Days! - Santiment",
                "source": "Santiment",
                "url": "https://app.santiment.net/insights/read/these-solana-ecosystem-projects-lead-development-over-the-past-30-days-10459",
                "body": "These Solana Ecosystem Projects Lead Development Over the Past 30 Days!\nPYTH\nSWARMS\nW\nSOL\nLINK\n🧑💻 Here are crypto's top Solana ecosystem projects by development. Directional indicators represent each project's ranking rise or fall since last month:\n➡️ 1) ChainLink $LINK 🥇\n➡️ 2) Solana $SOL 🥈\n➡️ 3) Wormhole $W 🥉\n📈 4) Swarms $SWARMS\n➡️ 5) Pyth $PYTH\n➡️ 6) Meteora $MET\n📈 7) DoubleZero #2Z\n📉 8) Drift $DRIFT\n📉 9) JITO $JTO\n📈 10) Marinade $MNDE"
            },
            {
                "title": "Starknet Partners with NEAR to Bring STRK to Solana - thedefiant.io",
                "source": "thedefiant.io",
                "url": "https://thedefiant.io/news/defi/strk-goes-live-on-solana-via-near",
                "body": "Starknet Partners with NEAR to Bring STRK to Solana\nEthereum Layer 2 Starknet’s token STRK is now natively accessible on Solana, with cross-chain interoperability provided by NEAR Intents, according to an announcement on Jan. 15.\nThe integration allows users to receive STRK directly in a Solana wallet from “a wide range of supported tokens and chains.”\nThe move brings STRK into Solana’s ecosystem — which has a TVL of nearly $11 billion — without requiring users to go through a standard bridging process. Instead, NEAR Intents uses a “solver-based execution model” where users specify an outcome and execution is handled behind the scenes, according to a press release viewed by The Defiant. The release emphasized the integration is meant to make the token easily accessible in Solana DeFi.\n“The result is a practical cross-ecosystem workflow that prioritizes speed, usability, and real DeFi participation over novelty,” the release reads.\nSTRK will be available for spot trading on Solana-based decentralized exchange Jupiter, while fellow Solana DEX Meteora will act as the primary liquidity venue for STRK on the chain.\nThe launch comes a day after Solana’s official X account posted a jab at Starknet, criticizing the network’s reported daily activity and valuation. The post claimed Starknet had “8 daily active users” and “10 daily transactions,” while referencing its market cap and fully diluted valuation (FDV) and concluding, “Send it straight to 0.”\nIt also comes as Starknet has added more than $100 million in TVL since December, reaching over $313 million by press time, though it is still slightly below its March 2024 peak of nearly $331 million.\nSTRK is currently trading at $0.086 at press time, down about 6% over the past 24 hours, according to CoinGecko. The token has a market cap of roughly $435 million. Solana’s native token, SOL, is currently changing hands at $143, down 3% on the day.\nRelated Posts\nAdvertisement\nGet an edge in Crypto with our free daily newsletter\nKnow what matters in Crypto and Web3 with The Defiant Daily newsletter, Mon to Fri\n90k+ Defiers informed every day. Unsubscribe anytime."
            },
            {
                "title": "Bybit Alpha Insights: Meme Coin Resurgence Led by Solana Ecosystem - PR Newswire",
                "source": "PR Newswire",
                "url": "https://www.prnewswire.com/news-releases/bybit-alpha-insights-meme-coin-resurgence-led-by-solana-ecosystem-302662309.html",
                "body": "DUBAI, UAE, Jan. 15, 2026 /PRNewswire/ -- Bybit, the world's second-largest cryptocurrency exchange by trading volume, signaled a window of opportunities for fun-loving, thrill-seeking traders in the meme coin space. Two weeks into 2026, Bybit Alpha's recent listings underscore the significant meme coin revival, with Solana emerging as the primary battleground for this latest wave of speculative activity.\nFeaturing light-hearted and provocative themes, the current meme coin surge embraces irreverent humor and bold defiance, departing from the grand narratives of mainstream crypto. Since the final week of 2025, Bybit Alpha has matched market enthusiasm with an accelerated listing pace, adding six new meme tokens between January 11 and 13, 2026 alone, including WHITEPEPE, TATA, testicle, HAPPY, B, and Buttcoin.\nSolana Dictating Market Momentum\nSolana's meme sector has demonstrated remarkable growth in early 2026:\n- Total market capitalization of Solana meme coins closes in on $6.7 billion, up from $5.1 billion at the start of the year\n- Daily trading volume in the sector surged from $850 million to over $2.57 billion in the same period\n- Pump.fun, now effectively the second-largest DEX and meme coin launchpad on Solana, saw an all-time high of $2 billion in daily DEX trading volume\nEstablished meme tokens are also seeing strong rebounds, with BONK gaining over 50% and others like PENGU, WIF, and POPCAT following suit.\nRecently, Solana and X also announced collaboration plans, introducing \"Smart Cashtags,\" enabling real-time on-chain asset visualization directly within the social platform. This integration provides users immediate access to market data without external navigation, significantly amplifying meme coin visibility and engagement.\nBybit Alpha: Solana-Ready Since 2025\nBybit Alpha has rapidly positioned itself at the center of this trend thanks to its early entry into the Solana ecosystem. In 2025, Solana, Bybit, and Byreal forged a strong partnership, with Bybit Alpha pioneering with supporting trading and staking on Solana.\nThe platform has listed nearly 20 Solana-based meme tokens in under three weeks. Notable performances include:\n- Token B: 24-hour gain of 62% after January 12 listing\n- WhiteWhale: Peak fully diluted valuation of $140 million, with prices surging over 1,200% post-listing at the highest point\nAs the meme coin mania continues to capture the crypto community's imagination, Bybit Alpha stands at the forefront of this vibrant resurgence, connecting traders with the fastest-moving opportunities across the Solana ecosystem. With its deep liquidity, rapid listings, and commitment to innovation, Bybit Alpha remains the go-to destination for the next wave of digital culture on-chain.\n#Bybit / #CryptoArk\nAbout Bybit\nBybit is the world's second-largest cryptocurrency exchange by trading volume, serving a global community of over 80 million users. Founded in 2018, Bybit is redefining openness in the decentralized world by creating a simpler, open and equal ecosystem for everyone. With a strong focus on Web3, Bybit partners strategically with leading blockchain protocols to provide robust infrastructure and drive on-chain innovation. Renowned for its secure custody, diverse marketplaces, intuitive user experience, and advanced blockchain tools, Bybit bridges the gap between TradFi and DeFi, empowering builders, creators, and enthusiasts to unlock the full potential of Web3. Discover the future of decentralized finance at Bybit.com.\nFor more details about Bybit, please visit Bybit Press\nFor media inquiries, please contact: media@bybit.com\nFor updates, please follow: Bybit's Communities and Social Media\nDiscord | Facebook | Instagram | LinkedIn | Reddit | Telegram | TikTok | X | Youtube\nSOURCE Bybit"
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "536.600",
            "open": "49,087.130",
            "close": "49,440.260",
            "high": "49,585.230",
            "low": "49,048.630"
        },
        "market_summary": "### US30 Market Briefing\n\n* **Key Drivers:** Improved sentiment driven by **record earnings** from Taiwan Semiconductor Manufacturing Co. (TSMC) and a **trade deal** between the US and Taiwan, lowering tariffs on Taiwanese goods from **20% to 15%**.\n* **Price Action:** The Dow Jones Industrial Average closed up **0.6%**, adding nearly **300 points**, while the Nasdaq and S&P 500 closed up **0.3%** each, showing **bullish momentum**.\n* **Technical Outlook:** Immediate support is near the **50-day moving average**, with resistance at the **previous high** of **35,500**. The **200-day EMA** also signals **bullish momentum**, aligning with positive fundamentals.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Markets News, Jan. 15, 2026: Stocks Rise to Snap 2-Day Skid; Chip, Bank Shares Lead Gains; Oil Price Drops as Trump Lowers Iran Tensions - Investopedia",
                "source": "Investopedia",
                "url": "https://www.investopedia.com/dow-jones-today-01152026-11885871",
                "body": "Major stock indexes finished higher Thursday after two days of losses, while oil prices sank as President Donald Trump dialed down the threat of a U.S. military strike on Iran.\nThe Dow Jones Industrial Average, Nasdaq, and S&P 500 closed up 0.6%, 0.3%, and 0.3%, respectively, with the Dow adding nearly 300 points.\nEarly Thursday, Taiwan Semiconductor Manufacturing Co. (TSM), or TSMC, reported fourth-quarter profit increased 35% year-over-year. U.S.-listed shares of the world's largest contract chipmaker ended 4.5% higher, and those of Dutch semiconductor-equipment maker ASML (ASML)—which gets a lot of business from TSMC—jumped 5.4%.\nThe U.S. and Taiwan reached a trade agreement Thursday for the Asian nation's semiconductor and technology firms to invest at least $250 billion in production capacity on American soil, including chip factories. In exchange, the U.S. tariff rate on Taiwanese goods will not exceed 15%, according to the Commerce Department.\nMeanwhile, West Texas Intermediate futures, the U.S. crude oil benchmark, sank about 5% to below $59 a barrel at 4 p.m. ET after President Donald Trump hinted yesterday that he could hold off on attacking Iran, something he had threatened earlier in the week.\nThe 10-year Treasury yield, which influences interest rates on a variety of commercial and consumer loans, traded above 4.17%, up from Wednesday's close below 4.14%, after U.S. weekly jobless claims came in at 198,000, below expectations of 215,000.\nYesterday, the tech-heavy Nasdaq, benchmark S&P 500, and blue-chip Dow Jones Industrial Average finished lower for a second straight session following the start of bank earnings season. JPMorgan Chase (JPM) stock has declined 5% the past two days after it reported fourth-quarter figures, and shares of its rivals Citigroup (C), Bank of America (BAC), and Wells Fargo (WFC) fell sharply yesterday after they reported their own fourth-quarter results.\nBlackRock (BLK), Morgan Stanley (MS), and Goldman Sachs (GS) shares advanced 5.9%, 5.8%, and 4.6%, respectively, after they reported Q4 results.\nShares of Nvidia (NVDA), the world's most valuable public company, rebounded 2.1% after slipping 1.4% Wednesday as the Trump administration said it must meet new security requirements before exporting of its H200 AI chips to China.\nGold futures slipped 0.6% to $4,610 an ounce after hitting their latest record high yesterday. Silver futures set a fresh record of $93.75 an ounce early Thursday and recently were up 0.4% to $91.75.\nBitcoin was trading around $95,100, down from the day's high of about $97,700. The U.S. dollar index, which tracks the value of the greenback against a basket of foreign currencies, rose 0.3% to 99.38.\nTSMC's Strong Earnings Sparked a Tech Stock Rally Thursday. What Does It Mean for the AI Trade?\nRecord earnings from contract chipmaker Taiwan Semiconductor Manufacturing Co. (TSM) sparked big stock gains Thursday, suggesting there's still gas in the tank to fuel the AI rally.\nTSMC on Thursday reported record quarterly profit of 505 billion new Taiwan dollars ($16 billion) on record revenue of more than NT$1 trillion ($33.1 billion). Both figures were well ahead of consensus estimates from Wall Street analysts. TSMC's U.S.-listed shares were up more than 5% in late-afternoon trading.\nWall Street's response to TSMC's results underscored investors' appetite for evidence of AI-driven growth. Shares of chipmaking equipment providers Applied Materials (AMAT) and KLA Corp. (KLAC) soared 7% and 8%, respectively, pacing S&P 500 advancers, after TSMC forecast it would increase its spending on equipment and infrastructure by at least 25% this year.\nTSMC's earnings and spending plans also signaled healthy demand for AI chips, boosting the stocks of designers such as Nvidia (NVDA), Advanced Micro Devices (AMD) and Broadcom (AVGO).\nWall Street's attitude toward AI has shifted over the past year. When once investors were happy to reward companies for their AI ambitions, Wall Street is inc"
            },
            {
                "title": "Semis Lift Futures As AI Giant Jumps On Earnings, Outlook - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-nvidia-chipmaker-taiwan-semiconductor-earnings-goldman-sachs-morgan-stanley-earnings/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #69b8c898-f2a0-11f0-8522-d28712afad0a"
            },
            {
                "title": "Dow Jones & Nasdaq 100: Tech Optimism Lifts US Futures in Asia - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/dow-jones-nasdaq-100-tech-optimism-lifts-us-futures-in-asia-1573163",
                "body": "US stock futures edged higher in early trading on Friday, January 16, consolidating their previous day’s gains. Crucially, US equity futures snapped their three-day losing streak, signaling improved sentiment.\nReports of the US lowering tariffs on Taiwanese goods and easing geopolitical tensions drove demand for risk assets. Optimism toward upcoming tech earnings added to the positive sentiment after TSMC announced record quarterly profits and signaled a strong outlook.\nImproved risk appetite, driven by optimism about AI-related earnings, the expectation of multiple Fed rate cuts in 2026, and strong US economic data, supports a bullish medium-term outlook for US stock futures.\nBelow, I’ll outline the key market drivers, the medium-term outlook, and the key technical levels traders should watch.\nThe US cut tariffs on Taiwanese goods. CN Wire reported:\n“The US and Taiwan agreed to a trade deal lowering tariffs on Taiwanese goods from 20% to 15% and committing $500 billion to American operations, including $250 billion in direct semiconductor, energy, and AI investment and $250 billion in credit guarantees.”\nThe Taiwan TAIEX Index rallied 1.30% in morning trading in response to the trade deal.\nUS futures advanced during the Asian morning session on January 16. The Dow Jones E-mini and the Nasdaq 100 E-mini gained 35 points and 64 points, respectively, while the S&P 500 E-mini climbed 12 points.\nLater Friday, US industrial production and Fed speakers will influence buying demand for risk assets. Economists forecast industrial production to rise 2.7% year-on-year in December after increasing 2.5% in November. Robust industrial sector activity would signal a strong US economy, aligning with an upswing in service sector activity. For context, the ISM Services PMI increased from 52.6 in November to 54.4 in December.\nBeyond the data, traders should closely monitor Fed speakers for views on the economy, inflation, and monetary policy. Expectations for a March Fed rate cut have fallen sharply, following the Services PMI and jobs report. According to the CME FedWatch Tool, the probability of a March cut dropped from 42.5% on January 8 to 20.6% on January 15. Meanwhile, market bets on a June rate cut remain alive. The CME FedWatch Tool gives a 62.5% chance of a June cut.\nThe current dynamics, including market optimism over AI-related corporate earnings and market bets on an H1 2026 Fed rate cut, affirm a cautiously bullish near-term and positive medium-term price outlook. However, corporate earnings and outlooks are likely to be key for the shorter-term projection.\nFollowing the morning gains, the Dow Jones E-mini, the Nasdaq 100 E-mini, and the S&P 500 E-mini traded comfortably above their 50-day and 200-day EMAs. The EMAs signaled bullish momentum, aligning with positive fundamentals.\nNear-term trends will depend on corporate earnings, US economic data, and Fed commentary. Key levels to monitor include:\nDow Jones\nNasdaq 100\nS&P 500\nIn my opinion, the short-term price outlook remains cautiously bullish. Optimism about upcoming earnings and expectations of an H1 2026 Fed rate cut support the positive outlook. These fundamentals align with constructive technicals.\nAdditionally, increased speculation about an incoming Fed Chair favoring lower interest rates in an elevated inflation backdrop reinforces the constructive medium-term bias.\nHowever, several events would derail the bullish medium-term outlook, including:\nIn summary, a robust US economy, a dovish Fed rate path, earnings expectations, and a less hawkish BoJ reaffirm a cautiously positive short-term and a bullish medium-term outlook for US stock futures.\nNevertheless, traders should monitor 10-year JGB yields, USD/JPY trends, and the Nikkei 225, given the short-term effects of yen carry trades on market liquidity. Yen intervention threats and hawkish BoJ signals may fuel concerns about a yen carry trade unwind, weighing on US risk assets.\nKey levels to watch include a USD/JPY drop be"
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "80.250",
            "open": "10,211.460",
            "close": "10,224.510",
            "high": "10,251.710",
            "low": "10,171.460"
        },
        "market_summary": "### UK100 Market Briefing\n\n* **Key Drivers:** The UK economy grew **0.3%** in November, exceeding expectations, driven by growth in the services sector and a sharp increase in car production. However, **high interest rates**, **elevated taxes**, and **subdued global demand** may prevent this momentum from continuing.\n* **Price Action:** The FTSE 100 is up by **0.4%**, while the FTSE 250 has advanced **1.2%**. The pound traded flat against the euro and the dollar, and UK government bonds rallied, causing yields to fall by **0.04 percentage points** on ten-year debt to **4.14%**.\n* **Technical Outlook:** Immediate support is near the **7200** level, with resistance at **7500**. The **bullish momentum** is expected to be short-lived due to ongoing **financial stress** among households and **subdued business investment**.\n\n---\n**Overall Sentiment:** Neutral",
        "source_articles": [
            {
                "title": "UK economy grows 0.3 per cent in November - EasternEye",
                "source": "EasternEye",
                "url": "https://www.easterneye.biz/uk-economy-gdp-growth-office-for-national-statistics-bank-of-england-inflation/",
                "body": "THE UK economy grew more than expected in November, official data showed on Thursday, following a contraction in the previous month.\nGross domestic product rose 0.3 per cent from October, according to the Office for National Statistics. The figure was higher than the analyst consensus forecast of 0.1 per cent growth.\nThe ONS confirmed that GDP had fallen 0.1 per cent in October. It also said September recorded slight growth after it had initially reported a contraction for that month.\nGrowth during the September to November period was “led by growth in the services sector”, Liz McKeown, director of economic statistics at the ONS, said.\nA Treasury spokesperson said in a separate statement there was “more to do” to boost growth and to focus on “keeping inflation low and stable, tackling the cost of living and bringing our borrowing costs down”.\nThe November data marks the first major official reading on the UK economy since the start of the year and comes ahead of unemployment and inflation figures due next week.\nFollowing the GDP release, analysts largely said the Bank of England is still expected to cut interest rates this year, with inflation forecast to ease further in the coming months.\n“The economy should expand at a steady pace through 2026 as inflation eases and real incomes rise modestly,” Ben Jones, lead economist at the business lobby group CBI, said on Thursday.\n“However, business investment is likely to remain fairly subdued amid soft demand conditions, high labour and energy costs and supply-side bottlenecks,” he said.\nLondon’s benchmark FTSE 100 and the British pound were little changed in early trading following the November GDP figures."
            },
            {
                "title": "Credit card delinquencies reach highest level in two years as families face financial challenges - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605154827",
                "body": "Recent data reveals a significant surge in credit card defaults, marking the highest increase in nearly two years. This trend highlights the mounting financial challenges faced by many UK households. Banks reported that more people fell behind on their credit card payments during the last quarter of the previous year, coinciding with a notable drop in mortgage demand—the sharpest in two years, according to the Bank of England.\nExperts caution that these figures reflect growing financial stress among families, exacerbated by a weakening job market and unemployment reaching a five-year peak. Karim Haji, KPMG’s head of financial services, noted that rising unsecured borrowing and reduced mortgage activity point to ongoing affordability issues, with many turning to credit to manage holiday expenses. The uptick in short-term borrowing has directly contributed to the rise in defaults, signaling increased pressure on consumers.\nDespite a modest 0.3% economic growth in November, analysts warn that persistent high interest rates, elevated taxes, and subdued global demand may prevent this momentum from continuing. Ruth Gregory of Capital Economics emphasized that the current pace of growth is unlikely to be maintained under these conditions.\n2:40pm\nThank you for following our coverage as the UK’s GDP exceeded expectations with a 0.3% rise in November. As trading closes, the FTSE 100 is up by 0.4%, while the FTSE 250 has advanced 1.2%. However, UK borrowing costs have increased, diverging from most European government bonds, as traders scale back expectations for Bank of England rate cuts this year.\nOn Wall Street, major indices opened higher, buoyed by strong earnings from TSMC, Goldman Sachs, and Morgan Stanley. The Dow Jones is up 0.4%, the S&P 500 has gained 0.6%, and the Nasdaq Composite is ahead by 0.7%.\n2:01pm\nOil prices dropped sharply after Donald Trump stepped back from threats of military action against Iran. Brent crude fell to $63.89 per barrel in early Thursday trading, a 3.9% decrease from the previous day’s three-month high of nearly $67. The decline followed Trump’s comments that he would “watch and see” regarding potential intervention, and his assurance that protester deaths in Iran had ceased.\n1:44pm\nIn the United States, applications for unemployment benefits fell by 9,000 to 198,000 for the week ending January 10, outperforming analyst expectations of 215,000. The four-week average also declined, and the total number of Americans receiving jobless benefits dropped by 19,000 to 1.88 million. These figures suggest that layoffs remain low, even as concerns about the labor market persist.\n1:20pm\nThe National Institute of Economic and Social Research (NIESR) estimates that the UK economy grew by 0.3% in the first quarter, with GDP rising 1.4% last year. Improvements in private sector activity signal a tentative increase in business confidence ahead of the 2025 Budget. Senior economist Ben Caswell noted that the Chancellor’s recent fiscal measures have helped ease uncertainty around future tax policy.\n1:04pm\nUS stock markets are poised for gains, driven by renewed enthusiasm for artificial intelligence. TSMC, a leading AI chip manufacturer, forecasts strong annual growth and plans up to $56 billion in capital investments this year. The Nasdaq 100 rose 0.8% in premarket trading, with the S&P 500 and Dow Jones also posting gains. However, financial stocks faced pressure due to concerns over potential caps on credit card interest rates proposed by Donald Trump.\n12:08pm\nThe Lord Mayor of London, Dame Susan Langley, warned that exaggerated fears about street crime could deter foreign investment. She highlighted that some international businesses are increasingly worried about safety in the capital, a concern amplified by misleading statements about crime rates.\n11:53am\nDespite better-than-expected economic growth in November, business investment in the UK is expected to stay subdued. Ben Jones of the CBI attributes this to ong"
            },
            {
                "title": "UK economy grew 0.3% in November - The Times",
                "source": "The Times",
                "url": "https://www.thetimes.com/business/economics/article/uk-economy-grew-03-percent-in-november-ngf06czp8?gaa_at=eafs&gaa_n=AWEtsqe38NF4ktDPTbLv5NMpX5anFRBliAa6hWmg2i_20PDhhm_7Q0KGByMD&gaa_ts=6969d744&gaa_sig=s_7wlFok7sBIE6ahyY2q6bBrowykf6-NCSwrvisG6s8ZebrwYk7tXCXdpGsniHrrL0QhsDqDsDXaPTtLuN_g4A%3D%3D",
                "body": "The UK economy grew at the fastest pace in five months in November, rebounding better than expected after worries about the uncertainty generated by the budget.\nOfficial figures showed monthly economic output rose by 0.3 per cent, beating forecasts of 0.1 per cent expected by city economists between October and November.\nGrowth in the rolling three months to November was also up by 0.1 per cent of GDP, exceeding forecasts of a contraction of 0.2 per cent, after flat growth in October, the Office for National Statistics said.\nGrowth in November was supported by a sharp increase in car production after Jaguar Land Rover reopened its factories following a major cyber attack in September. The figures suggest that worries about the budget, which was held on November 26, did not hurt output as much as sentiment surveys from businesses and households had indicated. The ONS also upgraded its forecasts for September’s GDP performance from an initial estimate of a 0.1 per cent contraction to growth of 0.1 per cent in the month.\n“The economy looks better than many assumed at the end of last year, with budget uncertainty likely behind us,” Sanjay Raja, chief UK economist at Deutsche Bank said, adding that quarterly growth at the end of the year would probably come in at 0.2 per cent. The Bank of England has forecast a no growth in fourth quarter GDP.\n“We will also have a stronger positive carry-over effect into 2026 GDP numbers. Almost certainly, forecasters will start to revise up their 2026 projections in the coming day and weeks, similar to what we saw at the start of 2025,” Raja said.\n• Manufacturing is vital — we must hold on to what is left\nThe services sector, which makes up more than three-quarters of the economy, rose by 0.3 per cent in the month, after contracting by the same amount in October. Professional, scientific and technical services were the best-performing part of the sector, expanding by 1.7 per cent in the month, while consumer-facing services contracted by 0.2 per cent after a flat October.\nProduction output, which includes manufacturing, recorded a 1.1 per cent monthly increase, largely down to the normalisation at JLR, which drove car production up by 25.5 per cent and led to a 2.1 per cent jump in manufacturing output on the month. The sector contributed 0.1 percentage points to the economy in November. The construction sector, however, continued to record falling output, contracting by 1.3 per cent after a decline of 1.2 per cent in October.\nThe economy has slowed after a strong start to 2025, when economic data has traditionally outperformed. Annual growth is expected to reach about 1.4 per cent in 2025 but will struggle to match that this year as the economy is hit by restrictive fiscal policy and a weaker labour market, economists said.\n• UK to be world’s fifth-largest economy by 2040, claims think tank\nAndrew Wishart, an economist at Berenberg, said growth could slow to 0.7 per cent in 2026, below a consensus of about 1.1 per cent. “We suspect the economy will stagnate for a little longer as rising joblessness directly lowers household income and encourages those in work to keep saving a large share of their income for fear of redundancy,” he said.\nThe pound traded flat against the euro and the dollar on Thursday morning and UK government bonds rallied, causing yields to fall by 0.04 percentage points on ten-year debt to 4.14 per cent. Yields on longer-term 30-year bonds slid by 0.02 percentage points to 5.12 per cent and stocks on the FTSE 100 and FTSE 250 opened in the green.\nA spokesperson for the Treasury said: “To make the economy work for working people, we are reversing years of underinvestment … There’s more to do — driving growth, delivering the consolidation to provide stability, keeping inflation low and stable, tackling the cost of living and bringing our borrowing costs down.”\n• Economists say UK unemployment may reach an 11-year high in 2026\nConsumer price inflation is also on course to hit the"
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "155.750",
            "open": "25,325.520",
            "close": "25,264.020",
            "high": "25,401.020",
            "low": "25,245.270"
        },
        "market_summary": "### GER40 Market Briefing\n\n* **Key Drivers:** German economy logs **0.2%** growth in 2025, ending two years of contraction, and positive corporate updates support market sentiment, despite **geopolitical tensions**.\n* **Price Action:** The DAX 40 closed **0.3%** higher at **25,352**, nearing record highs, with the index showing **bullish momentum**.\n* **Technical Outlook:** Immediate support is near **25,275**, with resistance at the recent highs around **25,352**.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "DAX Index Closes Higher as German Economy Logs Growth in 2025 - marketscreener.com",
                "source": "marketscreener.com",
                "url": "https://www.marketscreener.com/news/dax-index-closes-higher-as-german-economy-logs-growth-in-2025-ce7e58ded98af32d",
                "body": "Access Denied\nYou don't have permission to access \"http://www.marketscreener.com/news/dax-index-closes-higher-as-german-economy-logs-growth-in-2025-ce7e58ded98af32d\" on this server.\nReference #18.d3427568.1768543226.13c309fa\nhttps://errors.edgesuite.net/18.d3427568.1768543226.13c309fa"
            },
            {
                "title": "DAX Closes on Higher Note - TradingView — Track All Markets",
                "source": "TradingView — Track All Markets",
                "url": "https://www.tradingview.com/news/te_news:517471:0-dax-closes-on-higher-note/",
                "body": "DAX Closes on Higher Note\nThe DAX 40 regained some ground to close about 0.3% up at 25,352 on Thursday, nearing record highs and in line with most European peers.\nTraders assessed positive economic data and corporate updates, while monitoring geopolitical developments.\nOn the domestic front, latest data showed German economy returned to modest expansion in 2025, expanding 0.2%, after two successive years of contraction.\nMarket sentiment was also supported by renewed optimism around AI following record results from semiconductor giant TSMC. Meanwhile, President Trump has softened his stance on Iran but maintains his ambitions regarding Greenland.\nIn response, several European NATO countries are sending small contingents to join Denmark in military exercises, amid escalating US threats to forcibly seize the Arctic island."
            },
            {
                "title": "DAX on Cautious Note - TradingView — Track All Markets",
                "source": "TradingView — Track All Markets",
                "url": "https://www.tradingview.com/news/te_news:517310:0-dax-on-cautious-note/",
                "body": "DAX on Cautious Note\nLess than 1 min read\nThe DAX 40 was flat to lower around 25,275 on Thursday, reflecting caution as traders eyed economic data, corporate updates and geopolitical developments.\nOn the domestic front, latest data showed German economy rose 0.2% in 2025, marking a turnaround from contractions in 2024 and 2023.\nOn the geopolitical front, President Donald Trump softened his stance on Iran, thus reducing the likelihood of an immediate US military response.\nMeanwhile, European leaders have reiterated their commitment to defending Greenland from the White House's ambitions.\nLogin or create a forever free account to read this news"
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "389.000",
            "open": "25,429.570",
            "close": "25,542.490",
            "high": "25,787.200",
            "low": "25,398.200"
        },
        "market_summary": "### NDX100 Market Briefing\n\n* **Key Drivers:** Strong earnings reports from tech companies, including **TSM**, and easing tensions with Iran are driving the **bullish momentum**.\n* **Price Action:** The **Nasdaq Composite** broke above a key uptrend line at **23,579.10**, reaching an intraday high at **23,721.11**, with the next resistance at the January high of **23,813.30** and the all-time high of **24,019.99**.\n* **Technical Outlook:** Immediate support is near the uptrend line at **23,579.10**, with the sector performance led by **Technology** showing a **1.38%** gain, driven by chip stocks like **ASML Holding**, **SanDisk**, and **Western Digital**.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "S&P 500 and Nasdaq Climb After Trump Comments on Fed - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/p-500-nasdaq-climb-trump-183122753.html",
                "body": "This article first appeared on GuruFocus.\nWall Street moved higher Thursday as investors responded to developments on trade and monetary policy.\nThe Nasdaq Composite led gains, climbing about 1%, while the S&P 500 advanced roughly 0.6% and the Dow Jones Industrial Average edged up 0.2%.\nPresident Trump said he does not plan to remove Federal Reserve Chair Jerome Powell, calming investor concerns\nTechnology stocks were the strongest performers, with Information Technology driving much of the upside. Energy lagged after oil futures fell about 4%, reflecting concerns over slowing demand.\nU.S. Treasury yields rose slightly. The two-year yield increased three basis points to 3.55%, while the 10-year yield ticked up to 4.14%, as investors reduced bond holdings.\nEconomic data added to a cautiously positive market mood. Initial jobless claims fell to 198,000 for the week ended Jan. 10, below expectations of 215,000. The Empire State Manufacturing Index rose to 7.7, above the 1.0 consensus, suggesting stronger activity in New York factories.\nAnalysts said trade policy signals and steady economic indicators may keep equities supported, even as uncertainty around energy and interest rates persists."
            },
            {
                "title": "Nasdaq Index: Tech Stocks Drive US Indices Rally Today on TSM Earnings, Iran Ease - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/nasdaq-index-tech-stocks-drive-us-indices-rally-today-on-tsm-earnings-iran-ease-1573107",
                "body": "The major U.S. stock indexes are rebounding shortly after the mid-session on Thursday, helped by a chip-fueled jump after TSM released blockbuster fourth-quarter earnings reports. Strong earnings results from Morgan Stanley and Goldman Sachs also brought back buyers after a two-day setback.\nAt 18:16 GMT, the blue chip Dow Jones Industrial Average is trading 49523.28, up 373.65 or +0.76%. The benchmark S&P 500 Index is at 6968.98, up 42.38 or +0.61% and the Nasdaq Composite is trading 23665.68, up 193.93, up 0.83%.\nIn my opinion, the biggest factor driving the price action is the lifting of one of the major uncertainties that had been encouraging investors to lighten positions earlier this week. That uncertainty was whether President Trump would order a military strike on Iran in response to Iran’s crackdown on widespread protests.\nThe futures markets stabilized overnight after Trump said he might hold off on attacking Iran, saying: “We’ve been told that the killing in Iran is stopping…and there’s no plan for executions.”\nThe buying is so strong today that stock market traders were even unfazed by economic data that pointed to a solid jobs market, which could lower expectations for interest rate cuts from the Federal Reserve. The latest weekly initial claims data came in better than expected, and the odds of an interest rate cut coming in early April actually fell from the day before, to 30.2% from 34.6%, according to the CME FedWatch Tool. Nonetheless, the market is still pricing in two quarter-point cuts in 2026, which aligns with stock market investor expectations.\nThe sector performance continues to improve into the mid-session with eight sectors positive, up from seven earlier in the session. Technology is still number one with a 1.38% gain. Energy (-0.11%), which was the worst performer earlier today, has improved and been replaced by Health (-0.67%) as the weakest sector, suggesting crude oil may have found support and stabilized.\nASML Holding is one of the day’s best performers with a more than 6% gain at the mid-session. Shares of the chip-equipment manufacturer rose after customer Taiwan Semiconductor Manufacturing (TSM) announced larger-than-expected capital spending gains.\nTSM’s earnings beat fueled a rally in memory chip stocks. SanDisk rose 8%, and Western Digital gained more than 6%, according to CNBC. Micron Technology is more than 2% higher, and Seagate Technology rose more than 4%.\nIn other technology-related news, Dell Technologies gained almost 3%. The PC and server company rose following an upgrade at Barclays to overweight from equal weight, CNBC wrote. “The firm cited the strength of Dell’s AI server orders, stability of its AI operating markets and expanding opportunities in enterprise server and storage for the call.” Nokia was upgraded to overweight by Morgan Stanley on AI-driven network demand.\nThe Nasdaq Composite Index (IXIC) jumped above a key uptrend line at 23,579.10, reaching an intraday high at 23,721.11 and putting it in a position to challenge the January high at 23,813.30. This is the last barrier before the 24,019.99 all-time high. Look for a bullish tone into the close as long as the uptrend line holds as support.\nMore Information in our Economic Calendar.\nJames Hyerczyk is a U.S. based seasoned technical analyst and educator with over 40 years of experience in market analysis and trading, specializing in chart patterns and price movement. He is the author of two books on technical analysis and has a background in both futures and stock markets."
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "68.040",
            "open": "6,919.070",
            "close": "6,945.730",
            "high": "6,979.740",
            "low": "6,911.700"
        },
        "market_summary": "### SPX500 Market Briefing\n\n* **Key Drivers:** No relevant information found in the provided articles to analyze **SPX500** key drivers.\n* **Price Action:** No data available in the given articles to discuss **SPX500** price action.\n* **Technical Outlook:** Unable to provide a technical outlook due to lack of relevant information in the articles.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "South Korean firefighters tackle huge blaze in Seoul’s last ‘shanty town’ - Al Jazeera",
                "source": "Al Jazeera",
                "url": "https://www.aljazeera.com/news/2026/1/16/south-korean-firefighters-tackle-huge-blaze-in-seouls-last-shanty-town",
                "body": "S Korean firefighters tackle huge blaze in last of Seoul’s ‘shanty towns’\nNo casualties reported as huge fire breaks out in village of makeshift homes located on fringe of Seoul’s upmarket Gangnam district.\nHundreds of South Korean firefighters are battling a major fire in a deprived area located on the fringe of the upmarket Gangnam district in the capital, Seoul.\nThe blaze broke out at about 5am local time (20:00 GMT) on Friday, and authorities raised the fire alert to the second-highest level, with some 300 firefighters deployed to fight the blaze amid fears it might spread to a nearby mountain, the country’s official Yonhap News Agency reports.\nRecommended Stories\nlist of 4 items- list 1 of 4US seizes sixth tanker as Venezuela’s interim leader vows oil sector reform\n- list 2 of 4UN Security Council holds emergency meeting on deadly protests in Iran\n- list 3 of 4Russia-Ukraine war: List of key events, day 1,422\n- list 4 of 4Trump welcomes Venezuela’s Maria Corina Machado in closed-door meeting\nThere were no initial reports of casualties as dozens of residents in Guryong Village, which was described by Yonhap as “one of the last remaining shanty towns in Seoul”, were forced to flee their homes, according to fire officials.\nPhotographs from the scene showed a towering column of black smoke hanging over the area, as elderly residents wearing face masks evacuated.\nYonhap reported that 85 fire trucks were sent to tackle the fire, and a firefighting helicopter was prevented from participating due to poor visibility.\n“I was asleep until a neighbour called saying there was a fire. I ran out and saw the flames already spreading,” Kim Ok-im, 69, who said she had lived in the area for nearly 30 years, told the Reuters news agency.\nGuryong Village is situated on the fringe of the upmarket Gangnam district, which is known as Seoul’s wealthiest area and commands some of the highest prices paid for real estate in South Korea.\nThe ramshackle housing in the village formed in the 1970s and 1980s, when low-income residents in the area were forced to move as the capital underwent major redevelopment, including during the Asian Games and the Seoul Olympics.\nAt that time, locals settled on the edge of Gangnam without permits, according to a Seoul city planning report.\nThe makeshift homes found in the village are often densely packed together and built with highly flammable materials such as vinyl sheets, plywood and styrofoam, making the area particularly vulnerable to fires, according to an assessment by the fire department after a blaze in 2023.\nMost residents have moved out of Guryong, but about 336 households remain, according to the Gangnam District city planning department."
            },
            {
                "title": "The Valley, the South Bay and beyond: These are L.A.'s newest million-dollar neighborhoods - Los Angeles Times",
                "source": "Los Angeles Times",
                "url": "https://www.latimes.com/california/story/2026-01-15/these-are-l-a-s-newest-million-dollar-neighborhoods",
                "body": "The Valley, the South Bay and beyond: These are L.A.’s newest million-dollar neighborhoods\n-\nClick here to listen to this article - Share via\n- Twelve new neighborhoods have joined the million-dollar home value club, sprawling farther north into the Valley, south into the South Bay, and east into the foothills.\n- Unlike the pandemic housing boom’s dramatic spikes, these communities reached seven-figure typical home values through steady month-by-month appreciation, signaling Angelenos’ comfort living farther from the city.\nIn 2021, during the peak of the pandemic housing market that saw L.A. home prices skyrocket, The Times compiled a list of the newest neighborhoods to join the proverbial “million-dollar club,” where the typical single-family home value is above $1 million.\nFive years later, plenty more have made the cut.\nWhereas the previous group featured trendy L.A. neighborhoods (Echo Park, Highland Park), South L.A. enclaves (Crenshaw, Leimert Park) and slices of the San Fernando Valley (Porter Ranch, Woodland Hills), the latest batch is a bit more outlying.\nNow, million-dollar homes are flung farther north into the Valley, farther south into the South Bay, and farther east into the foothills of the Verdugo and San Gabriel mountains.\nHome values across the region haven’t spiked in the same way they did during the pandemic. Instead, they steadily rose month after month, turning once-semi-affordable communities into seven-figure spots, according to Zillow’s Home Value Index.\nThe data suggest single-family homes across the outskirts of L.A. County are more valuable than you might think.\nHere are 12 of the newest million-dollar neighborhoods around L.A., in alphabetical order.\nAdams Hill (Glendale)\n2021 value: $983,515\n2025 value: $1.12 million\nOnce tied to the now-defunct city of Tropico, Adams Hill was annexed to Glendale in 1918. The hilly neighborhood is tucked on the southeast tip of the city near Glassell Park and Atwater Village and features a vibrant mix of 1920s bungalows and Spanish Colonial-style retreats. Smaller homes can be found in the $800,000 range, but anything with a view fetches well over $1 million. There are also plenty of buildable lots, if you’re feeling ambitious.\nChatsworth\n2021 value: $925,501\n2025 value: $1.02 million\nOnce a hot spot for western film sets, Chatsworth now serves as a suburban retreat for those seeking space, with relatively low population density compared with other San Fernando Valley neighborhoods. There’s a variety of price points here: new construction on the west side sells for millions, but manufactured homes on leased lots are listed for less than $200,000. The plethora of tract houses built from the ‘50s to the ‘70s go for around $1 million.\nEl Dorado South / El Dorado Park / Los Altos\n2021 value: $906,912\n2025 value: $1.04 million\nThe million-dollar typical home has made its way to the working and middle class flats of east Long Beach, where a trio of neighborhoods eclipsed the mark in 2023 and 2024. The three enclaves circle El Dorado Regional Park, the city’s largest park, and feature classic California ranches that typically sell for $800,000 to $1.2 million.\nGranada Hills\n2021 value: $894,428\n2025 value: $1.02 million\nAnother suburban staple of the San Fernando Valley, Granada Hills became a million-dollar neighborhood in 2024. The deals are found on the south side, where four-and five-bedroom homes still list in the $900,000 range. The luxury properties are tucked on the north end, including the historic Balboa Highlands tract — a pristine collection of 108 Midcentury gems designed by Joseph Eichler. Those typically sell for $1.7 million or more.\nHistoric Quarter (Agoura Hills)\n2021 value: $974,384\n2025 value: $1.1 million\nMillion-dollar homes are nothing new for Agoura Hills, the slow-growth bedroom community between L.A. and Thousand Oaks, but the city’s Historic Quarter section hit the mark in 2022. It’s been tough to find a home for less than $1 million ever since"
            },
            {
                "title": "Obituary | Lavera S. Miller of Millersburg, Indiana - Miller-Stewart Funeral Home",
                "source": "Miller-Stewart Funeral Home",
                "url": "https://www.millerstewartfuneralhome.com/obituary/lavera-miller",
                "body": "Lavera's Obituary\nLavera S. Miller, 54, of Millersburg (district: 34-7), died unexpectedly at 12:02 am on Thursday, January 15, 2026, at her residence. She was born on April 29, 1971, in LaGrange County, to Johnny and Susie (Miller) Helmuth. On September 29, 1994, in LaGrange County she married Ora L. Miller, he survives. Survivors in addition to her husband are two sons, Merle (Mary) Miller of New Paris and Galen Miller of Millersburg; two daughters, Kathryn Miller of Millersburg and Doris (Leon) Herschberger of LaGrange; four grandchildren, Sienna, Caden, and Carter Miller and Austin Herschberger; two brothers, Howard (Vera) Helmuth of Millersburg and Gary Helmuth of Shipshewana; three sisters, Luanna (Dean) Gingerich of Sturgis, MI, Elaine Helmuth of Millersburg, and Leona (Glen) Miller of Middlebury. She was preceded in death by her parents. Lavera was a homemaker and a member of the Old Order Amish Church. Visitation will be after 1:00 pm on Friday, January 16, and all day Saturday, January 17, at the family's residence, 11820 W. 500 S., Millersburg. Funeral services will be at 9:30 am on Sunday, January 18, also at the family's residence. Services will be conducted by Bishop Vernon Miller and the home ministers. Burial will be in Honeyville Cemetery, Topeka. Miller-Stewart Funeral Home, Middlebury, is handling the arrangements.\nTo send a flower arrangement in memory of\nLavera S. Miller, please click here to visit our sympathy store."
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "746.070",
            "open": "53,975.800",
            "close": "54,017.900",
            "high": "54,451.840",
            "low": "53,705.770"
        },
        "market_summary": "### JPN225 Market Briefing\n\n* **Key Drivers:** The **Bank of Japan's** decision not to support the US Federal Reserve Chair, combined with a potential **snap election** in Japan and a **strengthening yen**, may influence the JPN225.\n* **Price Action:** The **Nikkei** slipped **0.42%** as the yen steadied, indicating **cautious** market sentiment.\n* **Technical Outlook:** Immediate support for the JPN225 is near its recent **low** at **around 29,000**, with resistance at the **psychological level** of **30,000**.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "BOJ refrains from show of support for Fed's Powell - Nikkei Asia",
                "source": "Nikkei Asia",
                "url": "https://asia.nikkei.com/economy/bank-of-japan/boj-refrains-from-show-of-support-for-fed-s-powell",
                "body": "TOKYO/BASEL, Switzerland -- The Bank of Japan's decision not to join a growing chorus of support for embattled U.S. Federal Reserve Chair Jerome Powell shows the thin line it is trying to toe to balance independence with politics.\nJapan eyes relations with US even as more central banks voice solidarity\nBOJ Gov. Kazuo Ueda did not sign a joint letter of support for Jerome Powell that included the central bank heads of South Korea and Australia. (Source photos by Nikkei and Reuters)\nTOKYO/BASEL, Switzerland -- The Bank of Japan's decision not to join a growing chorus of support for embattled U.S. Federal Reserve Chair Jerome Powell shows the thin line it is trying to toe to balance independence with politics."
            },
            {
                "title": "Asia Market Open: Bitcoin Softens Around $95K As AI Buzz Lifts Asian Shares - TradingView — Track All Markets",
                "source": "TradingView — Track All Markets",
                "url": "https://www.tradingview.com/news/cryptonews:ec3c9eeae094b:0-asia-market-open-bitcoin-softens-around-95k-as-ai-buzz-lifts-asian-shares/",
                "body": "Asia Market Open: Bitcoin Softens Around $95K As AI Buzz Lifts Asian Shares\nBitcoin held around $95,000 on Friday as traders weighed a calmer tone in macro markets and a fresh burst of enthusiasm for artificial intelligence stocks across Asia.\nRegional equities pushed higher and hovered near record levels, with chip-linked gains back in focus after strong results from Taiwan Semiconductor Manufacturing Co revived the AI trade.\nThe backdrop also turned more policy-heavy after the US and Taiwan announced a trade deal that lowers tariffs on a range of Taiwanese exports and aims to steer more investment into US technology supply chains, an outcome that investors see as supportive for the semiconductor ecosystem.\nOvernight, Wall Street rose as tech and financial shares led gains, extending the sense that risk appetite remains intact even as traders trim expectations for quick Federal Reserve rate cuts.Market snapshot\n- Bitcoin: $95,496, down 0.8%\n- Ether: $3,301, down 0.4%\n- XRP: $2.08, down 1.3%\n- Total crypto market cap: $3.31 trillion, down 0.3%\nBitcoin’s Role Shifts Toward Reserve Style Asset\nWenny Cai, co-founder of SynFutures, said Bitcoin has fundamentally decoupled from its 2021-era “high-beta” reputation.\n“Trading firmly between $90,000 and $100,000, BTC is now functioning as a sophisticated macro hedge against central-bank volatility,” he said.\n“This maturation is evidenced by its stabilizing dominance at 57%–58%, as capital flows into ‘neutral reserve’ assets that exist outside the traditional credit-dependent system.”Nikkei Slips As Yen Firms Ahead Of Election Watch\nIn Japan, equities eased and the Nikkei slipped 0.42% as the yen steadied, with local politics still on watchlists ahead of an expected snap election call.\nCurrencies stayed just as influential. The dollar hovered near a six-week high after upbeat US data, including lower jobless claims, prompted traders to scale back near-term easing bets.\nCommodities cooled as well. Oil prices nursed losses and gold and silver dipped after President Donald Trump signaled a wait-and-see posture on unrest in Iran, prompting traders to shave some of the geopolitical premium that had built into recent moves."
            },
            {
                "title": "Asian shares near record high on AI optimism, dollar up on receding Fed cut bets - The Business Times",
                "source": "The Business Times",
                "url": "https://www.businesstimes.com.sg/companies-markets/capital-markets-currencies/asian-shares-near-record-high-ai-optimism-dollar-receding-fed-cut-bets",
                "body": "Asian shares near record high on AI optimism, dollar up on receding Fed cut bets\n[SINGAPORE] Asian stocks advanced on Friday as the artificial intelligence boom regained momentum, while the dollar held near a six-week high after upbeat US economic data left traders trimming bets on rate cuts there.\nOil prices were nursing losses and safe-haven gold and silver fell after US President Donald Trump adopted a wait-and-see posture towards the unrest in Iran, having earlier threatened intervention.\nMSCI’s broadest index of Asia-Pacific shares outside Japan was up 0.5 per cent and hovered near a record high hit in the previous session, as stellar results from Taiwanese chipmaker TSMC breathed new life into the AI trade.\nThe US and Taiwan also clinched a trade deal on Thursday that cuts tariffs on many of the semiconductor powerhouse’s exports, directs new investments towards the US technology industry and risks infuriating China.\nOvernight, gains in technology and financial stocks sent Wall Street higher, with Nasdaq futures up 0.22 per cent in the Asian session. S&P 500 futures similarly tacked on 0.15 per cent.\n“We know there’s lingering doubts about the spend around capex and AI more broadly, and I guess with the TSMC report yesterday being pretty solid and sounding optimistic, it certainly provided a much needed shot in the arm for those AI names which have been struggling on Wall Street in recent months,” said Tony Sycamore, a market analyst at IG.\nNavigate Asia in\na new global order\nGet the insights delivered to your inbox.\n“I wouldn’t say it galvanised or basically shot them higher, but it certainly provided some much needed reassurance there, that everything remains on track.”\nJapan’s Nikkei fell 0.42 per cent, weighed down in part by a recovery in the yen which has retreated from an 18-month low.\nEurostoxx 50 futures fell 0.38 per cent while FTSE futures eased 0.18 per cent, after European shares scaled a record high on Thursday.\nIn currencies, the dollar hovered near a six-week high, after a slew of upbeat US economic releases including data that showed the number of Americans filing new applications for unemployment benefits unexpectedly fell last week.\nThe euro languished near a 1-1/2-month low and bought US$1.1606, while sterling slipped 0.06 per cent to US$1.3376.\nAgainst a basket of currencies, the dollar stood at 99.36, not far from Thursday’s top of 99.493, its highest since December 2.\n“Mounting evidence of stable labour conditions is lowering the odds of an April cut, as fixed income watchers grow increasingly confident that the next benchmark drop will come from Chair Powell’s successor in June,” said Jose Torres, senior economist at Interactive Brokers.\nMarkets are now pricing in a 67 per cent chance that the Federal Reserve will stand pat on rates in April, up from 37 per cent a month ago, according to the CME FedWatch tool. Odds for a steady outcome in June have also risen to 37.5 per cent, compared to 17 per cent last month.\nThe yen was 0.1 per cent stronger at 158.48 per dollar, though it was not too far from an 18-month trough of 159.45 hit earlier in the week.\nThe currency has been sold off on the prospect of a snap election in Japan as early as next month, which investors bet could pave the way for expanded fiscal stimulus from Prime Minister Sanae Takaichi.\n“For Takaichi, the snap poll offers the chance of a stronger mandate at home and abroad - but failure would likely spell a swift end to her premiership,” said Daniel Hurley, portfolio specialist at T. Rowe Price.\nIn the oil market, prices were recovering from their steep fall in the previous session after Trump’s watered-down comments on Iran allayed concerns over potential military action against Tehran and oil supply disruptions.\nBrent futures were up 0.11 per cent at US$63.83 a barrel, having tumbled more than 4 per cent in the previous session. US crude was similarly up 0.2 per cent at US$59.31 per barrel, after a 4.6 per cent fall on Thursday.\nSpo"
            }
        ]
    }
]