[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "116.710",
            "open": "4,518.850",
            "close": "4,598.160",
            "high": "4,630.160",
            "low": "4,513.450"
        },
        "market_summary": "### Gold (XAU/USD) Market Briefing\n\n* **Key Drivers:** Escalating tensions between the US government and the Federal Reserve, coupled with **geopolitical risks** and **inflation concerns**, are driving investors towards **safe-haven assets** like gold.\n* **Price Action:** Gold has surged to a new record high, breaking above **$4,600** per ounce, with **silver** also reaching new highs, nearing **$85** per ounce, showcasing significant **bullish momentum**.\n* **Technical Outlook:** The **$4,600** level is now a key psychological resistance, with support expected at the **$4,500** level, given the metal's recent **upward trend**.\n\n---\n**Overall Sentiment:** Positive ️",
        "source_articles": [
            {
                "title": "Gold and silver soar after US targets Federal Reserve in Powell probe - Euronews.com",
                "source": "Euronews.com",
                "url": "https://www.euronews.com/business/2026/01/12/gold-and-silver-soar-after-us-targets-federal-reserve-in-powell-probe",
                "body": "European indexes were mixed on Monday after a rally in Asia, while US futures dipped on reports of a Justice Department probe into Fed chair Jerome Powell. The news sent gold and silver to fresh records.\nMarkets in Europe showed little movement on Monday after a broad rally in Asia.\nUS futures dipped, meanwhile, after Federal Reserve Chair Jerome Powell said the Department of Justice had served the central bank with subpoenas.\nPowell noted that the threat of a criminal indictment relates to his testimony about the Fed’s building renovations.\nPresident Donald Trump insisted that he did not \"know anything\" about the investigation that escalates a nearly year-long feud between the government and the central bank.\nWhen asked by NBC if the probe is intended to pressure Powell on rates, Trump said: “No. I wouldn’t even think of doing it that way.”\nTrump has nonetheless criticised the $2.5 billion (€2.13bn) renovation of two Fed office buildings as excessive.\nGold and silver continue to rise\nMarkets appeared to take the news in their stride, although gold and other safe-haven assets climbed.\nGold vaulted over $4,600 an ounce, shooting up over 2.5%, and silver approached $85 for the first time, rising over 7%. Copper futures in the US jumped by 2.52% to $6.051.\nPowell’s term as chair ends in May, and Trump administration officials have signalled that he could name a potential replacement this month. Trump has also sought to fire Fed governor Lisa Cook, another move that chips away at central bank independence.\nGold's rise is also linked to unrest in Iran as nationwide demonstrations against leader Ayatollah Ali Khamenei enter a third week. More than 500 people have been killed during the demonstrations, according to the US-based Human Rights Activists News Agency, including 490 protesters.\nPresident Trump said that he intends to intervene in the country if the Iranian government continues to kill protestors.\nUS futures dip lower\nFutures for the S&P 500 dipped by 0.53% a few hours before daily trading started on Wall Street.\nFutures for the Dow Jones Industrial Average fell 0.67%, while the Nasdaq composite index slipped 0.71% in pre-market trading.\nLast Friday, US stocks hit records following a mixed report on the US job market. The data may delay another cut to interest rates by the Federal Reserve but does not entirely rule out the possibility.\nThe S&P 500 climbed 0.65% to 6,966.28, topping its prior all-time high set earlier in the week. The Dow Jones Industrial Average added 0.5% to 49,504.07 and likewise set a record. The Nasdaq composite led the market with a 0.8% gain, closing at 23,671.35.\nThe US Labor Department said employers hired fewer workers during December than economists expected, though the unemployment rate improved and was better than expected. An update on US inflation at the consumer level is due Tuesday, followed by a report on wholesale prices on Wednesday.\nIn other dealings early Monday, the dollar fell to 157.8180 Japanese yen, a daily drop of less than 0.1%. The euro climbed to $1.1691, a 0.49% rise.\nUS benchmark crude oil gave up early gains, falling to $58.91 per barrel. Brent crude, the international standard, dropped to $63.18 per barrel.\nRest of the world\nIn Germany, the DAX was nearly flat at 25,358.17, while France's CAC 40 also showed modest movements, coming to 8,359.71 by mid-afternoon. Britain's FTSE 100 edged less than 0.1% higher, to 10,127.05.\nIn Asian trading, Hong Kong's Hang Seng gained 1.44% to 26,608.48, while the Shanghai Composite index jumped 1.09% to 4,165.29 after reports that Chinese leaders were preparing additional support for the economy.\nIn South Korea, the Kospi added 0.84% to 4,624.79 while Australia's S&P/ASX 200 gained 0.48% to 8,759.40. Taiwan's Taiex gained 0.92%."
            },
            {
                "title": "Stock market today: Dow, S&P 500 eke out records, gold soars after Trump amps up fight with Fed, Powell - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-eke-out-records-gold-soars-after-trump-amps-up-fight-with-fed-powell-210028506.html",
                "body": "Stock market today: Dow, S&P 500 eke out records, gold soars after Trump amps up fight with Fed, Powell\nUS stocks notched fresh records on Monday, as Wall Street trod cautiously but largely looked past concerns over Federal Reserve independence after US prosecutors opened a criminal investigation into Chair Jerome Powell.\nThe Dow Jones Industrial Average (^DJI) rose 0.2% to close at an all-time high. The S&P 500 (^GSPC) gained 0.2% to also notch a fresh record. The tech-heavy Nasdaq Composite (^IXIC) added 0.3%. The three indexes began Monday's session sharply lower but turned around by late morning.\n(^DJI)\nOther pockets of markets showed more effects from the Fed fight, with gold (GC=F) and silver (SI=F) surging to records as investors flocked to safer havens. Bonds ticked lower. The US dollar (DX-Y.NYB) also fell.\nRattled markets took in the drama as Powell said the Justice Department has subpoenaed the Fed, threatening criminal charges over his testimony on building renovations. In a strongly worded statement, Powell said the action is an escalation of President Trump's campaign to pressure the Fed into cutting interest rates.\n\"The threat of criminal charges is a consequence of the Federal Reserve setting interest rates based on our best assessment of what will serve the public, rather than following the preferences of the President,\" Powell wrote, describing the concerns cited in the subpoenas as \"pretexts.\"\nIn corporates, bank and other financial services stocks slumped thanks to a warning to credit card issuers from Trump. Lenders will be \"in violation of the law\" if they don't cap interest rates at 10%, he told reporters on Sunday. Shares of Capital One (COF) slid 7% to lead early trading losses. Citi (C) and JPMorgan (JPM) also fell in a downbeat start to a week when big US banks will kick off earnings season.\nThe unsettled mood comes as investors get ready for this week's updates on inflation in December, with the Consumer Price Index (CPI) reading due on Tuesday. Markets were overwhelmingly betting on no rate cut from the Fed this month after Friday’s December jobs report showed continued cooling in the labor market without signaling a sharp economic slowdown.\nLIVE 29 updatesNvidia, Eli Lilly announce $1 billion investment in AI drug discovery lab\nAI chipmaker Nvidia (NVDA) and pharmaceutical giant Eli Lilly (LLY) on Monday announced that the two companies will jointly invest $1 billion to create a lab in San Francisco focused on using AI to accelerate drug discovery.\n“Combining our volumes of data and scientific knowledge with NVIDIA’s computational power and model-building expertise could reinvent drug discovery as we know it,\" said Lilly CEO David Ricks.\nThe investment builds on Nvidia and Lilly's existing partnership. Lilly in October said it is building an AI factory with Nvidia's Blackwell systems to speed up drug discovery timelines.\nLLY shares rose fractionally, while NVDA hovered below the flatline."
            },
            {
                "title": "The relationship between gold prices and the dollar: Everything to know - AOL.com",
                "source": "AOL.com",
                "url": "https://www.aol.com/articles/relationship-between-gold-prices-dollar-153224624.html",
                "body": "The relationship between gold prices and the dollar: Everything to know\nInvestors have long viewed gold as a steady hedge during periods of economic uncertainty, but its role in today's markets is evolving rapidly. Recent shifts in monetary policy, stubborn inflation risks and rising geopolitical tensions have all reshaped how investors think about safety, value and long-term protection, and have pushed traditional market relationships to their limits.\nAgainst that backdrop, gold's recent price behavior has been anything but ordinary. After breaking through key price thresholds in 2024 and 2025 — first $3,000 per ounce, then $4,000 — the price of the precious metal has continued climbing in 2026, recently surpassing $4,600 per ounce and setting a string of new all-time highs. What once looked like a cyclical upswing now resembles a sustained re-rating of gold's place in the global financial system.\nA combination of persistent central-bank buying, shifting rate expectations and changing investor attitudes toward risk has helped keep gold's momentum intact. Perhaps most surprising, though, is how the metal has behaved alongside a relatively strong U.S. dollar, challenging long-held assumptions and leaving many investors wondering what comes next. Below, we'll break down what investors should know now.\nWanted to invest in gold now that the price is climbing? Get started here now.\nThe relationship between gold prices and the dollar\nBelow, experts break down why the price of gold keeps climbing and the precious metal's complex relationship with the dollar.\nWhy gold prices have been climbing\n\"Gold can be a valuable asset in a portfolio precisely because it has [a] low correlation with other asset classes,\" emphasizes Ben Nadelstein, head of content at Monetary Metals.\nThis independence from traditional market patterns has caught investors' attention, especially as the economy faces increasing uncertainty. The appeal of gold's unique behavior has helped drive its impressive price climb, but it's not the only factor at work. Industry professionals highlight other forces that have pushed gold prices higher:\nCentral bank buying: Central banks have dramatically increased their gold reserves in recent years and continue to do so.Investor sentiment: More investors are adding gold to diversify their portfolios amid inflationary and financial stability concerns.De-dollarization: The BRICS+ nations are reducing their dependence on the U.S. dollar.Market evolution: Gold prices now respond to a broader range of global economic factors.\nHow gold prices typically move with the dollar\nHenry Yoshida, co-founder of Rocket Dollar, highlights that gold prices and the U.S. dollar traditionally move in opposite directions.\nAdvertisement\n\"A stronger U.S. dollar will suppress the price of gold, while a weaker U.S. dollar will likely drive the price of gold higher through increased demand,\" Yoshida says.\nBut Michael Petch, co-founder and president of Argo Digital Gold, points out that this relationship isn't absolute.\n\"[When there's] financial instability, gold and the dollar may [go up as people] seek safe-haven assets,\" Petch says.\nThe complex interplay between gold and the dollar\n\"Large-scale government accumulation has added a demand-side force that can push [gold] prices higher, even in a strong-dollar environment,\" Petch says.\nBeyond this influence, Kevin Bryan, director of customer experience at The Alloy Market, points to several often-overlooked factors that create a more nuanced dynamic:\nSupply limits: Mining strikes and environmental regulations can restrict gold production. As a result, gold prices may go up, even if the dollar is strong.Geopolitical risks: Rising global tensions and trade disputes create uncertainty. Naturally, this drives people to invest in safe-haven assets such as gold.Inflation concerns: Investors may turn to precious metals, including gold and silver, to hedge against inflation, regardless of current dollar strength.Digi"
            }
        ]
    },
    {
        "asset_name": "Silver",
        "symbol": "EIGHTCAP:XAGUSD",
        "status": "Success",
        "data": {
            "day_range": "6.445",
            "open": "80.629",
            "close": "85.159",
            "high": "86.219",
            "low": "79.774"
        },
        "market_summary": "### Silver (XAG/USD) Market Briefing\n\n* **Key Drivers:** Growing safe-haven demand due to the **Fed crisis** and **unrest in Iran**, coupled with **industrial demand** and **supply shortages**, are driving **silver** prices higher.\n* **Price Action:** Surged to a new all-time high, with **silver** approaching **$85** and showing significant **bullish momentum**.\n* **Technical Outlook:** Immediate resistance is at **$86.06** (Fibo 100% expansion), with support at **$80.00**; a close above the former top is needed to confirm the fresh positive signal, targeting **$90.00**.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Gold and silver soar after US targets Federal Reserve in Powell probe - Euronews.com",
                "source": "Euronews.com",
                "url": "https://www.euronews.com/business/2026/01/12/gold-and-silver-soar-after-us-targets-federal-reserve-in-powell-probe",
                "body": "European indexes were mixed on Monday after a rally in Asia, while US futures dipped on reports of a Justice Department probe into Fed chair Jerome Powell. The news sent gold and silver to fresh records.\nMarkets in Europe showed little movement on Monday after a broad rally in Asia.\nUS futures dipped, meanwhile, after Federal Reserve Chair Jerome Powell said the Department of Justice had served the central bank with subpoenas.\nPowell noted that the threat of a criminal indictment relates to his testimony about the Fed’s building renovations.\nPresident Donald Trump insisted that he did not \"know anything\" about the investigation that escalates a nearly year-long feud between the government and the central bank.\nWhen asked by NBC if the probe is intended to pressure Powell on rates, Trump said: “No. I wouldn’t even think of doing it that way.”\nTrump has nonetheless criticised the $2.5 billion (€2.13bn) renovation of two Fed office buildings as excessive.\nGold and silver continue to rise\nMarkets appeared to take the news in their stride, although gold and other safe-haven assets climbed.\nGold vaulted over $4,600 an ounce, shooting up over 2.5%, and silver approached $85 for the first time, rising over 7%. Copper futures in the US jumped by 2.52% to $6.051.\nPowell’s term as chair ends in May, and Trump administration officials have signalled that he could name a potential replacement this month. Trump has also sought to fire Fed governor Lisa Cook, another move that chips away at central bank independence.\nGold's rise is also linked to unrest in Iran as nationwide demonstrations against leader Ayatollah Ali Khamenei enter a third week. More than 500 people have been killed during the demonstrations, according to the US-based Human Rights Activists News Agency, including 490 protesters.\nPresident Trump said that he intends to intervene in the country if the Iranian government continues to kill protestors.\nUS futures dip lower\nFutures for the S&P 500 dipped by 0.53% a few hours before daily trading started on Wall Street.\nFutures for the Dow Jones Industrial Average fell 0.67%, while the Nasdaq composite index slipped 0.71% in pre-market trading.\nLast Friday, US stocks hit records following a mixed report on the US job market. The data may delay another cut to interest rates by the Federal Reserve but does not entirely rule out the possibility.\nThe S&P 500 climbed 0.65% to 6,966.28, topping its prior all-time high set earlier in the week. The Dow Jones Industrial Average added 0.5% to 49,504.07 and likewise set a record. The Nasdaq composite led the market with a 0.8% gain, closing at 23,671.35.\nThe US Labor Department said employers hired fewer workers during December than economists expected, though the unemployment rate improved and was better than expected. An update on US inflation at the consumer level is due Tuesday, followed by a report on wholesale prices on Wednesday.\nIn other dealings early Monday, the dollar fell to 157.8180 Japanese yen, a daily drop of less than 0.1%. The euro climbed to $1.1691, a 0.49% rise.\nUS benchmark crude oil gave up early gains, falling to $58.91 per barrel. Brent crude, the international standard, dropped to $63.18 per barrel.\nRest of the world\nIn Germany, the DAX was nearly flat at 25,358.17, while France's CAC 40 also showed modest movements, coming to 8,359.71 by mid-afternoon. Britain's FTSE 100 edged less than 0.1% higher, to 10,127.05.\nIn Asian trading, Hong Kong's Hang Seng gained 1.44% to 26,608.48, while the Shanghai Composite index jumped 1.09% to 4,165.29 after reports that Chinese leaders were preparing additional support for the economy.\nIn South Korea, the Kospi added 0.84% to 4,624.79 while Australia's S&P/ASX 200 gained 0.48% to 8,759.40. Taiwan's Taiex gained 0.92%."
            },
            {
                "title": "Gold, Silver Surge to Records as Fed Crisis, Inflation Data Drive Markets - News and Statistics - IndexBox",
                "source": "IndexBox",
                "url": "https://www.indexbox.io/blog/gold-and-silver-hit-record-highs-amid-fed-crisis-and-inflation-data-awaited/",
                "body": "Gold and Silver Hit Record Highs Amid Fed Crisis and Inflation Data Awaited\nGold and silver surged to record highs Monday as investors sought shelter from a political crisis at the Federal Reserve and braced for a pivotal week of U.S. inflation data, according to Decrypt. Silver jumped nearly 7% from Fridays close to trade near $85, while gold, up 2.2%, set a new record high of $4,600.\nThe rally in precious metals was catalyzed by an unprecedented political crisis at the Federal Reserve, following the Department of Justices lawsuit against Chair Jerome Powell. \"Gold and silver moved higher as markets leaned back into safe-haven positioning amid rising geopolitical risk and renewed uncertainty around U.S. monetary policy credibility,\" Wenny Cai, COO at Synfutures, told Decrypt. The DOJs move has added \"unusual political risk, raising concerns around central bank independence,\" driving the rotation into metals, she said.\nMarket Sentiment Shifts\nMarket sentiment is visibly shifting, with users on prediction market Myriad, owned by Decrypt s parent company Dastan, now assigning a 79% chance that gold reaches $5,000 before Ethereum—a conviction level that has risen from 70% at the start of the week.\nYaroslav Patsira, Fractional Director at CEX.IO, echoed Cais take, citing additional drivers including renewed geopolitical tensions and soft labor data, which strengthen the case for rate cuts—a bullish environment for non-yielding assets, he told Decrypt.\nLooming Inflation Data\nAll eyes now turn to Tuesdays U.S. Consumer Price Index (CPI) and Producer Price Index (PPI) inflation readings, which will test the rallys durability. \"The most impactful data this week are likely the U.S. CPI and PPI inflation releases,\" Patsira explained. \"Downside surprises could reinforce rate cut expectations and provide additional support for gold and silver.\"\nCai concurred, stating that softer inflation and labor market readings \"would reinforce expectations for future rate cuts, which tends to support non-yielding assets like gold and silver.\" The rally places precious metals at a pivotal juncture. Whether they hold these record levels will now depend on cold, hard inflation data, testing the durability of their safe-haven appeal against fresh macroeconomic reality.\nThis report provides a comprehensive view of the silver industry in the United States, tracking demand, supply, and trade flows across the national value chain. It explains how demand across key channels and end-use segments shapes consumption patterns, while also mapping the role of input availability, production efficiency, and regulatory standards on supply.\nBeyond headline metrics, the study benchmarks prices, margins, and trade routes so you can see where value is created and how it moves between domestic suppliers and international partners. The analysis is designed to support strategic planning, market entry, portfolio prioritization, and risk management in the silver landscape in the United States.\nQuick navigation\n- Key findings\n- Report scope\n- Product coverage\n- Country coverage\n- Methodology\n- Forecasts to 2035\n- Price analysis\n- Market participants\n- Country profiles\n- How to use this report\n- FAQ\nKey findings\n- Domestic demand is shaped by both household and industrial usage, with trade flows linking local supply to imports and exports.\n- Pricing dynamics reflect unit values, freight costs, exchange rates, and regulatory shifts that affect sourcing decisions.\n- Supply depends on input availability and production efficiency, creating a distinct national cost curve.\n- Market concentration varies by segment, creating different competitive landscapes and entry barriers.\n- The 2035 outlook highlights where capacity investment and demand growth are most aligned within the country.\nReport scope\nThe report combines market sizing with trade intelligence and price analytics for the United States. It covers both historical performance and the forward outlook to 2035, allowing you to comp"
            },
            {
                "title": "XAG/USD outlook: Silver posts new all-time high on growing safe-haven and industrial demand - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/analysis/xag-usd-outlook-silver-posts-new-all-time-high-on-growing-safe-haven-and-industrial-demand-202601121641",
                "body": "XAG/USD outlook: Silver posts new all-time high on growing safe-haven and industrial demand\nSilver hit new all-time high following over 6% advance on Monday, as fresh shockwaves from a criminal probe by Trump administration on Fed Chair Jerome Powell struck markets at the start of the week and prompted investors into safety.\nUnrests in Iran, with threats of uncontrollable escalation, add to growing uncertainty and boost safe-haven demand, with silver being additionally supported by supply shortages, due to strong industrial demand.\nCompletion of corrective phase from previous record high and bullish failure swing pattern on daily chart, generate fresh signal of continuation of larger uptrend that was paused for $85.42/$70.03 correction.\nClose above former top is needed to confirm fresh positive signal, with violation of initial target at $86.06 (Fibo 100% expansion of acceleration from $70.03) needed to validate wave principles and open way for extension of the third wave of five-wave sequence (from $70.03) towards $90.00 (round-figure and 90.74 (FE 138.2%).\nDips on price adjustments should be shallow and hold above $80 to keep broader bulls in play.\nRes: 86.06; 88.00; 89.05; 90.00\nSup: 84.60; 83.54; 82.73; 80.00\nAuthor\nSlobodan Drvenica\nWindsor Brokers\nIndustry veteran with over 22 years’ experience, Slobodan Drvenica joined Windsor Brokers in 1995 when he was an active trader for more than 10 years, managing the trading desk and own account departments."
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.540",
            "open": "63.429",
            "close": "64.337",
            "high": "64.464",
            "low": "62.924"
        },
        "market_summary": "### Spot Brent Crude Oil Market Briefing\n\n* **Key Drivers:** Potential U.S. control over Venezuela's oil industry could undermine **OPEC's** influence on global oil markets, while supply risks in Venezuela, Iran, and Russia are adding a **supply risk premium** to crude oil prices.\n* **Price Action:** **West Texas intermediate's** near-month futures contract closed at **$59.12** per barrel, an increase of **$2.46** per barrel from three weeks ago, amid concerns over global supply risks.\n* **Technical Outlook:** Immediate support is near the **50-day moving average**, with resistance at **$60** per barrel, as the market weighs the potential impact of U.S. intervention in Venezuela's oil sector on **global supply**.\n\n---\n**Overall Sentiment:** **Neutral** ️",
        "source_articles": [
            {
                "title": "Trump’s Venezuela Gambit Could Erode OPEC’s Clout in Oil Markets - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/trump-venezuela-gambit-could-erode-220000681.html",
                "body": "For the past year, surging oil production from the Americas – led by the United States, Guyana, and Brazil – has been a headache for OPEC in its efforts to rebalance the market and seek higher oil prices.\nOPEC’s efforts to continue influencing global oil supply and prices could be further undermined by the U.S. intervention in Venezuela and President Donald Trump’s idea to control the oil industry of the world’s biggest crude resource holder.\nOPEC member Venezuela is estimated to hold 303 billion barrels of crude oil, more than each of its fellow OPEC producers, Saudi Arabia, Iraq, Iran, or the United Arab Emirates (UAE).\nThe U.S. controlling the Venezuelan reserves, and U.S. companies investing in recovering the struggling oil industry in the South American country could seriously tip the scale of energy market dynamics to U.S. favor. This would undermine OPEC’s influence on the global oil markets, analysts say.\nAny meaningful recovery of Venezuela’s oil supply, which is currently at less than 1% of global daily demand, would need billions of U.S. dollars, probably upwards of $100 billion, in investments, and years to take hold. And that’s considering that there will be solid new legal frameworks and security guarantees that would give assurances to potential investors that they would not face another asset seizure and nationalization.\nRelated: Is Iraq About to Make Its Biggest Geopolitical Pivot in Years?\nPresident Trump’s plan to have U.S. firms invest in Venezuela’s oil sector recovery was not met with enthusiasm by the executives of the top U.S. oil firms at the Friday meeting at the White House.\nDespite President Trump touting Venezuela’s oil as a creator of “tremendous wealth” for industry and “great wealth” for the American people, the reception from executives was lukewarm.\n“We’ve had our assets seized there twice, and so you can imagine to re-enter a third time would require some pretty significant changes from what we’ve historically seen here,” Exxon’s CEO Darren Woods told President Trump.\n“If we look at the legal and commercial constructs and frameworks in place today in Venezuela today, it’s uninvestable.”\nRegardless of how investable Venezuela will be in the future, the U.S. control over its oil industry would change the power balance in the oil markets, giving the U.S. more sway in longer-term supply. This would leave OPEC and the wider OPEC+ group including Russia and Kazakhstan with potentially diminished clout in influencing the oil market balances and prices."
            },
            {
                "title": "Gasoline prices drop nearly 10 cents, oil supply risks loom - CSP Daily News",
                "source": "CSP Daily News",
                "url": "https://www.cspdailynews.com/fuels/gasoline-prices-drop-nearly-10-cents-oil-supply-risks-loom",
                "body": "The national average retail price of regular grade gasoline dropped a further 9.9 cents per gallon in the past three weeks. The new price, $2.893 per gallon, is down 27 cents in the past seven weeks alone.\nCompared with last year's high price point into early April, the current price is 45 cents per gallon lower. Versus one year ago, the price is a discount of 24 cents.\nBut unfolding scenes in several oil producing nations have added some supply risk premium to crude oil prices. West Texas intermediate's near-month futures contract closed at $59.12 per barrel on Jan. 9, an increase of $2.46 pe barrel, the equivalent of nearly 6 cents per gallon, higher than its price of three weeks ago.\nUnknowns concerning the speed and degree of any comebacks in Venezuelan oil sales and production are joined by the growing public protests in Iran against the dangers of regime retaliation, and the possibility of a new and more severe U.S. tariff upon sales of sanctioned Russian oil, plus the lack of progress in efforts to end the Russia-Ukraine war, have hiked oil prices beyond what they otherwise would have been.\nUnless one or more of the global unknowns adding to oil's supply risk price premium should appear more benign quickly, it is likely that gasoline price cutting will soon cease and possibly bring increases. If oil price increases are substantial and sustained, gasoline prices will respond by climbing.\nMeanwhile gasoline stocks are now far higher, and U.S. refiners continue to utilize capacity at a high rate of 94.7%.\nRetailers now garner on average a still handsome regular grade margin of 40.3 cents, after losing 8.3 cents in the past three weeks. Retail price, wholesale price and retail margin all declined. The only winner was the gasoline tax man, made up of federal, state, local and sales taxes weighted and combined, rose three tenths of a cent.\nTrilby Lundberg is publisher of the Lundberg Survey of U.S. fuel markets. Lundberg Survey Inc. is based in Camarillo, California.\nMembers help make our journalism possible. Become a CSP member today and unlock exclusive benefits, including unlimited access to all of our content. Sign up here."
            },
            {
                "title": "What Trump's oil gamble in Venezuela could mean for OPEC - The New Arab",
                "source": "The New Arab",
                "url": "https://www.newarab.com/analysis/what-trumps-oil-gamble-venezuela-could-mean-opec",
                "body": "Breadcrumb\nWhat Trump's oil gamble in Venezuela could mean for OPEC\nIf Washington secures access to Venezuela’s vast oil reserves, its geopolitical hand would be strengthened considerably. Folded into existing US and Canadian output, oil from the Latin American country would bring close to 40% of global supply within America’s strategic orbit.\nAnd if President Donald Trump’s plan to bring the Western Hemisphere’s oil production under US influence succeeds, it could end up overseeing more crude than OPEC, a global body of petroleum-exporting countries.\nOriginally founded by Iran, Iraq, Kuwait, Saudi Arabia, and Venezuela in 1960, and now comprising Algeria, the Democratic Republic of the Congo, Equatorial Guinea, Gabon, Libya, Nigeria, and the UAE, OPEC’s power rests on managing output to maintain profitability, while preserving market stability.\nThe rise of a rival production hub managed by the US could erode this leverage, potentially pushing oil prices below desired OPEC levels - such as $50 per barrel - as Washington gains more control over the global market.\nAnd if American-led producers keep output high, OPEC’s coordinated production cuts may no longer be relevant. A divided oil market could reduce the influence of OPEC, while its ‘energy diplomacy’, long used to build partnerships and have a say in global affairs, would carry less weight.\nThough a US hold over oil production in the Western Hemisphere would not collapse OPEC, it could shake the foundation of oil-dependent economic models. For OPEC members like Saudi Arabia, the UAE, and Iraq, the slightest drop in their oil revenue directly impacts their national budget.\nEven a moderate spell of lower oil prices could directly shrink government revenues, limit fiscal space, complicate spending commitments, and affect political stability. To mitigate these risks, GCC states have been proactively pursuing economic diversification strategies to reduce hydrocarbon revenue, but they still need more time.\nWhat are Washington's plans for Venezuela's oil?\nInitially, the US plans to sell 50 million barrels of sanctioned Venezuelan oil (which it says will be turned over by Caracas’s interim authorities) valued at about $2.5 billion.\nWhile analysts expect it may take months before any impact is seen from this supply, White House Press Secretary Karoline Leavitt has said that the oil will be arriving “very soon”.\nAccording to US Energy Secretary Chris Wright, after the crude currently in storage gets sold, Washington plans to sell Venezuelan oil “indefinitely”, allowing it to flow “around the world to bring better oil supplies”. With around 303 billion barrels worth of proven oil reserves, Venezuela has about 17% of the global total, more than Saudi Arabia, which has 267 billion barrels.\nIntensive discussions are taking place with major US oil companies like Chevron, Exxon Mobil, and ConocoPhillips, about expanding their licenses and ramping up refining and exports from Venezuela. Top energy CEOs were invited to the White House last week, but while most of them expressed interest, they wanted serious guarantees before getting involved in Venezuela.\nMajor companies like ExxonMobil and ConocoPhillips are still stuck in prior drilling disputes there. Consequently, Exxon Mobil CEO Darren Woods said that the country is “un-investible”. However, Chevron (the last American company still operating in Venezuela) was willing to raise its output as it is already producing almost 240,000 barrels a day with a Venezuelan partnership.\nThough hurdles remain for US oil giants, there is optimism in the market. As Tony Franjie, head of energy fundamentals at SynMax Intelligence, said recently, US intervention could “fundamentally change” the oil market as American oil companies could speed up Venezuelan production, paving the way for “sub-$50 WTI”.\nInterestingly, most US Gulf Coast refineries were originally built to process “heavy” crude oil, the same as Venezuelan crude, so this type of oil remains w"
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.455",
            "open": "59.062",
            "close": "59.847",
            "high": "59.922",
            "low": "58.467"
        },
        "market_summary": "### Spot WTI Crude Oil Market Briefing\n\n* **Key Drivers:** A potential increase in global oil supply due to the US capture of Venezuela's President and the possible resumption of Venezuelan oil production, combined with a global glut of oil, is putting downward pressure on **Spot WTI Crude Oil** prices. Additionally, the unwinding of **OPEC**'s 2023 voluntary production cuts and growth in non-**OPEC** countries are contributing to the surplus.\n* **Price Action:** **Spot WTI Crude Oil** prices are trading at around **$56** a barrel, with longer-dated futures contracts forecasting prices between **$56** and **$57** a barrel until June 2028. Recent events have led to a slight increase, with the near-month futures contract closing at **$59.12** per barrel, an increase of **$2.46** per barrel from three weeks ago.\n* **Technical Outlook:** Immediate support is near the **50-day moving average**, while resistance is at **$60**. The **bullish momentum** is limited due to the global supply glut and potential increase in Venezuelan production.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "US frackers were already facing a global oil supply glut. Trump’s Venezuelan dream could make it worse - The Guardian",
                "source": "The Guardian",
                "url": "https://www.theguardian.com/us-news/2026/jan/12/us-oil-producers-global-supply-glut-venezuela",
                "body": "US shale-oil producers were already contending with oil prices at four-year lows. News that they may soon face a significant competitor in their back yard probably wasn’t how frackers wanted to greet 2026.\nThe US capture of Venezuela’s President Nicolaá Maduro and his wife, Cilia Flores, hit the share prices of independent shale-oil producers, such as Diamondback Energy and Devon Energy, last week.\nOver the last 20 years, the US fracking industry has built itself into the main driver of domestic oil production: it accounted for 64% of total US crude oil production in 2023. With average production levels of 13.6m barrels a day (BPD), the US is the world’s largest crude-oil producer.\nIt will take years for Venezuela’s production to ramp up, limiting the near-term impact on US suppliers, but Donald Trump has made clear he wants firms to move quickly.\nThe development comes at a difficult time for the industry, which is pressured by a global glut of oil. Higher supplies come from an unwinding of 2023 voluntary production cuts by some members of the Organization of Petroleum Exporting Countries (Opec) and growth in non-Opec countries, including Argentina, Brazil, Canada, China and Guyana.\nOil prices have been trending down since passing $100 in early 2022, when Russia invaded Ukraine. With supply overwhelming demand, nearby Nymex West Texas Intermediate crude-oil futures prices – agreed rates for assets to be bought at a later date – are trading at about $56 a barrel. Longer-dated futures contracts for the US oil benchmark forecast prices range between $56 and $57 a barrel until June 2028.\nUS fracking is expensive, so the industry will not welcome more price pressures. Potentially, this is a threat to Republicans who have championed fracking in swing states like Pennsylvania, where the shale revolution has been an economic boon.\nFor now, the picture is as murky as a barrel of oil.\nRob Haworth, senior investment strategy director at US Bank Asset Management Group, says any impact Venezuela has on US producers is a matter of timing. The US oil market is currently “acting like a reasonably supplied market with expectations that supply continues to increase, which keeps dampening those oil prices”, he said.\nWhether Venezuelan production resumes as projected is debatable, but one saving grace for US producers is that Venezuelan oil is heavy, and requires more processing than the light oil the US pumps. That makes Venezuelan petroleum less of a competitive threat to the US, since refiners globally can use light oil, says Peter McNally, global head of sector analysts at Third Bridge. Still, Venezuela’s potential output adds to the growing global glut.\nThe economics of US oil production, when oil is about $57 a barrel, are troublesome in the longer term. The Federal Reserve Bank of Dallas estimates that break-even prices for existing wells, in both shale and non-shale production, are between $26 and $45 a barrel, but that break-even rises to between $61 and $70 for any newly drilled wells.\nDespite sluggish returns, the shale-oil industry is in better shape than in 2020. Producers’ balance sheets were already laden with debt when prices briefly turned negative during the Covid lockdown, says Rob Thummel, senior portfolio manager at Tortoise Capital.\nMany smaller producers went bankrupt. Those that survived started to focus on generating cashflow and return on invested capital, rather than hiking production. That capital discipline means companies are in better fiscal shape to weather lower oil prices, and are likely to keep a close eye on the bottom line, Thummel says. “What that means is they’re going to cut back on spending and [rein in] production.”\nThe difficult times in 2020 ushered in consolidation, and the industry became dominated by oil majors like ExxonMobil and ConocoPhillips, rather than the independent producers that started up during the initial hydraulic fracturing oil boom in the early aughts. Sustained lower prices could spe"
            },
            {
                "title": "Trump’s Venezuela Gambit Could Erode OPEC’s Clout in Oil Markets - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/trump-venezuela-gambit-could-erode-220000681.html",
                "body": "For the past year, surging oil production from the Americas – led by the United States, Guyana, and Brazil – has been a headache for OPEC in its efforts to rebalance the market and seek higher oil prices.\nOPEC’s efforts to continue influencing global oil supply and prices could be further undermined by the U.S. intervention in Venezuela and President Donald Trump’s idea to control the oil industry of the world’s biggest crude resource holder.\nOPEC member Venezuela is estimated to hold 303 billion barrels of crude oil, more than each of its fellow OPEC producers, Saudi Arabia, Iraq, Iran, or the United Arab Emirates (UAE).\nThe U.S. controlling the Venezuelan reserves, and U.S. companies investing in recovering the struggling oil industry in the South American country could seriously tip the scale of energy market dynamics to U.S. favor. This would undermine OPEC’s influence on the global oil markets, analysts say.\nAny meaningful recovery of Venezuela’s oil supply, which is currently at less than 1% of global daily demand, would need billions of U.S. dollars, probably upwards of $100 billion, in investments, and years to take hold. And that’s considering that there will be solid new legal frameworks and security guarantees that would give assurances to potential investors that they would not face another asset seizure and nationalization.\nRelated: Is Iraq About to Make Its Biggest Geopolitical Pivot in Years?\nPresident Trump’s plan to have U.S. firms invest in Venezuela’s oil sector recovery was not met with enthusiasm by the executives of the top U.S. oil firms at the Friday meeting at the White House.\nDespite President Trump touting Venezuela’s oil as a creator of “tremendous wealth” for industry and “great wealth” for the American people, the reception from executives was lukewarm.\n“We’ve had our assets seized there twice, and so you can imagine to re-enter a third time would require some pretty significant changes from what we’ve historically seen here,” Exxon’s CEO Darren Woods told President Trump.\n“If we look at the legal and commercial constructs and frameworks in place today in Venezuela today, it’s uninvestable.”\nRegardless of how investable Venezuela will be in the future, the U.S. control over its oil industry would change the power balance in the oil markets, giving the U.S. more sway in longer-term supply. This would leave OPEC and the wider OPEC+ group including Russia and Kazakhstan with potentially diminished clout in influencing the oil market balances and prices."
            },
            {
                "title": "Gasoline prices drop nearly 10 cents, oil supply risks loom - CSP Daily News",
                "source": "CSP Daily News",
                "url": "https://www.cspdailynews.com/fuels/gasoline-prices-drop-nearly-10-cents-oil-supply-risks-loom",
                "body": "The national average retail price of regular grade gasoline dropped a further 9.9 cents per gallon in the past three weeks. The new price, $2.893 per gallon, is down 27 cents in the past seven weeks alone.\nCompared with last year's high price point into early April, the current price is 45 cents per gallon lower. Versus one year ago, the price is a discount of 24 cents.\nBut unfolding scenes in several oil producing nations have added some supply risk premium to crude oil prices. West Texas intermediate's near-month futures contract closed at $59.12 per barrel on Jan. 9, an increase of $2.46 pe barrel, the equivalent of nearly 6 cents per gallon, higher than its price of three weeks ago.\nUnknowns concerning the speed and degree of any comebacks in Venezuelan oil sales and production are joined by the growing public protests in Iran against the dangers of regime retaliation, and the possibility of a new and more severe U.S. tariff upon sales of sanctioned Russian oil, plus the lack of progress in efforts to end the Russia-Ukraine war, have hiked oil prices beyond what they otherwise would have been.\nUnless one or more of the global unknowns adding to oil's supply risk price premium should appear more benign quickly, it is likely that gasoline price cutting will soon cease and possibly bring increases. If oil price increases are substantial and sustained, gasoline prices will respond by climbing.\nMeanwhile gasoline stocks are now far higher, and U.S. refiners continue to utilize capacity at a high rate of 94.7%.\nRetailers now garner on average a still handsome regular grade margin of 40.3 cents, after losing 8.3 cents in the past three weeks. Retail price, wholesale price and retail margin all declined. The only winner was the gasoline tax man, made up of federal, state, local and sales taxes weighted and combined, rose three tenths of a cent.\nTrilby Lundberg is publisher of the Lundberg Survey of U.S. fuel markets. Lundberg Survey Inc. is based in Camarillo, California.\nMembers help make our journalism possible. Become a CSP member today and unlock exclusive benefits, including unlimited access to all of our content. Sign up here."
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0077",
            "open": "1.1627",
            "close": "1.1665",
            "high": "1.1698",
            "low": "1.1621"
        },
        "market_summary": "### EUR/USD Market Briefing\n\n* **Key Drivers:** Concerns over the **Fed's independence** and potential implications on monetary policy are weighing on the **US Dollar**, while the **European Central Bank (ECB)** nearing the end of its rate-cutting cycle supports the **Euro**.\n* **Price Action:** The EUR/USD pair is holding steady above **1.1650**, trading around **1.1665**, as market participants react to political tensions in the US and potential **bearish** momentum for the **US Dollar**.\n* **Technical Outlook:** Immediate support is near **1.1600**, with resistance at **1.1700**. A break below **1.1600** could push the pair towards **1.1500**, while a move above **1.1700** could signal **bullish momentum**.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "Euro holds steady above 1.1650 amid Fed independence concerns - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/eur-usd-holds-steady-above-11650-amid-fed-independence-concerns-202601130114",
                "body": "EUR/USD holds steady above 1.1650 amid Fed independence concerns\n- EUR/USD flat lines around 1.1665 in Tuesday’s early Asian session.\n- Renewed concerns over the Fed’s independence could drag the US Dollar lower.\n- ECB policymakers suggested the cycle is \"most likely\" finished.\nThe EUR/USD pair holds steady near 1.1665 during the early Asian trading hours on Tuesday. Traders digested the US President Donald Trump administration's threat to indict the Federal Reserve (Fed) after Chair Jerome Powell said on Sunday that he’s under criminal investigation.\nPolitical risks around the US central bank could weigh on the US Dollar (USD) and create a tailwind for the pair. Reuters reported on Sunday that the US Justice Department is investigating Fed’s Powell for possible criminal issues related to his June Senate testimony on the Fed’s building renovations. Powell called the threats a \"pretext\" aimed at putting pressure on the Fed to cut interest rates.\n\"This open warfare between the Fed and the U.S. administration ... it's clearly not a good look for the U.S. dollar,\" said Ray Attrill, National Australia Bank's head of currency strategy.\nSigns that the European Central Bank (ECB) appears to be near the end of its rate-cutting cycle could provide some support to the shared currency. ECB Vice President Luis de Guindos said last week that interest rates are at an appropriate level, though he warned of “enormous uncertainty” due to geopolitical risks.\nFinancial markets currently see limited scope for immediate action, with a chance of rates remaining unchanged at the next meeting. Some analysts expect a rate reduction later in 2026, though a hike is considered unlikely given the subdued inflation backdrop.\nThe US Consumer Price Index (CPI) inflation data for December will be in the spotlight later on Tuesday. The headline and core CPI are projected to see a rise of 2.7% YoY in December. If the report shows a hotter-than-expected outcome, this could help limit the Greenback’s losses in the near term.\nEuro FAQs\nThe Euro is the currency for the 20 European Union countries that belong to the Eurozone. It is the second most heavily traded currency in the world behind the US Dollar. In 2022, it accounted for 31% of all foreign exchange transactions, with an average daily turnover of over $2.2 trillion a day. EUR/USD is the most heavily traded currency pair in the world, accounting for an estimated 30% off all transactions, followed by EUR/JPY (4%), EUR/GBP (3%) and EUR/AUD (2%).\nThe European Central Bank (ECB) in Frankfurt, Germany, is the reserve bank for the Eurozone. The ECB sets interest rates and manages monetary policy. The ECB’s primary mandate is to maintain price stability, which means either controlling inflation or stimulating growth. Its primary tool is the raising or lowering of interest rates. Relatively high interest rates – or the expectation of higher rates – will usually benefit the Euro and vice versa. The ECB Governing Council makes monetary policy decisions at meetings held eight times a year. Decisions are made by heads of the Eurozone national banks and six permanent members, including the President of the ECB, Christine Lagarde.\nEurozone inflation data, measured by the Harmonized Index of Consumer Prices (HICP), is an important econometric for the Euro. If inflation rises more than expected, especially if above the ECB’s 2% target, it obliges the ECB to raise interest rates to bring it back under control. Relatively high interest rates compared to its counterparts will usually benefit the Euro, as it makes the region more attractive as a place for global investors to park their money.\nData releases gauge the health of the economy and can impact on the Euro. Indicators such as GDP, Manufacturing and Services PMIs, employment, and consumer sentiment surveys can all influence the direction of the single currency. A strong economy is good for the Euro. Not only does it attract more foreign investment but it may encourage the"
            },
            {
                "title": "EUR/USD forecast: Currency pair of the week | Monday 12 January 2026 - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en/news-and-analysis/eur-usd-forecast-currency-pair-of-the-week-monday-12-january-2026/?amp=true",
                "body": "EUR/USD forecast: Currency pair of the week | Monday 12 January 2026\nThe dollar fell against the euro and indeed almost all other major currencies today (except the yen) on the back of a surprise announcement that federal prosecutors have opened a criminal investigation into Fed Chair Jerome Powell. That development immediately raised concerns around the Fed’s independence, prompting investors to sell US assets broadly and rotate into traditional safe havens. But we saw US indices come back up, even as gold and silver continued to surge higher. The EUR/USD forecast remains neutral despite the rebound given the recent mildly bearish price action, and pockets of strength in US data. But If fears around Fed independence fade quickly, the EUR/USD may well resume lower, even if the downside looks to be quite limited. Atten will shift back towards incoming data with CPI and retail sales firmly in focus this week, following a mixed jobs report released on Friday of last week.\nAnnexation of Greenland major risk for EUR/USD forecast\nThe main downside risk to the euro and frankly nearly all other major European currencies is the growing risk from the US threat to forcibly annex Greenland. Data-wise, the euro has very little to work with this week. As well as the lack of any meaningful data, it is unlikely that any of the ECB speakers will say anything out of the ordinary. As a result, markets are unlikely to materially adjust ECB rate pricing.\nTherefore, if concerns over Fed independency quickly fades, there is scope for the EUR/USD to push towards 1.1600 in the near term, possibly 1.1500, as the dollar makes a potential recovery.\nFocus turns to US CPI release\nMeanwhile, the US economic calendar is also not super busy this week, but we do have a couple of important macro pointers scheduled. Following Friday’s mixed US non-farm payrolls report, consumer inflation data is expected to land on Tuesday with a headline reading of 2.7% year-on-year, unchanged from the previous month. On a month over month bases, both headline and core CPI measures are expected to print +0.3% respectively.\nOne other potentially market moving event that investors will need to be watching is the Supreme Court ruling on Trump’s tariffs. A potentially unfavourable ruling could emerge at some point this week and may lend further support to the dollar.\nFor now, though, those factors feel secondary. Investors are likely to demand greater clarity on the Fed situation before rebuilding meaningful dollar long positions. A much weaker inflation print combined with lingering doubts over Fed independence could instead trigger a dollar slide, potentially lifting the EUR/USD forecast, particularly if there is also a technical break out from the bearish channel.\n-- Written by Fawad Razaqzada, Market Analyst\nFollow Fawad on Twitter @Trader_F_R\nThe information on this web site is not targeted at the general public of any particular country. It is not intended for distribution to residents in any country where such distribution or use would contravene any local law or regulatory requirement. The information and opinions in this report are for general information use only and are not intended as an offer or solicitation with respect to the purchase or sale of any currency or CFD contract. All opinions and information contained in this report are subject to change without notice. This report has been prepared without regard to the specific investment objectives, financial situation and needs of any particular recipient. Any references to historical price movements or levels is informational based on our analysis and we do not represent or warranty that any such movements or levels are likely to reoccur in the future. While the information contained herein was obtained from sources believed to be reliable, author does not guarantee its accuracy or completeness, nor does author assume any liability for any direct, indirect or consequential loss that may result from the reliance by an"
            },
            {
                "title": "EUR/USD remains stable above 1.1650 as worries about Fed autonomy persist - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605149152",
                "body": "The EUR/USD currency pair is trading steadily around 1.1665 in the early hours of Tuesday’s Asian session. Market participants are reacting to heightened political tensions in the United States, following threats from President Donald Trump’s administration to bring charges against the Federal Reserve (Fed). This comes after Fed Chair Jerome Powell revealed on Sunday that he is currently the subject of a criminal investigation.\nConcerns over the independence of the US central bank are putting pressure on the US Dollar (USD), potentially benefiting the euro. According to Reuters, the US Justice Department is examining possible criminal conduct by Powell related to his June testimony before the Senate about the Fed’s renovation projects. Powell described these allegations as a “pretext” designed to influence the Fed’s monetary policy decisions, particularly regarding interest rates.\nRay Attrill, head of currency strategy at National Australia Bank, commented, “This public confrontation between the Fed and the US administration is clearly damaging for the dollar’s image.”\nMeanwhile, indications that the European Central Bank (ECB) may be nearing the conclusion of its rate-cutting phase are providing some stability for the euro. Last week, ECB Vice President Luis de Guindos stated that current interest rates are appropriate, though he cautioned that significant geopolitical uncertainties remain.\nAt present, financial markets anticipate little immediate change, with expectations that interest rates will likely remain steady at the upcoming meeting. Some experts predict a possible rate cut in 2026, but a rate increase appears unlikely given the persistent low inflation environment.\nLater on Tuesday, investors will be closely watching the release of the US Consumer Price Index (CPI) data for December. Both headline and core CPI are forecast to rise by 2.7% year-over-year. Should inflation figures exceed expectations, the US Dollar could find some short-term support and limit its recent losses."
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0095",
            "open": "1.3393",
            "close": "1.3463",
            "high": "1.3485",
            "low": "1.3390"
        },
        "market_summary": "### GBP/USD Market Briefing\n* **Key Drivers:** Concerns over the **US Federal Reserve's independence** and **hawkish** monetary policy stance are influencing the **US Dollar**, while expectations for **two more interest rate cuts** by the **Bank of England (BoE)** in 2026 could cap gains for the **GBP/USD** pair.\n* **Price Action:** The **GBP/USD** pair is holding steady near **1.3475**, having rebounded from a three-week low of **1.3390**, with a modest increase of about **0.10%** for the session, driven by **bullish momentum**.\n* **Technical Outlook:** Immediate support is near the key confluence area around **1.3380**, which includes the **100** and **200-day MAs**, with resistance at **1.3500** and the recent highs at **1.3568**.\n\n--- \n**Overall Sentiment:** Neutral",
        "source_articles": [
            {
                "title": "GBP/USD holds steady near 1.3475 amid Fed concerns, US CPI in focus - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-usd-holds-steady-around-13475-as-traders-seem-hesitant-ahead-of-us-cpi-report-202601130129",
                "body": "GBP/USD holds steady around 1.3475 as traders seem hesitant ahead of US CPI report\n- GBP/USD sticks to a positive bias for the second straight day amid subdued USD demand.\n- Fed independence fears act as a headwind for the buck despite reduced rate cut bets.\n- Expectations for more BoE rate cuts could cap the GBP and the pair ahead of the US CPI.\nThe GBP/USD pair edges higher for the second straight day on Tuesday and looks to build on the previous day's recovery from the 1.3390 region, or a three-week low. Spot prices currently trade around the 1.3475 region, up nearly 0.10% for the day.\nThe US Dollar (USD) struggles to attract any meaningful buyers amid growing worries about the US Federal Reserve's (Fed) independence, and turns out to be a key factor acting as a tailwind for the GBP/USD pair. In fact, prosecutors opened a criminal investigation into Fed Chair Jerome Powell. In a rare statement, Powell said that the threat of criminal charges against him is a consequence of the central bank setting interest rates based on the best assessment of what will serve the public, rather than following the preferences of the President.\nDespite the negative development, the downside for the USD remains limited amid reduced bets for more aggressive policy easing by the Fed, which, in turn, could cap gains for the GBP/USD pair. A fall in the US Unemployment Rate, to a larger extent, overshadowed a miss in the headline US Nonfarm Payrolls (NFP) figures and backed the case for potentially stagnant monetary policy in the first quarter. This, in turn, holds back the USD bears from placing aggressive bets as the focus shifts to the latest US consumer inflation figures, due later today.\nIn the meantime, rising bets for two more interest rate cuts by the Bank of England (BoE) in 2026 could act as a headwind for the British Pound (GBP) and also keep a lid on any meaningful upside for the GBP/USD pair. Traders this week will also confront the release of the US Producer Price Index on Wednesday. Apart from this, the monthly UK GDP report on Thursday would provide some meaningful impetus to the currency pair.\nPound Sterling FAQs\nThe Pound Sterling (GBP) is the oldest currency in the world (886 AD) and the official currency of the United Kingdom. It is the fourth most traded unit for foreign exchange (FX) in the world, accounting for 12% of all transactions, averaging $630 billion a day, according to 2022 data. Its key trading pairs are GBP/USD, also known as ‘Cable’, which accounts for 11% of FX, GBP/JPY, or the ‘Dragon’ as it is known by traders (3%), and EUR/GBP (2%). The Pound Sterling is issued by the Bank of England (BoE).\nThe single most important factor influencing the value of the Pound Sterling is monetary policy decided by the Bank of England. The BoE bases its decisions on whether it has achieved its primary goal of “price stability” – a steady inflation rate of around 2%. Its primary tool for achieving this is the adjustment of interest rates. When inflation is too high, the BoE will try to rein it in by raising interest rates, making it more expensive for people and businesses to access credit. This is generally positive for GBP, as higher interest rates make the UK a more attractive place for global investors to park their money. When inflation falls too low it is a sign economic growth is slowing. In this scenario, the BoE will consider lowering interest rates to cheapen credit so businesses will borrow more to invest in growth-generating projects.\nData releases gauge the health of the economy and can impact the value of the Pound Sterling. Indicators such as GDP, Manufacturing and Services PMIs, and employment can all influence the direction of the GBP. A strong economy is good for Sterling. Not only does it attract more foreign investment but it may encourage the BoE to put up interest rates, which will directly strengthen GBP. Otherwise, if economic data is weak, the Pound Sterling is likely to fall.\nAnother significant data rele"
            },
            {
                "title": "Key Support Holds for GBP/USD as Traders Eye US Inflation and UK GDP - marketpulse.com",
                "source": "marketpulse.com",
                "url": "https://www.marketpulse.com/markets/key-support-holds-for-gbpusd-as-traders-eye-us-inflation-and-uk-gdp/",
                "body": "The Great British Pound has found support of a key confluence area around the 1.3380 handle The move has come as the US Dollar facing a selloff over Fed independence fears\nPowell vs Trump 2.0\nOver the weekend, Federal Reserve Chair Jerome Powell announced that the Justice Department has served the central bank with legal orders (subpoenas) and is threatening criminal charges.\nPowell claims this is part of a larger campaign by the White House to pressure the bank. He explicitly stated that these threats are a punishment because the Fed refused to follow President Trump's demands to lower interest rates, choosing instead to make decisions based on what is best for the public.\nWhile President Trump denies knowing anything about the investigation, he has a long history of attacking Powell for not cutting rates as quickly as he wants.\nThis move has brought Fed independence fears to the forefront once more. As a result the US Dollar struggled for the majority of the day.\nThe DXY does however face a crucial support test which may prove a tough nut to crack around the 98.70 handle.\nUS Dollar Index Daily Chart, January 12, 2026\nSource: TradingView\nCatalysts Ahead with US Inflation & UK GDP Data\nTraders are closely watching the UK's economic growth report on Thursday but before that tomorrow's US inflation report is expected to be higher than most experts predict (rising 0.4%). Investors are feeling calmer about the American job market after the unemployment rate dropped to 4.4% on Friday, even though the underlying details aren't entirely positive.\nFinally, the dollar was expected to get a boost from the US Supreme Court, which is likely to rule against President Trump's tariffs sometime between Tuesday and Thursday. If not the Dollar may remain under pressure with the next catalyst likely to be Thursday UK GDP release.\nFor all market-moving economic releases and events, see the MarketPulse Economic Calendar. (click to enlarge)\nTechnical Analysis - GBP/USD\nFrom a technical perspective, GBP/USD did bounce off a key confluence area around the 1.3380 zone.\nThis area plays host to the 100 and 200-day MAs while also being a key area of support and resistance in the past.\nThe move today was further helped by fundamentals around the US dollar which has experienced a selloff.\nThe bullish move has also seen GBP/USD bounce off the 50 level on the period-14 RSI. This hints at bullish momentum.\nOn the upside cable does face some significant hurdles as well with the 1.3500 handle before the recent highs at 1.3568 comes into focus.\nGBP/USD Daily Chart, January 12, 2026\nSource:TradingView.com\nFollow Zain on Twitter/X for Additional Market News and Insights @zvawda\nOpinions are the authors'; not necessarily that of OANDA Business Information & Services, Inc. or any of its affiliates, subsidiaries, officers or directors. The provided publication is for informational and educational purposes only.\nIf you would like to reproduce or redistribute any of the content found on MarketPulse, an award winning forex, commodities and global indices analysis and news site service produced by OANDA Business Information & Services, Inc., please refer to the MarketPulse Terms of Use.\nVisit https://www.marketpulse.com/ to find out more about the beat of the global markets.\n© 2026 OANDA Business Information & Services Inc."
            },
            {
                "title": "GBP/USD remains stable near 1.3475 as market participants appear cautious before the release of the US CPI data - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605149162",
                "body": "The GBP/USD currency pair continues its upward momentum on Tuesday, marking its second day of gains. After rebounding from a three-week low near 1.3390, the pair is now trading close to 1.3475, reflecting a modest increase of about 0.10% for the session.\nThe US Dollar is struggling to find strong support as concerns mount over the independence of the Federal Reserve. This uncertainty has provided a boost to the GBP/USD pair. Notably, prosecutors have launched a criminal probe into Fed Chair Jerome Powell. Powell responded by emphasizing that any legal threats stem from the central bank’s commitment to setting interest rates based on what is best for the public, rather than aligning with presidential preferences.\nDespite these developments, the US Dollar’s losses remain contained, as expectations for aggressive policy easing by the Federal Reserve have diminished. A recent drop in the US Unemployment Rate has largely offset weaker-than-expected Nonfarm Payrolls data, supporting the view that monetary policy may remain steady in the near term. As a result, traders are cautious about making strong bearish bets on the Dollar, with attention now turning to the upcoming US consumer inflation report.\nMeanwhile, speculation that the Bank of England (BoE) could implement two additional rate cuts in 2026 may weigh on the British Pound and limit further advances for the GBP/USD pair. This week, investors are also awaiting the release of the US Producer Price Index on Wednesday, as well as the UK’s monthly GDP figures on Thursday, both of which are expected to influence the currency pair’s direction."
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0010",
            "open": "0.6706",
            "close": "0.6708",
            "high": "0.6716",
            "low": "0.6706"
        },
        "market_summary": "### AUD/USD Market Briefing\n\n* **Key Drivers:** Concerns over **Fed independence** and a **hawkish** RBA stance are driving the AUD/USD pair, with the Australian dollar outperforming due to strong domestic spending data and potential rate hike prospects.\n* **Price Action:** AUD/USD is trading around **0.6714**, up by nearly **0.35%**, after snapping a three-day losing streak, with the pair attracting bids on moves towards support at **0.6660** and facing resistance at **0.6720**.\n* **Technical Outlook:** The **US Dollar Index** has decreased to approximately **98.88**, and the policy divergence between the **Fed** and the **RBA** keeps AUD/USD tilted to the upside, with expectations of potential Australian rate hikes strengthening the Aussie further, and support from strong commodity prices, such as **iron ore prices** trading above **$140 per tonne**.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Australian dollar outlook: AUD/USD rips as Fed fears ease and spending jumps - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/australian-dollar-outlook-aud-usd-rips-as-fed-fears-ease-and-spending-jumps/?amp=true",
                "body": "Australian dollar outlook: AUD/USD rips as Fed fears ease and spending jumps\n- Fed served DOJ subpoenas, sparking fears of political interference\n- Republican resistance reduces risk of Trump stacking the FOMC\n- Aussie boosted by robust household spending and rate hike prospects\nSummary\nMarkets started the week on edge after Jerome Powell revealed the Fed had been served DOJ subpoenas, raising concerns about political interference in monetary policy. Those fears eased as Republican senators vowed to block Trump’s Fed nominees, reinforcing confidence that independence will hold. Risk appetite recovered, with the Australian dollar outperforming thanks to strong domestic spending data that keeps the RBA on track for a possible February hike.\nFed Independence Fears Fade\nJerome Powell revealed over the weekend that the Fed had been served grand jury subpoenas from the Department of Justice (DOJ), raising fears of political interference in monetary policy. While the official explanation points to testimony on renovations at the Fed’s headquarters, the timing suggests pressure aimed at the central bank. For markets, that matters.\nWhy is this such a concern? If policy starts to look political rather than data-driven, you risk a second coming of the “sell America” trade, similar to what followed Liberation Day in 2025. That would mean a weaker dollar as reserve confidence fades, higher long-end yields as term premiums widen, and risk assets generally under pressure as uncertainty grows.\nHowever, a pushback from Republican lawmakers in response to the subpoenas changed the tone in markets on Monday. Vows from Thom Tillis and Lisa Murkowski to block any Trump Fed nominees until the DOJ investigation is resolved build confidence that independence will hold. Without their support, Trump’s pick for Fed chair is unlikely to be confirmed, making it far harder to stack the FOMC with policy doves aligned with his views, especially if Lisa Cook’s dismissal is ruled illegal by the U.S. Supreme Court. That would reduce the odds of politically driven rate cuts or personnel changes that skew the committee’s reaction function.\nThat likely explains today’s price action. Risk appetite has recovered as traders reassess the political and policy implications, with high-beta currencies like the Australian dollar outperforming. Domestic factors have also helped, with strong household spending data reinforcing expectations that the RBA may need to tighten policy further, adding to the Aussie’s appeal on interest rate differentials.\nSolid Spending Keeps RBA Hike Risk alive\nAustralian household spending surged again in November, rising 1% after an upwardly revised 1.4% gain in October. It marked the first back-to-back 1%+ monthly increases since late 2022 and saw the annual growth rate accelerate to 6.3%, the strongest since September 2023. Discretionary categories led the charge, supported by major events and Black Friday sales. With Q4 averaging 1.2% so far compared to just 0.3% in Q3, real household consumption looks set to deliver another solid contribution to GDP without a major unwind in December.\nThe strength in spending keeps the RBA on track to consider another rate hike as early as February, provided inflation trends in Q4 mirror those seen in Q3. Robust demand, particularly in discretionary segments, suggests underlying momentum in the largest sector in the economy remains firm. If price pressures persist alongside this level of consumption, the case for a further increase in the cash rate will be hard to ignore, likely underpinning the Australian dollar on a pure interest rate differential basis.\nAUD/USD Rangebound Following Bullish Move\nSource: TradingView\nLooking at AUD/USD on the daily chart, the pair looks to be settling into a new range following recent gains, attracting bids on moves towards support at .6660 with bullish probes running into offers layered above .6720.\nThat’s the initial range traders should focus on, rather than the bullish s"
            },
            {
                "title": "AUD/USD rebounds as US Dollar weakens on Fed independence concerns - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/aud-usd-rebounds-as-us-dollar-weakens-on-fed-independence-concerns-202601121832",
                "body": "AUD/USD rebounds as US Dollar weakens on Fed independence concerns\n- AUD/USD snaps a three-day losing streak as broad US Dollar weakness lifts the pair.\n- Concerns over Fed independence weigh on the Greenback after reports of a DOJ probe involving Chair Powell.\n- RBA-Fed policy divergence and hawkish Australian rate expectations provide additional support to the Aussie.\nThe Australian Dollar (AUD) gains traction against the US Dollar (USD) on Monday, with AUD/USD snapping a three-day losing streak as broad-based weakness in the Greenback lifts the pair. At the time of writing, AUD/USD trades around 0.6714, up nearly 0.35% on the day.\nThe US Dollar comes under renewed selling pressure after reports that the US Department of Justice (DoJ) issued grand jury subpoenas as part of a criminal investigation involving Federal Reserve (Fed) Chair Jerome Powell, raising fresh concerns over political pressure on the central bank.\nMeanwhile, the US Dollar Index (DXY), which measures the Greenback's value against six major peers, is trading around 98.88 after retreating from one-month highs.\nPowell stood his ground, saying the action is politically motivated and that the Fed must continue to set policy based on economic conditions rather than political pressure.\nOn the monetary policy front, growing policy divergence between the Fed and the Reserve Bank of Australia (RBA) keeps AUD/USD tilted to the upside.\nThe Fed remains on a gradual easing path after last week’s mixed US labour-market data trimmed expectations for a near-term rate cut, although traders continue to expect a total of around 50 basis points (bps) of easing this year.\nLooking ahead, traders will closely watch the US Consumer Price Index (CPI) data due on Tuesday for further clues on the Fed’s policy outlook, while also parsing remarks from key Fed officials throughout the week.\nIn Australia, markets are increasingly anticipating that the RBA’s next move could be a rate hike, as the latest inflation data show price pressure remains above the central bank’s 2-3% target band.\nIn a recent interview with ABC News, RBA Deputy Governor Andrew Hauser said it was “still true” that Australians had likely seen the last rate cuts this cycle. Meanwhile, an Australian Financial Review survey showed that 17 of 38 economists now expect at least two rate hikes over the next 18 months.\nOn the data front, the Australian economic calendar remains relatively light this week, with Westpac Consumer Confidence scheduled for Tuesday and Consumer Inflation Expectations due on Thursday. Markets will also track China’s trade data on Wednesday, as developments in exports and imports often influence the Aussie due to Australia’s close economic ties with China.\nAustralian Dollar FAQs\nOne of the most significant factors for the Australian Dollar (AUD) is the level of interest rates set by the Reserve Bank of Australia (RBA). Because Australia is a resource-rich country another key driver is the price of its biggest export, Iron Ore. The health of the Chinese economy, its largest trading partner, is a factor, as well as inflation in Australia, its growth rate and Trade Balance. Market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – is also a factor, with risk-on positive for AUD.\nThe Reserve Bank of Australia (RBA) influences the Australian Dollar (AUD) by setting the level of interest rates that Australian banks can lend to each other. This influences the level of interest rates in the economy as a whole. The main goal of the RBA is to maintain a stable inflation rate of 2-3% by adjusting interest rates up or down. Relatively high interest rates compared to other major central banks support the AUD, and the opposite for relatively low. The RBA can also use quantitative easing and tightening to influence credit conditions, with the former AUD-negative and the latter AUD-positive.\nChina is Australia’s largest trading partner so the health of the Chi"
            },
            {
                "title": "The Australian Dollar strengthens against the US Dollar, recovering from losses amid Greenback’s decline - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/the-australian-dollar-strengthens-against-the-us-dollar-recovering-from-losses-amid-greenbacks-decline/",
                "body": "The AUD/USD recovers from a recent losing streak as the US Dollar weakens amid concerns over Federal Reserve independence. Reports of a Department of Justice probe involving Fed Chair Powell have led to broader US Dollar selling pressures, affecting its value across global markets.\nCurrently, AUD/USD is trading around 0.6714, up by nearly 0.35%. The US Dollar Index, which tracks the Greenback against six major currencies, has decreased to approximately 98.88. The ongoing policy gap between the Federal Reserve and the Reserve Bank of Australia aids the AUD, with expectations of potential Australian rate hikes strengthening the Aussie further.\nFederal Reserve And RBA Policies\nThe Federal Reserve remains cautious, with mixed US labour data affecting expectations for rate adjustments. Around 50 basis points of easing are expected this year, but speculations on upcoming rate changes continue. Meanwhile, Australia’s monetary policy sentiment suggests a potential rate hike due to inflation concerns.\nThe outcome of the US Consumer Price Index data, to be released soon, will be pivotal for the Fed’s policy directions. Economic indicators for Australia, like Westpac Consumer Confidence, are expected shortly, while China’s trade data will also be monitored. The broader economic interplay between Australia and China remains significant for the AUD’s trajectory.\nLooking back at the situation in 2025, concerns over Fed independence created temporary US dollar weakness, but that has since faded from focus. As of today, January 13, 2026, the primary driver is the clear policy divergence between the central banks. We are now navigating an environment where the AUD/USD is holding firm around 0.6850, testing its recent highs.\nThe Federal Reserve’s expected easing path in 2025 did not fully materialize, as sticky inflation persisted through the second half of the year. The most recent US CPI data for December 2025 came in at 3.4%, prompting the Fed to signal a firm pause on any further rate cuts in the first quarter of this year. This has provided underlying support for the US dollar, capping gains in the Aussie.\nAussie Dollar Support\nConversely, the Reserve Bank of Australia met the hawkish expectations from last year, delivering a final rate hike in November 2025. However, with the latest quarterly inflation figures from late 2025 showing a modest cool-down to 3.8%, the market now believes the RBA’s tightening cycle is complete. This leaves the policy rate differential between the two nations less favorable for the AUD than we anticipated six months ago.\nSupporting the Australian dollar are external factors, particularly strong commodity prices and steady demand from China. Iron ore prices have remained robust, trading above $140 per tonne for the last two months, well above the 2025 average. China’s latest trade balance figures, released just last week, showed a surprising 2.5% increase in imports, easing fears of a slowdown.\nGiven these conflicting forces, we expect elevated volatility in the AUD/USD pair in the coming weeks. The Fed’s surprisingly firm stance creates downside risk, while strong commodity prices provide a solid floor for the currency. Derivative traders should consider strategies that benefit from sharp price swings, such as purchasing straddles, rather than taking an outright directional view on the pair."
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "0.6840",
            "open": "158.0800",
            "close": "158.1430",
            "high": "158.1970",
            "low": "157.5130"
        },
        "market_summary": "### USD/JPY Market Briefing\n* **Key Drivers:** The **USD/JPY** pair is surging due to **hawkish** expectations from the Bank of Japan and a **dovish** Federal Reserve, with the Japanese Yen weakened by political risks and uncertainty over the next interest rate hike.\n* **Price Action:** Broke above the key psychological level of **159.00**, showing significant **bullish** momentum, with the pair reaching a fresh one-year high.\n* **Technical Outlook:** Immediate support is near the 50-day moving average at **157.00**, with resistance at **160.00**, and the pair seems poised to appreciate further amid a **bullish** technical setup.\n\n--- \n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "USD/JPY is surging still. Do we pencil in January 19 for Bank of Japan intervention? - investingLive",
                "source": "investingLive",
                "url": "https://investinglive.com/centralbank/usdjpy-is-surging-still-do-we-pencil-in-january-19-for-bank-of-japan-intervention-20260113/",
                "body": "Summary:\nUSD/JPY extends gains despite repeated jawboning\nKatayama and government warnings fail to shift FX\nRecord Nikkei boosts tolerance for weak yen\nIntervention risk tied to disorderly moves, not levels\nThin-liquidity periods seen as risk windows ... I'm eyeing January 19 for direct intervention risk\nThe continued surge in USD/JPY despite multiple rounds of official jawboning has refocused my attention on the risk of direct yen intervention, even as authorities show little urgency to escalate beyond rhetoric for now.\nJapanese officials have already stepped up verbal warnings, with Finance Minister Satsuki Katayama flagging concerns about one-sided yen weakness during talks in Washington, followed by reinforced language from the government spokesperson warning against sharp and speculative FX moves. Yet the impact on pricing has so far been limited, with USD/JPY continuing to grind higher.\nMarkets appear to be interpreting the lack of follow-through as a signal that tolerance for yen weakness remains relatively high, particularly while Japanese equities benefit. The Nikkei 225 has pushed to record highs, underpinned by the weak currency’s boost to exporters’ overseas earnings, complicating the political calculus around intervention.\nThat said, traders are increasingly alert to the conditions under which Tokyo has historically chosen to act. Japan has tended to intervene when FX moves become disorderly rather than merely directional, often during periods of thinner liquidity when impact per dollar spent is maximised. Against that backdrop, upcoming U.S. market holidays later this month have emerged as potential risk windows rather than base-case triggers.\nSpecifically January 19, Martin Luther King, Jr. Day:\n- Equity markets are closed\n- US bond markets are closed\n- FX never fully closes but liquidity and interest will be much thinner than usual\nImportantly, officials have stopped short of defining explicit red lines. Rate differentials continue to favour the dollar, and without a shift in Bank of Japan policy, any intervention would still be leaning against fundamentals — a dynamic Tokyo is well aware tends to limit durability.\nFor now, markets are testing Japan’s tolerance rather than pricing imminent action. But as USD/JPY pushes into fresh highs and verbal intervention loses traction, sensitivity to sharp or illiquid moves is rising. The longer yen weakness persists without consolidation, the greater the risk that authorities feel compelled to act — not on a schedule, but in response to market behaviour."
            },
            {
                "title": "Japanese Yen drops to fresh one-year low vs. USD amid BoJ uncertainty, election risks - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/japanese-yen-drops-to-fresh-one-year-low-vs-usd-amid-boj-uncertainty-election-risks-202601130317",
                "body": "Japanese Yen selling remains unabated; USD/JPY rallies to July 2024 high\n- Japanese Yen extends its descending trend and is pressured by a combination of factors.\n- BoJ uncertainty, Japan-China rift, and talks of a snap election in Japan undermine the JPY.\n- Intervention fears might cap USD/JPY amid a subdued USD, ahead of the US CPI report.\nThe Japanese Yen (JPY) selling bias remains unabated through the Asian session, which, along with a modest US Dollar (USD) uptick, lifts the USD/JPY pair to the 159.00 neighborhood, or the highest level since July 2024. Reports that Prime Minister Sanae Takaichi may soon call a snap election to take advantage of strong approval ratings fueled speculation for more expansionary fiscal policy. Adding to this, the uncertainty over the likely timing of the next interest rate hike by the Bank of Japan (BoJ), the deepening Japan–China diplomatic crisis, and a positive risk tone continue to undermine the safe-haven JPY.\nMeanwhile, the recent JPY decline might prompt some verbal intervention from Japanese authorities, which, in turn, warrants some caution for bearish traders. The USD, on the other hand, seems to struggle to attract meaningful buyers amid concerns about the US Federal Reserve's (Fed) independence, and also keep a lid on the USD/JPY pair. Investors might also opt to wait for the release of the US consumer inflation figures, due later today, for more cues about the Fed's rate-cut path. This, in turn, will play a key role in influencing the near-term USD price dynamics and determining the trajectory for the currency pair.\nJapanese Yen continues to be pressured by political risks, BoJ rate hike doubts\n- Reports suggest that Japan's Prime Minister Sanae Takaichi may call an early election in the first half of February to bolster her coalition government’s parliamentary majority, fueling hopes for additional stimulus.\n- Last week, China prohibited some rare earth elements from being exported to Japan with immediate effect. The ban follows a diplomatic row over Taiwan and heightens supply-chain risk for Japanese manufacturers.\n- Despite the Bank of Japan's (BoJ) hawkish outlook, investors remain uncertain about the likely timing of the next rate hike. This, along with the risk-on impulse, is seen undermining demand for the safe-haven Japanese Yen.\n- Japan’s Finance Minister Satsuki Katayama said this Tuesday that she shared concerns over the JPY's recent one-sided decline with US Treasury Secretary Scott Bessent and added that the tolerance for weakness was limited.\n- Concerns about the Federal Reserve's independence resurfaced on Monday after prosecutors opened a criminal investigation against Jerome Powell over his testimony about the central bank building renovation project.\n- Powell, in a rate statement, called the probe unprecedented and said that he believed it was opened due to US President Donald Trump's anger over the Fed's refusal to cut interest rates despite repeated public pressure.\n- This keeps the US Dollar bulls on the defensive despite firming expectations for a less aggressive monetary policy easing by the US central bank this year, bolstered by the latest monthly employment details released last Friday.\n- Traders are pricing in the possibility of two more rate cuts by the Fed in 2026. This marks a significant divergence compared to expectations that the BoJ will stick to its policy normalization path and should cap the USD/JPY pair.\n- BoJ Governor Kazuo Ueda reiterated last week that the central bank would continue to raise interest rates if economic and price developments move in line with forecasts, leaving the door open for further policy tightening.\n- Investors might also refrain from placing aggressive directional bets and opt to wait for more cues about the Fed's rate-cut path. Hence, the focus will remain glued to the release of the latest US consumer inflation figures.\nUSD/JPY seems poised to appreciate further amid bullish technical setup\nThe 50-day Simple Movin"
            },
            {
                "title": "Despite a weaker US Dollar, uncertainty around politics and the BoJ leaves Yen bulls cautious - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/despite-a-weaker-us-dollar-uncertainty-around-politics-and-the-boj-leaves-yen-bulls-cautious/",
                "body": "The Japanese Yen (JPY) experienced a slight recovery after reaching a one-year low against a weakening US Dollar (USD) during Monday’s Asian session. Geopolitical tensions have bolstered safe-haven flows towards the JPY, while concerns about the Federal Reserve’s independence apply pressure on the USD. Subsequently, the USD/JPY pair saw some limitations in its movement.\nJapan faces uncertainties due to its rift with China and potential early elections, affecting JPY bets. This uncertainty is compounded by unclear timing on the Bank of Japan’s next interest rate hike. Additionally, US inflation figures due this week could influence the USD/JPY pairing further. Tensions in Iran and the ongoing Russia-Ukraine conflict enhance the appeal of the safe-haven Yen, though various elements curb enthusiasm among JPY traders.\nUS And Japan Economic Indicators\nEconomic data indicates US Nonfarm Payrolls rose by 50K in December, yet unemployment decreased to 4.4%. This influenced expectations of a Fed rate cut, contrasting with potential BoJ tightening. The BoJ sustains a prudent stance, with its gradual shift from ultra-loose policies supporting the Yen. Technical indicators like the 200-period SMA and MACD suggest an upward trend in the USD/JPY pair, though an overbought RSI could limit gains.\nOverall, the JPY’s value is swayed by Japan’s economic performance, BoJ policies, and global risk sentiment. As tensions and policy dynamics evolve, the Yen’s perceived reliability continues to attract safe-haven investments, impacting its exchange rate against the US Dollar.\nLooking back at the analysis from early 2025, the market was navigating a complex mix of geopolitical risk and central bank uncertainty. The push and pull between safe-haven flows into the Yen and questions over the Bank of Japan’s next move created significant tension. That environment saw USD/JPY testing the high 157.00s, a level that proved to be a peak as monetary policy divergence began to narrow.\nThat expected narrowing of policy did unfold throughout 2025, which helps explain our current situation. We saw the Federal Reserve implement three separate 25-basis-point rate cuts during the year, bringing the Fed Funds Rate down to its current 4.00-4.25% range. In contrast, the Bank of Japan delivered two cautious rate hikes, moving its policy rate to 0.25% by the end of last year and effectively ending its negative interest rate policy.\nCurrent Market Dynamics\nThis policy shift has brought the USD/JPY pair down to the 145.00 level we see today. However, recent U.S. data now complicates the outlook for further Fed easing. The December 2025 jobs report showed a resilient gain of 185,000 payrolls, and the latest CPI reading still shows inflation stubbornly holding at 3.1%, keeping pressure on the Fed to hold rates steady for now.\nOn the other side, Japan’s own economic picture suggests the Bank of Japan may also be on hold for the near future. While core inflation is stable at 2.3%, recent GDP figures for the fourth quarter of 2025 showed growth slowing to an annualized rate of just 0.4%. This tepid growth makes further aggressive rate hikes unlikely, capping the Yen’s potential strength for the moment.\nFor derivative traders, this suggests the strong downward trend in USD/JPY seen last year may be losing momentum. The conflicting economic signals from both the U.S. and Japan point towards a period of consolidation or heightened volatility rather than a clear directional move. Therefore, using options to construct long volatility strategies, such as buying straddles or strangles, could be an effective approach in the coming weeks.\nThese strategies would profit from a significant price move in either direction, which could be triggered by upcoming inflation data or central bank communications. Implied volatility in USD/JPY options has fallen from its 2025 highs, making such positions relatively cheaper to establish now. The key is to position for a potential breakout from the curr"
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0050",
            "open": "1.3907",
            "close": "1.3877",
            "high": "1.3917",
            "low": "1.3867"
        },
        "market_summary": "### USD/CAD Market Briefing\n\n* **Key Drivers:** The **USD/CAD** pair is influenced by **higher Oil prices** lifting the Canadian Dollar, and concerns over the Federal Reserve's independence due to a criminal investigation into Fed Chair Jerome Powell, which has led to a **dovish** outlook.\n* **Price Action:** The pair has retreated from a nine-day high of approximately **1.3920**, currently trading below **1.3900**, showing **bearish** momentum.\n* **Technical Outlook:** Immediate support is near **1.3860**, with resistance at **1.3920**. The price of **Oil**, specifically **WTI crude**, remains a key factor, currently trading around **$59.40**, and the **US Dollar**'s strength is impacted by **geopolitical tensions** and **Federal Reserve policy**.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "USD/CAD holds losses below 1.3900 as higher Oil lifts Canadian Dollar - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-cad-holds-losses-below-13900-as-higher-oil-lifts-canadian-dollar-202601130255",
                "body": "USD/CAD holds losses below 1.3900 as higher Oil lifts Canadian Dollar\n- USD/CAD slips as commodity-linked CAD gains support from rising Oil prices amid escalating Iran tensions.\n- President Trump warned that countries trading with Iran would face a 25% US tariff.\n- Traders await December US CPI data on Tuesday for clues on the Federal Reserve’s policy path.\nUSD/CAD remains subdued for the second successive session, trading around 1.3870 during the Asian hours on Tuesday. The pair depreciates as the commodity-linked Canadian Dollar (CAD) receives support from higher Oil prices, given Canada’s status as the largest crude exporter to the United States (US).\nWest Texas Intermediate (WTI) Oil price gains ground for the fourth successive session, trading around $59.40 at the time of writing. Crude Oil prices gain traction amid supply concerns, which could be attributed to rising tensions in Iran. Traders brace for the release of the American Petroleum Institute (API) crude oil stockpiles report later in the day.\nUS President Donald Trump, on Monday, warned countries trading with Iran would face a 25% tariff on business with the United States, following threats of repercussions over civilian targeting, as Tehran cautioned the US and Israel against intervention, per Reuters.\nThe downside of the USD/CAD pair could be restrained as the US Dollar (USD) rebounds after registering modest losses in the previous session. Traders await the Consumer Price Index (CPI) data for December due on Tuesday, which could offer clues on the Federal Reserve’s (Fed) policy path.\nMarkets are pricing in two Federal Reserve rate cuts this year, starting in June, though an upside inflation surprise could curb easing prospects. December’s Nonfarm Payrolls (NFP) missed expectations, reinforcing a more dovish Fed outlook. The CME Group's FedWatch tool shows that Fed funds futures price in about 95% probability that the US central bank will keep rates unchanged at its January 27–28 meeting.\nThe US Dollar weakened after federal prosecutors threatened to indict Fed Chair Jerome Powell over his congressional testimony on a building renovation, raising concerns over the Fed’s independence. Investors are also awaiting a US Supreme Court ruling on the legality of President Donald Trump’s tariff policies, expected on Wednesday.\nCanadian Dollar FAQs\nThe key factors driving the Canadian Dollar (CAD) are the level of interest rates set by the Bank of Canada (BoC), the price of Oil, Canada’s largest export, the health of its economy, inflation and the Trade Balance, which is the difference between the value of Canada’s exports versus its imports. Other factors include market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – with risk-on being CAD-positive. As its largest trading partner, the health of the US economy is also a key factor influencing the Canadian Dollar.\nThe Bank of Canada (BoC) has a significant influence on the Canadian Dollar by setting the level of interest rates that banks can lend to one another. This influences the level of interest rates for everyone. The main goal of the BoC is to maintain inflation at 1-3% by adjusting interest rates up or down. Relatively higher interest rates tend to be positive for the CAD. The Bank of Canada can also use quantitative easing and tightening to influence credit conditions, with the former CAD-negative and the latter CAD-positive.\nThe price of Oil is a key factor impacting the value of the Canadian Dollar. Petroleum is Canada’s biggest export, so Oil price tends to have an immediate impact on the CAD value. Generally, if Oil price rises CAD also goes up, as aggregate demand for the currency increases. The opposite is the case if the price of Oil falls. Higher Oil prices also tend to result in a greater likelihood of a positive Trade Balance, which is also supportive of the CAD.\nWhile inflation had always traditionally been thought of as a negative factor for "
            },
            {
                "title": "USD/CAD remains above 1.3860 even as the US Dollar broadly weakens - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605147660",
                "body": "The US Dollar has experienced broad declines, pressured by renewed doubts regarding the Federal Reserve's autonomy. Despite this, the USD/CAD pair has seen only modest downward movement, with support holding above 1.3860, preserving the upward momentum established since December.\nFresh anxiety was sparked by a New York Times article revealing that the US Government has launched a criminal investigation into Fed Chair Jerome Powell. This development has reignited fears about the central bank’s ability to operate without political interference, causing the Dollar to slip against major currencies during Monday’s Asian trading hours.\nJerome Powell addressed these concerns in a video statement released soon after the news broke, describing the government’s actions as “unprecedented.” He suggested that these moves are part of a larger effort by US officials to pressure the central bank into reducing borrowing costs.\nThe Canadian Dollar’s recovery has also been hampered by a slight decline in oil prices. US benchmark WTI crude fell by approximately $1, settling at $58.60 after reaching $59.60 earlier in the session. While oil, Canada’s primary export, has gained about 2% since the start of the year, prices remain 23% below their June 2025 highs.\nOn the economic front, recent US data was generally upbeat. The unemployment rate dropped more than anticipated, and the Michigan Consumer Sentiment Index showed improvement, reducing immediate pressure on the Federal Reserve to lower interest rates.\nIn contrast, Canada’s employment figures for December were mixed. The economy added 8,200 jobs, defying forecasts of a 5,000 job loss. However, the unemployment rate climbed to 6.8% from 6.5%, exceeding expectations of a smaller increase to 6.6%."
            },
            {
                "title": "The USD/CAD pair retreats from a nine-day high of approximately 1.3920 due to USD weakness - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/the-usd-cad-pair-retreats-from-a-nine-day-high-of-approximately-1-3920-due-to-usd-weakness/",
                "body": "The USD/CAD pair weakens below 1.3900 due to a drop in USD, despite recording a high of 1.3920 recently. Concerns about the Federal Reserve’s independence amid reduced rate cut bets contribute to this decline.\nFed Chair Jerome Powell’s remarks on the consequences of criminal charges connected to interest rate decisions raise issues about the Fed’s autonomy. Meanwhile, US geopolitical tensions and potential military action considerations by President Trump keep global risks heightened, partially cushioning the USD.\nImpact On The Canadian Dollar\nCrude Oil price pullbacks may undermine the CAD, which, coupled with weakening Canadian labour market reports, limit expectations for a tighter Bank of Canada policy. Conversely, stronger US Nonfarm Payrolls and a lower Unemployment Rate in December bolster the case for the Fed to maintain higher rates, potentially limiting USD losses.\nTraders remain cautious, anticipating the upcoming US CPI and PPI figures before making significant moves in the USD/CAD pair. The Federal Reserve’s core functions include interest rate adjustments to manage inflation and employment, influencing the value of the USD. Quantitative Easing (QE) and Quantitative Tightening (QT) are key tools impacting the USD, with QE typically leading to a weaker dollar and QT bolstering its strength.\nLooking back to early 2025, we saw the USD/CAD pair react sharply to concerns over Federal Reserve independence, which created significant two-way volatility around the 1.3900 level. Today, on January 12, 2026, those same political themes are echoing, but the economic landscape has shifted considerably, with the pair currently trading near 1.3750. This creates a new set of challenges and opportunities for navigating the coming weeks.\nGeopolitical And Economic Factors\nThe political pressure on the Fed has not subsided, adding a layer of unpredictable risk to holding long US Dollar positions. However, the core economic divergence between the US and Canada is now more pronounced than it was a year ago. Recent US jobs data from December 2025 showed a notable slowdown, with non-farm payrolls adding only 95,000 jobs, but inflation remains stubbornly above the Fed’s target at 3.4%.\nOn the Canadian side, the Bank of Canada is facing mounting pressure as last week’s domestic CPI figure came in at 2.1%, right near their target. This data, combined with a recent uptick in the Canadian unemployment rate to 6.3%, strengthens the case for the BoC to begin an easing cycle well ahead of the Fed. Historically, such monetary policy divergence has consistently led to a stronger USD/CAD.\nCrude oil prices, a key driver for the loonie, remain volatile but have found a floor, with WTI trading consistently in the $85-$90 range due to persistent geopolitical risk. While this provides some underlying support for the Canadian dollar, it is not enough to counteract the growing monetary policy gap we see forming with the United States. This situation mirrors periods we saw in the mid-2010s when oil prices stabilized but a hawkish Fed still propelled USD/CAD higher.\nGiven the potential for sudden USD weakness from political headlines, an outright long spot position carries significant risk. Therefore, we see traders increasingly favoring derivative strategies to express a bullish view on USD/CAD. Buying call options with a strike price around 1.4000 for the March 2026 expiry offers a way to profit from the expected policy divergence while defining and limiting downside risk."
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "1.4200",
            "open": "211.7270",
            "close": "212.9390",
            "high": "213.0040",
            "low": "211.5840"
        },
        "market_summary": "### GBP/JPY Market Briefing\n\n* **Key Drivers:** The **Japanese Yen (JPY)** weakness due to **political uncertainty** and **hawkish** expectations from the Bank of Japan (BoJ) is driving the **GBP/JPY** pair higher, alongside a **lack of USD buying interest** which benefits the **British Pound (GBP)**.\n* **Price Action:** The pair has broken above the **212.00-213.00** range, reaching new highs near **214.00**, the highest since August 2008, showing significant **bullish momentum**.\n* **Technical Outlook:** Immediate resistance is at **214.00**, with support levels at **213.00**, **212.00**, and the **20-day Simple Moving Average (SMA) at 210.68**. The **Relative Strength Index (RSI)** indicates **overbought conditions**, warranting caution for bulls.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "GBP/JPY climbs to 214.00, highest since 2008 on JPY weakness - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-advances-to-21400-mark-highest-since-august-2008-amid-notable-jpy-weakness-202601130550",
                "body": "GBP/JPY advances to 214.00 mark, highest since August 2008 amid notable JPY weakness\n- GBP/JPY gains strong follow-through positive traction for the third consecutive day on Tuesday.\n- BoJ uncertainty, Japan-China rift, and talks of a snap election in Japan weigh heavily on the JPY.\n- The GBP benefits from a subdued USD demand and also contributes to the pair’s momentum.\nThe GBP/JPY cross builds on the previous day's breakout momentum through a nearly three-week-old range and gains follow-through positive traction for the third consecutive day on Tuesday. Spot prices have climbed to a fresh high since August 2008, with bulls now looking to extend the ascending trend further beyond the 214.00 mark amid a broadly weaker Japanese Yen (JPY).\nReports that Japan's Prime Minister Sanae Takaichi may soon call a snap election to take advantage of her approval ratings fuel speculations about further expansionary fiscal policy. This comes on top of the uncertainty over the likely timing of the next rate hike by the Bank of Japan (BoJ) and the deepening Japan–China diplomatic crisis, which, in turn, is seen weighing heavily on the JPY. Moreover, the underlying bullish sentiment across the global equity markets turns out to be another factor undermining the JPY's safe-haven status and pushing the GBP/JPY cross higher.\nThe JPY bears, meanwhile, seem unaffected by expectations that Japanese authorities could step in to stem further weakness in the domestic currency. In fact, Japan’s Finance Minister Satsuki Katayama said this Tuesday that she shared concerns over the JPY's recent one-sided slide with US Treasury Secretary Scott Bessent and added that the tolerance for weakness was limited. Moreover, the BoJ's hawkish outlook also does little to ease the prevalent selling bias surrounding the JPY, which backs the case for a further near-term appreciating move for the GBP/JPY cross.\nThe British Pound (GBP), on the other hand, benefits from the lack of any meaningful US Dollar (USD) buying interest. This, in turn, validates the near-term positive outlook on the back of the overnight strength beyond the previous multi-year peak, around the 212.15 region, touched last week. From a technical perspective, the daily Relative Strength Index (RSI) is flashing overbought conditions and warrants caution for the GBP/JPY bulls. Traders now look to Bank of England (BoE) Governor Andrew Bailey's speech for a fresh impetus amid bets for two more interest rate cuts in 2026.\nJapanese Yen FAQs\nThe Japanese Yen (JPY) is one of the world’s most traded currencies. Its value is broadly determined by the performance of the Japanese economy, but more specifically by the Bank of Japan’s policy, the differential between Japanese and US bond yields, or risk sentiment among traders, among other factors.\nOne of the Bank of Japan’s mandates is currency control, so its moves are key for the Yen. The BoJ has directly intervened in currency markets sometimes, generally to lower the value of the Yen, although it refrains from doing it often due to political concerns of its main trading partners. The BoJ ultra-loose monetary policy between 2013 and 2024 caused the Yen to depreciate against its main currency peers due to an increasing policy divergence between the Bank of Japan and other main central banks. More recently, the gradually unwinding of this ultra-loose policy has given some support to the Yen.\nOver the last decade, the BoJ’s stance of sticking to ultra-loose monetary policy has led to a widening policy divergence with other central banks, particularly with the US Federal Reserve. This supported a widening of the differential between the 10-year US and Japanese bonds, which favored the US Dollar against the Japanese Yen. The BoJ decision in 2024 to gradually abandon the ultra-loose policy, coupled with interest-rate cuts in other major central banks, is narrowing this differential.\nThe Japanese Yen is often seen as a safe-haven investment. This means that in times of"
            },
            {
                "title": "GBP/JPY Price Forecast: Breaks higher to 213.00 as risk-off sinks JPY - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-price-forecast-breaks-higher-to-21300-as-risk-off-sinks-jpy-202601122241",
                "body": "GBP/JPY Price Forecast: Breaks higher to 213.00 as risk-off sinks JPY\n- GBP/JPY rallies above the 210.00–212.00 range as risk-off sentiment weakens the Yen.\n- Bullish breakout targets 213.00 and 213.50, with momentum favoring further upside.\n- Support rests at 212.00, then 211.00 and the 20-day SMA near 210.68.\nThe GBP/JPY rises on Monday, courtesy of a risk-off mood that weighed on safe-haven peers like the Japanese Yen and the Dollar, which are trading softer against most currencies. At the time of writing the cross-pair trade at 212.88 up 0.61%.\nJapanese Yen Price This week\nThe table below shows the percentage change of Japanese Yen (JPY) against listed major currencies this week. Japanese Yen was the strongest against the Australian Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Japanese Yen from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent JPY (base)/USD (quote).\nGBP/JPY Price Forecast: Technical outlook\nThe GBP/JPY technical picture is bullish after the pair cleared the top of the 210.00-212.00 trading range, pushing the pair to new yearly highs of 212.93, with buyers eyeing the 213.00 mark. Once surpassed, the next stop would be 213.50 mark, ahead of 214.00.\nOn the flip side, the GBP/JPY first support would be the 212.00 figure. A breach of the latter would clear the way to challenge 211.00, followed by the 20-day Simple Moving Average (SMA) at 210.68. Once surpassed, the next stop would be the 50-day SMA at 207.36.\nGBP/JPY Price Chart – Daily\nJapanese Yen FAQs\nThe Japanese Yen (JPY) is one of the world’s most traded currencies. Its value is broadly determined by the performance of the Japanese economy, but more specifically by the Bank of Japan’s policy, the differential between Japanese and US bond yields, or risk sentiment among traders, among other factors.\nOne of the Bank of Japan’s mandates is currency control, so its moves are key for the Yen. The BoJ has directly intervened in currency markets sometimes, generally to lower the value of the Yen, although it refrains from doing it often due to political concerns of its main trading partners. The BoJ ultra-loose monetary policy between 2013 and 2024 caused the Yen to depreciate against its main currency peers due to an increasing policy divergence between the Bank of Japan and other main central banks. More recently, the gradually unwinding of this ultra-loose policy has given some support to the Yen.\nOver the last decade, the BoJ’s stance of sticking to ultra-loose monetary policy has led to a widening policy divergence with other central banks, particularly with the US Federal Reserve. This supported a widening of the differential between the 10-year US and Japanese bonds, which favored the US Dollar against the Japanese Yen. The BoJ decision in 2024 to gradually abandon the ultra-loose policy, coupled with interest-rate cuts in other major central banks, is narrowing this differential.\nThe Japanese Yen is often seen as a safe-haven investment. This means that in times of market stress, investors are more likely to put their money in the Japanese currency due to its supposed reliability and stability. Turbulent times are likely to strengthen the Yen’s value against other currencies seen as more risky to invest in.\nAuthor\nChristian Borjon Valencia\nFXStreet\nChristian Borjon began his career as a retail trader in 2010, mainly focused on technical analysis and strategies around it. He started as a swing trader, as he used to work in another industry unrelated to the financial markets."
            },
            {
                "title": "The Pound remains stable above 212.10 due to a declining Japanese Yen and political speculation - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/the-pound-remains-stable-above-212-10-due-to-a-declining-japanese-yen-and-political-speculation/",
                "body": "The GBP/JPY has reached new highs near 212.50, buoyed by a weakening Yen. This follows reports that Japanese Prime Minister Sanae Takaichi may be planning snap elections in February, creating unexpected political uncertainty and pressuring the Yen.\nReports suggest Takaichi may dissolve the House of Representatives on January 23, with elections on February 8 or 15. This development surprised markets, impacting the Yen significantly.\nCurrent Market Trend\nThe GBP/JPY is trading at 212.29 within an upward channel since early November. Technical indicators, such as the 4-Hour RSI at 66 and a positive MACD, indicate a bullish trend with potential targets at 212.85 and 213.34 if gains consolidate above 212.10.\nHowever, a downside risk exists if the price dips below the 210 mark, with trendline resistance at 211.20 and further support from late-December lows between 210.05 and 210.25.\nToday’s heat map shows JPY experiencing a 0.08% change against the USD, with varied movements against other major currencies. The base and quote currencies help determine percentage changes, highlighting the Yen’s performance throughout various currency pairs.\nLooking back at the analysis from early 2025, we can see the market was focused on Japanese political uncertainty pushing GBP/JPY to long-term highs. That dynamic, driven by rumors of a snap election, has completely changed a year later. The fundamental drivers for the yen are now monetary policy based, not political.\nMonetary Policies and Market Strategies\nThe major shift has been the Bank of Japan’s exit from its negative interest rate policy in the fourth quarter of 2025. With Japan’s core inflation now holding above 2% for the last six months, the market is pricing in the possibility of another small rate hike this year. This provides a fundamental bid for the yen that was absent throughout early 2025.\nOn the sterling side, the Bank of England is still battling persistent price pressures, with the latest December inflation data showing a headline rate of 3.1%. This is well above the BoE’s target, suggesting interest rates in the UK will remain elevated for longer, lending support to the pound. We are now in a tug-of-war between two central banks with tightening biases.\nFor derivative traders, this environment points towards increased volatility rather than the clear uptrend we saw this time last year. We believe purchasing straddles is a viable strategy, as it allows for profiting from a large price swing in either direction without betting on a specific outcome. This is preferable to taking an outright directional view in such a conflicted macro environment.\nHistorically, the initial phases of a Bank of Japan tightening cycle, like the one seen in 2006, often lead to choppy, whipsaw price action in yen crosses. The pair is no longer simply a “risk-on” trade based on yen weakness. Therefore, we should use options to position for a period of price discovery and two-way volatility in the coming weeks."
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "2,457.4000",
            "open": "90,644.7300",
            "close": "90,982.5000",
            "high": "92,417.5000",
            "low": "89,960.1000"
        },
        "market_summary": "### BTC/USD Market Briefing\n* **Key Drivers:** Institutional adoption and regulatory clarity are driving **bullish momentum**, with Morgan Stanley joining BlackRock and Fidelity in the **$123 billion** Bitcoin ETF market.\n* **Price Action:** The price of BTC/USD has been supported by **institutional flows** and **long-term allocations**, rather than speculative momentum, with a rumored Venezuelan Bitcoin stash of approximately **600,000 BTC** (worth around **$56 billion** to **$67 billion**) still uncertain.\n* **Technical Outlook:** Immediate support and resistance levels are not explicitly stated in the articles, but the growing **institutional demand** and **regulatory clarity** are expected to support price stability and reduce **volatility** over time.\n\n--- \n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Fate of reported Venezuelan bitcoin stash 'remains to be seen,' SEC chairman says - Fox Business",
                "source": "Fox Business",
                "url": "https://www.foxbusiness.com/video/6387612138112",
                "body": "Live Now\nAll times easternNOW - 1:00 AM\n1:00 AM\n1:30 AM\n2:00 AM\n2:30 AM\n3:00 AM\nFox Business Channel\nPaid Programming\n1:00 AM - 1:30 AM\nPaid Programming\n1:30 AM - 2:00 AM\nPaid Programming\n2:00 AM - 2:30 AM\nPaid Programming\n2:30 AM - 3:00 AM\nPaid Programming\n3:00 AM - 3:30 AM\nFox News Channel\nJesse Watters Primetime\n1:00 AM - 2:00 AM\nHannity\n2:00 AM - 3:00 AM\nGutfeld!\n3:00 AM - 3:30 AM\nFox Weather Channel\nFox News Radio\nFox News Channel Live"
            },
            {
                "title": "Wall Street's Crypto Takeover: Morgan Stanley Joins BlackRock, Fidelity in $123 Billion Bitcoin ETF Market - 24/7 Wall St.",
                "source": "24/7 Wall St.",
                "url": "https://247wallst.com/investing/2026/01/12/wall-streets-crypto-takeover-morgan-stanley-joins-blackrock-fidelity-in-123-billion-bitcoin-etf-market/",
                "body": "The Wall Street Bitcoin ETF takeover has crossed a defining threshold. What began as cautious experimentation has turned into coordinated institutional dominance, with Morgan Stanley joining BlackRock and Fidelity in a Bitcoin ETF market now worth over $123 billion. This reflects the alignment of regulation, client demand, and competitive pressure pulling Bitcoin (CRYPTO: BTC) squarely into traditional finance.\nCryptocurrency exposure is becoming standard as large banks and asset managers integrate ETFs into advisory products and retirement plans. The outcome is a Bitcoin ETF market that’s shaped by institutional flows and long-term allocations rather than speculative momentum.\nWall Street’s Bitcoin ETF Market Hits $123 Billion—How We Got Here\nThe Bitcoin ETF story represents one of the fastest institutional adoption cycles in financial history. Decades of SEC denial ended in January 2024 when court decisions compelled the agency to greenlight eleven spot Bitcoin ETFs, eliminating longstanding custody and regulatory concerns.\nInstitutional capital responded immediately. Bitcoin ETFs attracted $35.2 billion in cumulative net inflows in 2024, and the total net assets now stand at $123.52 billion. The first week of 2026 alone brought over $1.2 billion in fresh capital. This regulatory clarity and the availability of regulated structures enabled pension funds, endowments, and wealth managers to invest with confidence, transforming Bitcoin from a speculative asset into an acknowledged commodity exposure.\nThe Wall Street Bitcoin ETF takeover marks a structural shift. Investor confidence grew from regulatory approval and operational readiness, proving that traditional finance could interact with crypto assets safely. Both spot and futures ETFs now form the foundation of institutional crypto involvement.\nMorgan Stanley’s Entry Marks Next Phase of Institutional Crypto Adoption\nThe Morgan Stanley crypto ETF entry on January 6 represents the most significant bank-led Wall Street’s expansion yet. Morgan Stanley filed S-1 registration statements with the SEC for spot Bitcoin and Solana ETFs, becoming the first major U.S. bank to seek approval for its own spot Bitcoin ETF.\nBy integrating a proprietary Bitcoin ETF into E*Trade and wealth management platforms, Morgan Stanley retains control over client relationships, fee structures, and portfolio recommendations. The bank’s strategy embeds crypto exposure directly into retirement accounts and balanced portfolios, enhancing accessibility for both high-net-worth and mainstream clients.\nBank of America followed suit, allowing wealth advisers to recommend crypto allocations from January 2026. According to the SEC filing, the Morgan Stanley Bitcoin Trust will track Bitcoin’s spot price without leverage or derivatives. The firm also plans crypto trading on E*Trade in H1 2026.\nThe filing reflects broader institutional crypto adoption patterns—showing that even late entrants can secure competitive advantages through brand trust, distribution reach, and strategic product integration.\nHow BlackRock, Fidelity, and Morgan Stanley Are Reshaping Crypto Markets\nInstitutional influence is redefining Bitcoin’s market structure. BlackRock, Fidelity, and now Morgan Stanley control significant capital flows, creating structural demand that supports price stability and reduces volatility over time.\nBlackRock’s iShares Bitcoin Trust (IBIT) holds approximately $70.6 billion in assets, making it the most dominant player in the space. Fidelity’s FBTC adds $17.7 billion in AUM with roughly 203,000 BTC in custody. These allocations move beyond simple hedging, acting as directional capital that reinforces market trends during rallies and corrections.\nMorgan Stanley’s entry adds proprietary distribution, embedding ETFs directly into advisory workflows. Combined, these firms set liquidity and price discovery standards for the entire Bitcoin ETF market in 2026. Their dominance ensures institutional-grade execution, reliabl"
            },
            {
                "title": "SEC Chair: Fate of Rumored Venezuelan Bitcoin Stash ‘Remains to Be Seen’ - Bitcoin Magazine",
                "source": "Bitcoin Magazine",
                "url": "https://bitcoinmagazine.com/news/sec-chair-on-rumored-venezuelan-bitcoin",
                "body": "U.S. Securities and Exchange Commission Chair Paul Atkins said today that it remains unclear whether the U.S. government will move to seize the widely discussed Bitcoin holdings rumored to be tied to Venezuela, an uncertainty that comes as Washington seeks to bring greater regulatory clarity to digital asset markets.\nAtkins told Fox Business the question of pursuing the so‑called Venezuela Bitcoin stash — variously estimated at roughly 600,000 BTC, or about $56 billion to $67 billion at current prices — is “still to be seen” and is being handled by other parts of the administration.\n“I leave that to others to deal with. That’s not my focus,” Atkins said, underscoring that the SEC is not currently prioritizing asset confiscation.\nRumors in crypto and intelligence circles have pointed to a massive “shadow reserve” of Bitcoin allegedly accumulated by the Venezuelan government through gold sales, oil deals settled in stablecoins, and other transactions dating back to 2018.\nIf verified and under U.S. control, such a reserve would rank among the largest Bitcoin holdings globally.\nBut independent blockchain analysts note that there is no verifiable on‑chain evidence yet linking wallets containing such amounts to Venezuela’s government, and publicly traceable addresses connected to state entities reflect only a tiny fraction of the rumored holdings.\nBitcoin and CLARITY Act update\nAtkins pivoted quickly from the Venezuela question to highlight ongoing legislative efforts in Congress aimed at clarifying the regulatory framework for digital assets.\n“This week is an important week because the Senate is taking up a bipartisan bill that will bring clarity and certainty to the crypto world,” he said, referring to a measure designed to delineate oversight responsibilities between the SEC and the Commodity Futures Trading Commission (CFTC).\nThe bill — backed by members of both parties and anticipated to be marked up this week — represents the next step in positioning the U.S. as a global leader in digital asset markets, Atkins said.\nHe also cited the Genius Act, passed late last year, as the first statute formally recognizing crypto assets under U.S. law, and credited it with helping to bring regulatory clarity to stablecoin frameworks.\nAtkins expressed optimism that with clearer rules, markets will gain much‑needed certainty around products and oversight.\nHe noted ongoing collaboration with the new CFTC chairman and reiterated the SEC’s commitment to enforcing future regulations once enacted.\nWhile ethical questions around public officials and crypto business interests remain under Congressional purview, Atkins said the immediate priority is a regulatory regime that reduces market ambiguity and supports investor confidence."
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "107.3000",
            "open": "3,116.4300",
            "close": "3,086.8000",
            "high": "3,166.3500",
            "low": "3,059.0500"
        },
        "market_summary": "### ETH/USD Market Briefing\n\n* **Key Drivers:** Weaker-than-expected **Bitcoin** performance and improving relative fundamentals, including Ethereum's dominance in **stablecoins**, **tokenized real-world assets**, and **DeFi**, are expected to drive **ETH** outperformance.\n* **Price Action:** Currently trading at **$3,099**, with a forecasted price of **$7,500** in 2026, **$15,000** in 2027, **$22,000** in 2028, **$30,000** in 2029, and **$40,000** by 2030.\n* **Technical Outlook:** Immediate support is near the **$2,500** level, with resistance at **$3,500**; the **ETH-BTC ratio** is expected to return to its 2021 highs, around **0.08**, driven by Ethereum's structural advantages.\n\n---\n**Overall Sentiment:** **Bullish**",
        "source_articles": [
            {
                "title": "Exploring the Relationships Between Ethereum Price and the DeFi Ecosystem - The Pantagraph",
                "source": "The Pantagraph",
                "url": "https://pantagraph.com/life-entertainment/article_f69d270e-e578-5c6d-96ae-5f3ba059b1d7.html",
                "body": "Exploring the Relationships Between Ethereum Price and the DeFi Ecosystem Contributor Content Provided content by Ethan M. Stone Jan 12, 2026 Jan 12, 2026 Updated 12 hrs ago 0 3 min to read Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Photo provided by Pexels kAmtE96C6F> :D C6=2E:G6=J F?:BF6 2>@?8 >2;@C 4CJAE@4FCC6?4:6D :? E92E[ C2E96C E92? D6CG:?8 2D 2 DA64F=2E:G6 DE@C6 @7 G2=F6 =:<6 q:E4@:?[ :E :?DE625 @A6C2E6D 2D 2 A=2E7@C> 7@C 9F?5C65D @7 5646?EC2=:K65 7:?2?46 Ws6u:X ?6EH@C<D[ }u% >2C<6ED[ 2?5 5646?EC2=:K65 2AA=:42E:@? W5pAAX 9F3D] q642FD6 6G6CJ EC2?D24E:@? @? E96D6 6I492?86D :?4FCD 2 766 :? 6E96C Wt%wX[ E96 k2 9C67lQ9EEADi^^HHH]3:?2?46]4@>^6?^AC:46^6E96C6F>Q E2C86ElQ03=2?<QmtE96C6F> AC:46k^2m D:8?:7:42?E=J :?7=F6?46D E96 G:23:=:EJ @7 E96D6 DJDE6>D]k^AmkAms6u: 2AA=:42E:@?D[ :? A2CE:4F=2C[ 2C6 962G:=J C6=:2?E @? E96 tE96C6F> ?6EH@C<[ 6DA64:2==J 8:G6? E96 H:56DAC625 FD6 @7 =6?5:?8 A=2E7@C>D[ 5646?EC2=:K65 6I492?86D Wst)DX[ 2?5 J:6=5 72C>:?8] p?J@?6 FD:?8 @C E9:?<:?8 23@FE FD:?8 E96D6 D6CG:46D D9@F=5 8C2DA 9@H E96 tE96C6F> AC:46 :>A24ED E96> 2?5 H92E A@E6?E:2= D9:7ED 4@F=5 >62? 7@C FD6CD] k^Am People are also reading… Bloomington motorcyclist dies after crash with SUV Illinois State football roster tracker: Check out who's staying and who's leaving Hundreds gather in Bloomington to decry ICE after woman slain Bloomington man ID'd in fatal motorcycle-SUV crash Overtime pain for Illinois State in FCS National Championship loss to Montana State Carle Health announces new Bloomington-Normal area president Prison ordered for self-described 'vigilante' in child sex imagery case More than 20 Bloomington residents displaced after apartment fire Flick Fact: What business was there in Normal before it was Pub II? More than 100 gather in Bloomington-Normal to protest Venezuela attack Flick Fact: How little Congerville, population 500, made world news 28 years ago this morning? Daiso store plans grand opening in NormalIvy Lane Bakery owners prepare to pass the torch at the end of 2026Scramblers restaurant now open for breakfast, lunch in BloomingtonDaniel “Dan” W. Miller k9bmkDEC@?8mp qC:67 #6G:6Hi tE96C6F> 2?5 s6u:k^DEC@?8mk^9bm kAmtE96C6F> :D 2 3=@4<492:? ?6EH@C< E92E FD6D 2 AC@@7\\@7\\DE2<6 W!@$X 4@?D6?DFD >6492?:D>[ @7E6? >2<:?8 :E >@C6 6?6C8J\\677:4:6?E 2?5[ :? >2?J 42D6D[ =6DD 4@DE=J E@ FD6 E92? E96 @=56C AC@@7\\@7\\H@C< W!@(X >@56=] tE96C6F>’D 2AA62= 2D 2 A=2E7@C> 7@C s6u: AC@;64ED DE6>D 7C@> E96D6 G6CJ 2EEC:3FE6D] k^AmkAmq642FD6 tE96C6F> EC2?D24E:@?D C6BF:C6 t%w E@ 4@G6C 82D 766D[ 2?5 3642FD6 2 A@CE:@? @7 E9@D6 766D :D DF3D6BF6?E=J 3FC?65[ 7=F4EF2E:@?D :? t%w’D G2=F6 5:C64E=J 27764E E96 4@DE @7 FD:?8 s6u: D6CG:46D]k^Am kAmx7 tE96C6F> :D E96 A=2E7@C> E92E 9@DED s6u:[ E96? s6u: :D E96 D6C:6D @7 2AA=:42E:@?D E92E A6@A=6 8@ E@ tE96C6F> E@ FD6] r@:?EC:3F?6 567:?6D s6u: 2D “2? :??@G2E:G6 DJDE6> E92E C6=:6D @? E96 3=@4<492:? E@ @776C k2 9C67lQ9EEADi^^HHH]4@:?EC:3F?6]4@>^6?^567:\\6E96C6F>\\4@>A=6E6\\8F:56\\E@\\5646?EC2=:K65\\7:?2?46^Q E2C86ElQ03=2?<Qm7:?2?4:2= D6CG:46Dk^2m H:E9@FE 8@:?8 E9C@F89 EC25:E:@?2= :?E6C>65:2C:6D =:<6 32?<D] ,%9C@F89. s6u:[ FD6CD 42? =6?5[ 3@CC@H[ DA64F=2E6 @? 2DD6E AC:46 >@G6>6?ED[ 2?5 6G6? 62C? :?E6C6DE @? E96:C D2G:?8D]” k^Am kAm&D6CD 92G6 2 H62=E9 @7 s6u: A=2E7@C>D E@ 6IA=@C6[ 6249 AC6D6?E:?8 2 D:>:=2C DF:E6 @7 D6CG:46D[ J6E H:E9 F?:BF6 36?67:ED] x? 4@?EC2DE[ @?6 A=2E7@C> >2J 6I46= 2E AC@G:5:?8 72DE EC2?D24E:@?D[ 2?5 2?@E96C >2J 2FE@>2E6 :?G6DE>6?E AC@46DD6D] k^Am kAms6u:’D 4@C6 :D 3F:=E @? D>2CE 4@?EC24ED[ H9:49 2C6 6DD6?E:2==J AC@8C2>>23=6 :?E6C7246D 2==@H:?8 FD6CD E@ EC256 H:E9@FE :?E6C>65:2C:6D] qFE E96D6 4@?EC24ED 2C6 ?@E 7@@=AC@@7] %96J 42? 4@?E2:? H62<?6DD6D E92E 325 24E@CD 42? E2<6 25G2?E286 @7]k^Amk9bmkDEC@?8m!C:46 '@=2E:=:EJ 2?5 r@==2E6C2= $E23:=:EJk^DEC@?8mk^9bmkAmtE96C6F> @7E6? D6CG6D 2D E96 324<3@?6 7@C 4@==2E6C2= @? s6u: A=2E7@C>D[ F?56CA:??:?8 DE23=64@:?D 2?5 =@2?D] p DFC86 :? t%w’D G2=F6 EC2?D=2E6D 5:C64E=J E@ :?4C62D65 4@==2E6C2= H@CE9[ H9:49 :? EFC? 8:G6D FD6CD E96 23:=:EJ E"
            },
            {
                "title": "Standard Chartered says '2026 will be the year of Ethereum' as bank backs ETH outperformance - The Block",
                "source": "The Block",
                "url": "https://www.theblock.co/post/385097/standard-chartered-says-2026-will-be-the-year-of-ethereum",
                "body": "Standard Chartered says '2026 will be the year of Ethereum' as bank backs ETH outperformance\nQuick Take\n- Standard Chartered said “2026 will be the year of Ethereum,” citing improving relative fundamentals even as weaker Bitcoin performance has weighed on the broader digital asset market.\n- The bank argued that Ethereum’s dominance in stablecoins, tokenized real-world assets, and DeFi, alongside rising network throughput, should help ETH outperform BTC.\n- Global Head of Digital Assets Research, Geoffrey Kendrick, also lowered his price forecasts for 2026 to 2028 while raising longer-term targets.\nStandard Chartered has struck a bullish tone on Ethereum’s outlook, with the bank’s Global Head of Digital Assets Research, Geoffrey Kendrick, saying he expects Ethereum to outperform crypto peers in 2026 even as the firm trims some near-term price forecasts amid broader weakness in crypto markets.\n“I think 2026 will be the year of Ethereum, much like 2021 was,” Kendrick said in a note accompanying the bank’s latest digital assets report. He pointed to the growing adoption of blockchains and onchain products as factors that should allow ether to “outperform significantly.”\nThe call comes as Standard Chartered has turned more constructive on Ethereum versus Bitcoin, despite lowering its absolute ETH price targets for the next few years. It now sees ether ending 2026 at $7,500, down from a previous $12,000 estimate, followed by $15,000 in 2027 and $22,000 in 2028, both lower than earlier projections. In contrast, Standard Chartered has raised its longer-dated outlook, lifting its end-2029 forecast to $30,000 and introducing a new $40,000 target for end-2030.\nETH’s bull case\nIn the report, the bank said weaker-than-expected Bitcoin performance has dampened prospects for digital assets against the dollar, given the foremost cryptocurrency’s continued dominance of the sector. Relative to Bitcoin, however, Ethereum’s drivers have strengthened, Kendrick asserted.\nStandard Chartered now expects the ETH-BTC ratio to gradually return toward its 2021 highs, around 0.08, as Ethereum benefits from structural advantages not shared by its peers. Those include its dominant position in stablecoins, real-world assets, and decentralized finance, as well as ongoing efforts to scale the network.\nKendrick’s team said flows into digital asset exchange-traded funds and corporate treasury vehicles have slowed across the board, but remain relatively more supportive for Ethereum than for Bitcoin. The report highlighted continued buying by BitMine Immersion, currently the largest Ethereum-focused digital asset treasury company, which now holds about 3.4% of ether in circulation and remains on track to reach its 5% target.\nStandard Chartered also reiterated its bullish stance on stablecoins and tokenized real-world assets, forecasting both markets to reach $2 trillion by 2028, with the majority of activity expected to settle on Ethereum. According to the bank, more than half of all stablecoins and tokenized RWAs already sit on Ethereum, a share it expects to grow as traditional financial activity moves onchain.\nNetwork fundamentals were another pillar of the thesis. Ethereum’s transaction count has reached fresh all-time highs in recent weeks, driven largely by stablecoin activity, which now accounts for roughly 35% to 40% of transactions.\nThe bank said planned increases in Ethereum’s Layer 1 throughput — including steps taken through the Fusaka upgrade in December — are critical, as higher throughput has historically translated into a higher market capitalization.\nAs The Block previously reported, Ethereum developers deployed two major hard forks last year in Pectra and Fusaka. The successful rollout began a twice-a-year upgrade schedule designed to scale Ethereum’s network into a trillion-dollar ecosystem.\nStandard Chartered also added that a more supportive regulatory backdrop could further bolster the outlook, pointing to the proposed U.S. Clarity Act, which "
            },
            {
                "title": "Standard Chartered sees Ethereum overtaking Bitcoin, forecasts $40K by 2030 - Cryptopolitan",
                "source": "Cryptopolitan",
                "url": "https://www.cryptopolitan.com/standard-chartered-predicts-ethereum/",
                "body": "Standard Chartered raised its forecast on Ethereum on Monday, saying it could hit $40,000 by 2030. He also believes that ETH’s growth this year will outperform Bitcoin, driven by improving relative fundamentals in the market.\nThe bank’s Head of Digital Assets Research, Geoff Kendrick, stated that the prospects for Ethereum in 2026 have significantly improved. He also anticipates that the digital asset will cross and gradually return to its 2021 highs.\nKendrick cites crypto regulation as a catalyst for ETH’s rally in 2026\nLove this take from @vaneck_us on ethererum $ETH\n– by 2030, base case $ETH -> $22,000\n– by 2030, bull case $ETH -> $154,000https://t.co/hCjsZNL61A pic.twitter.com/C10yq3QRfX— Thomas (Tom) Lee (not drummer) FSInsight.com (@fundstrat) January 9, 2026\nKendrick pointed to weaker-than-expected BTC performance weighing on the broader cryptocurrency industry as evidence for ETH’s potential rally. He also argued that continued purchases by the largest Ethereum-focused digital asset treasury company will push ETH higher this year.\nThe analyst forecasted that Ethereum will surge, driven by its dominance in stablecoins. He also pointed to the progress in plans to increase the digital asset’s Layer-1 throughput by tenfold.\nStandard Chartered’s analyst also believes that regulations surrounding the crypto industry are a potential catalyst to catapult ETH’s price. He pointed to the Senate Agriculture and Banking Committees’ vote on the CLARITY Act legislation expected on Thursday.\nKendrick acknowledged that the passage of the bill will establish a clearer framework for virtual assets. He also believes the legislation could significantly benefit Ethereum by unlocking further DeFi developments. Standard Chartered revealed that it lowered its ETH-USD forecast for 2026-2028 due to the weakness in Bitcoin prices.\n“Despite our more positive outlook for ETH versus BTC, we lower our ETH-USD forecast for 2026-2028 due to BTC weakness. However, we raise our ETH-USD forecast for end-2029, and we see the price reaching $40,000 by end-2030.”\n-Geoff Kendrick, Head of Digital Asset Research at Standard Chartered.\nFor the near term, Kendrick predicts that Ethereum’s price will reach $7,500 in 2026, which would be a new all-time high for the digital asset. The analyst had previously forecasted that ETH would hit $12,000 this year. For its longer-term outlook, Standard Chartered predicts that ETH prices will reach $30,000 by 2029 and $40,000 by 2030.\nKendrick’s forecast suggests that Ethereum would have to surge by nearly 1,200% from current prices to hit its $40,000 target. At the time of publication, Ethereum is trading at $3,099, down nearly 1.45% in the past 24 hours. The digital asset has also declined by more than 1.7% over the past 30 days.\nBitmine adds more ETH to its balance sheet\nStandard Chartered’s forecast on ETH comes as the leading publicly traded Ethereum treasury firm, Bitmine Immersion Technologies, continues accumulating the digital asset. The firm purchased an additional 24,266 ETH over the last week, worth around $76 million.\nBitmine’s latest acquisition has increased its ETH portfolio to over 4.16 million ETH, valued at more than $13 billion. The firm now ranks as the largest Ethereum treasury company and also the second-largest digital asset treasury behind Strategy.\nBitmine’s ETH stockpile accounts for about 3.5% of the entire Ethereum circulating supply. The firm’s Chairman, Tom Lee, argued that many positive things favor Ethereum in 2026. He pointed to the adoption of stablecoins and tokenization, saying both will make the ETH blockchain the settlement layer of Wall Street.\nLee also stated that 2026 is the year crypto prices will recover, calling the October 10 record-setting liquidation a mini-crypto winter. He also believes ETH will record stronger gains in 2027-2028.\nLee predicted on January 2 that Ethereum could reach $250,000, a more than 7,800% surge from the current prices. He also forecasted a future price o"
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "6.8469",
            "open": "138.4374",
            "close": "138.6167",
            "high": "144.1156",
            "low": "137.2687"
        },
        "market_summary": "### SOL/USD Market Briefing\n\n* **Key Drivers:** The introduction of **CFTC-regulated futures** on Coinbase has increased institutional investment in Solana, providing **regulatory certainty** and **liquidity**. The potential approval of a **Spot Solana ETF** is also a significant driver, with analysts estimating an **80% to 90%** chance of approval by mid-2026.\n* **Price Action:** SOL is currently trading in a **consolidation range** between **$125** and **$145**, with a market capitalization of approximately **$75.5 billion**. The price experienced a **12%** drop in December 2025, but the presence of deep futures markets has provided a **\"soft landing\"**.\n* **Technical Outlook:** Immediate resistance is at the **$147** level, with a clean break above this potentially signaling a retest of **all-time highs**. The **50-day moving average** is providing support, and the **24/7 trading** availability on Coinbase has reduced **\"gap risk\"** during weekend volatility.\n\n---\n**Overall Sentiment:** **Bullish**",
        "source_articles": [
            {
                "title": "Solana’s Institutional Awakening: How Coinbase’s Regulated Futures Transformed SOL into a Global Asset Class - The Chronicle-Journal",
                "source": "The Chronicle-Journal",
                "url": "http://markets.chroniclejournal.com/chroniclejournal/article/breakingcrypto-2026-1-12-solanas-institutional-awakening-how-coinbases-regulated-futures-transformed-sol-into-a-global-asset-class",
                "body": "The landscape of institutional digital asset investment shifted permanently throughout 2025, and as of January 12, 2026, the ripple effects of Coinbase Global, Inc. (NASDAQ: COIN) expanding into Solana futures are more visible than ever. What began as a strategic filing with the Commodity Futures Trading Commission (CFTC) in early 2025 has matured into a cornerstone of the Solana ecosystem, providing the regulatory certainty and liquidity required for the world’s largest asset managers to move beyond Bitcoin and Ethereum.\nThe launch of these regulated contracts on February 18, 2025, was met with immediate enthusiasm from the high-frequency trading community and hedge funds, who had long sought a U.S.-regulated venue to hedge SOL exposure. By mid-2025, Coinbase stepped further into the breach by introducing 24/7 trading for these futures, effectively bridging the gap between traditional finance (TradFi) hours and the around-the-clock nature of the blockchain. This move has been a primary catalyst in cementing Solana’s status as the third major institutional asset class in the crypto space.\nMarket Impact and Price Action\nThe introduction of CFTC-regulated futures has fundamentally altered Solana’s (SOL) market structure. Throughout 2025, the \"basis trade\"—whereby institutions go long on spot SOL and short the futures to capture yield—became a dominant strategy. This resulted in a massive surge in liquidity, with Solana’s total open interest across all regulated venues, including the CME and Coinbase, reaching a staggering $13 billion by August 2025. Currently, as of early January 2026, SOL is trading in a consolidation range between $125 and $145, maintaining a robust market capitalization of approximately $75.5 billion.\nWhile the price experienced a \"Red December\" in 2025, dropping roughly 12% amid broader macro-economic cooling, the presence of deep futures markets has provided a \"soft landing.\" Unlike the volatile swings of 2023 and 2024, the current market shows significantly higher support levels. Technical analysts are currently eyeing the $147 resistance mark; a clean break above this, supported by the ongoing \"Green January\" momentum, could signal a retest of all-time highs. The 24/7 trading availability on Coinbase has also reduced \"gap risk\" during weekend volatility, a factor that has historically deterred large-scale capital entry.\nCommunity and Ecosystem Response\nThe Solana community has largely embraced the \"institutionalization\" of the network. On social media platforms like X and Reddit, the narrative has shifted from SOL being a \"retail-only\" chain to a legitimate competitor to Ethereum for enterprise-grade applications. This sentiment is bolstered by the technical success of the Firedancer upgrade, which has recently pushed network speeds toward 1 million transactions per second (TPS) in testing environments.\nWithin the DeFi space, protocols like Jupiter and Kamino have seen record volumes as institutional players use regulated futures to hedge complex on-chain yield strategies. The growth of the Solana stablecoin market to $15 billion in January 2026 is a testament to this increased velocity of capital. Furthermore, the entry of traditional giants has brought a new level of legitimacy; for instance, Morgan Stanley (NYSE: MS) recently filed for a Solana Trust ETF, a move that the community views as the ultimate validation of the network's resilience and regulatory \"thaw.\"\nWhat's Next for Crypto\nThe primary focus for the first half of 2026 is the potential approval of a Spot Solana ETF. Analysts currently estimate the odds of SEC approval at 80% to 90% by mid-year, citing the existence of a \"significant, regulated market\" for the underlying asset—a requirement that Coinbase’s futures market has now satisfied for over a year. If approved, the influx of capital from retail brokerage accounts could dwarf the institutional inflows seen in 2025.\nBeyond ETFs, we are witnessing the rise of the \"Productive Treasury.\" Mo"
            },
            {
                "title": "Solana Price Prediction: Solana Is Being Built Into Elon’s X (Twitter) – Could This Be the Most Important Integration in Crypto History? - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/news/feed/62b0e-solana-price-prediction-solana-is-being-built-into-elons-x-twitter-could-this-be-the-most-important-integration-in-crypto-history",
                "body": "cryptorank.io\nVerifying you are human. This may take a few seconds.\ncryptorank.io needs to review the security of your connection before proceeding.\nVerification successful\nWaiting for cryptorank.io to respond...\nEnable JavaScript and cookies to continue"
            },
            {
                "title": "The 3 Cryptos That Could Skyrocket Your Portfolio in 2026 - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605148223",
                "body": "- Solana: Fast, low-fee blockchain powering NFTs, DePIN, and real-world retail adoption.\n- Sui Network: Developer-friendly, scalable platform gaining traction in NFTs and crypto gaming.\n- Ethena: Innovative DeFi project offering on-chain, stablecoin-backed staking yields with strong investor backing.\nThe crypto market in 2026 is attracting attention from both seasoned investors and newcomers. Certain coins are emerging as strong contenders for growth, thanks to their innovative technology and real-world applications. Choosing the right crypto now could give investors a significant advantage as the year unfolds. In this article, we look at three cryptocurrencies that have shown remarkable potential. These projects are backed by fast, reliable networks, supportive developer communities, and unique financial tools.\nSolana (SOL)\nSolana has experienced a rollercoaster journey, moving from “Ethereum killer” hype to doubts about its future. Despite challenges, Solana Network has proven resilient. Its fast transaction speeds and extremely low fees make it a favorite for consumer-focused applications, including NFT marketplaces and DePIN protocols. Solana has also introduced Firedancer.\nSolana Pay is gaining traction as a payment solution, and integration with Shopify opens doors for real-world retail use. Several investment firms have recognized Solana as one of the fastest-growing cryptocurrencies of 2026, highlighting strong institutional interest alongside an active user base.\nSui Network (SUI)\nSui Network is a newcomer that is quickly making a name for itself, thanks to its innovative architecture and developer-friendly approach. Built by former Meta engineers, the network uses parallel execution to process transactions more efficiently than many competitors. Developers praise Sui for the ease of coding and testing applications, especially in gaming and NFT projects.\nGaming studios have started exploring the platform for new experiences, suggesting that Sui could play a central role if crypto gaming gains traction this year. Its scalability and developer-focused tools make it a promising option for those looking at long-term growth potential.\nEthena (ENA)\nEthena stands out by combining decentralized finance with a novel approach to stablecoins. Its internet bond, the USDe token, offers staking yields that are fully on-chain and censorship-resistant. This model is not a traditional stablecoin and not a typical yield farm, but it appeals to DeFi users looking for something new.\nEthena quickly attracted billions in Total Value Locked and has significant support from crypto-native venture capital firms. By blending security, yield, and innovation, Ethena positions itself to lead the next phase of DeFi growth. If the synthetic dollar trend continues, Ethena could become a central player in the decentralized finance ecosystem.\nEach of these three cryptos bring something unique to the table. Solana delivers speed and real-world payment adoption, Sui offers developer-friendly scalability, and Ethena innovates in DeFi with synthetic dollar staking. Investors looking for growth opportunities in 2026 should watch these projects closely. Understanding their strengths and potential applications can help make more informed decisions."
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "641.500",
            "open": "49,463.570",
            "close": "49,536.600",
            "high": "49,632.570",
            "low": "48,991.070"
        },
        "market_summary": "ERROR: An unexpected error occurred during AI summary generation: 'choices'",
        "source_articles": [
            {
                "title": "Dow Jones, Nasdaq, S&P 500 weekly preview: Markets brace for Q4 earnings, CPI data - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/news/stock-market-news/dow-jones-nasdaq-sp-500-weekly-preview-markets-brace-for-q4-earnings-cpi-data-4441347",
                "body": "Asia stocks rise on tech rally; Nikkei hits record high on snap election reports\nInvesting.com -- U.S. stocks ended the week at record levels on Friday after a softer-than-expected jobs report reinforced hopes for a steadier growth outlook.\nThe S&P 500 advanced 0.65% to close at 6,966.28, briefly touching an all-time high during the session. The Nasdaq Composite rose 0.81% to 23,671.35, while the Dow Jones Industrial Average (DJIA) gained 238 points, or 0.48%, to finish at 49,504.07, also a record close.\nAll three benchmarks posted solid weekly gains. The S&P 500 added just over 1% for the week, while the Dow and Nasdaq rose 2.3% and 1.9%, respectively.\nDecember’s employment report showed payroll growth of 50,000, undershooting expectations for 73,000. While the headline figure was weaker than forecast, investors viewed the data as evidence that the U.S. economy remains resilient, with room for momentum to rebuild.\nThe unemployment rate edged down to 4.4%, compared with estimates of 4.5%, which traders interpreted as a modest positive signal.\nThe report was also the first set of jobs data not distorted by last year’s prolonged government shutdown, which had delayed or disrupted several key economic releases. With data flow now normalizing, markets are turning their attention to inflation figures and upcoming policy decisions.\nWhile stocks have started 2026 on solid ground, the coming week could test market momentum as the fourth-quarter earnings season begins, inflation data looms, and geopolitical tensions remain high.\nTuesday’s release of December’s consumer price index (CPI) is expected to be closely watched ahead of the Federal Reserve’s late-January meeting. The central bank cut rates at its final three meetings of 2025, but the timing of any further easing remains uncertain.\n“December CPI report should kick off a run of high-side core CPI readings,” JPMorgan strategists led by Bruce Kasman said in a note.\nThey expect an initial 0.4% month-on-month rise next week and see core CPI accelerating to an annual pace above 3% by May.\n“Against this anticipated macro backdrop, we do not see the new dovish Fed chair being able to sway the FOMC to cut,” they added.\nU.S. President Donald Trump is expected to announce a nominee in the coming weeks to succeed Jerome Powell, whose term as Federal Reserve chair ends in May.\nTrump has repeatedly called for lower interest rates and applied uncommon pressure on the central bank, prompting questions over how independently his pick would operate. Trump’s nominee would require Senate confirmation.\nQ4 earnings season begins this week\nAlso this week, large U.S. banks are set to open the fourth-quarter earnings season, with earnings growth a key pillar supporting investor optimism.\nThe new reporting season will begin with JPMorgan Chase’s report on Tuesday, followed by Citigroup, Bank of America and Goldman Sachs later in the week.\nGoldman Sachs says that consensus expects EPS growth of 7% year over year, but argues this “appears too conservative once again,” pointing out that S&P 500 earnings grew by 10% or more in each of the first three quarters of 2025 and beat analyst expectations by an average of about six percentage points.\nWhat analysts are saying about U.S. stocks\nJPMorgan: \"We believe that the growth-policy tradeoff will be favourable for equities, at least through 1H of this year. Economic activity is likely to be supported by a relatively easy monetary and fiscal backdrop in the US and EuroArea, while inflation rates are likely to keep moving lower.\"\n\"Within our constructive equity outlook, driven by supportive Growth-Inflation tradeoff that we see for 2026, we believe that Cyclical sectors will be the outperformers.\"\nGoldman Sachs: \"The 4Q earnings season will represent another important test for big tech andn the AI trade. The trajectory of AI capex spending established this quarter will have meaningful implications for the earnings outlook and share price performance of AI infrastr"
            },
            {
                "title": "These Two Top Banks Chart Bullish Patterns Ahead Of Q4 Launch - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/news/jpmorgan-chase-bank-earnings-q4-2025-jpm-stock-dow-jones-bank-of-new-york-mellon-bny-bk/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #fc8935d0-f044-11f0-9cfd-b58335f44d26"
            },
            {
                "title": "Dow Jones & Nasdaq 100: Yen slide cushions US futures ahead of CPI - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/dow-jones-nasdaq-100-yen-slide-cushions-us-futures-ahead-of-cpi-1572449",
                "body": "US stock futures dipped in early trading on Tuesday, January 13, amid caution ahead of the highly anticipated US CPI report.\nHowever, a weaker Japanese yen cushioned the downside as markets considered the China-Japan political spat, a potential snap election, and BoJ policy uncertainty. USD/JPY climbed 0.36% to 158.692, its highest level since January 2025, fueling yen carry trades into US risk assets.\nDespite the morning losses, optimism about the earnings season, bets on two Fed rate cuts in 2026, and a resilient US economy support a bullish medium-term outlook for US equity futures.\nBelow, I’ll outline the key market drivers, the medium-term outlook, and the key technical levels traders should watch.\nPolitical and monetary policy uncertainty sent USD/JPY higher in early trading as markets considered a potential snap election in February in Japan. A strong election win would strengthen Prime Minister Sanae Takaichi’s push for fiscal policy measures. USD/JPY has surged 7.9% since Prime Minister Takaichi became the Liberal Democratic Party leader.\nNotably, concerns about her fiscal policy plans have sent 10-year Japanese Government Bond (JGB) yields to their highest levels since 1999 in morning trading.\nPrime Minister Takaichi’s spending plans and Japan’s sizeable debt-to-GDP ratio have increased risk premiums for holding JGBs, sending yields higher. Rising borrowing costs and a substantial national debt burden expose the Japanese economy to downside risks.\nUncertainty about the timing of Bank of Japan rate hikes contributed to the yen’s weakness. US-Japan interest rate differentials remain firmly in favor of the US dollar, sending the USD/JPY pair higher.\nImportantly, the Nikkei 225 surged 3.08% in morning trading, benefiting from the weaker yen and the prospects of fiscal policy support. The China-Japan political spat added to the negative sentiment toward the yen.\nCrucially, the prevailing yen weakness sent USD/JPY into the intervention zone (157-160), raising the threat of government intervention in the forex markets, capping USD/JPY gains.\nUS futures saw modest losses during the Asian morning session on Tuesday, January 13, after a choppy start to the week.\nThe Nasdaq 100 E-mini and the S&P 500 E-mini fell 81 points and 10 points, respectively, while the Dow Jones E-mini slipped 22 points.\nLater Tuesday, the US CPI report will influence sentiment regarding the Fed rate path. Economists forecast headline inflation to remain at 2.7% in December, while forecasting core inflation to rise from 2.6% in November to 2.7% in December. December’s figures will likely dictate the timeline for a Fed rate cut, given the stronger-than-expected US jobs report.\nSofter inflation would likely support a more dovish rate path, boosting demand for risk assets. Typically, lower borrowing costs would boost earnings and equity valuations.\nHeadline inflation fell from 3% in October to 2.7% in November. However, economists attributed the drop to the US government shutdown, curbing consumption, suggesting that ‘in line’ with forecast numbers would boost bets on a March Fed rate cut.\nGiven the significance of the CPI report, traders should closely monitor reactions from Fed speakers to the numbers and views on rate cuts.\nBeyond the economic calendar, corporate earnings will influence risk appetite. JPMorgan Chase (JPM) will kick off the earnings season on Tuesday.\nThe current dynamics, including market optimism over corporate earnings and expectations of an H1 2026 Fed rate cut, affirm the cautiously bullish near-term and bullish medium-term price outlook.\nDespite the morning pullback, the Dow Jones E-mini, the Nasdaq 100 E-mini, and the S&P 500 E-mini traded above their 50-day and 200-day EMAs. The EMAs indicated a bullish short- to medium-term outlook, aligning with positive fundamentals.\nNear-term trends will hinge on geopolitical risks, US inflation, corporate earnings, and Fed forward guidance. Key levels to monitor include:\nDow Jones\nNasdaq 100"
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "56.250",
            "open": "10,129.710",
            "close": "10,150.010",
            "high": "10,151.710",
            "low": "10,095.460"
        },
        "market_summary": "### UK100 Market Briefing\n* **Key Drivers:** The **US Department of Justice's investigation** into Federal Reserve chair Jay Powell has led to a decrease in the **US Dollar index** by more than **0.3%**, which may have a positive impact on the **UK100** due to the potential weakening of the dollar.\n* **Price Action:** The **UK100** is expected to react to the global market movements, potentially showing **bullish momentum** as investors seek safe havens during times of geopolitical upheaval, with the **US Dollar index** down to **98.8**.\n* **Technical Outlook:** Immediate support for the **UK100** is needed to determine its resilience, while resistance levels will be crucial in understanding the **bearish** or **bullish** trend, with **gold prices** increasing by **6%** this year and currently trading at **$4,605**.\n\n--- \n**Overall Sentiment:** Neutral",
        "source_articles": [
            {
                "title": "Market Movers blog: US launches investigation into Fed chair Jay Powell - Investment Week",
                "source": "Investment Week",
                "url": "https://www.investmentweek.co.uk/blog/4080428/market-movers-blog",
                "body": "In this live blog, Investment Week collates all the breaking market news, analysis and opinion on equity, bond and currencies, as well as the impact of regulation, economics and key market figures.\nUS equity markets have opened lower today (12 January) after being rattled by the news of US Department of Justice's (DoJ) investigation into testimony given by Federal Reserve chair Jerome Powell to a Senate committee over renovations to the Bank's building.\nThe S&P 500 index was down 0.2% at the time of reporting, while the tech-heavy Nasdaq Composite index opened 0.1% lower, according to data from MarketWatch\nThe US Dollar index is also down more than 0.3% to 98.8.\nUS Treasuries rose marginally at market open, instead, with US 10- and 30-Year Treasury bonds up 0.023 and 0.037, respectively.\nThe DoJ is investigating the $2.5bn forecasted redevelopment of the central bank’s headquarters.\nUS president Donald Trump nominated Powell for chair back in 2017 but has turned to publicly criticising him for over a year, argued that the renovation costs would be much higher.\nPowell's statement on Sunday was the first time he has publicly and robustly pushed back against Trump, and warned that the independence of the US central bank is at stake as he saw this probe as politically motivated.\nFollowing the DoJ's announcement, gold prices shot up, currently trading at above the $4,600 mark at $4,609, a 2.4% increase so far today,\nUS prosecutors have opened an investigation into Federal Reserve chair Jay Powell regarding a $2.5bn investment into the redevelopment of the Fed’s headquarters.\nIn a statement on Sunday (11 January), Powell explained the US Department of Justice (DoJ) served the Fed with grand jury subpoenas regarding the renovation project.\nHe said: “I have deep respect for the rule of law and for accountability in our democracy. No one—certainly not the chair of the Federal Reserve—is above the law. But this unprecedented action should be seen in the broader context of the administration's threats and ongoing pressure.”\nThe chair also claimed this was not about the renovation of Fed's buildings but was a “consequence of the Federal Reserve setting interest rates based on our best assessment of what will serve the public, rather than following the preferences of the president”.\nSpeaking to NBC News, President Donald Trump denied any involvement and said: “I do not know anything about it, but [Powell’s] certainly not very good at the Fed, and he is not very good at building buildings.”\nGold rallied following the news, reaching highs of $4,612, but settling at $4,605 at time of reporting, according to data from MarketWatch.\nSo far this year, gold prices have increased by 6% as investors have continued to look for safe havens during times of geopolitical upheaval.\nUS President Donald Trump has revealed plans to increase defence spending from $1trn to $1.5trn in 2027, to be paid for using the “tremendous income” from his tariff regime.\nTaking to social media on Wednesday (7 January), the president also issued a warning that he would “not permit” US defence companies to issue share buybacks or dividends until they addressed his concerns about production speed and product reliability.\nDespite this, the spending proposals were enough to see stocks in the defence sector rally, with BAE Systems opening the day more than 6% up while Lockheed Martin was similarly up by over 6% in pre-market trading at the time of reporting, according to data from MarketWatch.\nHowever, Russ Mould, investment director at AJ Bell, urged investors to watch the bond market closely as Trump’s proposals “could put even more pressure on the already sky-high US national debt”.\n“While Trump insists any extra spending would be paid for by tariffs, bond markets might not be as convinced. Equity markets are already looking a bit doubtful, with futures prices implying a red day for Wall Street,” Mould added.\nS&P 500 futures were trading 0.17% lower, while Dow Jones futures we"
            },
            {
                "title": "Pound Edges Higher as Fed Threat Hits Dollar - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/live-blog/2026-01-12/ftse-100-live-fed-powell-trump-dollar-pound-oil-gold-prices-what-s-moving-uk-markets-right-now-markets-today",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            },
            {
                "title": "Knights Group Shows Operational Momentum Within FTSE AIM Legal Services Sector - Kalkine Media",
                "source": "Kalkine Media",
                "url": "https://kalkinemedia.com/uk/stocks/industrial/knights-group-shows-operational-momentum-within-ftse-aim-legal-services-sector",
                "body": "Knights Group Shows Operational Momentum Within FTSE AIM Legal Services Sector\nTo keep reading, please log in to your account, create a free account, or simply fill out the form below.\nTo keep reading, please log in to your account, create a free account, or simply fill out the form below.\nDisclaimer\nThe content, including but not limited to any articles, news, quotes, information, data, text, reports, ratings, opinions, images, photos, graphics, graphs, charts, animations and video (Content) is a service of Kalkine Media Limited, Company No. 12643132 (Kalkine Media, we or us) and is available for personal and non-commercial use only. Kalkine Media is an appointed representative of Kalkine Limited, who is authorized and regulated by the FCA (FRN: 579414). The non-personalised advice given by Kalkine Media through its Content does not in any way endorse or recommend individuals, investment products or services suitable for your personal financial situation. You should discuss your portfolios and the risk tolerance level appropriate for your personal financial situation, with a qualified financial planner and/or adviser. No liability is accepted by Kalkine Media or Kalkine Limited and/or any of its employees/officers, for any investment loss, or any other loss or detriment experienced by you for any investment decision, whether consequent to, or in any way related to this Content, the provision of which is a regulated activity. Kalkine Media does not intend to exclude any liability which is not permitted to be excluded under applicable law or regulation. Some of the Content on this website may be sponsored/non-sponsored, as applicable. However, on the date of publication of any such Content, none of the employees and/or associates of Kalkine Media hold positions in any of the stocks covered by Kalkine Media through its Content. The views expressed in the Content by the guests, if any, are their own and do not necessarily represent the views or opinions of Kalkine Media. Some of the images/music/video that may be used in the Content are copyright to their respective owner(s). Kalkine Media does not claim ownership of any of the pictures displayed/music or video used in the Content unless stated otherwise. The images/music/video that may be used in the Content are taken from various sources on the internet, including paid subscriptions or are believed to be in public domain. We have used reasonable efforts to accredit the source wherever it was indicated or was found to be necessary."
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "254.500",
            "open": "25,255.540",
            "close": "25,462.640",
            "high": "25,465.140",
            "low": "25,210.640"
        },
        "market_summary": "### GER40 Market Briefing\n\n* **Key Drivers:** The index is driven by **risk-on sentiment**, improvement in global risk appetite, and **broader strength in US equities**.\n* **Price Action:** The GER40 has seen **six consecutive days of gains**, pushing into **record territory** above the key psychological level of **25,000**, indicating strong **bullish momentum**.\n* **Technical Outlook:** Immediate support is near the recent **breakout levels**, with resistance at **overbought territory** as indicated by the RSI, suggesting potential for **short-term profit-taking**.\n\n---\n**Overall Sentiment:** Positive ️",
        "source_articles": [
            {
                "title": "DAX 40 continues to push to new highs - Capital.com",
                "source": "Capital.com",
                "url": "https://capital.com/en-ae/analysis/dax-40-continues-to-push-to-new-highs",
                "body": "DAX 40 continues to push to new highs\nThe DAX 40 sees six consecutive days of gains as the index pushes to new highs driven by risk-on sentimentThe DAX 40 has extended its rally to six consecutive sessions, pushing firmly into record territory and highlighting strong underlying bullish momentum. This persistence suggests that investors have been willing to buy into strength rather than take profits, a sign of confidence supported by both global and local drivers. Technically, the index has benefitted from sustained dip-buying and a lack of meaningful downside catalysts, allowing the trend to remain intact.\nDrivers of the Rally\nA key driver of the rally has been the broader improvement in global risk appetite. Strength in US equities, optimism around growth themes such as AI, and fading fears of aggressive further monetary tightening have helped lift equity sentiment worldwide. As a cyclical and export-heavy index, the DAX tends to outperform in these risk-on environments, attracting inflows as investors rotate into economically sensitive markets.\nSector performance has also played an important role. Industrial heavyweights and defence-related stocks have delivered strong gains, providing significant support to the index given their large weightings. This has allowed the DAX to advance even as domestic German economic data remains mixed. The index’s global revenue exposure means earnings prospects are more closely tied to international demand than to Germany’s near-term growth outlook alone.\nExpectations around European Central Bank policy have further underpinned the move. Softer inflation dynamics in the euro area and the perception that the ECB has no reason to start tightening again have helped support equity valuations, particularly for rate-sensitive sectors. Compared with the US, European policy expectations appear more benign, which has encouraged relative inflows into European equities, including the DAX.\nGeopolitical Risks\nDespite the positive momentum, geopolitical tensions present a meaningful risk premium that could temper sentiment. Iran is experiencing intense internal unrest sparked by its deepening economic crisis, steep currency depreciation, and nationwide protests, which have now spread across provinces and drawn heavy crackdowns by authorities.\nWhile the DAX’s rally reflects optimism and technical strength, geopolitical risk, especially as it relates to Iran’s unrest and US-Iran tensions, represents a latent headwind that could dampen sentiment if events escalate further. Risk-off impulses triggered by sharp geopolitical shocks typically benefit safe havens (bonds, gold) and can weigh on equities, particularly cyclicals and export-exposed indices like the DAX. In the near term, markets may remain resilient as long as geopolitical developments stay contained, but a sudden spike in tensions, military engagement, or significant disruptions to energy supply routes could prompt a swift reappraisal of risk assets.\nWhat to watch next\nWhile momentum remains strong, the rally is not without risks. After several consecutive gains, the index is more vulnerable to short-term profit-taking, especially if incoming macro data disappoints or if global risk sentiment deteriorates. In the near term, the sustainability of the move will depend on whether supportive global conditions persist and whether buyers continue to defend recent breakout levels. A period of consolidation would not be unusual after such a run, but the broader trend remains constructive as long as risk appetite holds.\nOn the daily chart we can see that the DAX 40 has broken above the range that held throughout most of 2025, with the move above 25,000 a key psychological milestone. However, the RSI has started to venture into overbought territory for the first time since February last year, which could attract some selling momentum.\nDAX 40 daily chart\nPast performance is not a reliable indicator of future results."
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "99.120",
            "open": "25,776.130",
            "close": "25,742.380",
            "high": "25,776.250",
            "low": "25,677.130"
        },
        "market_summary": "### NDX100 Market Briefing\n* **Key Drivers:** The **NDX100** is experiencing a wait-and-see mode ahead of the December consumer price index release, with investors anticipating **steady inflation** and **two quarter-point cuts in 2026**. \n* **Price Action:** The **NDX100** futures slipped **0.3%**, while the **Nasdaq Composite** closed at **23,733.90**, showing **bullish momentum** after rebounding from early slides.\n* **Technical Outlook:** Immediate support and resistance levels for the **NDX100** are not explicitly stated in the articles, but the **Nasdaq Composite**'s ability to close at a high of **23,733.90** indicates a strong **bullish** trend, with **technological stocks** outperforming.\n\n--- \n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Stock market today: Dow, S&P 500, Nasdaq futures slide after Fed drama as CPI inflation check looms - Yahoo! Finance Canada",
                "source": "Yahoo! Finance Canada",
                "url": "https://ca.finance.yahoo.com/news/stock-market-today-dow-sp-500-nasdaq-futures-slide-after-fed-drama-as-cpi-inflation-check-looms-234952493.html",
                "body": "Stock market today: Dow, S&P 500, Nasdaq futures slide after Fed drama as CPI inflation check looms\nUS stock futures were little changed Monday night as investors braced for a pivotal inflation reading and the start of earnings season for major banks.\nDow Jones Industrial Average futures (YM=F) and contracts on the S&P 500 (ES=F) inched down 0.1% While futures on the Nasdaq 100 (NQ=F) slipped 0.3%.\n(YM=F)\nMarkets are largely in wait-and-see mode ahead of Tuesday’s release of the December consumer price index, which is expected to offer a clearer snapshot of inflation trends after reporting disruptions tied to last year's record-length government shutdown. Analysts surveyed by Bloomberg expect inflation to have remained steady last month.\nThe data takes on added importance after December’s jobs report pointed to a cooling labor market. Futures markets are currently pricing in two quarter-point cuts in 2026, with the first expected in June, according to CME Group’s FedWatch tool.\nDuring Monday’s regular session, stocks pushed to new highs. The S&P 500 (^GSPC) and Dow Jones Industrial Average (^DJI) both notched fresh records, as investors largely shrugged off headlines surrounding a Justice Department criminal investigation involving Federal Reserve Chair Jerome Powell.\nPowell, whose term expires in May, characterized the probe as political pressure from President Trump, who has repeatedly called for aggressive rate cuts. Markets have largely dismissed those efforts, noting the Fed already lowered interest rates three times in late 2025 to support economic growth.\nStill, bank stocks faced some pressure after Trump proposed a one-year cap on credit card interest rates at 10%. Separately, the president said Monday evening that countries continuing business with Iran would face a 25% US tariff, adding another layer of geopolitical uncertainty to the market backdrop.\nAttention is looking ahead to corporate earnings, with JPMorgan Chase (JPM) set to report fourth-quarter results before Tuesday’s opening bell. The report kicks off a busy stretch for big banks on Wall Street, with Bank of America (BAC), Citigroup (C), and Morgan Stanley (MS) scheduled to follow later in the week.\nLIVE 2 updates"
            },
            {
                "title": "S&P 500, Dow climb to closing records as traders look past Fed independence risk: Live updates - CNBC",
                "source": "CNBC",
                "url": "https://www.cnbc.com/2026/01/11/stock-market-today-live-updates.html",
                "body": "Stocks rallied off their session lows, with the S&P 500 and Dow Jones Industrial Average hitting new all-time highs as investors shook off the Department of Justice opening a criminal investigation into Federal Reserve Chair Jerome Powell.\nThe S&P 500 rose 0.16% to end at 6,977.27, while the Dow Jones Industrial Average ticked up 86.13 points, or 0.17%, and settled at 49,590.20. Both indexes touched fresh all-time intraday highs and closed at records. The Nasdaq Composite was up 0.26% and closed at 23,733.90.\nThe major averages rebounded off their worst levels of the session, helped by gains in Walmart and some technology stocks. The Dow was down nearly 500 points, and the S&P 500 was off 0.5% at session lows. Alongside the S&P 500 and the 30-stock Dow, the Russell 2000 index notched a fresh all-time high as well.\nTrump's call to cap credit card rates for one year at 10% was also causing some market indigestion to start the week. Critics fear Trump's plan to aid affordability would backfire and restrict lending, hurting consumers — along with bank profitability. Bank stocks were the hardest hit Monday, with Citigroup down about 3%. JPMorgan and Bank of America were off by more than 1%. Capital One shares slid 6%.\n\"It doesn't matter that much, in some sense,\" Rob Williams, chief investment strategist at Sage, told CNBC. \"I think it's some noise, and it's not even pushing rates around that much ... the focus is going to be on data,\" he continued, pointing to the upcoming release of the consumer price index for December on Tuesday.\nThe S&P 500 clawed its way back into the green after starting off the session lower. U.S. equities were under pressure following Powell's confirmation in an unusual direct video statement Sunday evening that federal prosecutors have opened a criminal investigation related to his Senate Banking Committee testimony on the renovation of Fed office buildings. Powell said the investigation was another attempt by Trump to influence the central bank's monetary policy and he would not bow to the pressure. His term as chair is up in May.\nThe stock market in 2025 largely ignored Trump's attempts to pressure the Fed as the central bank went on anyway to cut rates three times as inflation stabilized. But the Fed is largely expected to hold off on further cuts when it next meets later this month as it waits to see how the inflation picture and economy unfold in the new year. Trump has made clear he would like to see the Fed continue to bring rates lower.\n\"The impact of Chairman Powell being under investigation is likely a long-term impact, meaning it's not going to change interest rates in the near term; it's not going to change inflation in the near term,\" Jim Lebenthal, chief markets strategist at Cerity Partners, said to CNBC.\nWith the anticipation of \"pretty good\" earnings this week and CPI possibly coming in \"well below 3%,\" not to mention an economy that's \"growing rapidly,\" Lebenthal said that there are just \"too many good things\" in the short term. That's what's keeping the broader market higher, even if the investigation spells bad news in the long term, he said.\n\"Anybody who is on the Federal Open Market Committee understands that if they don't do what the president wants, if they don't lower rates, they may be fired the way Lisa Cook has been at least theoretically fired or they may be the subject of an investigation the way Chairman Powell is,\" Lebenthal continued. \"For the new chairman and for anyone on the board, they're going to be more inclined to lower interest rates. That will eventually cause inflation, and it will eventually cause higher long-term interest rates, but those effects are not going to be felt until the end of the year at the earliest.\"\nGold futures, which are seen as a hedge against diminishing Fed independence, jumped 2.5% and posted a record close of $4,614.7. Investors fear a political central bank would be hesitant to snuff out resurgent inflation.\nWalmart gained 3% on enthusias"
            },
            {
                "title": "S&P 500, Dow Build on Records as Investors Shake Off Fed Worries - Barron's",
                "source": "Barron's",
                "url": "https://www.barrons.com/livecoverage/stock-market-news-today-011226?gaa_at=eafs&gaa_n=AWEtsqf8yUIuDUEOKdCs0cVFWVJKHzawqCrC9ziBEhhGymhW9MBtoNtuAkYJ&gaa_ts=6965e37d&gaa_sig=lvhqTZeQ8YeJyx_Nj1Sn2iYGJFcH-DN89gvl35LLNtAMNx4yy9Oft7FNFCUZi07Sk1Chbt_Ba7ildo7str5vJw%3D%3D",
                "body": "CONCLUDED\nS&P 500, Dow Build on Records as Investors Shake Off Fed Worries\nThe S&P 500 and Nasdaq are rising.\nLast Updated:\nJan. 12, 2026 at 5:39 PM ET\nKey Events\n14 hours ago\n20 hours ago\n20 hours ago\nPinned Post\nThe stock market rebounded from an early slide on Monday after some Republican lawmakers and former central bank and Treasury officials seemed to rally around Federal Reserve Chairman Jerome Powell.\nThe Dow Jones Industrial Average rose 86 points, or 0.2%. The S&P 500 was up 0.2%. The Nasdaq Composite was up 0.3%. The Dow and S&P each built on their closing highs from Friday.\nThe day began with selling in U.S. stocks and bonds, as well as the dollar, after Powell said on Sunday that the Fed received grand jury subpoenas and a threat of criminal indictment from the Justice Department. Market commentators, former Fed chairs and Treasury secretaries, and even some Republicans in Congress criticized the move in public statements.\n“Equities rebounded hard after the early ‘sell America’ trade head fake when we walked in this morning,” wrote Mizuho’s Daniel O’Regan. \"Tech is outperforming again led by Semi’s and pockets of the AI trade.\"\nConsumer staples, materials, industrials, and tech led the way. Financials struggled in the face of President Donald Trump’s demand for a one-year 10% cap on credit card interest rates. Synchrony Financial, Capital One, and American Express were among the S&P 500’s worst performing stocks. JPMorgan Chase also dragged on the Dow.\nThe Dow was down 1% at its low, making this the largest reversal from an intraday low since Oct. 14, according to Dow Jones Market Data."
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "74.760",
            "open": "6,963.620",
            "close": "6,970.900",
            "high": "6,985.410",
            "low": "6,910.650"
        },
        "market_summary": "### SPX500 Market Briefing\n* **Key Drivers:** None of the provided articles directly relate to the **SPX500** or offer insights into its current market trends. However, general economic and political instability, as hinted at by the discussions around health policies and international legal cases, can influence market sentiment. \n* **Price Action:** Without direct information on the **SPX500** from the provided articles, we cannot accurately describe its current price action. Typically, the index's performance is influenced by a broad range of economic, political, and social factors.\n* **Technical Outlook:** Given the lack of specific data on the **SPX500** in the articles, a technical outlook cannot be accurately provided. Usually, this would involve discussing trends, support and resistance levels, and other technical indicators relevant to the index's recent movement.\n\n--- \n**Overall Sentiment:** Neutral",
        "source_articles": [
            {
                "title": "RFK Jr.'s MAHA movement has picked up steam in statehouses. Here's what to expect in 2026. - CBS News",
                "source": "CBS News",
                "url": "https://www.cbsnews.com/news/rfk-jr-maha-health-states/",
                "body": "RFK Jr.'s MAHA movement has picked up steam in statehouses. Here's what to expect in 2026.\nWhen one of Adam Burkhammer's foster children struggled with hyperactivity, the West Virginia legislator and his wife decided to alter their diet and remove any foods that contained synthetic dyes.\n\"We saw a turnaround in his behavior, and our other children,\" said Burkhammer, who has adopted or fostered 10 kids with his wife. \"There are real impacts on real kids.\"\nThe Republican turned his experience into legislation, sponsoring a bill to ban seven dyes from food sold in the state. It became law in March, making West Virginia the first state to institute such a ban from all food products.\nThe bill was among a slew of state efforts to regulate synthetic dyes. In 2025, roughly 75 bills aimed at food dyes were introduced in 37 states, according to the National Conference of State Legislatures.\nChemical dyes and nutrition are just part of the broader \"Make America Healthy Again\" agenda. Promoted by Health and Human Services Secretary Robert F. Kennedy Jr., MAHA ideas have made their deepest inroads at the state level, with strong support from Republicans — and in some places, from Democrats. The $50 billion Rural Health Transformation Program — created last year as part of the GOP's One Big Beautiful Bill Act to expand health care access in rural areas — offers incentives to states that implement MAHA policies.\nFederal and state officials are seeking a broad swath of health policy changes, including rolling back routine vaccinations and expanding the use of drugs such as ivermectin for treatments beyond their approved use. State lawmakers have introduced dozens of bills targeting vaccines, fluoridated water, and PFAS, a group of compounds known as \"forever chemicals\" that have been linked to cancer and other health problems.\nIn addition to West Virginia, six other states have targeted food dyes with new laws or executive orders, requiring warning labels on food with certain dyes or banning the sale of such products in schools. California has had a law regulating food dyes since 2023.\nMost synthetic dyes used to color food have been around for decades. Some clinical studies have found a link between their use and hyperactivity in children. And in early 2025, in the last days of President Joe Biden's term, the Food and Drug Administration outlawed the use of a dye known as Red No. 3.\nMajor food companies including Nestle, Hershey, and PepsiCo have gotten on board, pledging to eliminate at least some color additives from food products over the next year or two.\n\"We anticipate that the momentum we saw in 2025 will continue into 2026, with a particular focus on ingredient safety and transparency,\" said John Hewitt, the senior vice president of state affairs for the Consumer Brands Association, a trade group for food manufacturers.\nThis past summer, the group called on its members to voluntarily eliminate federally certified artificial dyes from their products by the end of 2027.\n\"The state laws are really what's motivating companies to get rid of dyes,\" said Jensen Jose, regulatory counsel for the Center for Science in the Public Interest, a nonprofit health advocacy group.\nAndy Baker-White, the senior director of state health policy for the Association of State and Territorial Health Officials, said the bipartisan support for bills targeting food dyes and ultraprocessed food struck him as unusual. Several red states have proposed legislation modeled on California's 2023 law, which bans four food additives.\n\"It's not very often you see states like California and West Virginia at the forefront of an issue together,\" Baker-White said.\nAlthough Democrats have joined Republicans in some of these efforts, Kennedy continues to drive the agenda. He appeared with Texas officials when the state enacted a package of food-related laws, including one that bars individuals who participate in the Supplemental Nutrition Assistance Program — SNAP, or food stamp"
            },
            {
                "title": "Parents on RFK Jr.’s advice on sweets: ‘Completely unrealistic’ - Politico",
                "source": "Politico",
                "url": "https://www.politico.com/news/2026/01/10/rfk-sugar-dietary-guidelines-children-00720472",
                "body": "Parents on RFK Jr.’s advice on sweets: ‘Completely unrealistic’\nThe health secretary’s new dietary guidelines tell parents to cut the added sugar until their kids turn 11.\nThe new guidelines are the government’s declaration of war on added sugar, Kennedy said this week. Brandon Bell | Getty Images\nNew dietary guidelines from the Trump administration have some big asks of Americans, from prioritizing protein to avoiding highly processed food. The most onerous directive, though, was probably for moms and dads.\nHealth Secretary Robert F. Kennedy Jr. and Agriculture Secretary Brooke Rollins want them to stop giving their kids sugar until they turn 11.\nThat, says Keri Rodrigues, a mother of five boys and the president of the National Parents Union, is “completely unrealistic.” Her group, which has been critical of other administration policies, represents 1.7 million parents.\n“Sugar is everywhere,” she said. “It’s in bread, it’s in all kinds of other things,” she said.\nNo one is saying kids can’t eat foods that contain natural sugar, such as bananas and fresh mango, but avoiding added sugar — which most everyone agrees should be limited — would require incredible diligence. The old rules, which most parents failed to abide by, only asked them to hold the line till their kids turned 2.\nThe new guidance, strictly followed, would mean a wholesale overhaul of most kids’ diets and the traditions of childhood. There’d be no more Halloween candy, ice cream cones at the county fair, Cracker Jack at the ballgame or even a peanut-butter and jelly sandwich.\nThe guidelines are the government’s declaration of war on added sugar, Kennedy said when announcing the new recommendations Wednesday, pointing to the high rates of obesity among American children. Approximately 1 in 5 American children and teens are obese, according to 2024 data from the Centers for Disease Control and Prevention.\nThe new guidelines, spearheaded by Kennedy and Rollins, say that no amount of added sugar is recommended or considered part of a healthy diet.\nThe American Academy of Pediatrics, the American Medical Association and other health groups have praised the guidelines’ recommendations for Americans to avoid added sugar.\nThe new guidelines tell parents to avoid any added sugar for children 4 and under and stress that “no amount of sugar is recommended” for kids between 5 and 10. The previous guidelines, in addition to asking parents to avoid giving kids sugar till 2, recommended that added sugars remain under 10 percent of daily calories for kids older than that.\nConsuming too much added sugar is linked to conditions such as weight gain and obesity, type 2 diabetes, and heart disease, according to the Centers for Disease Control and Prevention, which in 2024 pointed to a 2021 survey showing that a majority of one-to-five year olds had consumed at least one sugary drink in the week prior to the survey.\nA Department of Health and Human Services official said highly processed foods, which often contain added sugar, trigger something akin to addiction, and early exposure can make it difficult to resist eating too much sugar later in life. POLITICO granted the official anonymity because they were not allowed to speak publicly.\nHHS spokesperson Andrew Nixon said the dietary guidelines “are a guideline and recommendation for Americans.” He stressed that they were only a recommendation.\nDietary guidelines affect how federal programs like school meals are run, but Americans have never faithfully adhered to them.\nTina Descovich, a mother of five and the co-founder of Moms for Liberty, a conservative parents’ rights organization, said she thought it would be hard to comply with the new guidance once children start to attend school and play dates.\nDescovich recalled her time as a Brevard County, Fla., school board member between 2016 and 2020. Parents often complained about sugar-laden breakfast foods the kids were served, she said, adding that she agreed that getting such foods "
            },
            {
                "title": "Landmark Myanmar Rohingya genocide case to open at U.N.'s top court - NBC News",
                "source": "NBC News",
                "url": "https://www.nbcnews.com/world/asia/landmark-myanmar-rohingya-genocide-case-open-uns-top-court-rcna253544",
                "body": "THE HAGUE, Netherlands — A landmark case accusing Myanmar of committing genocide against minority Muslim Rohingya will open at the United Nations’ top court on Monday.\nIt will be the first genocide case the International Court of Justice (ICJ) will hear in full in over a decade. The outcome will have repercussions beyond Myanmar, most likely affecting South Africa’s genocide case at the ICJ against Israel over the war in Gaza.\nMyanmar has denied accusations of genocide.\n“The case is likely to set critical precedents for how genocide is defined and how it can be proven, and how violations can be remedied,” Nicholas Koumjian, head of the U.N.’s Independent Investigative Mechanism for Myanmar, told Reuters.\nThe predominantly Muslim West African country of Gambia filed the case at the ICJ — also known as the World Court — in 2019, accusing Myanmar of committing genocide against the Rohingya, a mainly Muslim minority in the remote western state of Rakhine.\nMyanmar’s armed forces launched an offensive in 2017 that forced at least 730,000 Rohingya from their homes and into neighboring Bangladesh, where they recounted killings, mass rape and arson.\nA U.N. fact-finding mission concluded the 2017 military offensive had included “genocidal acts.”\nMyanmar authorities rejected that report, saying its military offensive was a legitimate counterterrorism campaign in response to attacks by Muslim militants.\nIn 2019 preliminary hearings in the ICJ case, Myanmar’s leader at the time, Aung San Suu Kyi, rejected Gambia’s accusations of genocide as “incomplete and misleading.”\nThe hearings at the ICJ will mark the first time that Rohingya victims of the alleged atrocities will be heard by an international court, although those sessions will be closed to the public and the media for sensitivity and privacy reasons.\nThe hearings start at 10 a.m. (4 a.m. ET) on Monday and will span three weeks.\nMyanmar has been in further turmoil since 2021, when the military toppled the elected civilian government and violently suppressed pro-democracy protests, setting off a nationwide armed rebellion.\nThe country is holding phased elections that have been criticized by the United Nations, some Western countries and human rights groups as neither free nor fair."
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "606.250",
            "open": "53,544.090",
            "close": "54,040.020",
            "high": "54,135.340",
            "low": "53,529.090"
        },
        "market_summary": "### JPN225 Market Briefing\n\n* **Key Drivers:** Speculation of a snap election in Japan, led by Prime Minister Sanae Takaichi, is fueling **bullish** momentum, alongside a **weak yen** which is boosting exporters.\n* **Price Action:** The Nikkei 225 index broke a new record, reaching **53,814.79**, showing significant **upward momentum** with a **3.6%** jump.\n* **Technical Outlook:** Immediate support is near the previous record level at **53,000**, with resistance at the newly set record **53,814.79**.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Japan’s Stocks Poised to Jump on Weak Yen, Election Expectations - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/articles/2026-01-12/japan-s-stocks-poised-to-jump-on-weak-yen-election-expectations",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            },
            {
                "title": "Nikkei 225 hits new record after reports of possible snap election in Japan - The Japan Times",
                "source": "The Japan Times",
                "url": "https://www.japantimes.co.jp/business/2026/01/13/economy/nikkei-snap-record/",
                "body": "Tokyo's Nikkei 225 stock index broke 53,000 and hit a new record at the open on Tuesday following unconfirmed reports of an election being called.\nThe benchmark index opened in record territory and rose to 53,814.79 ten minutes after the start of trade.\nNikkei 225 index futures rallied over the three-day holiday weekend after the Yomiuri Shimbun reported Friday night that Prime Minister Sanae Takaichi might dissolve the Lower House as soon as this month, which means a snap election might take place in early February.\nTakaichi, the first female prime minister in Japanese history and an advocate of expansionary fiscal policy, has been enjoying a high approval rating. A snap election might strengthen her political position and allow her to govern more freely.\nBonds fell, with the yield on 10-year Japanese government bonds hitting 2.135%, and the yen weakened into ¥158-to-the-dollar territory following the reports of a possible election.\nFinance Minister Satsuki Katayama, who met with U.S. Treasury Secretary Scott Bessent in Washington over the weekend, said she told Bessent that she was \"concerned about one-sided yen moves” and that Bessent “shared that understanding.”\nKatayama had previously warned of currency intervention, saying that the financial authorities have a “free hand” to take action against excessive currency moves."
            },
            {
                "title": "Nikkei hits record as weak yen and election speculation fuel rally - investingLive",
                "source": "investingLive",
                "url": "https://investinglive.com/stock-market-update/nikkei-hits-record-as-weak-yen-and-election-speculation-fuel-rally-20260113/",
                "body": "Summary:\nNikkei and Topix surge to record highs\nMarkets play catch-up with Wall Street rally\nEarly election speculation boosts fiscal hopes\nWeak yen lifts exporters; Katayama comments fade\nGlobal risk appetite outweighs Fed concerns\nJapanese equities surged to record highs on Tuesday as markets played catch-up with Wall Street’s recent rally and investors leaned into a familiar combination of yen weakness, global risk appetite and rising expectations of fiscal stimulus.\nThe Nikkei 225 jumped as much as 3.6% to a record 53,814, while the broader Topix climbed up to 2.4% to a fresh peak. The move followed a public holiday in Japan, with local investors reacting to new all-time highs in the S&P 500 and Dow Jones Industrial Average, where technology stocks led gains.\nSentiment was also buoyed by speculation that Prime Minister Sanae Takaichi may call an early election in the coming weeks to strengthen her coalition’s parliamentary position. Local media reported discussions within the ruling bloc, and coalition partner Ishin said Takaichi had met party leaders last week. Markets widely interpret the prospect of an early election as a signal for more proactive fiscal spending.\nCurrency dynamics reinforced the equity rally. The yen remained sharply weaker than at the previous Tokyo close, boosting the overseas earnings outlook for Japan’s export-heavy corporates. Earlier verbal intervention from Finance Minister Satsuki Katayama, who flagged concerns over one-sided currency moves, had little lasting impact on FX markets, leaving USD/JPY elevated and supportive for equities.\nJapanese stocks also appeared largely unfazed by political pressure on the U.S. Federal Reserve, with investors following global peers in brushing aside concerns over the Justice Department’s investigation into Fed Chair Jerome Powell.\nOverall, the session underscored how a weak yen continues to trump intervention rhetoric, amplifying global risk-on momentum and reinforcing Japan equities’ leadership at the start of the year.\n---\nUSD/JPY rising still:"
            }
        ]
    }
]