[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "39.610",
            "open": "3,734.880",
            "close": "3,749.180",
            "high": "3,761.700",
            "low": "3,722.090"
        },
        "market_summary": "Gold is experiencing a historic rally, driven by key U.S. inflation data meeting expectations and the Federal Reserve's pivot to interest rate cuts, which creates a favorable environment of negative real interest rates. This surge is further supported by robust demand from global central banks diversifying their reserves. However, the impact on related assets like the Canadian dollar is currently being offset by a stronger U.S. monetary policy outlook.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Gold price firmer after key U.S. inflation data as expected - KITCO",
                "source": "KITCO",
                "url": "https://www.kitco.com/news/article/2025-09-26/gold-price-firmer-after-key-us-inflation-data-expected",
                "body": "Jim Wyckoff\nJim Wyckoff has spent over 25 years involved with the stock, financial and commodity markets. He was a financial journalist with the FWN newswire service for many years, including stints as a reporter on the rough-and-tumble commodity futures trading floors in Chicago and New York. As a journalist, he has covered every futures market traded in the U.S., at one time or another.\nJim is the proprietor of the \"Jim Wyckoff on the Markets\" analytical, educational and trading advisory service. Jim also worked as a technical analyst for Dow Jones Newswires and as the senior market analyst with TraderPlanet.com. Jim is also a consultant with the highly respected \"Pro Farmer\" agricultural advisory service. Jim was also the head equities analyst at CapitalistEdge.com. He received his degree from Iowa State University in Ames, Iowa, where he studied journalism and economics.\nFollow Jim daily on Kitco.com as he provides both AM and PM roundups and a daily Technical Special. 1 877 963-NEWS jwyckoff at kitco.com"
            },
            {
                "title": "Gold Targets $3,800: A Deep Dive into Inflation, Fed Policy, and Market Dynamics - FinancialContent",
                "source": "FinancialContent",
                "url": "https://markets.financialcontent.com/stocks/article/marketminute-2025-9-26-gold-targets-3800-a-deep-dive-into-inflation-fed-policy-and-market-dynamics",
                "body": "Gold, the perennial safe-haven asset, is currently experiencing a historic rally, with its price firmly set on a trajectory towards the $3,800 per ounce mark. This unprecedented surge, unfolding against a backdrop of persistent US inflation and the Federal Reserve's pivot towards interest rate cuts, is reshaping financial market expectations and influencing investment strategies globally. As of September 26, 2025, the precious metal is not just reflecting market anxieties but actively signaling a significant shift in the global economic landscape.\nThe immediate implications of this gold surge are profound. Investors are increasingly flocking to gold as a hedge against currency debasement and economic uncertainty, driving robust demand from both institutional and retail segments. The rally underscores a growing skepticism about the long-term stability of fiat currencies, particularly the US dollar, and highlights gold's enduring appeal as a store of value in turbulent times. This movement is not merely speculative; it is rooted in fundamental economic shifts and a re-evaluation of risk by major financial players.\nThe Unfolding Gold Rush: Inflation, Rate Cuts, and Geopolitical Undercurrents\nGold's journey towards $3,800 has been marked by a series of pivotal events and reactions. Spot gold has consistently traded above $3,750 per ounce, reaching an all-time record of $3,791 per ounce on September 23, 2025. This remarkable ascent represents an 11.25% increase over the past month and an astounding 42.20% gain year-over-year.\nThe rally gained significant momentum throughout 2025, breaking past the $3,500 threshold earlier in the year. A key moment occurred on September 18, 2025, when the Federal Reserve implemented its first interest rate cut of the year. Gold initially surged to a new high of $3,707.40 per ounce immediately after the announcement. However, a less dovish-than-expected outlook from Fed Chair Jerome Powell led to a swift, albeit temporary, pullback of nearly $50. The broader bullish trend quickly reasserted itself, culminating in the new historic peak just days later.\nThe persistent upward pressure on US inflation, particularly the Personal Consumption Expenditures (PCE) price index, has been a critical catalyst. The core PCE index, excluding volatile food and energy components, reported a 2.9% year-over-year increase in August 2025. This marks the 19th consecutive month that core PCE inflation has remained above the Fed's 2% target, firmly entrenching gold's role as an inflation hedge. Historical data shows gold performing exceptionally well when US inflation exceeds 3%, delivering average annual returns of 14.9% during such periods.\nThe Federal Reserve (Fed) itself is a central player in this drama. On September 17, 2025, the Fed cut the federal funds rate by 25 basis points to a target range of 4.00%-4.25%. This \"risk-management cut,\" as described by Chair Powell, was in response to a weakening labor market. Crucially, the Fed's latest Summary of Economic Projections (the \"dot plot\"), released in September 2025, indicated that Federal Open Market Committee (FOMC) members anticipate two additional 25-basis-point rate cuts before the end of 2025, likely in October and December. These projections, coupled with elevated PCE inflation forecasts (3% for PCE and 3.1% for core PCE in 2025), signal an environment of negative real interest rates, a highly favorable condition for gold.\nBeyond monetary policy, global central banks have emerged as formidable drivers of gold demand. Over the past three years (2022-2024), central banks engaged in an unprecedented gold-buying spree, acquiring over 1,000 metric tons annually, a trend that continued into 2025. This vigorous accumulation, particularly by emerging market central banks like the People's Bank of China and the National Bank of Poland, is motivated by a desire to diversify reserves away from the US dollar, hedge against geopolitical risks, and protect against inflation. "
            },
            {
                "title": "Loonie not yet glittering, despite gold surge - Investment Executive",
                "source": "Investment Executive",
                "url": "https://www.investmentexecutive.com/news/research-and-markets/loonie-not-yet-glittering-despite-gold-surge/",
                "body": "Gold prices are soaring, and while that provides a boost to the value of the Canadian dollar, that support is being outweighed by the monetary policy picture, which favours the U.S. greenback, says Desjardins Group.\nIn a report on Friday, Desjardins said its analysis shows gold is becoming an increasingly important driver for the loonie, as Canada is a major producer and exporter of the precious metal, which has seen prices rise 43% so far this year.\n“Given this exposure, it would be reasonable to expect trade and investment flows to become increasingly supportive of the Canadian dollar,” it said.\nFor now, monetary policy remains a bigger factor for the loonie’s value against the U.S. dollar.\n“Gold prices currently explain about 12% of the weekly variance in USD/CAD — far more than oil prices, but a distant runner-up to monetary policy, which explains roughly 25%,” it said. “Put another way, the loonie isn’t ignoring gold prices, but their impact is being offset by interest rate expectations.”\nThe monetary policy picture currently favours the U.S. dollar, it noted.\n“While there are risks on both sides, we believe they are skewed towards the Fed doing a little less and the [Bank of Canada] doing a little more than the market anticipates. This should keep the loonie on the back foot for now,” the report said.\nLooking ahead, commodity prices may become a stronger support for the loonie in 2026, the report suggested.\n“A more broad-based rise in Canada’s terms of trade, including higher energy prices, may help revive the loonie’s ‘commodity currency’ status,” it said. “That outcome would also depend on whether higher prices and shifts in government policy stimulate domestic production — either through new capital investment or the activation of idle capacity.”"
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.155",
            "open": "68.753",
            "close": "69.241",
            "high": "69.318",
            "low": "68.163"
        },
        "market_summary": "Geopolitical risks, particularly Ukrainian drone strikes on Russian refineries and export infrastructure, are constraining global supply and supporting oil prices despite theoretical OPEC+ output increases. Strong demand, inventory draws, and ongoing Middle East tensions are contributing to market tightness and price volatility. The physical market is showing signs of strain, evidenced by regional fuel shortages and diverging benchmark prices.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Forget OPEC Warnings The Real Oil Shock Is Happening Inside Russia - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/forget-opec-warnings-real-oil-190000048.html",
                "body": "While the world is watching the UN General Assembly discussions on Gaza-Israel, hybrid warfare in Europe (drones) and Trump, global oil markets are showing increased instability, as Ukrainian drones are destroying key oil and gas infrastructure inside of Russia. Over the last few weeks, a tsunami of reports has been published about a possible oil glut in the coming months or years, supported by OPEC-8 decisions to increase the export ceiling. However, reality in the market shows a different picture. Until now, no real crude oil price crash is showing; global prices are even very stable, while fundamentals in the markets are increasingly influenced by external geopolitical threats, not only Russian aggression towards NATO, or a heating up of the East Med (Turkey, Israel, Gaza Flotilla), but also increasingly Ukraine’s effective strikes on Russia’s infrastructure.\nPowered by Money.com - Yahoo may earn commission from the links above.\nAlmost daily, reports are showcasing the strategic success of Ukraine's campaign, which, in addition to its battlefield tactics, has effectively executed precision strikes and drone attacks on Russian oil refineries, fuel depots, and related logistics. These intentional strikes have targeted the Kremlin’s economic lifelines, leading some to assert that the most effective sanctions currently hitting Russia’s war chest or Putin’s lifeline are the Ukrainian drones.\nWhile most energy analysts are still obsessed with OPEC, US shale, or Israel’s operations in Gaza, Russia, not only a pivotal player inside the so-called OPEC+ group, but also one of the world’s leading oil and gas exporters, is looking at a very dire situation. Ukrainian drones are not only degrading Moscow’s ability to turn Russian crude into exportable petroleum products (diesel, gasoline, kerosene) but also forcing Russian refineries to go offline. Both issues are hitting Putin’s war economy very hard, as they decrease options to monetize its hydrocarbon potential (exports) and also force higher domestic price settings for Russian citizens and external parties. Lately, in a move to squeeze Russia really, Ukraine has increased its attacks on Russian oil ports, in a move to hit export potential, while in the end forcing Russian crude oil production to be shut in.\nThe current situation, combined with increased geopolitical risks and strong global demand, suggests a potential shift towards a bullish environment. Even OPEC+'s theoretical production and export increases may not be enough to mitigate this shift, or in some cases, may not be sufficient at all. This potential for a bullish market should prompt all market participants to adopt preparedness and strategic planning.\nThe latest reports from Russia indicate that Ukrainian drones have hit dozens of Russian fuel facilities, while at the same time, maritime drones and missiles are being used. The potential of Ukraine’s latest military addition, the Flamingo Missile, could be a watershed development. This missile can reach much further into Russian territory with a larger payload, potentially causing significant damage to key oil and gas infrastructure. Western and Russian outlets have also indicated that over a million barrels per day of refining throughput is being hit or removed from the market, as major refineries and pipeline centers are being shut down or taken offline. For global oil markets, Russia’s exports are significant, as it is a leading exporter of diesel, fuel oil, and kerosene. The potential impact of the Flamingo Missile, combined with the ongoing drone attacks, underscores the evolving nature of the geopolitical risks in the oil market.\nWhile global markets are being hit increasingly, even if additional Russian crude is exported, the situation has become very dire. Independent reports from Russia indicate severe fuel shortages in several regions of the country, not only impacting the war economy sectors (manufacturing, defense) but also increasing the potential for inter"
            },
            {
                "title": "WTI (CL=F) and Brent (BZ=F) Face Volatility as Geopolitical Shocks Drive Oil to Weekly Gains - tradingnews.com",
                "source": "tradingnews.com",
                "url": "https://www.tradingnews.com/news/oil-prices-wti-jumps-to-65-usd-brent-70-usd-opec-supply-moves",
                "body": "Oil Prices Forecast - WTI Jumps to $65.72 and Brent Tops $70 as OPEC+ Supply Moves and Middle East Conflict Shake Oil Markets\nCrude posts biggest weekly rally since the Israel–Iran war; U.S. gasoline futures jump 1.62% on inventory draws, Russian refinery hits fuel diesel shortages, while Iraq readies Kurdistan export restart and traders eye $66.50 WTI resistance and $72 Brent breakout | That's TradingNEWS\nWTI (CL=F) and Brent (BZ=F) Face Volatility as Geopolitical Shocks Drive Oil to Weekly Gains\nCrude oil prices are moving sharply this week with WTI (CL=F) trading at $65.72, up 1.14%, while Brent (BZ=F) holds at $70.07, gaining 0.94%. This rebound puts the market on track for its steepest weekly advance since the Israel–Iran war began, with traders pricing in heightened geopolitical risks and supply chain uncertainty. Louisiana Light jumped 2.50% to $67.78, while Bonny Light from Nigeria slumped nearly 3% to $78.62, highlighting fragmentation across benchmarks as disruptions in refining and shipping routes continue to ripple through global trade flows.\nMiddle East Conflict and Tariff Fallout Reshape Supply Outlook\nThe Israel–Iran tensions are not only escalating security risks across vital shipping lanes but also injecting fear premiums into Brent, the seaborne benchmark. On top of that, U.S. tariffs announced by President Trump—ranging from 25% on heavy trucks to 100% on pharmaceuticals—have intensified concerns over global trade demand. These moves affect energy consumption patterns in transport and manufacturing, potentially softening medium-term demand even as near-term risk premiums lift prices. The geopolitical layer keeps Brent above $70 despite weaker macro indicators, while WTI has lagged as domestic supply remains heavy at the Cushing hub.\nOPEC+ Policy, Russia’s Strains, and Iraq’s Export Restart\nOPEC+ output management remains a decisive factor. Fresh reports suggest the cartel’s production hikes may not be as aggressive as feared, giving the market some support. At the same time, Russia is wrestling with refinery disruptions after drone strikes, forcing it to redirect flows and driving diesel shortages across Europe. Iraq is expected to restart Kurdistan exports on September 27, which could add pressure back onto Brent if volumes normalize. The OPEC basket sits at $71.50, advancing 1%, reflecting controlled supply discipline but leaving traders alert to fresh volatility.\nInventory Draws and Arbitrage Pressure in U.S. Oil Flows\nRecent U.S. data showed declining crude and gasoline inventories, adding a bullish element to the supply picture. Gasoline futures rose 1.62% to $2.035, underlining tightness at the consumer level. At the same time, the arbitrage window for American crude shipments into Asia is narrowing, limiting U.S. export competitiveness. Mars U.S. crude fell 1.33% to $71.01, showing how regional grades are diverging. This arbitrage closing makes Brent relatively firmer, even as WTI consolidates around the $65 mark, underscoring how global logistics are shaping spreads.\nRead More\n-\nKBWB ETF Climbs to $79.84 With 39.8% Annual Return, Banks Drive Rally Toward $93 Target\n26.09.2025 · TradingNEWS ArchiveStocks\n-\nBitcoin ETF Flows Whipsaw $241M In and $258M Out as BTC-USD Stalls at $109K— Bulls Target $146K in October\n26.09.2025 · TradingNEWS ArchiveCrypto\n-\nNatural Gas Futures Drop to $2.83, Storage Surplus and AECO Crash Weigh as LNG Flows Steady\n26.09.2025 · TradingNEWS ArchiveCommodities\n-\nUSD/JPY Price Forecast - Dollar to Yen Powers Toward ¥150.00 After Strong U.S. Data and BoJ Inflation Miss\n26.09.2025 · TradingNEWS ArchiveForex\nTechnical Pressure: WTI Stalls at $65 While Brent Tests the 200-Day EMA\nFrom a charting perspective, WTI crude (CL=F) faces stiff resistance at the $65–66.50 corridor, a range that has acted as both support and resistance repeatedly. Failure to clear $66.50 keeps the contract vulnerable to short-term pullbacks, with downside tests likely at $64 and then $62 if bearish momentum"
            },
            {
                "title": "Serbia’s future oil supply unclear as US sanctions loom By Reuters - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/news/stock-market-news/serbias-future-oil-supply-unclear-as-us-sanctions-loom-4258108",
                "body": "Electronic Arts stock jumps on reports of $50B private buyout deal\nBELGRADE (Reuters) -Serbia has ample crude oil and fuel in storage to meet demand in the short term but U.S. sanctions set to come into force on October 1 cast a shadow over the landlocked Balkan nation’s future energy security, sources told Reuters on Friday.\nRussian-owned oil company NIS said earlier it had secured adequate crude and fuel stocks after Serbian President Aleksandar Vucic confirmed that the U.S. would not extend further a waiver for sanctions first announced in January.\nNIS did not disclose inventory levels or how long supplies would last. Four sources familiar with the matter said the refinery could operate for two months and provide refined products to cover demand for slightly longer.\nRussia’s Gazprom Neft owns a 44.9% stake in NIS, an investment unit of Russia’s Gazprom has around 11.3%, and the Serbian government 29.9%.\nLONG-TERM ENERGY SECURITY UNCERTAIN\nNIS operates Serbia’s only oil refinery and supplies around 80% of Serbia’s diesel and gasoline demand, and 90% or more of jet fuel and heavy fuel oil, a trader told Reuters.\nThe U.S. sanctions targeting Russia’s oil sector were announced on January 10 but had been repeatedly postponed.\nOnce they are enforced, foreign banks may halt transactions with NIS, leaving domestic banks, which lack sufficient capacity.\n\"Authorities need to immediately ensure NIS has access to domestic financial markets, and then within the next month or two, do whatever it takes to keep the Pancevo refinery running,\" said one Serbian fuel industry source who asked not to be named.\n\"There’s no alternative for market supply without the refinery operating.\"\nNIS is majority-owned by Russia’s Gazprom Neft (SIBN.MM) and Gazprom (GAZP.MM) and as such is one of Russia’s last remaining oil assets in Europe.\nEarlier this year, Reuters reported that NIS was struggling to buy oil from traders abroad, while at home its former clients were seeking alternative fuel suppliers due to the pending sanctions.\nJANAF PIPELINE IMPACT\nNIS’ 4.8 million ton/year capacity Pancevo refinery gets all of its crude oil via Croatia’s JANAF pipeline.\nJANAF confirmed on Friday it would have to cease supplies to NIS when the sanctions take effect, but will appeal to the U.S. Office of Foreign Assets Control (OFAC) to extend its licence.\n\"It is now for NIS to provide evidence to explain why the licence should be extended,\" Vladislav Veselica, a JANAF board member, told Reuters.\nHe said the company’s lawyers in the U.S. would file for the extension on Friday. NIS accounts for more than 30% of JANAF revenues.\nShould you invest $2,000 in GAZP right now?\nMost investors will find it hard to answer that question with total confidence. Short of a guarantee, which no one can give you, the most successful traders stick to proven best practices without letting hype or hyper-vigilance take over their better judgment.\nBut that doesn't mean you can't use smart shortcuts. If you're considering GAZP, try chatting with WarrenAI, our powerful AI financial assistant.\nIt's just like ChatGPT for investors, but with access to 10 years of company data, a built-in screener, Wall Street analysts' reports, and earnings call transcripts for real-time, vetted insights.\nEven if you end up going with your gut feeling, at least you'll know why."
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.270",
            "open": "65.053",
            "close": "65.523",
            "high": "65.643",
            "low": "64.373"
        },
        "market_summary": "Geopolitical tensions, particularly Ukrainian drone strikes on Russian refineries and export infrastructure, are constraining global oil supply and creating market instability. Concurrently, anticipated declines in U.S. shale production due to falling investment and lower prices threaten future output. These supply-side constraints are met with reports of strong global demand, pointing to a potential bullish shift in the market.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Forget OPEC Warnings The Real Oil Shock Is Happening Inside Russia - Crude Oil Prices Today | OilPrice.com",
                "source": "Crude Oil Prices Today | OilPrice.com",
                "url": "https://oilprice.com/Energy/Energy-General/Forget-OPEC-Warnings-The-Real-Oil-Shock-Is-Happening-Inside-Russia.html",
                "body": "While the world is watching the UN General Assembly discussions on Gaza-Israel, hybrid warfare in Europe (drones) and Trump, global oil markets are showing increased instability, as Ukrainian drones are destroying key oil and gas infrastructure inside of Russia. Over the last few weeks, a tsunami of reports has been published about a possible oil glut in the coming months or years, supported by OPEC-8 decisions to increase the export ceiling. However, reality in the market shows a different picture. Until now, no real crude oil price crash is showing; global prices are even very stable, while fundamentals in the markets are increasingly influenced by external geopolitical threats, not only Russian aggression towards NATO, or a heating up of the East Med (Turkey, Israel, Gaza Flotilla), but also increasingly Ukraine’s effective strikes on Russia’s infrastructure.\nAlmost daily, reports are showcasing the strategic success of Ukraine's campaign, which, in addition to its battlefield tactics, has effectively executed precision strikes and drone attacks on Russian oil refineries, fuel depots, and related logistics. These intentional strikes have targeted the Kremlin’s economic lifelines, leading some to assert that the most effective sanctions currently hitting Russia’s war chest or Putin’s lifeline are the Ukrainian drones.\nWhile most energy analysts are still obsessed with OPEC, US shale, or Israel’s operations in Gaza, Russia, not only a pivotal player inside the so-called OPEC+ group, but also one of the world’s leading oil and gas exporters, is looking at a very dire situation. Ukrainian drones are not only degrading Moscow’s ability to turn Russian crude into exportable petroleum products (diesel, gasoline, kerosene) but also forcing Russian refineries to go offline. Both issues are hitting Putin’s war economy very hard, as they decrease options to monetize its hydrocarbon potential (exports) and also force higher domestic price settings for Russian citizens and external parties. Lately, in a move to squeeze Russia really, Ukraine has increased its attacks on Russian oil ports, in a move to hit export potential, while in the end forcing Russian crude oil production to be shut in.\nRelated: Vitol Nears Deal to Sell Iraqi Kurdistan Oil Exports\nThe current situation, combined with increased geopolitical risks and strong global demand, suggests a potential shift towards a bullish environment. Even OPEC+'s theoretical production and export increases may not be enough to mitigate this shift, or in some cases, may not be sufficient at all. This potential for a bullish market should prompt all market participants to adopt preparedness and strategic planning.\nThe latest reports from Russia indicate that Ukrainian drones have hit dozens of Russian fuel facilities, while at the same time, maritime drones and missiles are being used. The potential of Ukraine’s latest military addition, the Flamingo Missile, could be a watershed development. This missile can reach much further into Russian territory with a larger payload, potentially causing significant damage to key oil and gas infrastructure. Western and Russian outlets have also indicated that over a million barrels per day of refining throughput is being hit or removed from the market, as major refineries and pipeline centers are being shut down or taken offline. For global oil markets, Russia’s exports are significant, as it is a leading exporter of diesel, fuel oil, and kerosene. The potential impact of the Flamingo Missile, combined with the ongoing drone attacks, underscores the evolving nature of the geopolitical risks in the oil market.\nWhile global markets are being hit increasingly, even if additional Russian crude is exported, the situation has become very dire. Independent reports from Russia indicate severe fuel shortages in several regions of the country, not only impacting the war economy sectors (manufacturing, defense) but also increasing the potential for internal unres"
            },
            {
                "title": "Serbia’s future oil supply unclear as US sanctions loom By Reuters - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/news/stock-market-news/serbias-future-oil-supply-unclear-as-us-sanctions-loom-4258108",
                "body": "Electronic Arts stock jumps on reports of $50B private buyout deal\nBELGRADE (Reuters) -Serbia has ample crude oil and fuel in storage to meet demand in the short term but U.S. sanctions set to come into force on October 1 cast a shadow over the landlocked Balkan nation’s future energy security, sources told Reuters on Friday.\nRussian-owned oil company NIS said earlier it had secured adequate crude and fuel stocks after Serbian President Aleksandar Vucic confirmed that the U.S. would not extend further a waiver for sanctions first announced in January.\nNIS did not disclose inventory levels or how long supplies would last. Four sources familiar with the matter said the refinery could operate for two months and provide refined products to cover demand for slightly longer.\nRussia’s Gazprom Neft owns a 44.9% stake in NIS, an investment unit of Russia’s Gazprom has around 11.3%, and the Serbian government 29.9%.\nLONG-TERM ENERGY SECURITY UNCERTAIN\nNIS operates Serbia’s only oil refinery and supplies around 80% of Serbia’s diesel and gasoline demand, and 90% or more of jet fuel and heavy fuel oil, a trader told Reuters.\nThe U.S. sanctions targeting Russia’s oil sector were announced on January 10 but had been repeatedly postponed.\nOnce they are enforced, foreign banks may halt transactions with NIS, leaving domestic banks, which lack sufficient capacity.\n\"Authorities need to immediately ensure NIS has access to domestic financial markets, and then within the next month or two, do whatever it takes to keep the Pancevo refinery running,\" said one Serbian fuel industry source who asked not to be named.\n\"There’s no alternative for market supply without the refinery operating.\"\nNIS is majority-owned by Russia’s Gazprom Neft (SIBN.MM) and Gazprom (GAZP.MM) and as such is one of Russia’s last remaining oil assets in Europe.\nEarlier this year, Reuters reported that NIS was struggling to buy oil from traders abroad, while at home its former clients were seeking alternative fuel suppliers due to the pending sanctions.\nJANAF PIPELINE IMPACT\nNIS’ 4.8 million ton/year capacity Pancevo refinery gets all of its crude oil via Croatia’s JANAF pipeline.\nJANAF confirmed on Friday it would have to cease supplies to NIS when the sanctions take effect, but will appeal to the U.S. Office of Foreign Assets Control (OFAC) to extend its licence.\n\"It is now for NIS to provide evidence to explain why the licence should be extended,\" Vladislav Veselica, a JANAF board member, told Reuters.\nHe said the company’s lawyers in the U.S. would file for the extension on Friday. NIS accounts for more than 30% of JANAF revenues.\nShould you invest $2,000 in GAZP right now?\nWith GAZP making headlines, savvy investors are asking: Is it truly valued fairly? In a market full of overpriced darlings, identifying true value can be challenging.\nInvestingPro's advanced AI algorithms have analyzed GAZP alongside thousands of other stocks to uncover hidden gems.\nThese undervalued stocks, potentially including GAZP, could offer substantial returns as the market corrects. In 2025 alone, our AI identified several undervalued stocks that later surged by 50% or more.\nIs GAZP poised for similar growth? Don't miss the opportunity to find out."
            },
            {
                "title": "Shale Oil Faces Decline, Firms Eye Overseas Drilling - Oklahoma Energy Today",
                "source": "Oklahoma Energy Today",
                "url": "https://www.okenergytoday.com/2025/09/shale-oil-decline-overseas-drilling/",
                "body": "Shale Oil Decline Raises Concerns as Firms Look Overseas\nA new Dallas Federal Reserve report warns of a slowdown in oil production across Texas, New Mexico, and Louisiana, sparking industry debate over whether shale oil production is entering its twilight.\nThe U.S. Energy Information Administration (EIA) also projects a potential drop in U.S. oil output in 2026. If it happens, it would mark the first decline since 2021. Analysts attribute the expected decrease to falling oil prices and reduced drilling activity, particularly in the Permian Basin.\nShale oil decline shifts focus overseas\nThe Dallas Fed survey revealed many U.S. oil and gas executives now believe international projects will become more commercially viable. With capital spending expected to fall, 43% of exploration and production (E&P) firms anticipate a decline in third-quarter investments. Oilfield service companies also forecast a 42% drop in spending.\nSome executives told the Fed that overseas opportunities may provide the best growth prospects as U.S. shale drilling slows.\nContinental Resources invests in Turkey\nOne notable move is from Oklahoma City-based Continental Resources. Earlier this year, the company signed a joint venture with Turkish Petroleum Corporation (TPAO) to develop shale fields in the Diyarbakir Basin.\nFounded in 1954, TPAO has long been a cornerstone of Turkey’s energy industry, spearheading hydrocarbon exploration and refining projects. The venture highlights the growing global shift as U.S. firms diversify beyond domestic shale plays.\nUncertainty ahead for U.S. shale oil production\nThe industry remains cautious as it awaits upcoming third-quarter earnings reports from major producers. The financial disclosures will confirm whether the predicted capital expenditure slowdown is materializing.\nExecutives stress that without stronger oil prices, U.S. production growth may stagnate, accelerating the shift toward international ventures.\nSource: Reuters | Edited by Oklahoma Energy Today for clarity"
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0109",
            "open": "1.1737",
            "close": "1.1664",
            "high": "1.1754",
            "low": "1.1645"
        },
        "market_summary": "The EUR/USD is under pressure from a strong US Dollar, driven by surprisingly robust US economic data (GDP, jobless claims) and new trade tariffs, which have caused markets to scale back expectations for aggressive Fed rate cuts. While the pair found some support after the core PCE inflation data met estimates, it remains near key technical supports. Geopolitical tensions in Europe are an additional headwind for the Euro, with a busy week of US employment data ahead likely to dictate the near-term direction.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "EUR/USD rebounds as Fed rate cut bets strengthen after PCE - Mitrade",
                "source": "Mitrade",
                "url": "https://www.mitrade.com/insights/news/live-news/article-1-1154256-20250927",
                "body": "EUR/USD recovers on Friday as traders’ confidence rises that the Federal Reserve would reduce interest rates after the release of the latest inflation report in the United States (US). At the time of writing, the pair trades at 1.1697 up 0.27%.\nThe week ended in a recovery mode for the shared currency after the US Bureau of Economic Analysis (BEA) revealed that the Fed’s preferred inflation gauge, the core Personal Consumption Expenditures (PCE) Price Index was aligned with estimates, but shy of the 3% threshold.\nAfter the announcement, bets that the Fed would reduce borrowing costs increased from 84% a day ago to 88%m revealed the Prime Market Terminal interest rate probability tool.\nFederal Reserve officials crossed the wires. Fed Governor Michelle Bowman was dovish as she said that the labor market is fragile and should the conditions deteriorate, they would need to adjust policy at a faster pace. Earlier Richmond’s Fed Thomas Barkin said both inflation and unemployment are moving in the wrong direction, but the downside is limited.\nIn Europe, a scarce economic docket left traders adrift to geopolitics. Tensions in Europe seem to weigh on the Euro as NATO warned Russia that it is prepared to intercept Russian aircraft. According to Bloomberg, European officials privately told Russia they are ready to shoot down jets and view Russia’s Estonia incursion as deliberate.\nNext week, the US schedule will feature a flurry of Fed speakers, US ADP National Employment Change, the ISM Manufacturing PMI, Initial Jobless Claims and Nonfarm Payrolls for September.\nAcross the pond, the European schedule will feature Business Climate, Consumer Confidence, the Economic Sentiment Indicator, September inflation figures and a flurry of ECB speakers. Also, traders should be wary of Flash PMIs and German inflation and Retail Sales.\nEUR/USD ended the week on a lower note, yet it seems to have found its foot, at around 1.1650. After reaching the latter, the pair edged back towards 1.1700 but failed to end the day/week above that price level.\nThe Relative Strength Index (RSI) remains bearish. This, and EUR/USD failure at 1.1700, could clear the path for further downside.\nThe first support would be 1.1650, followed by 1.1600. If cleared, the next support would be the 100-day SMA At 1.1588. Conversely, if buyers reclaim 1.1700, the next resistance would be 1.1750 ahead of the 1.1800 mark.\nThe Euro is the currency for the 19 European Union countries that belong to the Eurozone. It is the second most heavily traded currency in the world behind the US Dollar. In 2022, it accounted for 31% of all foreign exchange transactions, with an average daily turnover of over $2.2 trillion a day. EUR/USD is the most heavily traded currency pair in the world, accounting for an estimated 30% off all transactions, followed by EUR/JPY (4%), EUR/GBP (3%) and EUR/AUD (2%).\nThe European Central Bank (ECB) in Frankfurt, Germany, is the reserve bank for the Eurozone. The ECB sets interest rates and manages monetary policy. The ECB’s primary mandate is to maintain price stability, which means either controlling inflation or stimulating growth. Its primary tool is the raising or lowering of interest rates. Relatively high interest rates – or the expectation of higher rates – will usually benefit the Euro and vice versa. The ECB Governing Council makes monetary policy decisions at meetings held eight times a year. Decisions are made by heads of the Eurozone national banks and six permanent members, including the President of the ECB, Christine Lagarde.\nEurozone inflation data, measured by the Harmonized Index of Consumer Prices (HICP), is an important econometric for the Euro. If inflation rises more than expected, especially if above the ECB’s 2% target, it obliges the ECB to raise interest rates to bring it back under control. Relatively high interest rates compared to its counterparts will usually benefit the Euro, as it makes the region more attractive as a place for global"
            },
            {
                "title": "EUR/USD Forecast: Forex Friday September 26, 2025 - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/eur-usd-forecast-forex-friday-september-26-2025/?amp=true",
                "body": "EUR/USD Forecast: Forex Friday September 26, 2025\n- EUR/USD forecast partly hinges on today’s US core PCE print\n- Geopolitical tensions remain a wildcard for the euro\n- US labour market in sharp focus in week ahead as traders reassess Fed easing bets\nThe US dollar extended its post-FOMC bounce this week on the back of surprisingly strong economic data, forcing markets to trim expectations for additional Fed rate cuts. That resilience has – for now – pushed the EUR/USD lower, but the pair could be setting up for a reversal if inflation numbers fail to justify the recent hawkish repricing. Today’s release of the Fed’s preferred inflation gauge, core PCE, is crucial— a tame 0.2% m/m print or lower could be all it takes for the dollar to give back some of its gains, allowing EUR/USD to rebound. Next week, we will have plenty of US employment data that could impact the EUR/USD forecast, while from the Eurozone CPI and German retail sales are among the highlights.\nDollar finds support from data surprises\nThe dollar’s move higher this week has been underpinned by a rare run of upbeat data. GDP for Q2 was revised up sharply from 3.3% to 3.8%, boosted by personal consumption. Weekly jobless claims have also steadied, suggesting that the spike to 264k earlier this month was an anomaly rather than the start of a worrying trend. Meanwhile, durable goods orders jumped 2.9% in August and housing figures also surprised to the upside.\nWhile this string of data is dollar-positive, the move feels stretched. The Fed is still in easing mode, and markets remain sensitive to any disappointment in upcoming numbers. If today’s PCE inflation data confirms a cooling trend, rate-cut expectations for December could shift back higher.\nEUR/USD forecast: Limited euro weakness\nGeopolitics has also played a role in determining the EUR/USD forecast. Tensions in Europe have pressured the euro, lending the greenback a temporary bid. NATO has warned this week that it is prepared to intercept Russian aircraft. Any escalation could keep the dollar bid, but a de-escalation would likely flip the script.\nDespite the dollar’s recent dominance, EUR/USD hasn’t collapsed. The single currency has held its own relatively well against other currencies. That suggests the euro still has a cushion, particularly if markets begin to question whether the dollar’s rally has gone too far, too fast.\nOn the eurozone data front, this week’s signals were mixed. French PMI numbers disappointed, slipping below the 50.0 expansion line, while Germany’s services PMI printed a healthier 52.5, lifting the overall eurozone services index to 51.4. Eurozone manufacturing, however, remains stuck in contraction territory, and sentiment surveys such as Germany’s Ifo and GfK continue to highlight a subdued outlook.\nWhat’s next: busy US data week could define the trend\nLooking ahead, eurozone CPI estimates and German retail sales will set the tone next week. Weak consumption data could weigh on sentiment, but if inflation holds firm, it may temper dovish ECB expectations—giving EUR/USD some support. But the EUR/USD forecast is likely be impacted more from the US side of things. Beyond today’s PCE release, the US calendar is stacked with key employment data. JOLTS job openings, ADP private payrolls, ISM surveys, and Friday’s non-farm payrolls will all feed into the Fed narrative. With the dollar feeling a little overextended, it may take another strong set of prints to maintain the bullish momentum. Otherwise, profit-taking could see EUR/USD bounce back in the near term.\nAmong the abovementioned employment pointers, JOLTS Job Openings (Tuesday) and non-farm payrolls (Friday) are likely to be the most important ones to watch.\nWith much of the focus being on a softening US labour market, while inflation concerns linger, any indications of further weakening here should boost expectations of two more rate cuts for 2025. The JOLTS job openings data is forward-looking and will be taken together with the week"
            },
            {
                "title": "EUR/USD Price Forecast - EURO to Dollar Slumps to 1.1675 as U.S. GDP Hits 3.8% and Tariffs Spark Dollar Demand - tradingnews.com",
                "source": "tradingnews.com",
                "url": "https://www.tradingnews.com/news/eur-to-dollar-drops-toward-11675-as-strong-us-data-and-trump-tariffs-drive-dollar-higher",
                "body": "EUR/USD Price Forecast - EURO to Dollar Drops Toward 1.1675 as Strong U.S. Data and Trump Tariffs Drive Dollar Higher\nEuro slides after U.S. GDP at 3.8%, jobless claims hit 218K, durable orders rise 2.9%. PCE inflation at 2.7% leaves Fed cautious, while technicals show 1.1650 support in play and downside risk to 1.1610–1.1575 | That's TradingNEWS\nEUR/USD Struggles Near 1.1675 as U.S. Data Boosts Dollar Strength\nThe EUR/USD pair is pinned close to three-week lows, trading around 1.1675 after bouncing from intraday lows of 1.1645. The euro has lost about 0.55% this week, pressured by a run of upbeat U.S. economic releases that have reinforced the dollar’s dominance. Revised second-quarter U.S. GDP showed a 3.8% annualized expansion, stronger than the 3.3% previously reported, driven largely by resilient consumer spending. At the same time, durable goods orders jumped 2.9% in August following two months of declines, while initial jobless claims fell to 218,000, their lowest since July, signaling ongoing labor market strength. These figures prompted markets to trim bets on deep Federal Reserve easing and lifted the dollar index back above 98.20, the highest in three weeks.\nTrump’s Tariff Announcements Deepen Euro Weakness Against USD\nAlongside strong U.S. data, fresh trade measures from President Trump have added to euro selling pressure. Washington announced new tariffs of 100% on branded medicines, 25% on heavy trucks, and 50% on kitchen cabinets, reigniting concerns of a broader trade war. The move spurred risk aversion during Asian trading hours and supported flows into the U.S. dollar, leaving EUR/USD struggling to regain ground above 1.1690. Markets remain cautious that tariff escalation could weigh on global growth while reinforcing dollar demand as a safe-haven play.\nInflation Data Shapes Fed Policy Expectations\nThe Federal Reserve’s preferred inflation measure, the PCE Price Index, rose 0.3% MoM in August, pushing the yearly pace to 2.7% from 2.6%. The core PCE held steady at 2.9% YoY, matching consensus. These readings confirm inflation progress is slowing but not collapsing, giving the Fed little room to ease aggressively. Market pricing via the CME FedWatch tool now implies an 87% probability of an October cut, down from above 90% earlier this week, with odds for a 50-bp move shrinking to 62% from nearly 80%.\nTechnical Landscape: EUR/USD Faces Key Support at 1.1650\nChart structure shows EUR/USD validated a bearish shift after breaking below its short-term uptrend line. Momentum indicators remain in negative territory, with RSI hovering near 31, close to oversold but still allowing further downside. Key support sits at 1.1650, which held both on Thursday and earlier in September. A decisive break beneath this zone would expose 1.1610 and the late-August low at 1.1575. On the topside, resistance is lined up near 1.1725, followed by 1.1755 and the September highs at 1.1820. Unless the euro reclaims the 200-day EMA around 1.1710, the bias remains tilted lower.\nConsumer Sentiment and Fed Commentary Awaited\nBeyond PCE, traders are watching the University of Michigan sentiment index and remarks from Fed Governor Bowman for further guidance. Earlier Fed speeches showed mixed views: some officials like Kansas City’s Jeffrey Schmid pushed for more cuts to protect jobs, while Chicago’s Austan Goolsbee warned against premature easing given persistent inflation. This divergence has left EUR/USD vulnerable to every data point, with sentiment swings exaggerated by thin positioning.\nRead More\n-\nKBWB ETF Climbs to $79.84 With 39.8% Annual Return, Banks Drive Rally Toward $93 Target\n26.09.2025 · TradingNEWS ArchiveStocks\n-\nBitcoin ETF Flows Whipsaw $241M In and $258M Out as BTC-USD Stalls at $109K— Bulls Target $146K in October\n26.09.2025 · TradingNEWS ArchiveCrypto\n-\nNatural Gas Futures Drop to $2.83, Storage Surplus and AECO Crash Weigh as LNG Flows Steady\n26.09.2025 · TradingNEWS ArchiveCommodities\n-\nUSD/JPY Price Forecast - Dollar t"
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0143",
            "open": "1.3445",
            "close": "1.3340",
            "high": "1.3466",
            "low": "1.3323"
        },
        "market_summary": "The GBP/USD has fallen to a seven-week low near 1.3322, pressured by strong U.S. economic data including 3.8% GDP growth and persistent PCE inflation at 2.9%, which have reduced expectations for aggressive Fed rate cuts. Meanwhile, the Bank of England's cautious and indecisive stance, caught between sticky inflation and a weakening UK economic outlook, has further weighed on Sterling. While the pair is showing signs of being technically oversold and has stabilized slightly after the PCE data met expectations, the overall market structure remains bearish with key resistance overhead.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "GBP/USD Price Forecast - Pound to Dollar Falls to 1.3322, Weakest in 7 Weeks as U.S. GDP Hits 3.8% and PCE at 2.9% Pressure Sterling - tradingnews.com",
                "source": "tradingnews.com",
                "url": "https://www.tradingnews.com/news/gbp-usd-price-forecast-pound-to-dollar-slides-to-1-3322-as-us-growth-outpaces-uk-outlook",
                "body": "GBP/USD Price Forecast - Pound to Dollar Slides to 1.3322 as U.S. Growth Outpaces U.K. Outlook and BoE Caution Adds Pressure\nSterling drops 3% from 1.3725 peak; Fed outlook steadies after strong data, PCE inflation at 2.9% looms, while technicals point to 1.3255–1.3150 support unless GBP/USD reclaims 1.3470–1.3500 resistance | That's TradingNEWS\nGBP/USD Slides to Seven-Week Low as U.S. Data Outpaces U.K. Recovery\nThe GBP/USD pair has come under sustained selling pressure, dropping to 1.3322 this week, its weakest point in nearly two months, before stabilizing just above 1.3350. The move reflects a sharp 3% decline from the September high at 1.3725 as U.S. economic strength has undercut the case for aggressive Federal Reserve rate cuts, while the Bank of England remains caught between sticky inflation and weakening domestic growth.\nImpact of U.S. Growth and Inflation Data on GBP/USD\nThe second-quarter U.S. GDP revision to 3.8% year-on-year, coupled with weekly jobless claims falling to 218,000 and durable goods orders surging 2.9%, has provided the dollar with renewed momentum. These numbers highlight U.S. economic resilience and have reduced expectations for back-to-back Fed cuts in 2025. Meanwhile, markets await the Core PCE inflation print at 2.9% year-on-year, a figure that could cement the Fed’s cautious stance and extend downside pressure on GBP/USD if it overshoots consensus.\nBank of England Uncertainty Weighs on Sterling\nGovernor Andrew Bailey has acknowledged that U.K. inflation is on a downward path but linked future easing directly to progress in consumer prices. This hesitancy is complicated by other MPC members, such as Megan Greene, warning against premature cuts amid lingering upside risks. Political noise in London—calls for re-nationalization of utilities and large-scale borrowing schemes—has rattled gilt markets already strained by fragile demand. With households sitting on unusually high savings and labor conditions softening, the pound has struggled to find a solid base against the dollar.\nTechnical Breakdown of GBP/USD Levels\nTechnically, GBP/USD’s inability to reclaim 1.3390, the 23.6% Fibonacci retracement of the January–July rally, leaves bears in control. A sustained break under 1.3330 risks a slide toward 1.3255, followed by deeper targets at 1.3145 and the 200-day SMA near 1.3130. On the flip side, only a decisive recovery above 1.3470–1.3500, where the 20- and 50-day SMAs converge, would ease bearish momentum and allow a rebound toward 1.3600. Until then, the bias remains skewed to the downside with 1.3300–1.3260 acting as the next key pivot zone.\nRead More\n-\nKBWB ETF Climbs to $79.84 With 39.8% Annual Return, Banks Drive Rally Toward $93 Target\n26.09.2025 · TradingNEWS ArchiveStocks\n-\nBitcoin ETF Flows Whipsaw $241M In and $258M Out as BTC-USD Stalls at $109K— Bulls Target $146K in October\n26.09.2025 · TradingNEWS ArchiveCrypto\n-\nNatural Gas Futures Drop to $2.83, Storage Surplus and AECO Crash Weigh as LNG Flows Steady\n26.09.2025 · TradingNEWS ArchiveCommodities\n-\nUSD/JPY Price Forecast - Dollar to Yen Powers Toward ¥150.00 After Strong U.S. Data and BoJ Inflation Miss\n26.09.2025 · TradingNEWS ArchiveForex\nShort-Term Pound Sterling Outlook Against the Dollar\nThe stochastic oscillator sitting below 20 suggests the pair is oversold, and price action beneath the lower Bollinger band signals the potential for a short-lived bounce. However, with market structure deteriorating since August’s 1.3139 low and with GBP/USD still capped under the broader 1.3675–1.3720 resistance band, upside moves should be treated as corrective rallies rather than a trend reversal. A failure to sustain above 1.3400 in the coming sessions would quickly put 1.3260 back on the radar.\nFinal Assessment: Bearish Bias Maintained on GBP/USD\nConsidering the stronger U.S. macro backdrop, upcoming PCE inflation data, and the Bank of England’s indecisive tone, GBP/USD remains in a bearish setup with high probability of retesting 1.3255–"
            },
            {
                "title": "GBP/USD Hits 7-Week Low as Fed Cut Odds Fall - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/analysis/gbpusd-wake-me-up-when-september-ends-200667552",
                "body": "Electronic Arts stock jumps on reports of $50B private buyout deal\n- GBP/USD sinks below SMAs, reaches September’s support at 1.3332\n- Short-term bias is bearish-to-neutral, price likely near oversold territory\nGBP/USD crashed to a seven-week low of 1.3322 on Thursday as a string of data reflected an expanding US economy, reducing the odds of an aggressive Fed rate cut.\nThe past two weeks have been heavy enough to push the pair into monthly losses, erasing almost 3.0% from the 1.3725 high. Yet, the price has not closed below September’s floor of 1.3332, creating speculation that the plunge could soon take a breather. The stochastic oscillator supports this narrative, fluctuating below its oversold level of 20, while the close beneath the lower Bollinger band suggests a pivot may be nearby.\nIf the pair fails to cross above the 23.6% Fibonacci retracement of the January–July 2025 uptrend at 1.3390, bears could retain control, driving the price towards the 1.3255 handle. Additional declines from there could expose the 38.2% Fibonacci level at 1.3145 and the 200-day simple moving average (SMA).\nA potential recovery above 1.3390 could face an initial test between the 20- and 50-day SMAs, currently sitting within the 1.3470–1.3500 zone. If bulls break through that wall, they may continue towards the 1.3600 barrier. Yet, with the market structure losing momentum since the drop to 1.3139 at the start of August, the case for bullish continuation remains under scrutiny, particularly as long as the price trades below 1.3675-1.3720.\nIn a nutshell, GBP/USD may be near a pivotal region, though whether the pair can attract enough buyers to recover from its latest bearish wave off 1.3725 remains to be seen.\nWhich stocks should you consider in your very next trade?\nThe best opportunities often hide in plain sight—buried among thousands of stocks you'd never have time to research individually.\nThat's why smart investors use our Stock Screener with 50+ predefined screens and 160+ customizable filters to surface hidden gems instantly.\nFor example, the Piotroski's Picks method averages 23% annual returns by focusing on financial strength, and you can get it as a standalone screen. Momentum Masters catches stocks gaining serious traction, while Blue-Chip Bargains finds undervalued giants.\nWith screens for dividends, growth, value, and more, you'll discover opportunities others miss. Our current favorite screen is Under $10/share, which is great for discovering stocks trading under $10 with recent price momentum showing some very impressive returns!"
            },
            {
                "title": "GBP/USD edges higher as Greenback eases after US PCE, UoM sentiment - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-usd-edges-higher-as-us-dollar-eases-after-pce-and-uom-sentiment-data-202509261410",
                "body": "- The British Pound steadies after a two-day slide, with GBP/USD staging a modest recovery.\n- The US PCE inflation report came broadly in line with forecasts, keeping the Fed’s outlook steady.\n- The core PCE Price Index rose 0.2% MoM, matching expectations, and headline PCE rose 0.3% MoM in August, up from 0.2% in July.\nThe British Pound (GBP) gains traction against the US Dollar (USD) on Friday, with GBP/USD snapping a two-day losing streak. At the time of writing, the pair is hovering near 1.3393, staging a modest recovery after dropping to its weakest level in about seven weeks on Thursday.\nFresh momentum in Sterling came after the release of the August US Personal Consumption Expenditures (PCE) Price Index, which broadly met market forecasts and offered no new hawkish cues for the Federal Reserve (Fed). The data kept the Greenback on the defensive, with the US Dollar Index (DXY), which gauges the Greenback’s value against six major peers, easing slightly from three-week highs to trade around 98.35.\nThe core PCE Price Index, the Fed’s preferred gauge of underlying inflation, rose 0.2% MoM in August, matching forecasts and below July’s originally reported 0.3%, which was revised down to 0.2%. On an annual basis, core PCE held steady at 2.9%, still above the Fed’s 2% target.\nThe headline PCE Price Index rose 0.3% on the month, in line with expectations and up from 0.2% in July, while the annual rate ticked up to 2.7% in August from 2.6% a month earlier. The report also showed that personal income rose 0.4% in August, slightly above expectations, and personal spending climbed 0.6%, up from 0.5% in July, signaling that US consumer demand remains resilient.\nThe latest University of Michigan (UoM) survey showed that both consumer sentiment and expectations softened slightly in September, while short and long-term inflation expectations also eased modestly.\nRichmond Fed President Thomas Barkin said on Friday that while the labor market appears to be softening, the supply of workers is also growing more slowly, which reduces the risk of a sharp spike in unemployment. He stressed that the Fed is now focused on balancing its dual mandate.\nBarkin emphasized that future policy moves will hinge on incoming data, saying the Fed may need to tilt a bit more toward its employment mandate following the recent rate cut, which he argued should support the labor market while keeping pressure on inflation.\nUS Dollar Price Today\nThe table below shows the percentage change of US Dollar (USD) against listed major currencies today. US Dollar was the strongest against the New Zealand Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the US Dollar from the left column and move along the horizontal line to the Japanese Yen, the percentage change displayed in the box will represent USD (base)/JPY (quote).\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held r"
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0078",
            "open": "0.6573",
            "close": "0.6538",
            "high": "0.6603",
            "low": "0.6525"
        },
        "market_summary": "The AUD/USD is recovering modestly from three-week lows, supported by a softening US Dollar following in-line US PCE inflation data and weaker consumer sentiment. Market focus is now squarely on the upcoming RBA policy decision, where rates are widely expected to hold steady, and the US Nonfarm Payrolls report. However, a major shift in institutional outlook is creating headwinds, as evidenced by Bank of America closing its long position on the pair due to a reassessment of Federal Reserve policy.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "AUD/USD lifts from three-week lows amid US Dollar softness, RBA in focus - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/aud-usd-lifts-from-three-week-lows-amid-us-dollar-softness-rba-in-focus-202509261832",
                "body": "- Australian Dollar regains ground as the US Dollar softens after in-line PCE data and weaker consumer sentiment.\n- Focus turns to the RBA’s monetary policy decision on Tuesday, with markets expecting rates to stay unchanged at 3.60%.\n- US labor market data back in focus with NFP due on Friday.\nThe Australian Dollar (AUD) gains ground on Friday as the US Dollar (USD) loses momentum after Personal Consumption Expenditures (PCE) inflation figures came broadly in line with forecasts, while weaker consumer sentiment and renewed tariff worries dampened demand for the Greenback.\nAt the time of writing, AUD/USD is trading around 0.6550, recovering modestly after a sharp two-day fall to three-week lows. Meanwhile, the US Dollar Index (DXY) has eased from recent highs, trading near the 98.00 mark, as traders reassess the Federal Reserve’s (Fed) monetary policy path.\nThe latest US Personal Consumption Expenditures (PCE) inflation report showed price pressure largely in line with expectations, reinforcing the view that disinflation remains slow. The core PCE rose 0.2% MoM in August, matching forecasts, while the annual rate held steady at 2.9%. The headline PCE rose 0.3% MoM, ticking up to 2.7% YoY, as personal income and spending also posted steady gains, highlighting resilient household demand.\nAdding to the softer tone of the Dollar, the University of Michigan (UoM) survey showed that both consumer sentiment and expectations dipped slightly in September, while short- and long-term inflation expectations also edged lower. The softer household outlook, combined with the in-line PCE data, offered no fresh hawkish cues for the Fed, prompting some profit-taking in the Greenback and allowing the Aussie to rebound from recent lows.\nFocus now shifts to the Reserve Bank of Australia’s (RBA) interest rate decision on Tuesday. A recent Reuters poll of 39 economists showed all respondents expect the RBA to keep the cash rate steady at 3.60%. Market pricing via ASX futures also implies a very low probability of a rate cut, with most investors betting that the central bank will hold fire until it gets the Q3 Consumer Price Index (CPI) report in late October.\nMajor Australian banks remain divided on the timing of easing. ANZ, CBA and Westpac continue to forecast a 25-basis-point cut before year-end, most likely in November, assuming inflation resumes its downward trend. By contrast, NAB has pushed back its expected first cut to May 2026, citing persistent price pressures in the services sector and robust household spending.\nIn the US, the spotlight now shifts to the Nonfarm Payrolls (NFP) report due on Friday, with the labor market expected to show a modest rebound. Economists forecast a gain of 39K jobs in September, up from just 22K in August.\nEconomic Indicator\nRBA Interest Rate Decision\nThe Reserve Bank of Australia (RBA) announces its interest rate decision at the end of its eight scheduled meetings per year. If the RBA is hawkish about the inflationary outlook of the economy and raises interest rates it is usually bullish for the Australian Dollar (AUD). Likewise, if the RBA has a dovish view on the Australian economy and keeps interest rates unchanged, or cuts them, it is seen as bearish for AUD.\nRead more.Next release: Tue Sep 30, 2025 04:30\nFrequency: Irregular\nConsensus: 3.6%\nPrevious: 3.6%\nSource: Reserve Bank of Australia\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all"
            },
            {
                "title": "Crucial AUD/USD Shift: Bank of America Exits Long Trade Amidst Federal Reserve Policy Reversal - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/news/feed/afaf9-aud-usd-forex-shift",
                "body": "Crucial AUD/USD Shift: Bank of America Exits Long Trade Amidst Federal Reserve Policy Reversal\nBitcoinWorld\nCrucial AUD/USD Shift: Bank of America Exits Long Trade Amidst Federal Reserve Policy Reversal\nThe financial world is abuzz with the recent announcement that Bank of America has strategically closed its long position on the AUD/USD currency pair. This significant move signals a cautious approach by one of the world’s leading financial institutions, driven primarily by a shifting outlook from the Federal Reserve. For anyone engaged in the dynamic Forex market, understanding such shifts is crucial, as they often foreshadow broader trends and present both opportunities and challenges.\nWhat Prompted Bank of America’s AUD/USD Exit?\nBank of America’s decision to exit its long AUD/USD trade wasn’t made in a vacuum. It reflects a recalculation of risk and reward based on evolving macroeconomic signals. A ‘long’ position implies a belief that the Australian Dollar would strengthen against the US Dollar. Closing this position suggests that the bank no longer holds that conviction, or at least sees increased downside risk. The primary catalyst for this change is the anticipated trajectory of the Federal Reserve policy.\nDecoding the Federal Reserve Policy Shift: Why Does it Matter?\nThe Federal Reserve, the central bank of the United States, holds immense sway over global financial markets. Its monetary policy decisions, particularly regarding interest rates, directly influence the strength of the US Dollar. A hawkish Fed, one that signals higher interest rates or a longer period of tight policy, typically strengthens the dollar. Conversely, a dovish stance can weaken it. Recent communications and economic data points have suggested a subtle but significant shift in the Fed’s outlook. Here’s why this matters for the Forex market:\n- Interest Rate Differentials: Higher US interest rates make dollar-denominated assets more attractive, drawing capital away from other currencies like the AUD.\n- Economic Outlook: The Fed’s assessment of US economic strength provides a benchmark for global economic health. A robust US economy, often supported by higher rates, tends to strengthen the dollar.\n- Risk Sentiment: Changes in Fed policy can alter global risk appetite. A tighter Fed can sometimes lead to a ‘risk-off’ environment, where investors flock to safe-haven assets like the US Dollar.\nNavigating the Forex Market: Understanding AUD/USD Dynamics\nThe AUD/USD pair is a popular choice among currency traders, often influenced by commodity prices (Australia is a major commodity exporter) and interest rate differentials between the Reserve Bank of Australia (RBA) and the Federal Reserve. When the Fed’s stance shifts, it directly impacts this differential. Historically, a strong US dollar tends to put pressure on the AUD. Factors that typically support the AUD include:\n- Rising commodity prices (especially iron ore, coal).\n- Strong economic data from China (Australia’s largest trading partner).\n- A relatively higher interest rate from the RBA compared to the Fed.\nBank of America’s decision indicates that the balance of these factors has tilted against the AUD, primarily due to the US side of the equation.\nWhat Does This Mean for Currency Trading Strategies?\nFor individual and institutional traders alike, Bank of America’s move offers a crucial lesson in adaptability and risk management. It underscores the importance of constantly re-evaluating currency trading strategies in light of new information, especially from influential central banks. Key takeaways for refining your strategies:\n- Stay Informed: Closely monitor official statements and speeches from the Federal Reserve and other major central bank decisions.\n- Analyze Economic Data: Pay attention to inflation reports, employment figures, and GDP data from both the US and Australia.\n- Technical vs. Fundamental: While technical analysis provides entry and exit points, fundamental analysis (like ce"
            },
            {
                "title": "European shares had a solid day to the upside - investingLive",
                "source": "investingLive",
                "url": "https://investinglive.com/news/european-shares-had-a-solid-day-to-the-upside-20250926/",
                "body": "Major European indices had a solid day led by Spain's Ibex which rose by 1.3%. Other major indices were up by 0.77% or more:\n- German DAX, +0.87%\n- France's CAC +0.97%\n- UK's FTSE 100 +0.77%\n- Spain's Ibex +1.3%\n- Italy's FTSE MIB +0.96%\nUS stocks have pushed into positive territory with the NASDAQ index leading with a gain of 0.06%:\n- Dow industrial average +0.59%\n- S&P index +0.34%\n- NASDAQ index +0.06%\nAt session lows, the NASDAQ index successfully tested its 100 hour moving average giving the buyers some hope from a technical perspective (see post here).\nA look around other markets shows:\n- Crude oil is up $0.93 at $65.90.\n- Gold is up $26.50 or 0.70% at $3775.23.\n- Silver is up $0.99 or 2.21% at $46.16. That is a new high going back to 2011.\n- Bitcoin is up $370 at $109,400."
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "1.3680",
            "open": "148.8110",
            "close": "149.7730",
            "high": "149.9210",
            "low": "148.5530"
        },
        "market_summary": "The USD/JPY is pushing toward the key ¥150.00 level, driven by strong U.S. economic data that has caused markets to unwind bets on aggressive Federal Reserve rate cuts. This dollar strength is compounded by softer-than-expected Tokyo inflation data, which has reduced immediate expectations for a Bank of Japan rate hike and reinforced the policy divergence between the two central banks. While the pair faces technical resistance near ¥151.00, the fundamental bias remains skewed to the upside for the dollar.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "USD/JPY Price Forecast - Dollar to Yen Powers Toward ¥150.00 After Strong U.S. Data and BoJ Inflation Miss - tradingnews.com",
                "source": "tradingnews.com",
                "url": "https://www.tradingnews.com/news/usd-jpy-price-forecast-dollar-to-yen-powers-toward-150-yen-after-strong-us-data",
                "body": "USD/JPY Price Forecast - Dollar to Yen Powers Toward ¥150.00 After Strong U.S. Data and BoJ Inflation Miss\nWith GDP growth at 3.8%, jobless claims at 218K, and Tokyo CPI cooling to 2.5%, the yen weakens as Fed cut bets unwind—leaving USD/JPY bulls targeting ¥151.00 and beyond | That's TradingNEWS\nUSD/JPY Pushes Toward 150.00 as Fed Easing Bets Unwind\nUSD/JPY surged into Friday’s European session, trading as high as ¥149.96 before easing to ¥149.52 by 17:00 GMT, marking a weekly gain of 1.3%. The move was powered by a sharp reduction in expectations for aggressive Federal Reserve rate cuts after a combination of stronger-than-expected U.S. macroeconomic releases. Second-quarter GDP was revised up to 3.8% from 3.2%, while weekly jobless claims fell to 218,000, the lowest since July, countering fears of a softening labor market. The dollar index simultaneously climbed to 97.85 before easing back to 97.50, underlining broad greenback strength that lifted USD/JPY from its early-September lows of 146.90.\nTokyo CPI Miss Adds Pressure on the Yen\nThe Japanese yen’s weakness was exacerbated by softer-than-expected inflation data in Tokyo, where September headline CPI slowed to 2.5% year-on-year from 2.6% in August. The core measure held at 2.5% rather than accelerating to 2.6% as economists had forecast. Markets immediately trimmed the probability of an October Bank of Japan rate hike from 50% to just 35%. The moderation in Japan’s inflation gives policymakers at the BoJ further cover to maintain ultra-accommodative policy, reinforcing the divergence between U.S. and Japanese yields. The move has pushed the yen to its weakest level in eight weeks, with USD/JPY now retesting levels last seen on August 1, when the pair briefly reached 150.00.\nFed Cut Repricing Tightens Link Between Rates and USD/JPY\nCorrelation studies show USD/JPY tracking short-end U.S. yields and Fed funds futures with a coefficient near -0.94 over the past two weeks, a near-lockstep relationship. Futures markets now discount fewer than 50 basis points of additional easing in 2025, compared to nearly 100 basis points just a month earlier. This repricing, tied closely to resilient consumer spending and income growth in the U.S., has made USD/JPY extremely sensitive to U.S. data surprises. Traders note that while the Fed’s preferred inflation measure—the PCE deflator—rarely shocks, today’s release of spending and income details could prove more consequential for expectations and price action in USD/JPY.\nTechnical Levels: Resistance at 151.00, Support Near 149.00\nUSD/JPY’s technical picture has turned decisively bullish. The pair has broken above its 200-day moving average for the first time since June, now holding support near the ¥149.00 level. Momentum gauges confirm the strength of the move: the 14-day RSI is trending higher, and MACD remains firmly in positive territory. Bulls are eyeing resistance at ¥151.00, the October 2022 swing high, and further at ¥152.40, a level tested in late 2023. On the downside, any slip below ¥149.00 could expose the 20-day moving average near ¥148.25, while deeper pullbacks might target ¥147.50 where demand has previously emerged. Still, with Japan’s inflation losing steam and U.S. data consistently surprising to the upside, the bias remains skewed to the upside for now.\nRead More\n-\nKBWB ETF Climbs to $79.84 With 39.8% Annual Return, Banks Drive Rally Toward $93 Target\n26.09.2025 · TradingNEWS ArchiveStocks\n-\nBitcoin ETF Flows Whipsaw $241M In and $258M Out as BTC-USD Stalls at $109K— Bulls Target $146K in October\n26.09.2025 · TradingNEWS ArchiveCrypto\n-\nNatural Gas Futures Drop to $2.83, Storage Surplus and AECO Crash Weigh as LNG Flows Steady\n26.09.2025 · TradingNEWS ArchiveCommodities\n-\nGBP/USD Price Forecast - Pound to Dollar Slides to 1.3322 as U.S. Growth Outpaces U.K. Outlook and BoE Caution Adds Pressure\n26.09.2025 · TradingNEWS ArchiveForex\nMarket Sentiment and Trading Flows\nInstitutional accounts in Tokyo and New York have bee"
            },
            {
                "title": "Better-than-expected US data sends dollar/yen plunging. Could the Bank of Japan accelerate interest rate hikes? - 富途牛牛",
                "source": "富途牛牛",
                "url": "https://news.futunn.com/en/post/62668963/better-than-expected-us-data-sends-dollar-yen-plunging-could",
                "body": "During the New York session on Friday (September 26), the US dollar fell 0.13% against the Japanese yen, pressured by stronger-than-expected US PCE data which weighed on the dollar’s performance. It is currently trading near 149.46. We explore the underlying reasons below. Reviewing today's movements, during the early Asian session, following the release of weaker-than-expected Tokyo CPI data from Japan, the exchange rate dropped nearly 30 points from 149.93 to 149.65.\nJapan's September Tokyo CPI data showed that core inflation in Tokyo came in at 2.5%, lower than the expected 2.8%. However, analysts noted that this result was influenced by non-recurring factors. At the same time, the data remains well above the central bank's 2% target, and pricing pressures continue to fuel market expectations for a potential rate hike in the near term. Later during the New York session, following the release of stronger-than-expected US PCE data, the US dollar fell by 40 points against the yen. Below is an analysis of these developments.\nNon-recurring factors may be the main cause of the decline in Tokyo's CPI data.\nThis data will become one of the key pieces of information studied by the Bank of Japan during its policy meeting on October 29-30, when the board will release updated quarterly growth and price forecasts. These forecasts will play a crucial role in their interest rate decisions.\nSpecifically, Tokyo's core consumer price index (CPI), which excludes volatile fresh food but includes fuel costs, rose 2.5% year-on-year in September, below the market consensus forecast of a 2.8% increase.\nTokyo's core CPI, a leading indicator of nationwide inflation trends, also saw a year-on-year rise of 2.5% in August.\nThe data shows that the September inflation rate fell short of expectations, mainly due to measures taken by the Tokyo Metropolitan Government to ease the pressure of rising living costs, such as reducing childcare fees and water charges.\nDespite some non-recurring factors influencing the figures, Japan's inflation rate is actually slowing down.\nNotably, Japan's Tokyo CPI, which excludes volatile fresh food and fuel costs, is closely monitored by the Bank of Japan as a preferred indicator of underlying inflation. In September, it rose 2.5% year-on-year, compared with a 3.0% increase in August.\nThe food inflation rate, excluding fresh food items such as vegetables, slowed to 6.9% in September from 7.4% in August.\nKoya Miyamae, senior economist at SMBC Nikko Securities, stated: 'The overall trend of slowing food inflation, after excluding one-off factors, remains unchanged.' However, I believe the inflation data itself is still far from the Bank of Japan’s target.\nInflation data supports the Bank of Japan's decision to maintain interest rates unchanged.\nMiyamae expects the Bank of Japan to raise interest rates in December or January next year, pointing out: 'When deciding on the timing of rate hikes, the Bank of Japan must not only focus on price trends but also consider the impact of exports, corporate profits, and U.S. tariffs on the economy.'\nThe Bank of Japan ended a decade-long large-scale stimulus program last year and raised short-term interest rates to 0.5% in January this year, when the central bank believed Japan was close to sustainably achieving its 2% inflation target.\nHowever, the data shows that the inflation issue remains unresolved.\nAlthough Japan's nationwide core inflation has remained above 2% for more than three consecutive years, Bank of Japan Governor Kazuo Ueda emphasized that further interest rate hikes should be approached cautiously to ensure that price increases are driven by wage growth and strong domestic demand.\nThe Bank of Japan maintained interest rates unchanged last week. However, there are signs that attention within the central bank's board to increasing price pressures is rising — two members dissented, proposing to raise interest rates to 0.75%, though the proposal was not adopted.\nRecent rapid ri"
            },
            {
                "title": "USD/JPY: Dollar Chases ¥150.00, Crosses 200-Day Moving Average in Steep Push Higher - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/tradingview:80cab4bc2094b:0-usd-jpy-dollar-chases-150-00-crosses-200-day-moving-average-in-steep-push-higher/",
                "body": "USD/JPY: Dollar Chases ¥150.00, Crosses 200-Day Moving Average in Steep Push Higher\n1 min read\nKey points:\n- Dollar makes progress against yen\n- PCE inflation lands in line with views\n- Bank of Japan stubborn about rate hikes\nAll three major simple moving averages are now under the exchange rate. Next resistance sits at ¥150.90, a previous top-turned-sell wall.\n💪 Dollar Gets Lift to 2-Month Top\n- The USDJPY pair climbed to a two-month high of 149.80 on Friday as currency traders were juggling rate-cut expectations and economic news releases.\n- The US dollar has been pushing higher in the past few days, adding pips against a weaker yen in what appears to be an exit of a mid-term consolidation.\n- Between early August and current market prices, the dollar-yen has been range-bound and trading sideways, hugging all three big simple moving averages (SMAs). But that’s not the case anymore.\n👉 PCE Inflation Points to More Cuts\n- The dollar’s fresh jump got the pair out of the range and above the 200-day moving average, which had been sitting at ¥148.50. Next up, if the bulls continue plowing ahead, is the ¥150.90 level as a mid-term resistance.\n- But on the flip side, yen bulls and dollar bears might have more in common than they suspect. And the recent inflation data indicated that the outlook for the dollar will likely remain uncertain and even gloomy.\n- PCE inflation was released earlier today, showing that prices increased in line with expectations at 2.9% annual growth in August. In other words, the Fed’s rate-cut plans remain intact and traders still eyeball two trims by the end of the year.\n🥱 Boring Pair Is Boring\n- Technically, that should take away some of the dollar’s appeal. Lower interest rates bring lower yields on fixed-income assets. That threatens to undermine investor confidence in the underlying currency.\n- But on the other end is the Bank of Japan, which is still reluctant to raise rates due to economic worries and growth headaches. All while inflation in Japan stays well above the bank’s 2% target. That stubbornness keeps a lid on yen appreciation.\n- The back-and-forth has been going on for a while now and that’s why this pair hasn’t been a very good bet for the long-term swing traders. Year to date, the dollar-yen is lower by less than 5%. The EURUSD is up 13% over the same time span and the GBPUSD is up 8%."
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0064",
            "open": "1.3890",
            "close": "1.3937",
            "high": "1.3949",
            "low": "1.3885"
        },
        "market_summary": "The USD/CAD pair is trading near the top of its recent range, driven by a resilient US economy and a strong dollar that overshadows supportive factors for the CAD like soaring gold prices. The primary driver is divergent monetary policy, with the Federal Reserve expected to cut rates less than the Bank of Canada, keeping the loonie under pressure in the near term. While some analysts expect a potential CAD recovery in the future, technical levels and current rate expectations are favoring USD strength for now.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "RBC Sticks With Bearish USD-CAD Call Despite Strong Dollar - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/rbc-sticks-with-bearish-usd-cad-call-despite-strong-dollar",
                "body": "about 10 hours ago • 2 mins\nJoin the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nRoyal Bank of Canada isn't budging on its negative outlook for the Canadian dollar, even as solid economic data pushes USD-CAD close to the top of its recent trading range.\nWhat does this mean?\nUSD-CAD has recently climbed toward the high end of the 1.3550–1.4000 band, lining up with RBC’s call. The jump stems from a resilient US economy and a strong greenback, with investors bracing for next week’s labor report. But RBC still views these moves as short-lived. The bank expects that the Federal Reserve’s eventual interest rate cuts—paired with a Bank of Canada cycle that's mostly in the rearview mirror—will put pressure on USD-CAD in the coming months. Technically, a close above the August peak of 1.3925 points to further upside, with resistance at 1.3977 and 1.4081. Meanwhile, support zones at 1.3925, 1.3862, and 1.3839 are holding up for now, though a drop below 1.3722 could change the story.\nWhy should I care?\nFor markets: Interest rates steer the currency ship.\nWith the US dollar flexing its muscles, currency pairs like USD-CAD are moving in sync with every central bank signal. As traders scrutinize potential Fed and Bank of Canada moves, shifting expectations about rate cuts are fueling volatility in North American currencies. Right now, markets are glued to whether resistance levels will hold—or if USD-CAD’s range is about to crack.\nThe bigger picture: Policy gaps widen the divide.\nAt the heart of USD-CAD’s journey are monetary policy differences. The Fed may be eyeing future cuts as US data holds up, while the Bank of Canada seems nearly done with its own cycle. These decisions ripple out to influence investment flows, Canadian exports, and even commodity prices. As policies evolve, they’ll shape where the Canadian dollar heads next—and how global investors play their cross-border bets.\nMentioned in story\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nInsight\nAlex Smith • about 15 hours ago\nQuick Take\nAberdeen Group x Finimize • about 18 hours ago\nNews\nFinimize Newsroom • about 9 hours ago\nNews\nFinimize Newsroom • about 9 hours ago\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article is based on reporting by MT Newswires. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies.\nGet the two biggest stories in finance, and the reasons why you should care, delivered to your inbox every day."
            },
            {
                "title": "Loonie not yet glittering, despite gold surge - Investment Executive",
                "source": "Investment Executive",
                "url": "https://www.investmentexecutive.com/news/research-and-markets/loonie-not-yet-glittering-despite-gold-surge/",
                "body": "Gold prices are soaring, and while that provides a boost to the value of the Canadian dollar, that support is being outweighed by the monetary policy picture, which favours the U.S. greenback, says Desjardins Group.\nIn a report on Friday, Desjardins said its analysis shows gold is becoming an increasingly important driver for the loonie, as Canada is a major producer and exporter of the precious metal, which has seen prices rise 43% so far this year.\n“Given this exposure, it would be reasonable to expect trade and investment flows to become increasingly supportive of the Canadian dollar,” it said.\nFor now, monetary policy remains a bigger factor for the loonie’s value against the U.S. dollar.\n“Gold prices currently explain about 12% of the weekly variance in USD/CAD — far more than oil prices, but a distant runner-up to monetary policy, which explains roughly 25%,” it said. “Put another way, the loonie isn’t ignoring gold prices, but their impact is being offset by interest rate expectations.”\nThe monetary policy picture currently favours the U.S. dollar, it noted.\n“While there are risks on both sides, we believe they are skewed towards the Fed doing a little less and the [Bank of Canada] doing a little more than the market anticipates. This should keep the loonie on the back foot for now,” the report said.\nLooking ahead, commodity prices may become a stronger support for the loonie in 2026, the report suggested.\n“A more broad-based rise in Canada’s terms of trade, including higher energy prices, may help revive the loonie’s ‘commodity currency’ status,” it said. “That outcome would also depend on whether higher prices and shifts in government policy stimulate domestic production — either through new capital investment or the activation of idle capacity.”"
            },
            {
                "title": "2 Stocks I’d Buy Before the Loonie Rallies Back - Yahoo",
                "source": "Yahoo",
                "url": "https://ca.finance.yahoo.com/news/2-stocks-d-buy-loonie-004500384.html",
                "body": "Written by Joey Frenette at The Motley Fool Canada\nThe Canadian dollar has been in a bit of a slump over the past few weeks, recently sinking to around US$0.71 or so. Undoubtedly, as the Bank of Canada continues to reduce interest rates alongside the Fed, the loonie might not have a chance to strengthen versus the U.S. dollar. And with the Canadian economy facing challenges at the hands of tariffs and pressures on the price of oil, there’s certainly potential for more pain in the loonie before the next big bounce.\nEither way, various pundits think that the loonie might actually be in for a bit of a break as it looks to gain a couple of cents going into the new year. And while the Canadian economy seems to be facing more than its fair share of headwinds, I wouldn’t be too surprised to see the loonie rise to the US$0.73–0.75 range by next summer. Indeed, a gain of a few cents to nearly a nickel might not seem like much, but it could mean a great deal for the firms that make most, if not all, of their money on this side of the border.\nWho knows? If the Bank of Canada started its rate-cutting cycle first, it might also be the first to hit the pause button. Of course, there’s also a chance that the Fed takes on a slightly more hawkish tilt before the Bank of Canada does. And if that happens, there is the risk of more pain for the Canadian dollar. Either way, here are two stocks I’d check out as the U.S. dollar looks to weaken a bit versus the loonie over the next year.\nMagna International\nMagna International (TSX:MG) is a Canadian auto-part maker that’s starting to pick up speed, now up over 26% in the past three months. Undoubtedly, the tariff fears were likely overdone, and with so much damage already done to the stock, investors have more reason to be constructive, especially as the auto scene looks to start picking up again.\nWith a decent past quarter and enough management confidence to hike its guidance, I’m inclined to start viewing MG shares as less of a value trap and more like a deep-value play. The stock trades at 11.1 times trailing price-to-earnings (P/E) or about an 8 times forward P/E. With a nice 4.2% dividend yield and the means to benefit greatly from a stronger Canadian dollar, I do think the path of least resistance might be higher in 2026.\nIndeed, a stronger Canadian dollar would help reduce input costs and add to the company’s margins, which also stand to benefit from ongoing operating efficiency efforts.\nFortis\nFortis (TSX:FTS) is another Canadian stock that wouldn’t mind a stronger loonie. Of course, the utility does business on both sides of the border. However, a stronger loonie would allow the firm a bit more purchasing power as it continues to embark on its capital expenditure plan. Not to mention a stronger loonie would make the U.S. dollar debt load seem even less hefty."
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "0.7500",
            "open": "200.0800",
            "close": "199.8170",
            "high": "200.3370",
            "low": "199.5870"
        },
        "market_summary": "The GBP/JPY is consolidating near the key 200.00 psychological level, caught between a weaker Yen following soft Tokyo inflation data and significant technical resistance. The pair is struggling to break decisively above the 200.35-200.50 resistance zone, which is seen as a gateway to further gains. Downside movement is being contained by support near the 199.20 area, keeping the pair in a sideways range as the market searches for a clear directional catalyst.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "GBP/JPY Price Forecast: Key resistance remains at the 200.35-200.50 area - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-price-forecast-key-resistance-remains-at-the-20035-20050-area-202509260822",
                "body": "- The Pound bounced up on Yen weakness, but is struggling to find acceptance above 200.00.\n- Moderate Tokyo inflation levels have dampened hopes of BoJ tightening in October.\n- GBP/JPY: key resistance lies ahead of 200.50, support is at the 199.20 area.\nThe British Pound is trimming Thursday’s losses on Friday, favoured by generalised Japanese Yen weakness, following relatively soft inflation figures in the Tokyo area. The pair has reached prices above the 200.00 level after bouncing at 199.55, but remains below a key resistance area ahead of 200.50\nData released on Thursday revealed that the advanced Tokyo CPI grew at a 2.5% yearly rate in September, down from 2.6% in August. The Core CPI remained steady at 2.5% against market expectations of an uptick to 2.6%. These figures give some more leeway to the BoJ to maintain its “wait-and-see” stance at its next monetary policy meeting, and have increased bearish pressure on the Yen.\nTechnical analysis: Looking for direction around 200.00\nThe technical picture is mixed. The pair broke below an ascending trendline support, yet bears have been unable to pull the pair below 199.20. The 4-hour Relative Strength Index is wavering around the 50 level, indicating a lack of a clear bias.\nBulls will find significant resistance in the area between Thursday’s high, at 200.35, and the reverse trendline, now around 200.50. A confirmation above here would open the way towards the year-to-date high, at 201.27.\nA reversal from current levels, on the contrary, would face support at the mentioned 199.20 (September 19 and 23 lows). Further down, the 78.6% retracement of the September rally, which meets the September 5 low at 198.65, and the September 2 low at 198.35, would be the next bearish targets.\n(This story was corrected on September 26 at 10:10 GMT to say that the September 5 low is at 198.65 and the September 2 at 198.35, not at 168.65 and 1.1830 as previously reported.)\nJapanese Yen Price Today\nThe table below shows the percentage change of Japanese Yen (JPY) against listed major currencies today. Japanese Yen was the strongest against the New Zealand Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Japanese Yen from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent JPY (base)/USD (quote).\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\nFXStreet and the author do not provide personalized recommendations. The author makes no repres"
            },
            {
                "title": "The GBPJPY repeats the sideways flcuatution– Forecast today – 26-9-2025 - Economies.com",
                "source": "Economies.com",
                "url": "https://www.economies.com/forex/gbp-jpy-analysis/the-gbpjpy-repeats-the-sideways-flcuatution%E2%80%93-forecast-today-%E2%80%93-26-9-2025-121448",
                "body": "No news for the GBPJPY pair, to keep providing weak sideways trading by its stability near200.10, reminding you that the continuation of providing support by the main indicators that might help it to breach the barrier at 200.45, to open the way for achieving several gains that might begin at 200.95 and 201.55.\nWhile the risk of activating the bearish correction track again is represented by the trading reach below 198.60, and holding below it will increase the efficiency of the bearish correction, to expect targeting the support initial at 197.80.\nThe expected trading range for today is between 199.20 and 201.55\nTrend forecast: Bullish\nPlatinum price continued its bullish attempts yesterday, taking advantage of providing positive momentum by the main indicators, achieving the extra targets by its rally to $1550.00, to face %2.236 Fibonacci extension level, which forms an intraday obstacle against the bullish scenario.\nStochastic attempt to exit the overbought level might force the price to provide sideways trading, but the stability above $1475.00 supports the continuation of the positivity, which might target $1583.00 resistance in the near period trading.\nThe expected trading range for today is between $1515.00 and $1560.00\nTrend forecast: Bullish\nCopper price hit $4.8600 level, to bounce quickly to settle below the barrier at $4.7500 level, attempting to catch its breath and gaining new positive momentum to reinforce the chances of reaching extra stations.\nThe bullish track remains valid by the stability of the price above the moving average 55, as it forms an extra support near $4.3800, note that its success in confirming the breach will allow it to reach 44.9500 followed by $5.3100 on a near-term basis.\nThe expected trading range for today is between $4.5500 and $4.9500\nTrend forecast: Bullish\nThe (ETHUSD) price rose in its last intraday trading, after breaking the critical support at $4,100, amid the dominance of the main bearish trend on the short-term basis and its trading alongside minor trendline, indicating the big volume of the negative momentum, with the continuation of the negative pressure that comes from its trading below EMA50, attempting to recover its previous losses, and attempting to offload some of its clear oversold conditions on the relative strength indicators, especially with the emergence of the positive signals.\nGet high-accuracy trading signals delivered directly to your Telegram. Subscribe to specialized packages tailored for the world’s top markets:\nUS Stock Signals from €44/month\nSubscribe via TelegramCrypto Signals from €49/month\nSubscribe via TelegramForex Signals from €49/month\nSubscribe via TelegramVIP Signals (Gold, Oil, Forex, Bitcoin, Ethereum, Indices) from €179/month\nSubscribe via TelegramFull VIP signals performance report for September 15–19, 2025:"
            },
            {
                "title": "U.S. Dollar Retreats As PCE Price Index Meets Estimates: Analysis For EUR/USD, GBP/USD, USD/CAD, USD/JPY - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/u-s-dollar-retreats-as-pce-price-index-meets-estimates-analysis-for-eur-usd-gbp-usd-usd-cad-usd-jpy-1551094",
                "body": "U.S. Dollar Index is losing ground as traders react to PCE Price Index report. The report indicated that PCE Price Index increased by +0.3% month-over-month in August, in line with analyst estimates.\nIn case U.S. Dollar Index settles below the support at 98.00 – 98.20, it will move towards the next support level at 97.10 – 97.30.\nEUR/USD rebounds after recent pullback as traders focus on economic reports from the U.S. Michigan Consumer Sentiment declined from 58.2 in August to 55.1 in September, compared to analyst forecast of 55.4.\nCurrently, EUR/USD is trying to settle back above the resistance at 1.1685 – 1.1700. In case this attempt is successful, EUR/USD will move towards the next resistance level, which is located in the 1.1785 – 1.1800 range.\nGBP/USD attempts to settle back above the 1.3400 level as traders focus on general weakness of the American currency.\nIn case GBP/USD manages to settle above 1.3400, it will move towards the next resistance level at 1.3485 – 1.3500. RSI is in the moderate territory, so there is plenty of room to gain momentum in case the right catalysts emerge.\nUSD/CAD is mostly flat as traders take some profits off the table after the strong rally. Other commodity-related currencies are moving higher in today’s trading session as traders react to the rally in commodity markets.\nA move above the 1.3950 level will open the way to the test of the resistance level at 1.4000 – 1.4015.\nUSD/JPY made an attempt to settle above the 150.00 level but lost momentum and pulled back.\nThe technical picture remains unchanged as USD/JPY needs to settle above 150.00 to gain additional upside momentum in the near term.\nFor a look at all of today’s economic events, check out our economic calendar.\nVladimir is an independent trader, with over 18 years of experience in the financial markets. His expertise spans a wide range of instruments like stocks, futures, forex, indices, and commodities, forecasting both long-term and short-term market movements."
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "1,717.0000",
            "open": "109,206.5000",
            "close": "109,339.5000",
            "high": "110,364.5000",
            "low": "108,647.5000"
        },
        "market_summary": "Bitcoin is experiencing significant volatility and consolidation around the $109,000-$110,000 level, pressured by whipsawing institutional ETF flows that saw large inflows quickly followed by sharp outflows. Despite the short-term bearish pressure and increased trader expectations of a dip below $100,000, the overall long-term technical structure remains bullish above key moving averages, with major catalysts like potential 401(k) allocations and expanded retail access on the horizon.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Stay Updated on Crypto: Latest Insights on Bitcoin, Ethereum, and Altcoins! - Investing News Network",
                "source": "Investing News Network",
                "url": "https://investingnews.com/cryptocurrency-market-recap/",
                "body": "Crypto Market Update: Institutional Treasuries Sharply Scale Back Bitcoin Acquisitions\nElsewhere in the crypto landscape, BlackRock has filed to launch a Bitcoin Premium Income ETF, expanding its push beyond its US$87 billion iShares Bitcoin Trust.\nHere's a quick recap of the crypto landscape for Friday (September 26) as of 9:00 a.m. UTC.\nGet the latest insights on Bitcoin, Ether and altcoins, along with a round-up of key cryptocurrency market news.\nBitcoin and Ether price update\nBitcoin (BTC) was priced at US$109,743, trading 1.2 percent lower over the past 24 hours. Its lowest valuation of the day was US$108,776, while its highest was US$111,694.\nBitcoin price performance, September 26, 2025.\nChart via TradingView.\nBitcoin is hovering just under the US$110,000 mark, and traders on prediction platforms now see a 61 percent chance it will dip below US$100,000 before 2026, up sharply from last week’s 41 percent.\nPosition trader Bob Loukas noted that the asset is nearing its weekly cycle low five weeks after peaking, with bears retaining short-term control after Bitcoin failed to break all-time highs in mid-August. CoinDesk’s James Van Straten compared today's setup to September 2024, when Bitcoin corrected 11 percent before rebounding into October.\nBitcoin dominance in the crypto market is 56.83 percent, a 1.37 percent slight rise over the week.\nFor its part, Ether (ETH) was priced at US$4,019.71, trading 1.1 percent lower over the past 24 hours and near its lowest valuation of the day, which was US$3,833.75. Its price peaked at US$4,019.71.\nEther is struggling with critical support levels after slipping under US$4,000, down nearly 20 percent in the last two weeks. Analysts warn that failure to reclaim momentum could send Ether tumbling toward US$2,750, with Ali Martinez highlighting US$4,841 as the key level needed to break the downtrend.\nPressure on Ether intensified after co-founder Jeffrey Wilcke transferred 1,500 ETH worth US$6 million to Kraken on Thursday (September 25), following previous multimillion-dollar deposits to the exchange.\nAltcoin price update\n- Solana (SOL) was priced at US$196.27, a decrease of 2.7 percent over the last 24 hours. Its lowest valuation of the day was US$191.28, while its highest value was US$203.50.\n- XRP was trading for US$2.74, down by 3.6 percent over the last 24 hourse. Its highest valuation of the day was US$2.86, while its lowest was US$2.70.\nETF data and derivatives trends\nSpot Bitcoin exchange-traded funds (ETFs) continued to see institutional demand this week.\nInflows were led by BlackRock’s iShares Bitcoin Trust (NASDAQ:IBIT), which saw net purchases of US$128.9 million and taking its total assets under management to about US$87.2 billion.\nOther US spot BTC ETFs also saw significant inflows. The Fidelity Advantage Bitcoin ETF (TSX:FBTC) added US$29.7 million, and the ARK 21Shares Bitcoin ETF (BATS:ARKB) added US$37.7 million on the same day.\nIn total, US Bitcoin ETFs now hold roughly US$150 billion in Bitcoin, equivalent to about 1.33 million to 1.35 million coins and roughly 6 to 7 percent of Bitcoin’s total market cap.\nAltcoin ETF momentum is also building. In mid-September, the first spot altcoin ETFs hit US markets, including the REX Osprey XRP ETF (CBOE:XRPR) and the REX Osprey DOGE ETF (CBOE:DOJE).\nSeveral firms are now racing to list others, including Solana and Stellar.\nOn the derivatives side, leverage remains near record levels. CryptoQuant data shows Bitcoin futures open interest above US$220 billion in September — a historic high — suggesting heavy speculative positioning. Analysts warn that clustered stops around the current price could trigger massive liquidations if breached.\nEther also saw significant liquidations in this pullback, reflecting similar crowd behavior in derivatives. Perpetual funding rates for both Bitcoin and Ether remain near zero, indicating a balanced market bias between bulls and bears.\nNext week's crypto news to watch\nSeveral major events are on "
            },
            {
                "title": "Bitcoin ETF Flows Swing $241M In, $258M Out — (BTC-USD) Holds $109,285 as October Rally to $146K in Sight - tradingnews.com",
                "source": "tradingnews.com",
                "url": "https://www.tradingnews.com/news/bitcoin-etf-flows-whispaw-241m-usd-in-258-usd-out",
                "body": "Bitcoin ETF Flows Whipsaw $241M In and $258M Out as BTC-USD Stalls at $109K— Bulls Target $146K in October\nWith Morgan Stanley preparing Bitcoin access for 10M E*TRADE clients and lawmakers pushing 401(k) crypto allocations, ETF volatility defines short-term sentiment as BTC eyes $124K–$146K upside against $98.9K SMA support | That's TradingNEWS\nBitcoin (BTC-USD) Faces Turbulence at $109,285 as ETF Flows Swing Wildly and Bulls Eye $146,000\nETF Flows See $241M In and $258M Out Within 48 Hours\nBitcoin’s price action has been defined by massive institutional rotation. On September 24, BTC spot ETFs recorded $241 million in net inflows, led by BlackRock’s iBIT with $129 million, pushing optimism back into the market. Just 24 hours later, however, sentiment flipped as ETFs bled $258.4 million in outflows, the sharpest reversal since August. Fidelity’s FBTC shed $114.8 million, Bitwise’s BITB lost $80.5 million, while Grayscale’s GBTC saw $42.9 million in redemptions. The volatility highlights how institutional flows, once seen as a stabilizing force, are now amplifying short-term swings around the $109,000–$113,000 range.\nBitcoin Price Holds $109,285 Despite Bearish Pressure\nAs of early September 26, Bitcoin trades at $109,285, down 2.1% daily, with trading volumes surging 39% to $68 billion. Despite the dip, BTC remains well above its 50-day simple moving average (SMA) at $98,971 and far higher than its 200-day SMA at $53,084, confirming a strong uptrend since mid-2024. Technical models suggest that if bulls defend the $110,000 psychological level, Bitcoin could reclaim its $124,474 all-time high before pushing toward the 0.618 Fibonacci extension at $146,000 — representing a 32% surge.\nInstitutional Catalysts: Morgan Stanley and 401(k) Crypto Access\nMorgan Stanley, which manages $1.7 trillion in assets, announced plans to introduce Bitcoin trading on its E*TRADE platform in 2026, opening potential exposure for 10 million retail investors. In parallel, lawmakers are lobbying the SEC to approve Trump’s executive order allowing 401(k) retirement accounts — worth over $9 trillion — to allocate into Bitcoin. If enacted, such a policy could unleash one of the largest waves of institutional adoption in the history of crypto markets, with the potential to dwarf daily ETF inflows.\nRead More\n-\nKBWB ETF Climbs to $79.84 With 39.8% Annual Return, Banks Drive Rally Toward $93 Target\n26.09.2025 · TradingNEWS ArchiveStocks\n-\nSolana Price Forecast - SOL-USD Battles $200 Support as $17B Futures OI and $300M Abu Dhabi Treasury Shift Market Sentiment\n26.09.2025 · TradingNEWS ArchiveCrypto\n-\nNatural Gas Futures Drop to $2.83, Storage Surplus and AECO Crash Weigh as LNG Flows Steady\n26.09.2025 · TradingNEWS ArchiveCommodities\n-\nUSD/JPY Price Forecast - Dollar to Yen Powers Toward ¥150.00 After Strong U.S. Data and BoJ Inflation Miss\n26.09.2025 · TradingNEWS ArchiveForex\nTechnical Indicators Show Fragile Balance\nMomentum remains mixed. The Relative Strength Index (RSI) sits at 52.47, in neutral territory, leaving room for further upside but hinting at ongoing selling pressure. Futures open interest surged 0.14% to $78.81 billion, showing traders aggressively positioning ahead of October. Meanwhile, the MACD line remains negative at -1,154, though the histogram’s green bars suggest bearish momentum is fading. A decisive breakout above $111,100–$113,700 resistance would confirm a bullish extension, while failure risks a correction toward $105,200 or even $102,800.\nMacro Tailwinds Add to October Optimism\nRevised U.S. GDP growth at 3.8% in Q2 strengthens the bullish case for Bitcoin as risk assets attract renewed demand. With inflation data (PCE at an expected 2.7%) due September 26, markets are pricing 91.9% odds of another Fed rate cut in October. Trump’s tariff-driven inflationary policies add complexity, but for Bitcoin, looser monetary policy and capital reallocation could become major upside triggers.\nOutlook: Can Bitcoin Hit $146,000 in October?\nIf"
            },
            {
                "title": "Should You Buy ARK 21Shares Bitcoin ETF (ARKB) While It's Under $40? - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/buy-ark-21shares-bitcoin-etf-120700769.html",
                "body": "Cryptocurrency headlines can be tiresome. Who cares if Bitcoin(CRYPTO: BTC) is worth $100,000 or $120,000 per coin, right? Both figures are enough to cover four years of college tuition, or buy a luxury car will all the bells and whistles (yes, even that one!). Sure, you can buy just a small fraction of a Bitcoin at a time, but it can be difficult to wrap your head around these large numbers.\nBut what if you could get exposure to Bitcoin's potential upside without dealing with those intimidating five- and six-figure price tags? Enter the ARK 21Shares Bitcoin ETF(NYSEMKT: ARKB), trading at $37.75 per share on September 24, 2025.\nThat's enough for a nice dinner, not a tricked-out SUV. Let's use the lower stakes of ARKB shares to consider the value and risks of Bitcoin investments.\nSame Bitcoin exposure, friendlier price tag\nFor all intents and purposes, buying shares of ARKB is the same thing as buying Bitcoin directly. Cathie Wood's ARK Invest team is actually buying and selling Bitcoin to reflect the cash being invested in this fund. As an exchange-traded fund (ETF), ARKB brings a couple of small quirks to your Bitcoin investment:\nThere's a modest management fee with an annual expense ratio of 0.21%. It's a bit higher than the 0.01% expense ratios you see in Vanguard ETFs, but it's actually one of the lowest fees in the spot Bitcoin ETF arena.\nWhen Bitcoin prices go up, ARKB's chart will follow. The direct effect remains when the crypto chart is pointing down, too.\nBitcoin is the only holding in the single-asset ARKB fund's portfolio.\nWith $4.86 billion of (pure Bitcoin) assets under management, ARKB is one of the most popular and most liquid spot Bitcoin funds. Investors should have no problem completing trades in this fund at a fair price.\nThe fund currently holds roughly 42,744 Bitcoins in its portfolio, and offers investor access to these assets through 50.3 million ARKB shares. That's how ARKB can provide Bitcoin exposure at such modest share prices -- by dividing a large pie in lots and lots of smaller slices. ARKB will be worth $40 right after Bitcoin passes the $120,000 mark.\nWhy Bitcoin believers are still buying\nNow that you know what the ARK 21Shares Bitcoin ETF is, it's time for a more direct investing question. Is ARKB a buy below $40 per share, based on what's going on with the underlying Bitcoin market?\nWell, Bitcoin and related investments have been strong performers lately. These Bitcoin bets have approximately quintupled the 15.7% gains of the S&P 500 (SNPINDEX: ^GSPC) stock market index over the last year:\nThat chart includes last November's election results, which brought a more crypto-friendly administration to Capitol Hill. Excluding that surge, Bitcoin's results have been comparable to the stock market in 2025. Generally speaking, the cryptocurrency tends to jump when the economy looks strong and fall when investors feel more pressure. Bitcoin is a very volatile asset, and many bulls make leveraged crypto investments with borrowed money. That's harder to do when interest rates are high, so macroeconomic moves have a direct impact on this sector.\nThe risks don't shrink with the share price, though\nIn a longer perspective, you have to weigh Bitcoin's potential gains against a plethora of unique risks. Bitcoin maximalists expect the \"digital gold\" to replace the U.S. dollar and physical gold as the preferred methods for storing and transferring money around the world. If that happens, the sky just might be the limit.\nARK Invest founder Cathie Wood and Strategy (NASDAQ: MSTR) chairman Michael Saylor both see million-dollar price tags for Bitcoin as early as the year 2030. That would translate into ARKB prices in the $850 range per share -- a massive return on your investment of less than $40. ARK Invest would probably split those shares several times before then, keeping the share price at a more digestible level.\nIf you agree with their ultra-optimistic views, the ARK 21Shares Bitcoin ETF certainly looks li"
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "220.5000",
            "open": "3,885.0900",
            "close": "4,011.2900",
            "high": "4,070.4100",
            "low": "3,849.9100"
        },
        "market_summary": "Ethereum's market is characterized by significant institutional accumulation and a resurgence in USDT transfer dominance, indicating strong underlying demand and ecosystem strength. However, these positive fundamentals are currently being overshadowed by a sharp market-wide downturn, with ETH struggling to hold key support levels amid a climate of fear and heavy trader liquidations. This creates a complex environment where long-term confidence clashes with short-term price volatility and negative sentiment.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Ethereum Whale Nets $2.43M in Profits, Retains $12.16M in Unclaimed Wagers - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560604990215",
                "body": "A well-known\nThis whale began accumulating by purchasing 8,733 ETH for $26.67 million in\nThe latest deposit of 1,000 ETH—worth $1.582 billion—indicates the whale is now selectively cashing in on profits as Ethereum’s price stabilizes. At the $1,582 level, this sale would realize gains from the whale’s original lower entry price. However, the whale still owns a large portion of ETH at an average cost of $3,054, so the remaining 7,733 ETH would need to reach $3,937 to fully realize the $12.16 million in unrealized profits [ 1 ]. This division between realized and unrealized profits shows the whale’s strategy of balancing capital protection with ongoing market exposure.\nIn recent months, institutional interest in Ethereum has grown, with companies like BitMine and anonymous whales acquiring nearly $882 million in ETH through over-the-counter (OTC) deals and exchange withdrawals. BitMine, a publicly traded\nThe whale’s recent moves also mirror wider market conditions. Ethereum’s price saw significant swings in 2025, dropping sharply to $1,400 early in the year before partially rebounding. Despite this volatility, the whale’s choice to deposit 1,000 ETH for possible profit-taking suggests continued faith in Ethereum’s strength. At the same time, on-chain data from platforms such as\nExperts point out that distinguishing between realized and unrealized profits is essential for understanding market sentiment. Realized gains offer liquidity and can be tax-efficient, while unrealized profits indicate speculative positioning and investor psychology. The whale’s current holdings—split between realized and unrealized profits—demonstrate Ethereum’s dual role as both a short-term trading vehicle and a long-term investment. Institutional players, including corporate treasuries and ETFs, have reinforced this by acquiring ETH in large quantities, often through strategic fundraising and stock issuance [ 4 ].\nThe whale’s recent actions also prompt questions about the broader market outlook. If large holders continue to selectively take profits, it may point to a maturing market where strategic capital management takes precedence over pure speculation. On the other hand, the persistence of significant unrealized gains suggests that many whales remain optimistic about Ethereum’s long-term prospects, especially as regulatory clarity and institutional involvement increase. As Ethereum approaches important resistance levels, the balance between realized and unrealized gains is likely to remain a key focus for market watchers."
            },
            {
                "title": "Ethereum vs. Tron: Who Rules the USDT Transfers in 2025 - OneSafe",
                "source": "OneSafe",
                "url": "https://www.onesafe.io/blog/ethereum-vs-tron-usdt-transfers-2025",
                "body": "Here we are in 2025, and guess what? Ethereum has snatched the crown back from Tron, becoming the top dog in USDT transfers. After two years of Tron's reign, this isn't just a number game; it's a whole paradigm shift in the crypto world. With institutional investors flocking to Ethereum, fintech startups need to catch up with the changing tides of stablecoin transactions. Let’s dive into what this all means.\nEthereum Back on Top\nEthereum has pulled ahead with a whopping $23.7 billion in weekly USDT transfers, leaving Tron's $22 billion in the dust. This marks a significant shift in the stablecoin transfer landscape, which has been under Tron's thumb for a long while. The resurgence of Ethereum is largely thanks to new life in decentralized finance (DeFi). Protocols like Plasma, Morpho, and Maple have been luring in big bucks from institutional investors, and that’s giving Ethereum a much-needed boost.\nSure, the stablecoin market thrives on low-cost and fast networks, and Ethereum has these, but its depth of ecosystem is proving to be a compelling factor. Institutions are engaging more with Ethereum, which is strengthening its transaction volume and hinting at a return of capital to Ethereum-based lending and borrowing. This all points to how crucial institutional confidence and regulatory clarity are for the future of stablecoin transactions.\nTron's Game Plan\nTron has long claimed the title of the go-to network for USDT movement because of its low fees and speedy transactions. This strategy has been a lifesaver, especially when Ethereum’s gas fees were sky-high. But now with Ethereum back in the spotlight, Tron has had to pivot to stay relevant.\nJustin Sun, the man behind Tron, announced a 60% fee cut across the entire network to keep its user base intact. This is aimed at retaining both retail and institutional stablecoin users, especially during market swings. Tron has always banked on fee efficiency for its stablecoin circulation dominance, and this adjustment shows how it’s trying to keep pace with competition while managing transaction scalability.\nThe Role of Institutions\nInstitutional investors are key players in Ethereum's resurgence in USDT transfers. Their adoption through large-scale, compliant investments, and preference for infrastructure is a stark contrast to Tron's low-fee, high-throughput focus. Ethereum's allure for institutional players is reinforced by its regulatory clarity and robust DeFi ecosystem, which are essential for large-scale asset management and treasury operations.\nAs more fintech startups embrace crypto payroll solutions, understanding how institutions play into this is vital. Ethereum's pull among these investors emphasizes compliance and security in the evolving crypto payments landscape. Startups need to adapt to these trends to fully utilize crypto payroll platforms and maintain their growth trajectory.\nThe DeFi Effect\nDeFi protocols are shaking up the stablecoin transfers landscape beyond just Ethereum and Tron. They’re allowing cross-chain interoperability, liquidity aggregation, and multi-chain stablecoin swapping, broadening the scope for stablecoin transactions. With so many blockchain ecosystems, platforms are emerging to pool liquidity and trading options from various chains, enhancing stablecoin transfers in cost, speed, and security.\nAs DeFi continues to flourish, stablecoins are becoming essential in lending, borrowing, and yield farming protocols across different chains. This surge in demand for efficient stablecoin transfers is pushing innovation in cross-chain bridges and multi-chain DeFi apps, ramping up the competition in this space.\nBest Practices for Crypto Treasury Management\nFor those fintech startups and SMEs looking to integrate crypto solutions, solid treasury management is a must. With the stablecoin payments landscape changing, businesses have to adopt strong compliance frameworks to navigate regulatory complexities. This includes understanding liquidity access, ope"
            },
            {
                "title": "Fear dominates market as BTC, ETH struggle for support - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/news/feed/66949-fear-dominates-market-as-btc-eth-struggle-for-support",
                "body": "Fear dominates market as BTC, ETH struggle for support\nCrypto markets clawed back some ground on Friday, but traders weren’t buying the bounce. The global digital assets market surged marginally over the last 24 hours to hover around $3.78 trillion. Bitcoin pushed back over $110,000 while Ether managed to regain $4,000 mark.\nWhile the market posted a minor recovery rally, the Fear and Greed depicted among the investors. CoinGlass data shows that more than 133k traders were liquidated over the last 24 hours. The total liquidations turned up around $329 million. The largest single liquidation order of BTC/USDT valued at $3.87 million happened on Binance.\n$329M wiped out as crypto rebounds\nData shows that $186 million worth of liquidated bets (56%) turned out to be long positions. However, Short bets amounted to $143 million. This shows that the crypto market is witnessing heavy fluctuations with pumps and dumps. Cryptopolitan reported that Thursday witnessed $1.1 billion liquidation washout.\nThe recovery coincided with fresh inflation data that matched forecasts. The Fed’s preferred gauge, PCE, rose 2.7% in August, while the core measure was up 2.9%. The numbers were hardly surprising, but they reinforced the sense that price pressures are easing. Analysts suggest that if inflation trends lower, risk assets may find support, but any upside surprises could quickly reset rate cut expectations.\nEthereum led the altcoins’ recovery by rising nearly 4%. ETH is down by 18% from its all-time high of above $4,900. Solana and Dogecoin added marginal gains. After a great run, SOL is trailing by 15% in the last 7 days. It is trading at an average price of $203 at the press time.\nHowever, Hyperliquid’s HYPE token was the lone standout in the top tier. It is up by more than 7% and bucking the sea of red. HYPE price is now up by 86% on a year-to-date (YTD) basis. It is trading at an average price of $44.64 at the press time.\nCrypto fear hits 5-month low\nThe Fear and Greed Index dropped to its lowest since April to hit 28 points on the chart. This signals “fear” across the market. Analysts pointed to heavy stress among short-term holders as Bitcoin traded under their cost basis of $109,700 for the first time in five months.\nBTC price has been running down by 6% over the last 7 days. It is trading at an average price of $109,601 at the press time. The 24-hour trading dipped by 18% to stand at $60.92 billion.\nSome see a silver lining in the cleanout. Analyst Maartunn, in a post, mentioned that roughly $12 billion in leveraged altcoin bets and $3 billion in speculative Bitcoin positions have been flushed.\nStocks and commodities painted a calmer picture as the S&P 500 gained 0.22% and gold edged higher. But a new wrinkle looms with Donald Trump’s latest tariff package set to take effect on October 1. That announcement could shake up risk appetite across markets and crypto.\nDon’t just read crypto news. Understand it. Subscribe to our newsletter. It's free.\nFear dominates market as BTC, ETH struggle for support\nCrypto markets clawed back some ground on Friday, but traders weren’t buying the bounce. The global digital assets market surged marginally over the last 24 hours to hover around $3.78 trillion. Bitcoin pushed back over $110,000 while Ether managed to regain $4,000 mark.\nWhile the market posted a minor recovery rally, the Fear and Greed depicted among the investors. CoinGlass data shows that more than 133k traders were liquidated over the last 24 hours. The total liquidations turned up around $329 million. The largest single liquidation order of BTC/USDT valued at $3.87 million happened on Binance.\n$329M wiped out as crypto rebounds\nData shows that $186 million worth of liquidated bets (56%) turned out to be long positions. However, Short bets amounted to $143 million. This shows that the crypto market is witnessing heavy fluctuations with pumps and dumps. Cryptopolitan reported that Thursday witnessed $1.1 billion liquidation washout.\nThe rec"
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "11.8207",
            "open": "196.1600",
            "close": "199.8800",
            "high": "202.5307",
            "low": "190.7100"
        },
        "market_summary": "The Zeus Network has launched BitcoinKit, a developer toolkit designed to seamlessly integrate Bitcoin into the Solana DeFi ecosystem. This initiative addresses key technical barriers like UTXO management and liquidity constraints by enabling the use of tokenized BTC (zBTC) for trading, lending, and yield strategies on Solana. Despite the positive development for Solana's utility and potential to unlock significant Bitcoin liquidity, the associated ZEUS token has seen a price decline, underperforming the broader market.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Zeus Network Launches BitcoinKit for Bitcoin-Solana DeFi Integration - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/zeus-network-launches-bitcoinkit-bitcoin-215955680.html",
                "body": "Zeus Network has launched BitcoinKit, a developer kit designed to connect Bitcoin with the Solana ecosystem, addressing several persistent barriers to Bitcoin’s use in decentralized finance (DeFi). The initiative introduces modular tools that enable projects to unlock programmable Bitcoin features on Solana, aiming to boost accessibility and utility for DeFi platforms.\nDeveloper Kit Solves Bitcoin DeFi’s Biggest Roadblocks\nBitcoinKit’s release comes at a time when Bitcoin infrastructure is fragmented, and available tooling is outdated. Also, the demand for Bitcoin DeFi is increasing in tandem with its price, and it is well known that developing within the Bitcoin network is challenging.\nDevelopers face significant limitations, including complex UTXO management, scaling bottlenecks, and a lack of practical DeFi products. According to the team at Zeus Network, the solution provides routes for integrating BTC trading pairs through tokenized assets, such as zBTC, allowing users to participate in borrowing, lending, and yield strategies via familiar Solana interfaces.\nThe kit addresses specific issues cited by developers: missing users, infrastructure gaps, and liquidity constraints. BitcoinKit interfaces range from single-line widgets for instant wallet support to comprehensive SDKs for enterprise adoption, removing technical hurdles for projects seeking to bridge Bitcoin and Solana environments.\nModular Architecture Expands Developer Options\nWith BitcoinKit, decentralized exchanges, wallets, and BTC-native experiences can gain modular integration paths. Developers can launch BTC-native DeFi protocols, add tokenized BTC balances, facilitate cross-chain routes using Zeus Reserve, and distribute BTC-based rewards. This flexible architecture aims to replace broken and limited legacy solutions, simplifying the onboarding of both new and existing users onto Solana-powered Bitcoin applications.\nZeus Network positions BitcoinKit as a catalyst for building a self-sustaining DeFi ecosystem around Bitcoin, offering infrastructure that matches project scope and user needs. By supporting plug-and-play integration modules, the kit helps developers reach broader audiences and unlock the liquidity traditionally trapped in siloed Bitcoin wallets.\nWorth mentioning that this launch doesn’t generate a lot of movement in the price of the ZEUS token, according to our price aggregator. Even though the cost of the token is following the crypto market, with a 10.14% drop in its prices over the last week.\nGrowing Bitcoin DeFi Demand Outpaces Mixed Token Performance\nThe launch underscores Zeus Network’s commitment to driving the adoption of programmable Bitcoin on Solana, aiming to deliver scalable, secure, and user-friendly tools for a new wave of cross-chain DeFi applications."
            },
            {
                "title": "Zeus launches BitcoinKit to plug BTC directly into Solana DeFi - Blockworks",
                "source": "Blockworks",
                "url": "https://blockworks.co/news/zeus-bitcoinkit-solana",
                "body": "Zeus launches BitcoinKit to plug BTC directly into Solana DeFi\nZeus’s BitcoinKit is unveiled in its latest epoch to empower BTC-native apps on Solana\nK illustrator Photo/Shutterstock and Adobe modified by Blockworks\nZeus Network has launched BitcoinKit, a new set of developer tools designed to make Bitcoin usable inside Solana’s defi ecosystem.\nThe release was announced during the project’s Epoch 10 update, part of its ongoing effort to bring more Bitcoin liquidity onto Solana without relying on custodians or wrapped tokens.\nZeus functions as a link between the Bitcoin and Solana blockchains. Through its system, users can lock Bitcoin on its native network and receive an equivalent token, called zBTC, on Solana. This design aims to let developers and traders use Bitcoin in DeFi applications while keeping the underlying asset secured on Bitcoin.\nThe network’s earlier projects include APOLLO, which mints zBTC. They also created btcSOL, which converts SOL yield into Bitcoin, and LightningFi, which aggregates Bitcoin yield. Together, these applications form the basis of what Zeus calls the “Bitcoin economy on Solana.”\nBitcoinKit builds on that foundation by offering a full toolkit for developers, including software libraries, command-line tools, and application interfaces. The goal is to make it easier for apps such as decentralized exchanges, wallets, and cross-chain protocols to integrate Bitcoin directly.\nZeus’s cross-chain model relies on nodes, guardians, and verification mechanisms that will need to be tested under real-world conditions.\nThis is a developing story.\nThis article was generated with the assistance of AI and reviewed by editor Jeffrey Albus before publication.\nGet the news in your inbox. Explore Blockworks newsletters:\n- The Breakdown: Decoding crypto and the markets. Daily.\n- 0xResearch: Alpha in your inbox. Think like an analyst.\n- Empire: Crypto news and analysis to start your day.\n- Forward Guidance: The intersection of crypto, macro and policy.\n- The Drop: Apps, games, memes and more.\n- Lightspeed: All things Solana.\n- Supply Shock: Bitcoin, bitcoin, bitcoin."
            },
            {
                "title": "Zeus Network Launches BitcoinKit for Bitcoin-Solana DeFi Integration - Coinspeaker",
                "source": "Coinspeaker",
                "url": "https://www.coinspeaker.com/zeus-network-launches-bitcoinkit-for-bitcoin-solana-defi-integration/",
                "body": "José Rafael Peña Gholam is a cryptocurrency journalist and editor with 9 years of experience in the industry. He wrote at top outlets like CriptoNoticias, BeInCrypto, and CoinDesk. Specializing in Bitcoin, blockchain, and Web3, he creates news, analysis, and educational content for global audiences in both Spanish and English.\nKey Notes\n- BitcoinKit provides comprehensive solutions for Bitcoin's DeFi integration challenges including UTXO management and scaling issues.\n- The modular architecture enables developers to build BTC-native protocols with tokenized assets like zBTC for lending and trading.\n- Bitcoin DeFi demand surged 2,000% in 2024 while ZEUS token dropped 10.14% despite the product launch announcement.\nZeus Network has launched BitcoinKit, a developer kit designed to connect Bitcoin with the Solana ecosystem, addressing several persistent barriers to Bitcoin’s use in decentralized finance (DeFi). The initiative introduces modular tools that enable projects to unlock programmable Bitcoin features on Solana, aiming to boost accessibility and utility for DeFi platforms.\nDeveloper Kit Solves Bitcoin DeFi’s Biggest Roadblocks\nBitcoinKit’s release comes at a time when Bitcoin infrastructure is fragmented, and available tooling is outdated. Also, the demand for Bitcoin DeFi is increasing in tandem with its price, and it is well known that developing within the Bitcoin network is challenging.\nDevelopers face significant limitations, including complex UTXO management, scaling bottlenecks, and a lack of practical DeFi products. According to the team at Zeus Network, the solution provides routes for integrating BTC trading pairs through tokenized assets, such as zBTC, allowing users to participate in borrowing, lending, and yield strategies via familiar Solana interfaces.\nIntroducing BitcoinKit – Powered by @ZeusNetworkHQ\nTurn Bitcoin into programmable money and tap directly into $2T of BTC liquidity, no corporate gatekeepers required.\nLearn more ↓ pic.twitter.com/ZdRKSIi52G\n— BitcoinKit – Powered by Zeus (@BitcoinKitDev) September 26, 2025\nThe kit addresses specific issues cited by developers: missing users, infrastructure gaps, and liquidity constraints. BitcoinKit interfaces range from single-line widgets for instant wallet support to comprehensive SDKs for enterprise adoption, removing technical hurdles for projects seeking to bridge Bitcoin and Solana environments.\nModular Architecture Expands Developer Options\nWith BitcoinKit, decentralized exchanges, wallets, and BTC-native experiences can gain modular integration paths. Developers can launch BTC-native DeFi protocols, add tokenized BTC balances, facilitate cross-chain routes using Zeus Reserve, and distribute BTC-based rewards. This flexible architecture aims to replace broken and limited legacy solutions, simplifying the onboarding of both new and existing users onto Solana-powered Bitcoin applications.\nZeus Network positions BitcoinKit as a catalyst for building a self-sustaining DeFi ecosystem around Bitcoin, offering infrastructure that matches project scope and user needs. By supporting plug-and-play integration modules, the kit helps developers reach broader audiences and unlock the liquidity traditionally trapped in siloed Bitcoin wallets.\nWorth mentioning that this launch doesn’t generate a lot of movement in the price of the ZEUS token, according to our price aggregator. Even though the cost of the token is following the crypto market, with a 10.14% drop in its prices over the last week.\nGrowing Bitcoin DeFi Demand Outpaces Mixed Token Performance\nThe launch underscores Zeus Network’s commitment to driving the adoption of programmable Bitcoin on Solana, aiming to deliver scalable, secure, and user-friendly tools for a new wave of cross-chain DeFi applications.\nMeanwhile, the price of Bitcoin BTC $109 527 24h volatility: 0.1% Market cap: $2.18 T Vol. 24h: $59.38 B continues to rise, and as a result, demand for a DeFi ecosystem is also increasing. For example, i"
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "440.150",
            "open": "46,180.800",
            "close": "45,976.680",
            "high": "46,238.550",
            "low": "45,798.400"
        },
        "market_summary": "The US30 (Dow Jones) showed modest gains in a mixed market environment, with its performance diverging from the declines seen in the tech-heavy Nasdaq and S&P 500. This movement was driven by sector-specific strength in industrials and consumer staples, while the broader market faced pressure from rising interest rate concerns ahead of key inflation data. Despite near-term volatility, a positive historical trend for Q4 and strong economic fundamentals, including robust GDP growth and anticipated consumer spending, provide a foundation for potential strength.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Stock Market Today : Dow Gains +0.33% ; S&P 500 and Nasdaq Fall ; – Eurasia Business News - Berawang News",
                "source": "Berawang News",
                "url": "https://berawangnews.com/stock-market-today-dow-gains-0-33-sp-500-and-fall-eurasia-business-news/",
                "body": "Stock Market Today: Dow Gains +0.33%; S&P 500 and Nasdaq Fall\nIn the latest market update, the Dow Jones Industrial Average experienced a modest gain of 0.33%, while the S&P 500 and Nasdaq Composite saw declines. This mixed performance illustrates the volatility and complexity of the current economic landscape, influenced by various factors including corporate earnings reports, inflation concerns, and geopolitical tensions.\nOverview of Major Index Performance\nDow Jones Industrial Average\nThe Dow Jones Industrial Average, a price-weighted index that includes 30 significant publicly traded companies in the United States, rose by 0.33%. This increase reflects gains in several key sectors, particularly in industrials and consumer staples. Companies such as The Coca-Cola Company and UnitedHealth Group contributed to this upward movement, showcasing resilience in consumer demand despite broader economic uncertainties. Investors in the Dow may find comfort in the index’s relative stability compared to its peers, especially as it comprises established companies with a history of steady performance.\nS&P 500\nThe S&P 500, which tracks the performance of 500 of the largest companies listed on stock exchanges in the U.S., fell during the trading session. This decline highlights the challenges faced by technology and healthcare sectors, which are often influential in determining the index’s overall performance. Notably, stocks from major tech firms like Alphabet Inc. and Amazon.com Inc. weighed heavily on the index, as they continue to grapple with rising costs and the potential for slower growth due to tightening monetary policy. Investors are particularly cautious as companies navigate a challenging economic environment, leading to increased volatility in stock prices.\nNasdaq Composite\nThe Nasdaq Composite, known for its heavy weighting in technology stocks, also experienced a downturn. The fall in the Nasdaq can be attributed to a combination of rising interest rates, which tend to impact tech stocks more severely, and ongoing concerns regarding inflation. As the Federal Reserve continues its monetary policy tightening, technology shares remain under pressure, with many investors reassessing their growth forecasts. The combination of external economic pressures and internal corporate performance has created a challenging climate for the tech-heavy index.\nFactors Influencing Market Movements\nEconomic Indicators\nEconomic indicators play a significant role in shaping market performance. Recent reports on inflation rates and employment figures have raised concerns among investors. The latest Consumer Price Index (CPI) data pointed to persistent inflation, which could lead to further interest rate hikes by the Federal Reserve. Such actions typically exert downward pressure on stock prices, as higher rates can slow consumer spending and corporate investment. The unemployment rate also remains a crucial metric, with any fluctuations sending ripples through market confidence.\nCorporate Earnings\nEarnings season is critical for stock market movements, and recent quarterly reports have shown mixed results. Some companies exceeded analysts’ expectations, while others failed to deliver, leading to volatility in their respective stock prices. For instance, tech giants like Meta Platforms Inc. reported better-than-expected earnings, leading to short-term spikes in their stock prices. Conversely, companies in the retail sector, such as Walmart Inc., faced challenges due to supply chain disruptions and increased operational costs. Investors are closely monitoring these earnings releases to gauge the overall health of the economy, as they provide insight into sectors that are performing well and those that are struggling.\nGeopolitical Tensions\nGeopolitical events also significantly influence market sentiment. Recent developments in global trade relations, including tensions between major economies, have introduced uncertainty into the markets. The ongoing"
            },
            {
                "title": "Dow Jones futures hold steady as traders await US PCE inflation data - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/dow-jones-futures-hold-steady-as-traders-await-us-pce-inflation-data-202509260747",
                "body": "- Dow Jones futures remain steady due to market caution ahead of the US August PCE Price Index data.\n- US markets fell as strong economic data may prompt the Fed to slow deeper rate cuts.\n- Tech stocks dragged, with Oracle down 5% and Tesla off 4%, while CarMax plunged 20% on weak earnings.\nDow Jones futures edge higher by 0.16% to trade near 46,350 during European hours on Friday, ahead of the United States (US) regular opening. Meanwhile, the S&P 500 futures gain 0.16% to remain above 6,650, while Nasdaq 100 futures climb 0.12% to trade near 24,650.\nUS index futures move little as traders adopt caution ahead of the US August Personal Consumption Expenditures (PCE) Price Index data, the Federal Reserve’s (Fed) preferred inflation gauge, for further clarity on the policy outlook.\nOn Thursday’s regular session, Wall Street marked a third consecutive decline, with the Dow Jones declining 0.38%, while the S&P 500 and Nasdaq each lost 0.5%. Tech stocks weighed heavily on the market, with Oracle slipping 5% and Tesla down 4%. CarMax tumbled 20% after posting weak earnings, while Intel surged 9% on reports it had approached Apple regarding an investment.\nUS stocks faced challenges as solid economic data from the United States (US) may prompt the US Federal Reserve (Fed) to adopt a more cautious approach to deliver deeper interest rate cuts. US Initial Jobless Claims declined to 218K last week, the lowest since July. The market expectations were an increase to 235K from 232K previously.\nThe US Gross Domestic Product (GDP) Annualized grew 3.8% in the second quarter (Q2), coming in above the previous estimate and the estimation of 3.3%. Meanwhile, the GDP Price Index rose 2.1% in the same period, as compared to the expected and previous 2.0% growth.\nDow Jones FAQs\nThe Dow Jones Industrial Average, one of the oldest stock market indices in the world, is compiled of the 30 most traded stocks in the US. The index is price-weighted rather than weighted by capitalization. It is calculated by summing the prices of the constituent stocks and dividing them by a factor, currently 0.152. The index was founded by Charles Dow, who also founded the Wall Street Journal. In later years it has been criticized for not being broadly representative enough because it only tracks 30 conglomerates, unlike broader indices such as the S&P 500.\nMany different factors drive the Dow Jones Industrial Average (DJIA). The aggregate performance of the component companies revealed in quarterly company earnings reports is the main one. US and global macroeconomic data also contributes as it impacts on investor sentiment. The level of interest rates, set by the Federal Reserve (Fed), also influences the DJIA as it affects the cost of credit, on which many corporations are heavily reliant. Therefore, inflation can be a major driver as well as other metrics which impact the Fed decisions.\nDow Theory is a method for identifying the primary trend of the stock market developed by Charles Dow. A key step is to compare the direction of the Dow Jones Industrial Average (DJIA) and the Dow Jones Transportation Average (DJTA) and only follow trends where both are moving in the same direction. Volume is a confirmatory criteria. The theory uses elements of peak and trough analysis. Dow’s theory posits three trend phases: accumulation, when smart money starts buying or selling; public participation, when the wider public joins in; and distribution, when the smart money exits.\nThere are a number of ways to trade the DJIA. One is to use ETFs which allow investors to trade the DJIA as a single security, rather than having to buy shares in all 30 constituent companies. A leading example is the SPDR Dow Jones Industrial Average ETF (DIA). DJIA futures contracts enable traders to speculate on the future value of the index and Options provide the right, but not the obligation, to buy or sell the index at a predetermined price in the future. Mutual funds enable investors to buy a share of a"
            },
            {
                "title": "4 Reasons for Q4 to Start on a Strong Note: ETFs to Play - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/zacks:37bbc757c094b:0-4-reasons-for-q4-to-start-on-a-strong-note-etfs-to-play/",
                "body": "4 Reasons for Q4 to Start on a Strong Note: ETFs to Play\nThe S&P 500, the Nasdaq and the Dow Jones — all hit all-time highs this year, having gained about 12.5%, 16.1% and 8.4%, respectively, so far this year (as of Sept. 25, 2025). But the fourth quarter may see even higher gains as it includes the all-important holiday season.\nThe fourth quarter of the year has actually been the best for the stock market. Over the past three decades, dated back to 1989, the Dow Jones (4.3%), the S&P (3.6%) and the Nasdaq (4.7%) posted gains in the fourth quarter, according to Kensho, and traded positively 75-80% of the time, per a CNBC article issued in 2019.\nLet’s find out what factors can hold up well for the stock market this fourth quarter.\nUpbeat U.S. GDP Growth\nThanks to stronger consumer spending, the U.S. economy grew at an unexpectedly robust 3.8% pace in Q2 of 2025, marking an upward revision of second-quarter growth released by the government.\nThe Commerce Department said Thursday that gross domestic product (GDP) bounced back in the spring after a 0.6% decline in the first quarter, which had been hit hard by trade tensions. The new estimate is higher than the previously reported 3.3% growth (per AP news, as quoted on Yahoo Finance).\nAll-Important Holiday Season\nThe fourth quarter embraces an all-important holiday season, and consumers tend to make solid discretionary purchases this time of the year. Note that consumer spending rose at a 2.5% clip in Q2, up from 0.6% in the first quarter and way higher than the 1.6% that the government had previously estimated.\nThis shows that the consumer spending pattern remains decently strong, which calls for a strong holiday season this year. This is especially true given that the Fed has started cutting interest rates from September 2025 to boost a weakening labor market. Market experts are anticipating further cuts this year, which should boost consumer spending even further.\nHost of AI Deals Announced in September\nWhile some market experts are concerned about the payoffs of huge investments being made in artificial intelligence (AI), the pace of AI investments is showing no sign of abating. NVIDIA has announced investment plans in OpenAI (worth up to $100 billion). Meanwhile, NVIDIA announced a $5 billion investment in Intel. There has been a deal announced between Alibaba and NVIDIA (per RTT news).\nCoreWeave announced an agreement with OpenAI to power the training of its most advanced next-generation models. Intel has reportedly approached Apple for an investment to fund its rebound, as quoted on Bloomberg. In short, the month has seen mega-deals in the AI space, which ensures that the AI boom is in fine fettle and should be able to drive Wall Street in the coming months.\nAlso, there have been deals in quantum computing. Among the notable ones, IonQ announced its intent to acquire Vector Atomic. Rigetti announced a three-year contract with the Air Force Research Laboratory (AFRL). Meanwhile, Trump and Britain joined forces on advancing AI, quantum computing and nuclear technologies (read: Here's Why Semiconductor ETFs Are Hitting 52-Week Highs).\nEarnings Strength\nAs we have consistently highlighted in recent weeks, the overall revisions trend of the S&P 500 earnings estimates remains positive, with estimates for the back half of the year steadily going up. For 2025 Q3, total S&P 500 index earnings are expected to be up 5.2% from the same period last year on 6.0% higher revenues, per the Earnings Trends. However, barring the Tech sector contribution, Q3 earnings for the rest of the S&P 500 index would be up only 2.2% (vs. 5.2% otherwise).\nETF Picks\nAgainst this backdrop, below we highlight a few ETFs that could be great picks for Q4.\niShares Russell 2000 ETF IWM – Zacks Rank #2 (Buy)\nSmall caps have gained momentum lately on Fed rate cut hopes and the upbeat GDP outlook provided by the Fed. As small-cap stocks are closely tied to the domestic economy, such developments go well with the seg"
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "46.800",
            "open": "9,240.440",
            "close": "9,241.690",
            "high": "9,250.690",
            "low": "9,203.890"
        },
        "market_summary": "The UK100 (FTSE 100) faced downward pressure as persistent inflation and a cautious Bank of England dampened investor sentiment, particularly impacting rate-sensitive sectors. This was compounded by sector-specific concerns, such as a sell-off in medical equipment stocks. However, these broad declines were partially offset by a significant rally in industrial mining stocks, which surged on the back of rising copper prices and strong global demand.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Hunting And 2 Other UK Penny Stocks Worth Watching - Yahoo",
                "source": "Yahoo",
                "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_bcc39813-6687-4060-a05d-e58211bc763c",
                "body": "Yahoo is part of the Yahoo family of brands.\nWhen you use our sites and apps, we use cookies to:\n- provide our sites and apps to you\n- authenticate users, apply security measures, and prevent spam and abuse, and\n- measure your use of our sites and apps\nIf you click '\nAccept all', we and\nour partners, including 238 who are part of the IAB Transparency & Consent Framework, will also store and/or access information on a device (in other words, use cookies) and use precise geolocation data and other personal data such as IP address and browsing and search data, for analytics, personalised advertising and content, advertising and content measurement, and audience research and services development.\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\nIf you would like to customise your choices, click 'Manage privacy settings'.\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy & cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our privacy policy and cookie policy."
            },
            {
                "title": "London Stocks Slip As Inflation And Medical Probes Rattle Investors - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/london-stocks-slip-as-inflation-and-medical-probes-rattle-investors",
                "body": "1 day ago • 2 mins\nJoin the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nLondon’s top stock indexes slid as persistent UK inflation and US investigations into imported medical goods spooked investors, but metal miners surged after copper notched its biggest rally in over a year.\nWhat does this mean?\nBoth the FTSE 100 and FTSE 250 closed in the red, dragged lower by worries over UK inflation, which remains the highest among G7 countries at 3.8%. A Bank of England official signaled that interest rate cuts could come slower than markets expect, adding more pressure on sectors sensitive to borrowing costs. Medical equipment stocks dipped after the US launched new national security reviews of imported health products, sending Convatec down over 6%. Construction stocks followed their European peers lower, and Mitchells & Butlers fell as sales growth slowed. On the flip side, Petershill Partners soared more than 33% after announcing plans to delist from London due to lackluster valuations. The day’s winners were industrial miners like Rio Tinto and Anglo American, which rallied as copper prices hit a 15-month high – a bullish sign for global demand. Investors are now looking ahead to updates from at least seven US Federal Reserve officials, hoping for direction on future interest rate moves.\nWhy should I care?\nFor markets: Inflation’s shadow keeps risk appetite in check.\nSticky inflation and uncertainty around interest rates are making investors more cautious, especially in the UK and across Europe. Sectors like healthcare and construction are under strain, while Petershill's decision to leave the London Stock Exchange highlights ongoing challenges for local capital markets. But it’s not all bleak – commodity-driven sectors are outperforming as global demand props up prices, with mining stocks enjoying strong gains thanks to copper’s surge.\nThe bigger picture: Central banks hold the keys to recovery.\nThe UK’s persistent inflation is setting it apart from other major economies and forcing the Bank of England to move slowly on rate cuts. Meanwhile, upcoming signals from US Federal Reserve officials could influence expectations for monetary policy worldwide. Whether rates come down or stay higher for longer could have lasting effects on investment decisions, sector performance, and the overall path to economic recovery.\nMentioned in story\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nInsight\nAlex Smith • about 15 hours ago\nQuick Take\nAberdeen Group x Finimize • about 18 hours ago\nNews\nFinimize Newsroom • about 9 hours ago\nNews\nFinimize Newsroom • about 9 hours ago\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies.\nGet the two biggest stories in finance, and the reasons why you should care, delivered to your inbox every day."
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "354.250",
            "open": "23,725.300",
            "close": "23,575.800",
            "high": "23,734.300",
            "low": "23,380.050"
        },
        "market_summary": "The GER40 (DAX) is facing headwinds from new U.S. tariffs, which are pressuring specific sectors like automotive and pharmaceuticals and contributing to a negative performance for the month. However, broader European markets remain relatively resilient, with the STOXX 600 posting a small gain. While U.S. inflation data was in line with expectations, supporting global risk sentiment, uncertainty surrounding Germany's upcoming budget negotiations is creating near-term volatility and souring sentiment toward German-exposed equities.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Germany's DAX Index Up; Daimler Truck Shares Down on Latest US Tariff Push - MarketScreener",
                "source": "MarketScreener",
                "url": "https://www.marketscreener.com/news/germany-s-dax-index-up-daimler-truck-shares-down-on-latest-us-tariff-push-ce7d5bdadb88fe27",
                "body": "Access Denied\nYou don't have permission to access \"http://www.marketscreener.com/news/germany-s-dax-index-up-daimler-truck-shares-down-on-latest-us-tariff-push-ce7d5bdadb88fe27\" on this server.\nReference #18.512b3417.1758952013.339a1988\nhttps://errors.edgesuite.net/18.512b3417.1758952013.339a1988"
            },
            {
                "title": "US Inflation Relieves Wall Street, Yields Stable - GV Wire",
                "source": "GV Wire",
                "url": "https://gvwire.com/2025/09/26/us-inflation-relieves-wall-street-yields-stable/",
                "body": "German share price index DAX graph is pictured at the stock exchange in Frankfurt, Germany, September 22, 2025. (Reuters File)\nShare\nNEW YORK — Steady U.S. inflation data reassured Wall Street, leading to gains on Friday while Treasury yields stayed largely flat and gold firmed on expectations the Federal Reserve may continue cutting interest rates this year.\nU.S. consumer spending rose slightly more than expected in August while the inflation rate rose to 2.7% from 2.6% in July, in line with economists’ expectations.\nConcerns continued to percolate around fresh White House tariffs on pharmaceuticals which had weighed on Asian bourses and put pressure on the dollar.\nPrice pressure is still to come, Citigroup’s global chief economist Nathan Sheets said.\n“Firms aggressively accumulated inventories during the first half of the year, and this has given them scope to delay price increases. But that process is now playing through,” Sheets said.\nThe Dow Jones Industrial Average was up 0.70%, the S&P 500 rose 0.46% and the Nasdaq Composite rose 0.18%.\nPresident Donald Trump imposed new 100% duties on imported branded drugs as well as new tariffs on goods ranging from trucks to kitchen cabinets on Thursday, in a move that again raised the specter of a trade war and complicated the inflation forecasts.\nEli Lilly shares rose 1.7%. Truck maker Paccar, which manufactures most of its trucks for the U.S. market domestically, gained 4.4% to top the S&P 500.\nNot Falling off a Cliff\nFriday’s personal consumption expenditures (PCE) index functions as a key component of the Federal Reserve’s inflation outlook.\nU.S. Treasury yields, which influence borrowing costs, moved little after the data was released.\nThe yield on benchmark U.S. 10-year notes rose 0.9 basis points to 4.183%, from 4.174% late on Thursday. The 30-year bond yield fell 0.1 basis points to 4.7516% from 4.753% late on Thursday.\n“The one bright spot was that income and spending were a little bit firmer than expected, which means the consumer isn’t falling off a cliff as the market was expecting,” said Gennadiy Goldberg, head of U.S. rates strategy at TD Securities.\nGold, a safe haven which usually benefits from lower interest rates, firmed and spot prices were last quoted 0.54% higher at $3,769.05 an ounce.\nInvestors now estimate an 85.5% probability of a rate cut in October and a 62% chance of another in December, the CME FedWatch Tool shows.\nThe Fed made its first interest rate cut of the year last week, and signaled further easing was to come. Treasury yields rose in spite of that.\nThis week, they declined after Fed Chair Jerome Powell gave few hints as to when cuts would come and emphasized the delicate balance facing the U.S. central bank.\nRichmond Fed Bank President Thomas Barkin told Bloomberg Television that tariffs meant he had very low confidence in inflation forecasts right now. Fed Vice Chair for Supervision Michelle Bowman speaks later on Friday.\n—\n(Reporting by Naomi Rovnick. Additional reporting by Rae Wee; Editing by Kate Mayberry, Stephen Coates, Aidan Lewis and Chizu Nomiyama)"
            },
            {
                "title": "German opportunity? - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/reuters.com,2025:newsml_L5N3VD0K3:0-german-opportunity/",
                "body": "German opportunity?\n- STOXX 600 up 0.3%\n- Insurers, banks lead\n- Trump introduces more tariffs\n- Wall St futures steady\nGERMAN OPPORTUNITY?\nAfter roaring higher in the early part of this year, European equities have been treading water over recent months, as investors wait for a new catalyst that could drive price action in the region.\nNext week's U.S. payrolls report could knock major bourses out of their range and Trump's latest tariff blitz brings another risk, but Barclays analysts are also highlighting the upcoming \"budget season\" in Europe.\nGermany, the main driver of Europe's equity strength this year, kicked off its budget negotiations this week and concerns have risen about funding infrastructure projects and a dialling down of reforms.\n\"Consequently, sentiment toward German-exposed equities has soured, with flows turning negative,\" writes Barclays.\nGermany's DAX DAX is down 1.2% in September, compared to a 0.3% gain for the pan-European STOXX 600 SXXP. The MDAX MDAX and SDAX SSDXP indexes of mid- and small-cap German stocks, which typically have more domestic exposure, are down 1.4% and 0.7%, respectively.\nBarclays expects some near-term volatility in German equities until November 27, when the budget is expected to be finalised, but thinks that could create a buying opportunity.\n\"As the froth that was built to into the exposed names is being wiped out, we would opportunistically re-engage with the space on further pullbacks, particularly as visibility on fund deployment improves,\" Barclays says.\n(Samuel Indyk)\n*****\nEARLIER ON LIVE MARKETS:\nEUROPEAN BOURSES SHRUG OFF TRUMP'S TARIFFS CLICK HERE\nSTOCKS COP ONE-TWO PUNCH CLICK HERE\nEUROPE BEFORE THE BELL: TRUMP DOES IT AGAIN CLICK HERE"
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "369.000",
            "open": "24,524.610",
            "close": "24,411.530",
            "high": "24,568.860",
            "low": "24,199.860"
        },
        "market_summary": "The Nasdaq 100 is experiencing a pullback from recent highs, driven by investor concerns over the Federal Reserve's potential to keep interest rates higher for longer following strong economic data. While the index saw mixed performances with some positive earnings beats, negative sentiment was fueled by significant earnings misses and guidance cuts from key constituents like Concentrix, alongside broader sector volatility. The market is also reacting to new potential tariff policies, adding to the uncertainty.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "UFP Industries' (NASDAQ:UFPI) earnings growth rate lags the 11% CAGR delivered to shareholders - Yahoo",
                "source": "Yahoo",
                "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_e3e1fa5a-7a38-4fb4-a5f4-de7f975706e8",
                "body": "Yahoo is part of the Yahoo family of brands.\nWhen you use our sites and apps, we use cookies to:\n- provide our sites and apps to you\n- authenticate users, apply security measures, and prevent spam and abuse, and\n- measure your use of our sites and apps\nIf you click '\nAccept all', we and\nour partners, including 238 who are part of the IAB Transparency & Consent Framework, will also store and/or access information on a device (in other words, use cookies) and use precise geolocation data and other personal data such as IP address and browsing and search data, for analytics, personalised advertising and content, advertising and content measurement, and audience research and services development.\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\nIf you would like to customise your choices, click 'Manage privacy settings'.\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy & cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our privacy policy and cookie policy."
            },
            {
                "title": "Concentrix Shares Fall After Q3 Earnings miss And Reduced Guidance - Benzinga",
                "source": "Benzinga",
                "url": "https://www.benzinga.com/trading-ideas/movers/25/09/47899525/concentrix-shares-fall-after-q3-earnings-miss-and-reduced-guidance",
                "body": "Concentrix Corporation (NASDAQ: CNXC) shares are trading lower after the company reported worse-than-expected third-quarter adjusted EPS results and cut its fiscal 2025 adjusted EPS guidance below estimates.\nWhat Happened: Concentrix reported quarterly earnings of $2.78 per share, which missed the Street estimate of $2.86. Quarterly revenue was $2.48 billion, above the analyst consensus estimate of $2.45 billion.\nThe company cut its fiscal 2025 adjusted non-GAAP EPS guidance to a range of $11.11 to $11.23, below the $11.69 analyst estimate. Concentrix increased its revenue outlook to between $9.79 billion and $9.82 billion, compared to the $9.77 billion estimate.\nFor the fourth quarter, the company provided non-GAAP earnings per share guidance in the range of $2.85 to $2.96, which was below the estimated adjusted EPS figure of $3.32. Additionally, Concentrix forecast its fourth quarter revenue between $2.53 billion and $2.55 billion for the quarter.\nDespite beating revenue expectations in quarter three and providing quarter four guidance above estimates, the earnings miss and reduced full-year profit outlook appear to weigh on investor sentiment.\nCNXC Price Action: Concentrix shares dipped 9.83% at $49.59 on Friday at the time of publication, according to Benzinga Pro.\nRead Next:\nImage: Shutterstock\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
            },
            {
                "title": "Nasdaq Stumbles as Fed Jitters Mount, Intel Soars, Tariffs Rattle Tech Markets - ts2.tech",
                "source": "ts2.tech",
                "url": "https://ts2.tech/en/nasdaq-stumbles-as-fed-jitters-mount-intel-soars-tariffs-rattle-tech-markets/",
                "body": "Key Facts:\n- Three-Day Slide: U.S. stocks fell for a third straight session on Thursday. The Nasdaq Composite lost about 0.5% to 22,384.70 [1] (Nasdaq-100 similarly dipped), erasing record highs set earlier in the week [2]. The S&P 500 and Dow also declined ~0.5% and 0.4% respectively [3] amid broad profit-taking in equities.\n- Hot Economic Data vs. Rate Cuts: Surprisingly strong U.S. economic reports – including an upward revision of Q2 GDP growth to +3.8% (from 3.3%) and a drop in weekly jobless claims to 218,000 [4] [5] – cast doubt on how aggressively the Federal Reserve will ease policy. The 10-year Treasury yield jumped to ~4.17% and the U.S. dollar index hit a one-week high near 98.5 [6] [7], underscoring expectations that interest rates may stay higher for longer.\n- Tech Winners and Losers: The tech sector saw mixed fortunes. Intel stock surged ~9% to lead the Nasdaq after reports that the chipmaker is seeking strategic investments – including a potential stake from Apple – to bolster its foundry business [8]. In contrast, Oracle shares tumbled ~5% after a Wall Street firm issued a rare “Sell” rating on the stock, sparking a third day of declines [9]. Tesla also slid over 4% amid profit-taking and rising EV competition, while Apple fell nearly 2% on valuation concerns [10] [11].\n- Earnings Highlights: Several Nasdaq-listed companies reported results. Retail giant Costco beat expectations with fiscal Q4 earnings of $5.87 per share on $86 billion in revenue, up ~9% year-over-year [12]. CarMax, however, plunged 20% – the S&P’s worst performer – after the used-car retailer’s quarterly profit and sales badly missed estimates [13]. Consulting firm Accenture topped revenue forecasts but its stock fell ~3% on cautious guidance [14], and Micron Technology posted record chip sales yet saw shares drop 3% as the post-AI-boom enthusiasm cooled [15].\n- Tariff Shocks Hit Pharma: In a surprise move, President Donald Trump announced sweeping new tariffs to take effect Oct. 1 – including 100% duties on imported branded pharmaceutical drugs, a 25% tariff on heavy trucks, and 30–50% tariffs on categories like kitchen cabinets and furniture [16] [17]. The news rattled global markets: Asian pharmaceutical stocks tumbled (Japan’s pharma index –1.2%, Hong Kong’s biotech index –2%) [18], and industry analysts noted that details on exemptions remain scarce.\n- Fed’s Mixed Signals: Federal Reserve officials struck a cautious tone in public remarks. Chicago Fed President Austan Goolsbee said he’s uneasy about cutting rates “too quickly” with inflation still above target, despite supporting last week’s rate cut [19]. Conversely, newly appointed Fed Governor Stephen Miran argued the economy is vulnerable and urged sharper rate cuts to avert a labor market “collapse” [20]. Traders responded by trimming bets on further easing – futures now imply slightly fewer rate reductions by year-end than a week ago [21].\n- Market Outlook: Investors are looking ahead to Friday’s release of the Personal Consumption Expenditures (PCE) price index – the Fed’s preferred inflation gauge – as a next crucial signal [22]. With another key U.S. jobs report due next week, many analysts expect continued market volatility. “The economic data…calls into question how much the Fed may cut rates again this year,” noted Peter Tuz of Chase Investment Counsel [23]. Still, bulls argue that easing price pressures or a gentle Fed could rekindle the tech rally, as “one big positive is it seems like the government is going to let big tech get bigger,” said Rick Meckler of Cherry Lane Investments [24].\nNasdaq and Indexes Retreat from Highs\nWall Street’s momentum faltered in the latter half of this week, with the Nasdaq Composite and Nasdaq-100 both posting their third straight daily loss on Thursday. The Nasdaq Composite closed at 22,384.70 (down 0.5%), and the S&P 500 and Dow Jones also fell around 0.5% and 0.4%, respectively [25]. These declines marked a sharp reversal from Monday, when"
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "80.960",
            "open": "6,644.460",
            "close": "6,609.240",
            "high": "6,652.710",
            "low": "6,571.750"
        },
        "market_summary": "The provided articles focus on political and cultural topics, specifically the health policy agenda of RFK Jr. and his HHS department, alongside a sports injury report. There is no direct information pertaining to the SPX500, corporate earnings, economic data, or market-moving events. The content is unrelated to equity market performance or financial conditions.\nSENTIMENT: Neutral\n\n**Overall Market Sentiment:** Neutral",
        "source_articles": [
            {
                "title": "RFK Jr.’s Obsession With the Past - The Atlantic",
                "source": "The Atlantic",
                "url": "https://www.theatlantic.com/newsletters/archive/2025/09/rfk-jr-maha-obsession-past/684390/",
                "body": "RFK Jr.’s Obsession With the Past\nA conversation with Elizabeth Bruenig about the MAHA movement’s ideological underpinnings\nThis is an edition of The Atlantic Daily, a newsletter that guides you through the biggest stories of the day, helps you discover new ideas, and recommends the best in culture. Sign up for it here.\nThe ascent of MAHA—the Trump administration’s movement to “Make America Healthy Again”—is part of a broader health revolution in the United States, one that venerates the past in order to carve out a purportedly healthier future. It has had mixed results; some MAHA tenets have little basis in medical literature (researchers pushed back on the White House’s announcement this week that Tylenol use during pregnancy could be linked to autism). In today’s Daily, my colleague Elizabeth Bruenig joins me for a conversation about her new article, “When Child Death Was Everywhere,” and the philosophy of the man behind the movement, Health and Human Services Secretary Robert F. Kennedy Jr.\nWill Gottsegen: How does the ideology of conservatism explain what Robert F. Kennedy Jr. is trying to do with health policy?\nElizabeth Bruenig: When you think of conservatism, you’re thinking basically of someone who wants to conserve. William F. Buckley Jr. said the conservative disposition “stands athwart history, yelling Stop.” I think that helps explain why RFK Jr., who was a lifelong liberal, wound up on the conservative side of things. He, like a lot of conservatives, feels that the answer to human health and happiness lies somewhere in the past. It’s a kind of nostalgia that drives what he’s doing.\nWill: Wasn’t that nostalgia for a supposedly healthier time once the province of the left?\nLiz: Vaccine skepticism was for a long time associated with the left, because it was associated with people who were skeptical of Western medicine or had a kind of “back to the earth” belief system that advocated holistic treatments and rejected modern pharmacology. Over time, anti-vax sentiment became more bipartisan, and then, after COVID, it just exploded on the right without exploding on the left.\nWill: Americans’ trust in institutions such as HHS and the CDC declined majorly after COVID, on the right and the left. Is that how you wind up with someone as skeptical of the medical establishment as RFK Jr.?\nLiz: I think it’s how you wind up with so many people who are interested in RFK Jr.’s message. RFK Jr. was already anti-vax by the time the pandemic came around, but what COVID changed is it created so many people who had serious doubts about our institutions. And I think that explains why you have so many people at this point who are willing to listen to an anti-vax message.\nWill: You describe a lot of what RFK Jr. is doing as an unwinding of old policies, or a vision of return to an earlier era. What are the wrongs he’s looking to right? And is there a way in which he’s reacting to specific policies?\nLiz: RFK Jr., if you look at his career, is someone who has focused on the purity of nature: protecting the purity of natural resources, clean water, protecting pristine natural sites from industrial pollution. So I think his view on vaccines and processed foods is all of a piece with everything else he’s done to try to keep things pure and natural. I do think that he is responding to the CDC’s actions during COVID. A lot of people wound up very disillusioned with the lockdowns, with the mask mandates, and so on. And RFK Jr. is very much capitalizing on that mistrust people developed of the CDC.\nWill: To what extent is this broad skepticism now self-sustaining? Will we even need RFK Jr. to keep the wheels turning?\nLiz: I’m afraid that we won’t. At this point, it’s become part of the belief system of the right, especially the MAGA right—just like how post–Donald Trump, we’ll still be dealing in some sense with the MAGA movement, because it’s changed how conservatives think about politics. We will still see right-wing anti-vax sentiment even afte"
            },
            {
                "title": "Packers list S Javon Bullard questionable, rule out two vs. Cowboys | Week 4 Injury Report - Green Bay Packers",
                "source": "Green Bay Packers",
                "url": "https://www.packers.com/news/packers-cowboys-injury-report-week-4-sept-26-2025",
                "body": "GREEN BAY – The Packers have listed safety Javon Bullard (concussion) questionable and ruled out tackles Zach Tom (oblique) and Anthony Belton (ankle) for Sunday's game against the Dallas Cowboys.\nLeft guard Aaron Banks (groin) is doubtful after not practicing this week.\nBullard entered the concussion protocol after colliding with Packers linebacker Quay Walker in the fourth quarter of Sunday's game against Cleveland. Bullard returned to practice Thursday and continued to practice in a limited capacity Friday.\nTom and Banks didn't practice this week after leaving the game against the Browns with injuries. Head Coach Matt LaFleur confirmed Friday morning that Belton also was hurt during Wednesday's practice but doesn't believe it's a \"long-term\" injury.\nVeteran Darian Kinnard briefly rotated at right tackle with Belton against Washington before the rookie second-round pick handled all the second-half reps there in a 27-18 victory.\nThe Packers acquired Kinnard from the Philadelphia Eagles on Aug. 25. He's played 50 snaps (36 offense, 14 special teams) in Green Bay's first three games.\n\"I think he's done a nice job. I think he gets better every day,\" said LaFleur of Kinnard. \"He gets more comfortable with what we're asking him to do. Even in the limited snaps he's played for us, I think he's done all right.\"\nThree Packers starters – left tackle Rasheed Walker (quadricep), tight end Tucker Kraft (knee/elbow), defensive lineman Devonte Wyatt (knee) – were all upgraded to full participation on Friday and will play against the Cowboys.\nAdditionally, the Packers didn't issue a game status for the following players who will be available: running back Josh Jacobs (ankle), defensive lineman Micah Parsons (back) and Karl Brooks (foot), quarterback Jordan Love (left thumb), tight end John FitzPatrick (groin), and cornerbacks Nate Hobbs (knee) and Bo Melton (shoulder).\nDallas ruled out All-Pro receiver CeeDee Lamb (ankle) and rookie guard Tyler Booker (ankle), who were both injured in last Sunday's 31-14 loss to the Chicago Bears.\nThe Cowboys didn't issue a game status for the cornerbacks DaRon Bland (foot), Trevon Diggs (knee) and Trikweze Bridges (knee), who will all be available."
            },
            {
                "title": "Meet Stefanie Spear, RFK Jr.’s “Attached at the Hip” HHS Deputy - Vanity Fair",
                "source": "Vanity Fair",
                "url": "https://www.vanityfair.com/news/story/meet-stefanie-spear",
                "body": "It took relentless fervor and no-holds-barred tactics to save the northern spotted owl, and the giant redwoods it called home. Activists disabled bulldozers, chained themselves to trees, drove spikes into the redwood trunks to thwart saws, and used bike locks to handcuff themselves to logging access gates. For symbolic effect, they also dressed as owls while issuing Native American–inspired war cries.\nAfter a three-month blaze of publicity, the Redwood Summer campaign of 1990 helped lead to the protection of California’s old-growth forests, safeguarding the owls’ habitat, and contributed in casting the Pacific Lumber Company, a subsidiary in the portfolio of a Texas hedge fund magnate, into ignominy.\nStefanie Penn Spear, now 57, was once a young activist involved in the protests, and has brought a seemingly similar mission to the headquarters of the US Department of Health and Human Services: guarding her boss, Robert F. Kennedy Jr., against internal and external attack with the same man-the-barricades zeal that worked so well in the Pacific Northwest.\nFrom the suite of offices on the sixth floor of the Hubert H. Humphrey Building, Kennedy, a longtime vaccine antagonist, is on a stated mission to Make America Healthy Again. But now, seven months into his tenure, many physicians and scientists view him as an existential threat to public health, degrading the nation’s vaccine infrastructure, slashing investments in critical scientific research, promoting treatments that have little proven efficacy, and maligning expert staff within US health agencies. To his many MAHA adherents, Kennedy, the perennially tanned descendant of Democratic royalty, is a self-avowed warrior in the fight against corporate corruption and a would-be progressive change agent in the right-wing Trump ecosystem—a mission that’s made him an endangered species, of sorts.\nAs his principal deputy chief of staff and senior counselor, Spear works from an office that connects to Kennedy’s suite through a door behind his desk. Spear has created, says a former HHS staffer, “this huge wall around him.” She is on seemingly constant watch to protect and shield him from disloyalty. In Kennedy’s seven months at the agency, heads have rolled—including even some brought in to further the MAHA agenda. Spear has remained a constant.\nSpear now sits at the liminal center of the current MAHA movement: a marriage of convenience that has yoked together the lefty wellness fringe, the vaccine-mandate-rejecting flank on the right, and the more mainstream MAGA GOP, happy to remove petroleum-based food dye from Froot Loops if it helps Republicans retain control of statehouses.\nKennedy and Spear’s professional relationship goes back at least 15 years. In their short time at HHS, they have left a consistent impression on those around them: “tethered,” “bolted together,” “attached at the hip,” “inseparable.” Their alliance is “untouchable,” one former White House official observes.\nThis assessment has taken on significant weight in recent months, as Spear has come into the crosshairs of Laura Loomer, the MAGA activist who has demonstrated particular sway with President Trump on personnel matters. Loomer has denounced Spear to her 1.8 million followers on X, calling her a “radical left” appointee. In the wake of Loomer’s August attacks, Kennedy used his official X account to defend Spear to his 1.1 million followers, describing her as a “fierce, loyal warrior for MAHA” who “works every day to advance President Trump’s vision for a healthier, stronger America.”\nA number of her former colleagues are aghast that Spear, the onetime eco-activist, has joined the drill-baby-drill Trump administration. Little more than a decade ago, she was denouncing the Keystone XL pipeline in a panel discussion sponsored by a Marxist opinion site, People’s World. Her consulting firm helped install renewable-energy infrastructure such as windmills, a particular bête noire for Trump. “It is fucking mind-blowing,”"
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "565.000",
            "open": "45,659.630",
            "close": "45,608.920",
            "high": "45,814.630",
            "low": "45,249.630"
        },
        "market_summary": "The Nikkei 225 fell nearly 1% as diminished expectations for Fed rate cuts and new US tariffs on pharmaceuticals pressured the market. However, the broader Topix index eked out a gain to a fresh record high, supported by a weak yen boosting exporters and strength in domestic sectors like real estate. The market is in a period of sector rotation, with recent tech winners declining while previously lagging domestic stocks advance.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "[Tokyo Stocks Close] Trump Suddenly Targets Pharmaceuticals! Nikkei 225 Falls Nearly 1%, Expectations for Fed Rate Cuts Diminish - 富途牛牛",
                "source": "富途牛牛",
                "url": "https://news.futunn.com/en/post/62660673/tokyo-stocks-close-trump-suddenly-targets-pharmaceuticals-nikkei-225-falls?level=1&data_ticket=1758951662755521",
                "body": "FX168 Financial News Agency (Asia-Pacific) reported on Friday (September 26) that Tokyo's stock market closed mixed, with exporters benefiting from the depreciation of the yen. However, as expectations for a US interest rate cut weakened, investors locked in some gains following recent significant rises in technology stocks.\nAt the close, the Nikkei 225 index fell by 399.94 points, or 0.87%, to end at 45,354.99 points. The broader Topix index rose by 1.67 points, or 0.05%, to 3,187.02 points, marking its third consecutive day of record highs. #JapanMarket#\nIn the main board market, the sectors that saw significant declines were non-ferrous metals and electrical stocks, while real estate and food stocks performed notably well, becoming prominent gainers.\nUS President Trump announced a 100% tariff on imported branded or patented drugs starting October 1, eliciting varied market reactions.\nThe pharmaceuticals sector was one of the worst-performing among the Tokyo Stock Exchange’s 33 industry segments, declining by 1.4%. Chugai Pharmaceutical’s shares plummeted by 4.8%, Sumitomo Pharma fell by 3.5%, Otsuka Holdings dropped by 2.9%, although Takeda Pharmaceutical only slipped by 0.1%, while Shionogi rose by 1%.\nJefferies analyst Stephen Barker stated that while he believed Trump's announcement was unlikely to have a 'heavy' tariff impact on Japan’s pharmaceutical industry, investors naturally could not ignore the potential risks.\nBarker noted that the divergence in performance between Sumitomo Pharma and Takeda Pharmaceutical might stem from their communication strategies.\n\"Takeda Pharmaceutical has been actively promoting that most of its products sold in the US are locally manufactured,\" he said. \"Whereas Sumitomo Pharma has been less transparent, with suspicions that they export drugs from Switzerland.\"\nAdditionally, market traders noted that rising US Treasury yields, coupled with upward revisions to US Gross Domestic Product (GDP) data, reinforced expectations that the Federal Reserve would not cut interest rates again in the near term, keeping the dollar above 149 yen in Tokyo trading.\nThe Nikkei index was weighed down by heavyweight semiconductor-related and artificial intelligence-linked stocks, which had seen substantial gains recently.\nAdditionally, the market was affected by an overnight decline in U.S. stocks, and weaker-than-expected initial jobless claims also diminished expectations for further monetary easing by the Federal Reserve.\nHowever, the market was supported by a weaker yen, with the currency's depreciation increasing the repatriated overseas profits of exporters. Analysts noted that sectors linked to domestic demand, such as real estate and food, have also drawn investor interest after lagging in performance previously.\nYuta Okamoto, a market analyst at Tokai Tokyo Research Institute, stated that while the stock market is primarily influenced by the U.S. market, the upcoming leadership election of the ruling party has sparked optimism about new economic policies, which could propel further gains in Japan's stock market."
            },
            {
                "title": "IPOs plunge 70% on TSE's Growth market as tighter standards loom - Nikkei Asia",
                "source": "Nikkei Asia",
                "url": "https://asia.nikkei.com/business/markets/ipo/ipos-plunge-70-on-tse-s-growth-market-as-tighter-standards-loom",
                "body": "TOKYO -- Initial public offerings on the Tokyo Stock Exchange's startup-focused Growth market dropped roughly 70% on the year in the six months to September ahead of tougher requirements meant to make it more competitive.\nTokyo bourse aims to weed out small listings to draw more global money\nJapan Exchange Group is raising the standards for companies to stay listed on the Tokyo Stock Exchange's Growth market. © Reuters\nTOKYO -- Initial public offerings on the Tokyo Stock Exchange's startup-focused Growth market dropped roughly 70% on the year in the six months to September ahead of tougher requirements meant to make it more competitive."
            },
            {
                "title": "Shigeru Fujimoto, dubbed \"Japan's Warren Buffett,\" starts his day at 2 a.m. every day even at the ag.. - 매일경제",
                "source": "매일경제",
                "url": "https://www.mk.co.kr/en/society/11430496",
                "body": "Shigeru Fujimoto, dubbed \"Japan's Warren Buffett,\" starts his day at 2 a.m. every day even at the age of 89. First, the US stock market will be checked with the US-Japan joint economic channel \"Nikkei CNBC.\" At four o'clock in the morning, I read the Nikkei newspaper and check the items to buy and sell that day. After breakfast and a quick walk, battle the chart until 3 p.m. when the market ends. Recurring transaction details and achievements by hand is also essential.\nFujimoto has been living this war-like life for 70 years. His assets are increasing since he started with a 'dirt spoon' without a penny. The assets, which were 1.8 billion yen (about 17 billion won) when the Japanese version of the book was released for the first time in 2023, are on the verge of surpassing 2.4 billion yen (about 22.7 billion won) this year. Shigeru earned nearly 6 billion won in two years, but he is still thirsty. In a recent interview with Maeil Economy, he said, \"I want to earn more than 1 billion yen. \"If the rest of my life allows it, it's fully possible,\" he said, expressing his will.\nThe secret to Fujimoto's ability to become a legendary investor, born as the son of a poor farmer, is \"steadiness.\" He first began stocking in 1955 at the age of 19. It was a time when transactions were concluded with a receiver because there was no electronic system. There was no mentor around to see and learn. He had no choice but to gain experience by studying events and companies as if he was heading to the ground. As I built up my skills like that, it became a guru for Japanese investors. \"On the contrary, it means that anyone can become rich if they try,\" Fujimoto said. \"Those who endure stocks and life laugh.\"\nIn fact, for 70 years, Fujimoto has faced countless crises. In particular, the assets of 1 billion yen (about 9.4 billion won) during the Black Monday incident in 1987 were cut to 200 million yen (about 1.9 billion won) in an instant. Many investors left the market in the shock, but Fujimoto was calm. He did not let go of his investment and study, saying, \"It is a waste of time to be gloomy.\"\nThen, what is Fujimoto's most important investment principle. Fujimoto stressed several times, \"You have to choose stocks that increase sales, increase profits, and increase dividends.\" They say that they need to develop an eye to choose the currently undervalued stocks among the stocks that will grow steadily for a long time. Next, he added, approach the sports you like or know well. In fact, Fujimoto is trading more than 80 items mainly for his favorite automobiles and semiconductors.\nThis is also in line with Buffett's investment principle, a \"legend of value investment.\" Buffett also emphasizes that ① invest long-term mainly in areas that have high internal value and ② know well. In other words, there is a difference between short-term and long-term holdings, but in the end, both investment legends send a message that there is no shortcut on the way to becoming rich.\nTo this end, Fujimoto introduced the \"one-to-two-to-six law.\" Judging by various indicators, it is an investment method in which 1,000 shares are first bought for decent stocks, followed by 2,000 and 6,000 shares in order according to the degree of confidence. Fujimoto explains that if you trade in this way, you can stably manage risks and earn profits even in the market with high uncertainty. One of the most commonly used indicators is RSI (relative intensity index). He also said that if the RSI is less than 30%, it is judged to be over-selling, and if it is more than 70%, it is over-buying.\nHowever, Fujimoto also warned, \"Don't even think about buying it at the lowest point and selling it at the highest point.\" \"Stocks are a battle against their own desires,\" he said, \"I've seen too many cases of raising losses after being optimistic that stock prices will rise further and that they will rise again if they fall.\" To avoid this, he stressed that it is better to give up your head and tail f"
            }
        ]
    }
]