[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "157.440",
            "open": "4,991.210",
            "close": "4,877.460",
            "high": "5,000.700",
            "low": "4,843.260"
        },
        "market_summary": "### Gold (XAU/USD) Market Briefing  \n* **Key Drivers:** Dollar strength, geopolitical talks, declining real rates.  \n* **Price Action:** Dropped to **$4,856**, rebounded to **$4,900**.  \n* **Technical Outlook:** Support at **$4,856**, consolidation phase.  \n---\n**Overall Sentiment:** Neutral ↔️  \n\n**Details:**  \n- Gold fell despite lower real rates, breaking below **$4,850**.  \n- Dollar hit 1-week highs, pressuring gold.  \n- Technical support at **$4,856** held, sparking a rebound.  \n- Long-term bullish outlook remains, but short-term consolidation persists.  \n- Central banks continue net buying, adding 863 MT in 2025.  \n- Top holders: US (8,133 MT), Germany (3,351 MT), Italy (2,452 MT).",
        "source_articles": [
            {
                "title": "Real Interest Rates Fall Yet Gold and Silver Drop Again - BullionVault",
                "source": "BullionVault",
                "url": "https://www.bullionvault.com/gold-news/gold-price-news/gold-real-interest-rates-021720261",
                "body": "Real Interest Rates Fall Yet Gold and Silver Drop Again\nGOLD and SILVER sank against a rallying US Dollar on Tuesday even as longer-term US interest rates fell in the bond market, with the precious metals losing as much as 3.8% and 6.9% so far this week respectively since bullion trading in China closed for the Lunar New Year holidays.\nPeace talks between the US and Iran as well as between Russia and Ukraine today continued in Geneva, Switzerland.\nGlobal stock markets meantime slipped for the 4th time in 5 sessions, with US tech stocks falling as well as Europe's aerospace and defense sector.\nWith US traders returning from yesterday's Presidents' Day holiday, betting in the interest rates market edged forecasts for the Federal Reserve's end-2026 rate back above 3.00% per annum on Tuesday, after dipping to the lowest such prediction since early December.\nBut longer-term borrowing costs fell in the bond market, with one CNBC anchor saying that the 10-year Treasury yield, \"the US benchmark, has plunged.\n\"Yet gold doesn't seem to care\" − defying the formerly strong negative relationship between gold and the direction of bond yields.\nFalling by more than 1/4 of a percentage point from a fortnight ago, the 10-year Treasury bond yield has now made its steepest 2-week drop since March last year.\nInflation-protected TIPS yields have meantime fallen to late-October levels on 10-year bonds. Back then, gold was trading up through $4000 per Troy ounce for the first time in history.\nYet gold on Tuesday fell to $4850 per Troy ounce in London trading, a new record high this time last month but 13.3% below end-January's spike to all-time gold price highs against the US currency.\n\"The change happened in 2022,\" says bullion bank HSBC's precious metals analyst James Steel, responding to CNBC.\n\"Until then, the real rate on the 10-year had a beautiful inverse correlation with gold. That broke apart, and gold is no longer as sensitive to real interest rates as it used to be.\n\"2022 is also when we got a lot of retail buying in the [small bar and coin] market, elevated geopolitical risk, and central-bank buying.\"\nThe Dollar on Tuesday meanwhile hit better-than-1-week highs on its DXY index, trading 2.0% above end-January's 4-year low against the world's other rich-economy currencies.\nLike gold, silver also hit 8-session lows versus the Dollar, falling within 10 cents of $72 per ounce − a new all-time high when first reached during China's Christmas bullion trading chaos, but 40.5% beneath January's record top.\n\"Don't forget, we've had a lot of new money come into the precious metals market and we've had a parabolic rally,\" says HSBC's Steel.\n\"It really invites volatility\" in gold and silver, says Steel. \"That's going to be the word for this year.\""
            },
            {
                "title": "Top 10 Central Bank Gold Reserves - Investing News Network",
                "source": "Investing News Network",
                "url": "https://investingnews.com/daily/resource-investing/precious-metals-investing/gold-investing/top-central-bank-gold-holdings/",
                "body": "Top 10 Central Bank Gold Reserves\nGlobal central bank gold reserves top 36,520.7 metric tons, nearly one-fifth of all the gold ever mined. Which countries hold the most of the metal?\nGlobal central banks own about 17 percent of all the gold ever mined, with reserves topping 36,520.7 metric tons (MT) at the end of November 2025. They acquired the vast majority after becoming net buyers of the metal in 2010.\nCentral banks purchase gold for a number of reasons: to mitigate risk, to hedge against inflation and to promote economic stability. Increased concerns over another global financial crisis have as expected led central banks once again to build up their gold reserves.\nIn a mid-2025 survey, the World Gold Council (WGC) said that 95 percent of the central bankers it polled expect global gold reserves to increase over the next 12 months. The precious metal’s \"performance during times of crisis\" was cited by 85 percent of respondents as highly or somewhat relevant to their decision, while 80 percent cited its long-term store of value.\nCentral banks added 863.3 metric tons of gold to their vaults in 2025. While this was lower than the previous three years, which all topped 1,000 MT each, the reserve gains were still well above the 2010 to 2021 annual average of 473 MT.\nYearly central bank gold purchases since 2019.\nChart via the WGC.\nA record 95 percent of respondents to the WGC survey stated their belief that central banks will continue to grow their holdings, with 5 percent suggesting they would hold at current levels. For the second year in a row, no respondents expected reserves to decrease.\nThe Council found that sentiment was consistent across advanced and emerging economies and reflected the strategic role of gold amid dynamic economic and geopolitical uncertainty.\nWhich central banks hold the most gold?\nRead on to find out the 10 top countries by central bank gold holdings, as per data from the WGC, including recent Q4 2024 and full-year 2024 reports.\n1. United States\nGold reserves: 8,133.46 metric tons\nWhen it comes to the largest gold depository in the world, the American central bank is number one with 8,133.46 metric tons of gold.\nA large percentage of US gold is held in “deep storage” in Denver, Fort Knox and West Point. As the US Treasury explains, deep storage is “that portion of the US Government-owned gold bullion reserve which the Mint secures in sealed vaults that are examined annually by the Treasury Department’s Office of the Inspector General and consists primarily of gold bars.”\nThe rest of US-owned reserves are held as working stock, which the country's mint uses as raw material to mint congressionally authorized coins.\n2. Germany\nGold reserves: 3,350.3 metric tons\nThe Bundesbank, Germany’s central bank, currently owns 3,351.53 metric tons of gold. Like many of the central banks on this list, the German national bank stores a significant portion of its gold in foreign central banks.\nToday, just over half of Germany’s gold holdings are stored within Frankfurt, while internationally 1,236 MT of gold is stored in the vaults of the New York Federal Reserve, and 12 percent of its holdings are in London.\nThe Bundesbank’s foreign gold reserves came into question in 2012, when the German Federal Court of Auditors, the Bundesrechnungshof, was openly critical of the Bundesbank’s gold auditing. The German bank issued a public statement defending the security of foreign banks. Privately, the Bundesbank then began the arduous process of repatriating some of its gold stock back to German soil. By 2016, more than 583 MT of gold had been transferred back to Germany.\nThe economic upheaval and geopolitical volatility brought about by US President Donald Trump's tariff wars and adversarial posturing toward Europe has led to calls for Germany to consider further repatriating its gold, reported The Guardian in January 2026.\n3. Italy\nGold reserves: 2,451.9 metric tons\nBanca d’Italia, the national bank of Italy, holds 2,451.84 me"
            },
            {
                "title": "US Dollar Price Action Setups: EUR/USD, USD/JPY, Gold - Forex Factory",
                "source": "Forex Factory",
                "url": "https://www.forexfactory.com/news/1384414-us-dollar-price-action-setups-eurusd-usdjpy-gold",
                "body": "expected short term downside continuation in the dollar will ultimately result in dollar crosses going up. one of which is evidently the euro. two fibs playing out perfectly on the 4h timeframe along with the daily timeframe. easy money to be made.\n-\nUS Dollar Price Action Setups: EUR/USD, USD/JPY, Gold\nThis week’s webinar started off with another short-term setup in gold. Last week, I looked at the 5k level in-play as short-term support and that led to a rally up to the $5100 level. That price was well-defended from sellers and ultimately led to a push back below the major psychological level, and today’s session saw price digging in support at $4856 which, so far, has held for a bounce up to $4900. In the webinar I explained the bigger picture backdrop around gold and why I retain a bullish outlook, longer-term. On a shorter-term basis, we’re still within the confines of consolidation but support can remain ... (full story)"
            }
        ]
    },
    {
        "asset_name": "Silver",
        "symbol": "EIGHTCAP:XAGUSD",
        "status": "Success",
        "data": {
            "day_range": "4.947",
            "open": "76.067",
            "close": "73.467",
            "high": "76.869",
            "low": "71.922"
        },
        "market_summary": "### Silver (XAG/USD) Market Briefing\n* **Key Drivers:** Real interest rates fall, yet silver drops 6.9% this week. Dollar rallies to 1-week highs.\n* **Price Action:** Breached **$72/oz**, hitting 8-session lows. **40.5%** below January's record peak.\n* **Technical Outlook:** Below 20-day EMA ($83.30), RSI neutral at 42.17. Support eyed at **$72/oz**.\n---\n**Overall Sentiment:** Negative 📉\n\n### Catalysts:\n- **Real Rates:** 10-year TIPS yields at late-October levels, yet silver fails to gain traction.\n- **Dollar Strength:** DXY up 2.0% from January lows, pressuring commodities.\n- **Volatility:** HSBC's Steel warns of \"parabolic rally\" unwinding, inviting sharp swings.\n\n### Technical Setup:\n- **Short-Term:** Bearish below $83.30 EMA; recovery attempts capped.\n- **Key Level:** $72/oz support tested; break could accelerate downside.\n- **Near-Term Risk:** FOMC Minutes Wednesday may trigger fresh volatility.",
        "source_articles": [
            {
                "title": "Real Interest Rates Fall Yet Gold and Silver Drop Again - BullionVault",
                "source": "BullionVault",
                "url": "https://www.bullionvault.com/gold-news/gold-price-news/gold-real-interest-rates-021720261",
                "body": "Real Interest Rates Fall Yet Gold and Silver Drop Again\nGOLD and SILVER sank against a rallying US Dollar on Tuesday even as longer-term US interest rates fell in the bond market, with the precious metals losing as much as 3.8% and 6.9% so far this week respectively since bullion trading in China closed for the Lunar New Year holidays.\nPeace talks between the US and Iran as well as between Russia and Ukraine today continued in Geneva, Switzerland.\nGlobal stock markets meantime slipped for the 4th time in 5 sessions, with US tech stocks falling as well as Europe's aerospace and defense sector.\nWith US traders returning from yesterday's Presidents' Day holiday, betting in the interest rates market edged forecasts for the Federal Reserve's end-2026 rate back above 3.00% per annum on Tuesday, after dipping to the lowest such prediction since early December.\nBut longer-term borrowing costs fell in the bond market, with one CNBC anchor saying that the 10-year Treasury yield, \"the US benchmark, has plunged.\n\"Yet gold doesn't seem to care\" − defying the formerly strong negative relationship between gold and the direction of bond yields.\nFalling by more than 1/4 of a percentage point from a fortnight ago, the 10-year Treasury bond yield has now made its steepest 2-week drop since March last year.\nInflation-protected TIPS yields have meantime fallen to late-October levels on 10-year bonds. Back then, gold was trading up through $4000 per Troy ounce for the first time in history.\nYet gold on Tuesday fell to $4850 per Troy ounce in London trading, a new record high this time last month but 13.3% below end-January's spike to all-time gold price highs against the US currency.\n\"The change happened in 2022,\" says bullion bank HSBC's precious metals analyst James Steel, responding to CNBC.\n\"Until then, the real rate on the 10-year had a beautiful inverse correlation with gold. That broke apart, and gold is no longer as sensitive to real interest rates as it used to be.\n\"2022 is also when we got a lot of retail buying in the [small bar and coin] market, elevated geopolitical risk, and central-bank buying.\"\nThe Dollar on Tuesday meanwhile hit better-than-1-week highs on its DXY index, trading 2.0% above end-January's 4-year low against the world's other rich-economy currencies.\nLike gold, silver also hit 8-session lows versus the Dollar, falling within 10 cents of $72 per ounce − a new all-time high when first reached during China's Christmas bullion trading chaos, but 40.5% beneath January's record top.\n\"Don't forget, we've had a lot of new money come into the precious metals market and we've had a parabolic rally,\" says HSBC's Steel.\n\"It really invites volatility\" in gold and silver, says Steel. \"That's going to be the word for this year.\""
            },
            {
                "title": "A single Trump announcement sparks billions in losses across gold and silver - AOL.com",
                "source": "AOL.com",
                "url": "https://www.aol.com/articles/single-trump-announcement-sparks-billions-152920735.html",
                "body": "A single Trump announcement sparks billions in losses across gold and silver\nA single announcement out of Washington sent gold and silver prices plunging, erasing billions of dollars in market value and catching investors off guard almost overnight.\nThe dizzying boom ended abruptly Friday morning after President Donald Trump confirmed Kevin Warsh as his pick to lead the Federal Reserve, sending the dollar to its strongest level in months and reshaping expectations for U.S. monetary policy.\nWarsh is widely viewed as a free-market, inflation hawk who breaks with much of the current Federal Reserve leadership. Influenced by his studies under economist Milton Friedman, he has long argued that inflation is driven by printing too much money.\nThat view departs from years of Federal Reserve policy focused on keeping borrowing costs low.\nTrump Nominates Kevin Warsh To Succeed Jerome Powell As Federal Reserve Chair\nFor investors, Warsh's record has signaled a more disciplined approach to inflation and monetary policy.\nAddressing inflation under that framework would likely require tighter monetary policy, including higher interest rates. And higher rates typically strengthen the U.S. dollar, giving investors less reason to seek refuge in gold and silver and prompting a selloff in both metals.\nAdvertisement\nWhat Trump’s Next Pick To Lead The Federal Reserve Means For Your Wallet\nFor months, a gravity-defying rally had pushed gold and silver prices to fresh highs, as investors piled into the traditional safe-haven assets amid inflation, trade tensions and concerns about the long-term stability of the dollar under Trump’s economic policies.\nHours before Trump announced Warsh’s nomination, gold and silver were still holding onto recent gains. The news sparked a swift bust, with gold suffering its worst selloff since 2013 and silver posting its steepest one-day drop since 1980.\nThe sudden reversal rattled investors who had turned to gold as a hedge against inflation and policy uncertainty, including many retirement-age Americans who viewed the metal as a safer place to park their savings.\nThe sharp swings also raised questions about how much more volatility could lie ahead, as markets brace for further policy signals from Washington and potential changes at the Federal Reserve.\nTrump’s Economic Wins Are Real — Now He Needs To Convince The Country\nClick Here To Download The Fox News App\nEven so, longer-term demand for gold has been supported by steady buying from foreign central banks, including China, which has been diversifying reserves away from the U.S. dollar amid geopolitical tensions.\nOriginal article source: A single Trump announcement sparks billions in losses across gold and silver"
            },
            {
                "title": "Silver recovers above $74.50 on safe-haven demand, FOMC Minutes loom - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/silver-price-forecast-xag-usd-drops-to-near-7600-while-investors-await-fomc-minutes-202602170315",
                "body": "Silver Price Forecast: XAG/USD recovers above $74.50 on safe-haven demand, FOMC Minutes loom\n- Silver recovers to around $74.75 in Wednesday’s early European session, bolstered by safe-haven flows.\n- Cooling US inflation in January fails to revive near-term rate-cut bets from the Federal Reserve.\n- Investors await the FOMC Minutes and monitor US-Iran talks, both seen as potential sources of volatility.\nSilver price (XAG/USD) rises to near $74.75 on Wednesday at the time of writing, up 1.90% on the day. The white metal rebounds amid persistent tensions between the United States (US) and Iran, which boost safe-haven demand. Iranian Foreign Minister Abbas Araqchi said on Tuesday that the US and Iran reached an understanding on main “guiding principles” in talks aimed at resolving their longstanding nuclear dispute, but that does not mean a deal is imminent.\nUS President Donald Trump has signaled that Iran will make a deal, while warning that the nation will face consequences if they don’t resolve issues.\nHowever, the dovish Federal Reserve (Fed) expectations might cap the upside for the precious metal despite cooling US inflation in January. Theoretically, immaterial dovish Fed prospects in the near term weigh on non-yielding assets, such as Silver.\nThe data released on Friday showed that the US headline inflation dropped to 2.4% YoY from 2.7% in December. In the same period, the core Consumer Price Index (CPI) – which excludes volatile food and energy items – grew moderately by 2.5%, as expected, against the previous reading of 2.6%.\nMeanwhile, investors brace for high volatility in the North American session as US markets will open after an extended weekend.\nThis week, the major trigger for the Silver price will be the release of Federal Open Market Committee (FOMC) minutes of the January policy meeting on Wednesday. In the meeting, the Federal Reserve left interest rates unchanged in the range of 3.50%-3.75%.\nSilver technical analysis\nIn the daily chart, XAG/USD trades at $73.68. The 20-day exponential moving average descends to $83.30, signaling a weakening short-term structure. Price holds below this gauge, keeping rebounds capped and leaving sellers in control. RSI (14) at 42.17 (neutral) stays under the midline, indicating momentum favors the downside without oversold conditions.\nA daily close back above the falling 20-day EMA would ease immediate pressure and improve the near-term tone. Absent that, the path of least resistance remains lower, with failed bounces prone to being faded as the average continues to cap recovery attempts.\n(The technical analysis of this story was written with the help of an AI tool.)\nRisk sentiment FAQs\nIn the world of financial jargon the two widely used terms “risk-on” and “risk off'' refer to the level of risk that investors are willing to stomach during the period referenced. In a “risk-on” market, investors are optimistic about the future and more willing to buy risky assets. In a “risk-off” market investors start to ‘play it safe’ because they are worried about the future, and therefore buy less risky assets that are more certain of bringing a return, even if it is relatively modest.\nTypically, during periods of “risk-on”, stock markets will rise, most commodities – except Gold – will also gain in value, since they benefit from a positive growth outlook. The currencies of nations that are heavy commodity exporters strengthen because of increased demand, and Cryptocurrencies rise. In a “risk-off” market, Bonds go up – especially major government Bonds – Gold shines, and safe-haven currencies such as the Japanese Yen, Swiss Franc and US Dollar all benefit.\nThe Australian Dollar (AUD), the Canadian Dollar (CAD), the New Zealand Dollar (NZD) and minor FX like the Ruble (RUB) and the South African Rand (ZAR), all tend to rise in markets that are “risk-on”. This is because the economies of these currencies are heavily reliant on commodity exports for growth, and commodities tend to rise in pric"
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "2.215",
            "open": "68.755",
            "close": "67.603",
            "high": "69.275",
            "low": "67.060"
        },
        "market_summary": "### Spot Brent Crude Oil Market Briefing  \n* **Key Drivers:** Shifting global trade flows, EU supply disruptions, Venezuela's market return.  \n* **Price Action:** N/A  \n* **Technical Outlook:** N/A  \n\n---  \n**Overall Sentiment:** Neutral ⚖️  \n\n**Notes:**  \n- **Non-OPEC+** dynamics reshaping crude flows; US-Venezuela imports may free North American crude for exports.  \n- **EU** supply stability maintained via emergency stocks; Hungary and Slovakia negotiating Adriatic pipeline imports.  \n- **Venezuela's** market reentry could bolster **Israel's** energy security amid global supply shifts.  \n- Russia-Ukraine pipeline disruptions and sanctions exemptions influencing regional trade patterns.",
        "source_articles": [
            {
                "title": "Non-Opec-Plus: Flows Poised to Change as Output Grows - Energy Intelligence",
                "source": "Energy Intelligence",
                "url": "https://www.energyintel.com/0000019b-fc47-dfab-a39b-fe7f77ce0001",
                "body": "Events so far in 2026 indicate that, more than sheer volume output, the most fascinating aspect involving producing countries outside the Opec-plus alliance will arguably be a renewed dynamism in trade patterns. More US imports of Venezuelan crude could free up more North American crude for exports, while India, under tremendous pressure to reduce intakes of Russian oil, is shifting to alternate suppliers. South America, where new supply is poised to increase greatly this year, will boost exports to Asia and try to fill any gap left by Russia’s loss of market share. In short, the great migration of crude oil that began in 2022 when Russia invaded Ukraine is undergoing yet another iteration.\nFundamentals\nNon-Opec-Plus: Flows Poised to Change as Output Grows\nCopyright © 2026 Energy Intelligence Group All rights reserved. Unauthorized access or electronic forwarding, even for internal use, is prohibited.\nPublished:\nTue, Feb 17, 2026"
            },
            {
                "title": "EU: Hungary, Slovakia to See No Short-Term Oil Supply Risk - Marine News Magazine",
                "source": "Marine News Magazine",
                "url": "https://www.marinelink.com/news/eu-hungary-slovakia-shortterm-oil-supply-535823",
                "body": "EU: Hungary, Slovakia to See No Short-Term Oil Supply Risk\nThe European Commission sees no short-term risk to the security of oil supplies in Hungary or Slovakia following the disruption of Russian oil flows via Ukraine because both EU countries have ample emergency stocks, a Commission spokesperson said on Tuesday.\nSlovakia's government also said its domestic fuel supply was not under threat, alleviating fears of an immediate fuel crunch after Kyiv's foreign ministry last week said a Russian attack on a Ukrainian pipeline was responsible for the halt to Russian oil flows to Eastern Europe since January 27.\nHungary has accused Ukraine of switching off power to that section of the pipeline, known as Druzhba, which supplies Hungary and Slovakia with Russian oil.\nThe potential fuel crisis would play against the Moscow-leaning Hungarian Prime Minister Viktor Orban, who is facing the possibility of losing power after 16 years following an election scheduled on April 12.\n\"There are no short-term risks to security of supply, because both member states - Hungary, Slovakia - hold 90 days' worth of emergency stocks in reserve,\" a Commission spokesperson said.\nThe spokesperson added that Brussels was in contact with Ukraine regarding the timeline for repairing the Druzhba pipeline.\nEU law requires member countries to hold 90 days' worth of net oil imports as a buffer against supply shocks.\nIn response to the disruption to Druzhba, Hungary wants to use an emergency exemption in EU sanctions to import Russian oil via Croatia's Adria pipeline, and has asked Croatia to facilitate this.\nSlovakia also said on Tuesday it was in negotiations to secure oil via Adria, which runs from the Croatian port of Omisalj to refineries in Croatia and others in southern and central Europe.\nSeaborne imports of Russian crude are banned under EU sanctions, although landlocked EU countries can claim an exemption if their pipeline oil supplies from Russia are interrupted.\nCroatia's economy minister Ante Susnjar said on Monday that the country would not allow central Europe's fuel supply to be endangered. He said the Adria pipeline could import more oil, but suggested that this should not come from Russia.\n\"A barrel bought from Russia may appear cheaper to some countries, but helps fund war and attacks on Ukrainian people,\" Susnjar said in a post on X.\nHungary's oil company MOL did not respond to emailed questions.\n(Reuters)"
            },
            {
                "title": "Venezuela’s Return to Oil Markets Enhances Israel’s Energy Security - Middle East Forum",
                "source": "Middle East Forum",
                "url": "https://www.meforum.org/mef-observer/venezuelas-return-to-oil-markets-enhances-israels-energy-security",
                "body": "www.meforum.org\nPerforming security verification\nThis website uses a security service to protect against malicious bots. This page is displayed while the website verifies you are not a bot.\nThis website uses a security service to protect against malicious bots. This page is displayed while the website verifies you are not a bot."
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "2.260",
            "open": "63.718",
            "close": "62.298",
            "high": "64.133",
            "low": "61.873"
        },
        "market_summary": "### Spot WTI Crude Oil Market Briefing\n* **Key Drivers:** U.S. shale resilience, China and dark fleet inventory absorption slowdown, EU supply disruptions.\n* **Price Action:** Production holds near **13.6M bpd** despite sub-$60 prices.\n* **Technical Outlook:** Potential plateau risk as prime acreage depletes.\n\n---\n**Overall Sentiment:** Neutral ⚖️\n\n**Supply Factors:**\n- U.S. output remains robust at **13.6M bpd** due to efficiency gains\n- China and dark fleet inventory absorption slowing\n- Mideast and Americas exports rising\n- EU supply risks mitigated by emergency stocks\n\n**Demand Factors:**\n- Refinery intake weakening in Asia\n- Discounted Russian/Iranian crude availability\n\n**Market Impact:**\n- Lower inflation and gasoline prices supported by U.S. production\n- Potential price pressure from oversupply in coming months",
        "source_articles": [
            {
                "title": "Why U.S. shale output is holding up in a $60 oil world - Baton Rouge Business Report",
                "source": "Baton Rouge Business Report",
                "url": "https://www.businessreport.com/article/why-u-s-shale-output-is-holding-up-in-a-60-oil-world",
                "body": "U.S. oil production is defying gravity—and expectations, The Wall Street Journal writes.\nDespite crude prices falling below $60 a barrel and rig counts shrinking, American producers pumped a record 13.6 million barrels a day last year, buoyed by remote monitoring, longer horizontal wells and drilling innovations that squeeze more output from fewer rigs.\nThat resilience has helped keep gasoline prices lower and inflation in check―a political and economic win for the Trump administration.\nConsolidation has also reshaped the industry, with oil majors such as Chevron and ExxonMobil wielding stronger balance sheets and driving efficiency gains across the Permian Basin.\nBut the surge may not last. Analysts warn production could plateau as prime drilling acreage dwindles and shale fields mature, potentially setting the stage for higher prices later this decade.\nRead the full story from The Wall Street Journal."
            },
            {
                "title": "Inventories: China, 'Dark Fleet' Absorb Less - Energy Intelligence",
                "source": "Energy Intelligence",
                "url": "https://www.energyintel.com/0000019b-fc47-dfab-a39b-fe7f52360003",
                "body": "China and tankers of the \"dark fleet\" remain the stock absorbers at the start of 2026, but their intake rate seems to have decelerated. At the end of last year and the start of the new year, some 300 million barrels in surplus crude oil was soaked up this way, with China and the fleet each roughly taking half. Both still have free capacity, and heavily discounted crude from Russia and Iran stored in tankers at sea remains available. At the same time, crude oil exports from the Mideast and the Americas continue rising. Softening crude price differentials in Asia now suggest that supply is starting to overwhelm refinery demand and storage intake by China and the dark fleet.\nFundamentals\nInventories: China, 'Dark Fleet' Absorb Less\nCopyright © 2026 Energy Intelligence Group All rights reserved. Unauthorized access or electronic forwarding, even for internal use, is prohibited.\nPublished:\nTue, Feb 17, 2026"
            },
            {
                "title": "EU: Hungary, Slovakia to See No Short-Term Oil Supply Risk - Marine News Magazine",
                "source": "Marine News Magazine",
                "url": "https://www.marinelink.com/news/eu-hungary-slovakia-shortterm-oil-supply-535823",
                "body": "EU: Hungary, Slovakia to See No Short-Term Oil Supply Risk\nThe European Commission sees no short-term risk to the security of oil supplies in Hungary or Slovakia following the disruption of Russian oil flows via Ukraine because both EU countries have ample emergency stocks, a Commission spokesperson said on Tuesday.\nSlovakia's government also said its domestic fuel supply was not under threat, alleviating fears of an immediate fuel crunch after Kyiv's foreign ministry last week said a Russian attack on a Ukrainian pipeline was responsible for the halt to Russian oil flows to Eastern Europe since January 27.\nHungary has accused Ukraine of switching off power to that section of the pipeline, known as Druzhba, which supplies Hungary and Slovakia with Russian oil.\nThe potential fuel crisis would play against the Moscow-leaning Hungarian Prime Minister Viktor Orban, who is facing the possibility of losing power after 16 years following an election scheduled on April 12.\n\"There are no short-term risks to security of supply, because both member states - Hungary, Slovakia - hold 90 days' worth of emergency stocks in reserve,\" a Commission spokesperson said.\nThe spokesperson added that Brussels was in contact with Ukraine regarding the timeline for repairing the Druzhba pipeline.\nEU law requires member countries to hold 90 days' worth of net oil imports as a buffer against supply shocks.\nIn response to the disruption to Druzhba, Hungary wants to use an emergency exemption in EU sanctions to import Russian oil via Croatia's Adria pipeline, and has asked Croatia to facilitate this.\nSlovakia also said on Tuesday it was in negotiations to secure oil via Adria, which runs from the Croatian port of Omisalj to refineries in Croatia and others in southern and central Europe.\nSeaborne imports of Russian crude are banned under EU sanctions, although landlocked EU countries can claim an exemption if their pipeline oil supplies from Russia are interrupted.\nCroatia's economy minister Ante Susnjar said on Monday that the country would not allow central Europe's fuel supply to be endangered. He said the Adria pipeline could import more oil, but suggested that this should not come from Russia.\n\"A barrel bought from Russia may appear cheaper to some countries, but helps fund war and attacks on Ukrainian people,\" Susnjar said in a post on X.\nHungary's oil company MOL did not respond to emailed questions.\n(Reuters)"
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0050",
            "open": "1.1848",
            "close": "1.1852",
            "high": "1.1854",
            "low": "1.1805"
        },
        "market_summary": "### EUR/USD Market Briefing\n* **Key Drivers:** Fed Minutes, capital flow dynamics, geopolitical tensions.\n* **Price Action:** Trading near **1.1840**, consolidating below **1.1850**.\n* **Technical Outlook:** Bearish bias persists, support eyed at **1.1800**.\n\n---\n**Overall Sentiment:** Cautious 📉\n\n### Key Takeaways:\n- **Fed Minutes** remain the focal point, with traders awaiting signals on future rate cuts.\n- **Capital flows** favor the euro, but a paused Fed easing cycle supports the dollar.\n- **Geopolitical risks** (U.S.-Iran talks) boost the dollar as a safe-haven asset.\n- **Yen strength** adds pressure, with capital inflows into Japan’s stock market.\n- **Upcoming PMI data** from the Eurozone could influence near-term EUR/USD direction.",
        "source_articles": [
            {
                "title": "EUR/USD Stalls as Traders Wait on Fed Minutes and Capital Flow Clarity - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/analysis/eurusd-stalls-as-traders-wait-on-fed-minutes-and-capital-flow-clarity-200675138",
                "body": "Gold prices fall amid firmer dollar ahead of key economic data this week\n- EURUSD remains prone to consolidation.\n- The yen is strengthening thanks to capital flows.\nThe US markets, closed for Presidents’ Day, brought calm to the Forex market. Traders are not forcing events, awaiting the publication of the January FOMC meeting minutes. This has resulted in EURUSD moving into a narrow trading range. The pair showed no interest in the news that the ECB is ready to offer liquidity to other central banks to prevent tensions in the money markets. This involves an increase in repo operations from the third quarter.\nING believes that the euro’s growing global role is positive for EURUSD. The exchange rate is closely linked to capital flows, and their movement from the US to Europe is good news for the regional currency. Christine Lagarde shares this opinion. According to the Frenchwoman, the general mood is currently in favour of the euro, as money is flowing into the region. The head of the ECB prefers incentives to taxes. Therefore, cheap liquidity will accelerate rotation.\nHowever, in the short term, the US dollar has a counterplay. The longer the Fed pauses in the easing cycle, the wider the rate differential will be. The high attractiveness of US assets will prevent investors from rushing to transfer capital to Europe.\nJapan is also scoring points with international investors. According to Kazuo Ueda (BoJ Governor), Sanae Takaichi (Prime Minister) did not make any specific requests that would restrict the activities of the central bank. They discussed economic and financial conditions. If the central bank continues to make decisions independently, political stability will play into the hands of the bears on USDJPY. Investors are trying to understand whether the Prime Minister is pressuring the BoJ to stop raising rates, which also increases debt servicing costs.\nGold is trying to find a balance point, treading water around $5,000 per ounce. According to Jefferies, two main macro factors are supporting the precious metal: the depreciation of the US dollar and high inflation. This allows the company to raise its forecast for the end of the year from $4,200 to $5,000. It notes the high risks of a short-term peak in Gold amid growing fears among traders concerned about the collapse in prices at the end of January.\nThe situation on the silver market is even worse. Backwardation is intensifying, and futures contracts with distant delivery dates are falling in price. This is usually characteristic of perishable goods such as agricultural products.\nThe FxPro Analyst Team\nWhat are the best investment opportunities in 2026?\nThe best investments start with better data. Going with your gut has its place, but when excitement masquerades as intuition, it can lead to costly mistakes—or analysis paralysis.\nInvestingPro+ combines institutional-grade data with AI-powered insights that you don't need a finance PhD to understand. It won't guarantee winners, but it will certainly help you find more of them, more often.\nSo what are the best investments of 2026 so far?"
            },
            {
                "title": "Euro loses ground below 1.1850 ahead of FOMC Minutes - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/eur-usd-loses-ground-below-11850-ahead-of-fomc-minutes-202602180455",
                "body": "EUR/USD loses ground below 1.1850 ahead of FOMC Minutes\n- EUR/USD softens to around 1.1840 in Wednesday’s early European session.\n- US growth outlook eases downward pressure on the US Dollar.\n- Hopes for the US-Iran negotiations could improve risk sentiment and lift the Euro.\nThe EUR/USD pair loses traction near 1.1840 during the early European session on Wednesday, pressured by renewed US Dollar (USD) demand. Traders brace for the Federal Open Market Committee (FOMC) Minutes for signals on future rate cuts, which will be released later on Wednesday.\nImprovement in US growth prospects, business confidence and expectations that US President Donald Trump will be less aggressive heading into the midterm elections this year provide some support to the Greenback and act as a headwind for the major pair.\n“A more growth‑focused and less politically volatile Trump administration ahead of the midterms will be added support,” said Dan Tobon, head of G10 FX strategy at Citi in New York. \"We think animal spirits will be coming back a bit. All of these things in conjunction, in our view, should actually be quite positive for the dollar.”\nOn the other hand, hopes for the US-Iran negotiations could boost the riskier assets, such as the shared currency. Iranian Foreign Minister Abbas Araghchi said on Tuesday that it has reached an understanding with the US on the main \"guiding principles\" to resolve their dispute over Tehran's nuclear program. However, officials said work still needed to be done.\nThe attention will shift to the preliminary readings of the Purchasing Managers’ Index (PMI) from the Eurozone and Germany on Friday. If the data show stronger-than-expected outcomes, this could underpin the EUR against the USD in the near term.\nEuro FAQs\nThe Euro is the currency for the 20 European Union countries that belong to the Eurozone. It is the second most heavily traded currency in the world behind the US Dollar. In 2022, it accounted for 31% of all foreign exchange transactions, with an average daily turnover of over $2.2 trillion a day. EUR/USD is the most heavily traded currency pair in the world, accounting for an estimated 30% off all transactions, followed by EUR/JPY (4%), EUR/GBP (3%) and EUR/AUD (2%).\nThe European Central Bank (ECB) in Frankfurt, Germany, is the reserve bank for the Eurozone. The ECB sets interest rates and manages monetary policy. The ECB’s primary mandate is to maintain price stability, which means either controlling inflation or stimulating growth. Its primary tool is the raising or lowering of interest rates. Relatively high interest rates – or the expectation of higher rates – will usually benefit the Euro and vice versa. The ECB Governing Council makes monetary policy decisions at meetings held eight times a year. Decisions are made by heads of the Eurozone national banks and six permanent members, including the President of the ECB, Christine Lagarde.\nEurozone inflation data, measured by the Harmonized Index of Consumer Prices (HICP), is an important econometric for the Euro. If inflation rises more than expected, especially if above the ECB’s 2% target, it obliges the ECB to raise interest rates to bring it back under control. Relatively high interest rates compared to its counterparts will usually benefit the Euro, as it makes the region more attractive as a place for global investors to park their money.\nData releases gauge the health of the economy and can impact on the Euro. Indicators such as GDP, Manufacturing and Services PMIs, employment, and consumer sentiment surveys can all influence the direction of the single currency. A strong economy is good for the Euro. Not only does it attract more foreign investment but it may encourage the ECB to put up interest rates, which will directly strengthen the Euro. Otherwise, if economic data is weak, the Euro is likely to fall. Economic data for the four largest economies in the euro area (Germany, France, Italy and Spain) are especially significant, as they a"
            },
            {
                "title": "Yen reverses Monday's losses, euro/dollar edges down before Fed minutes, U.S. GDP - CNBC",
                "source": "CNBC",
                "url": "https://www.cnbc.com/amp/2026/02/17/yen-reverses-mondays-losses-euro/dollar-edges-down-before-fed-minutes-us-gdp.html",
                "body": "Dollar strengthens as geopolitical tensions spur risk-off sentiment\nThe U.S. dollar rose against major currencies on Tuesday as geopolitical tensions from the ongoing U.S.-Iran nuclear talks unleashed more market uncertainty and a risk-off mood among investors.\nIran and the U.S. reached an understanding on the main \"guiding principles\" in a second round of indirect talks over their nuclear dispute on Tuesday, although a deal is not imminent, Iranian Foreign Minister Abbas Araqchi said.\nThe U.S. has sent a battle force to the Middle East to press Tehran to make concessions in the decades-long dispute. President Donald Trump has said \"regime change\" in Tehran may be the best thing that can happen.\nThe dollar tends to do better in times of uncertainty, with investors buying U.S. Treasuries and selling equities, said Eugene Epstein, head of trading and structured products at Moneycorp in New Jersey.\n\"Treasury yields are coming off quite a bit and you also have the dollar strengthening, which is kind of funny because it's back to the old mentality of risk-off. There's a potential conflict with Iran so you have the traditional buy U.S. dollar, buy U.S. Treasuries and sell equities, and that's seemingly what's going on today,\" he said.\nThe dollar was up 0.57% to 0.774 francs against the Swiss franc . The euro was down 0.34% at $1.181, on track for the sixth straight session of losses against the dollar. The dollar index rose 0.41% to 97.50.\n\"We have all the conditions technically for the dollar weakening - with the market currently pricing in the most amount of Fed cuts since the end of last year and bond yields coming off etc - and yet the dollar is strengthening. My guess is it's due primarily to this Iranian conflict,\" Epstein said.\nInvestors are also awaiting minutes from the Fed's last meeting and key economic data later in the week. U.S. stocks, including the benchmark S&P 500edged mostly lower in choppy trading. The yield on benchmark U.S. 10-year notes fell 1.2 basis points to 4.045%.\nYen pares gains\nThe Japanese yen weakened for the second straight session after snapping a five-day winning streak triggered by the election victory of Prime Minister Sanae Takaichi.\nMoney flowing into Japan's ebullient stock market is expected to support the yen. However, Japan's Nikkei fell on Tuesday as investors booked profits, while the post-election euphoria was ebbing.\nThe yen was down 0.17% against the greenback to 153.78 per dollar.\nThe pound dropped after data showed Britain's unemployment rate rose to a five-year high in December while wage growth cooled, potentially adding to the case for further Bank of England rate cuts. The sterling weakened 0.9% to $1.3502.\nThe Australian dollar weakened 0.38% versus the greenback to $0.7042. The dollar strengthened 0.13% to 6.891 versus the offshore Chinese yuan."
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0137",
            "open": "1.3630",
            "close": "1.3566",
            "high": "1.3633",
            "low": "1.3495"
        },
        "market_summary": "### GBP/USD Market Briefing\n* **Key Drivers:** UK wage growth slowed to **4.2%** (down from 4.6%), reinforcing **BoE March cut** expectations.\n* **Price Action:** GBP/USD under pressure, yen crosses notably weak.\n* **Technical Outlook:** Support at **1.3525** (50-day MA) and **1.3500** (psychological level).\n\n---\n**Overall Sentiment:** Negative 📉\n\n**Market Implications:**\n- **BoE Rate Cut Odds:** 76% chance of March cut, two cuts fully priced by November.\n- **FTSE 100:** Positive outlook supported by dovish BoE stance.\n- **Upcoming Data:** CPI (Wednesday), retail sales and PMI (Friday) to shape near-term direction.",
        "source_articles": [
            {
                "title": "FTSE 100 and GBP/USD forecast: UK data gives BoE March cut a further boost - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/ftse-100-and-gbp-usd-forecast-uk-data-gives-boe-march-cut-a-further-boost/?amp=true",
                "body": "FTSE 100 and GBP/USD forecast: UK data gives BoE March cut a further boost\nThe FTSE 100 edged higher to close in on last week’s record, as the pound weakened following the release of UK wages and Jobs data that puts a March rate cut firmly on the table, barring any surprises in tomorrow’s inflation report. Unless we see a sharp turnaround in data, I would be expecting another rate cut in June, and possibly more in the summer if inflation risks ease. This should keep the longer term FTSE 100 forecast firmly supported and keep a lid on sterling. Looking at the broader markets, it has been a choppy affair the last week and a bit. This week has started quietly with US markets closed on Monday for Presidents’ Day and China effectively offline for the whole week thanks to the Spring Festival there. But things should become a bit lively as it’s shaping up to be a busy few days on the earnings front, with plenty of results due from the UK, Europe and the US. On top of that, we’ve got a steady stream of key economic data from both sides of the Atlantic, which means interest rate expectations are likely to remain a dominant theme once again.\nWhat to make of today’s UK data?\nSterling slipped across the board while the FTSE 100 edged up 0.4% following the release of the latest UK labour market data, reflecting growing expectations that interest rate cuts are becoming more likely, as a softer jobs market continues to take the heat out of wage growth.\nThe three-month annual rate of average earnings slowed to 4.2% in December, down from 4.6% in November and well below the 5.9% seen a year earlier. That trend was echoed in the private sector too, where pay growth excluding bonuses eased from 3.6% to 3.4%. This is a big comedown from the 6.2% pace recorded last year.\nDiving deeper into the data, it looks like most of the weakness remains concentrated in consumer-facing sectors, particularly hospitality, retail and leisure, possibly as a result of the after-effects of last year’s higher National Insurance and minimum wage costs. Elsewhere, the picture is less alarming. Private-sector employment is edging down only marginally, redundancies remain contained, and vacancies have stabilised.\nIn short, wage pressures – one of the key sticking points for the MPC – are clearly cooling. And that’s strengthening the case for further easing from the BoE with the UK central bank likely to move in March now instead of waiting until April. Traders are now pricing in a 76% chance of a March cut while odds of two cuts are now fully priced in by November, up from about 48 basis points earlier. But I think we could see that second cut as early as June. As such, this should keep the FTSE 100 forecast positive.\nWhat about the FX markets?\nIt’s been a fairly subdued start to the week in FX, following a mildly bearish stretch for the US dollar last week. Despite a stronger-than-expected US jobs report, the greenback struggled to hold onto gains after Friday’s softer inflation data, which reinforced expectations that the Federal Reserve is still edging closer to rate cuts. That weakness helped to cushion the pound, even though UK data hasn’t exactly inspired confidence. The UK economy ended 2025 on a soft note, with construction and business investment under pressure, and a recent dovish hold from the Bank of England has kept sterling on the back foot against most majors. Today’s weaker wages data has further weighed on pound crosses, mostly notably the GBP/JPY with the yen again outperforming.\nLooking ahead: plenty of more data this week\nSpeaking of inflation, CPI is expected tomorrow and it will also be closely watched for clues on how soon and how aggressively the BoE might start cutting rates. Headline CPI is seen easing to 3.0% year-over-year, down from 3.4% in December.\nElsewhere, we’ll see a batch of global PMI figures on Friday, along with UK retail sales. Actually, Friday is also heavy on US data with GDP and core PCE inflation – the Fed’s preferred inflation"
            },
            {
                "title": "GBP/USD Leans Lower as Soft UK Jobs Data Reinforces BoE Cut Expectations - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/analysis/gbpusd-leans-lower-as-soft-uk-jobs-data-reinforces-boe-cut-expectations-200675164",
                "body": "www.investing.com\nPerforming security verification\nThis website uses a security service to protect against malicious bots. This page is displayed while the website verifies you are not a bot.\nThis website uses a security service to protect against malicious bots. This page is displayed while the website verifies you are not a bot."
            },
            {
                "title": "GBP/USD: Data weakness feeds BoE easing bets – Scotiabank - Mitrade",
                "source": "Mitrade",
                "url": "https://www.mitrade.com/au/insights/news/live-news/article-6-1484623-20260218",
                "body": "Scotiabank analysts Shaun Osborne and Eric Theoret note that the Pound is underperforming after a disappointing UK employment report. Softer job gains and wages keep domestic risks elevated into CPI, retail sales and PMI data. Markets now fully price a Bank of England rate cut in April and another in November, with GBP/USD support seen near 1.3525 and 1.3500.\n\"Domestic risk remains elevated into Wednesday’s CPI and Friday’s retail sales.\"\n\"The preliminary PMIs will also be released on Friday and the data will continue to set the tone for expectations around the BoE, as policymakers and market participants assess the extent of easing required.\"\n\"A cut is fully priced for April, with another fully priced for November following the latest jobs data.\"\n\"For GBPUSD, we look to near-term support at the 50 day MA (1.3525) and see additional support at the psychologically important 1.35 level.\"\n(This article was created with the help of an Artificial Intelligence tool and reviewed by an editor.)"
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0022",
            "open": "0.7080",
            "close": "0.7069",
            "high": "0.7087",
            "low": "0.7065"
        },
        "market_summary": "### AUD/USD Market Briefing  \n* **Key Drivers:** RBA hawkish stance, wage inflation data, US economic releases.  \n* **Price Action:** Consolidating near **0.7080**, above rising EMAs.  \n* **Technical Outlook:** Support at **0.7000**, resistance at **0.7100/0.7147**.  \n---\n**Overall Sentiment:** Neutral → Bullish 📈  \n\n**Policy Divergence & RBA Hawkishness**  \nGoldman Sachs raised AUD/USD forecasts to **0.72** (3m), **0.73** (6m), **0.74** (12m), citing the RBA's hawkish stance and relative policy divergence. The bank expects one more rate hike in May, with the Q4 Wage Price Index and January employment data as key catalysts.  \n\n**Technical Structure**  \nAUD/USD trades above rising 50-day and 200-day EMAs, confirming bullish momentum. Stochastic shows bearish divergence but remains overbought, suggesting consolidation. Immediate support at **0.7000**, resistance at **0.7100/0.7147**.  \n\n**Data Calendar & Risks**  \n- **Australia:** Q4 Wage Price Index (Wed), January employment (Thu).  \n- **US:** FOMC minutes (Wed), Q4 GDP & core PCE (Fri).  \nRisks include metals price volatility, weaker US data, and global risk-off sentiment.  \n\n**Market Positioning**  \nAUD remains undervalued per Goldman’s GSBEER model (~2% below fair value). Policy divergence and commodity-linked resilience support a firmer AUD/USD trajectory if RBA maintains tightening bias.",
        "source_articles": [
            {
                "title": "Goldman lifts AUD/USD forecasts to 0.74 as RBA hawkish stance supports outlook - investingLive",
                "source": "investingLive",
                "url": "https://investinglive.com/centralbank/goldman-lifts-audusd-forecasts-to-074-as-rba-hawkish-stance-supports-outlook-20260217/",
                "body": "Goldman raises its AUD/USD path to 0.72–0.74 over 12 months, citing RBA hawkishness, relative policy divergence and valuation support, while flagging commodity and global risk risks.\nSummary:\nGoldman Sachs lifts AUD/USD forecasts to 0.72 (3m), 0.73 (6m), 0.74 (12m).\nUpgrade driven by a hawkish Reserve Bank of Australia and expectation of another May hike.\nAUD seen undervalued versus Goldman’s GSBEER fair-value model.\nRisks: deeper metals selloff, weak US data, global risk-off (AI/software unwind).\nGoldman Sachs has turned more constructive on the Australian dollar, raising its forecasts for AUD/USD and arguing that relative policy dynamics are shifting in the currency’s favour.\nThe bank now sees AUD/USD at 0.72 in three months (vs. prior forecast of 0.68),\n- 0.73 in six months (vs. prior forecast of 0.69)\n- and 0.74 in twelve months (vs. prior forecast of 0.70)\na meaningful round of upgrades.\nUpgrade primarily on the stance of the Reserve Bank of Australia, which Goldman characterises as among the more hawkish developed-market central banks at present.\nFor market participants, the key takeaway is the policy divergence theme. Goldman expects the RBA to deliver one additional rate hike in May, broadly consistent with market pricing of roughly 20bp of tightening by that meeting. The bank notes that policymakers place significant weight on quarterly underlying CPI measures — with the next release due the week before the May decision — making that inflation print a pivotal catalyst for AUD positioning.\nNotably, Goldman argues that the Australian dollar has held up impressively despite volatility in metals prices and terms-of-trade headwinds. On its GSBEER fair-value framework, AUD remains roughly 2 percentage points undervalued relative to recent fundamentals, suggesting room for catch-up appreciation if the policy signal remains firm.\nFor traders and macro allocators, the implication is clear: as long as the RBA maintains a tightening bias and US data continue to soften at the margin, the balance of risks skews toward a firmer AUD/USD trajectory over the next quarter.\nGoldman does flag risks. A sharper downturn in metals prices would weigh on Australia’s external balance; materially weaker US consumer data could spark broader growth fears; and renewed equity volatility — particularly in US AI and software names — could pressure AUD against traditional safe havens such as the yen and Swiss franc."
            },
            {
                "title": "AUD/USD sees data-heavy second half of the week post-RBA - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/aud-usd-sees-data-heavy-second-half-of-the-week-post-rba-202602172228",
                "body": "AUD/USD sees data-heavy second half of the week post-RBA\n- RBA minutes showed data-dependent stance; Q4 Wage Price Index on Wednesday and January employment change (20K forecast) on Thursday are the key domestic catalysts.\n- FOMC minutes on Wednesday, US Q4 GDP and core PCE on Friday round out a packed week for the pair.\n- Data-heavy second half of the week after data-dependent RBA minutes.\nThe Reserve Bank of Australia (RBA) minutes released Tuesday showed the board judged its recent rate hike was necessary but stressed that future decisions will depend entirely on incoming data and the evolving balance of risks. With the cash rate at 3.60% and markets pricing roughly a 70% chance of another hike at the May meeting, Wednesday's Q4 Wage Price Index (WPI) will be the first test of whether wage pressures are reinforcing the RBA's hawkish stance. Thursday brings January employment data, where the consensus expects 20K jobs added (down from 65.2K prior), a participation rate of 66.8%, and an unemployment rate of 4.2%. Preliminary February S&P Global Purchasing Managers Index (PMI) figures for Australia are also due Thursday.\nOn the US side, the Federal Reserve (Fed) publishes minutes from its January meeting on Wednesday, where a 10-2 vote held rates at 3.50% to 3.75%; the two dissenting votes that favored an immediate cut will be scrutinized. Thursday features US initial jobless claims and the Philadelphia Fed Manufacturing Survey, while Friday delivers the heavyweight combination of preliminary Q4 Gross Domestic Product (GDP) (3.0% forecast versus 4.4% prior), core Personal Consumption Expenditures Price Index (PCE) (0.3% month-on-month forecast), and final February University of Michigan (UoM) consumer sentiment. Multiple Fed speakers are scheduled, including Bostic, Bowman, Kashkari, Goolsbee, and Daly across Thursday and Friday.\nTight daily range near 0.7082 as Stochastic rolls off overbought\nOn the daily chart, AUD/USD opened Tuesday at 0.70754, printed a high of 0.70901 and a low of 0.70283, and closed at 0.70824, posting a modest 0.10% decline in a tight-range session. The pair continues to trade well above the rising 50-day Exponential Moving Average (EMA) at 0.68497 and the 200-day EMA at 0.66344, with both averages climbing and widely separated, confirming a strong bullish structure. Price is consolidating below the year-to-date high of 0.71473 after the sharp rally from the January low of 0.66636. The Stochastic Oscillator (14,5,5) shows %K at 77.27 and %D at 83.79, with %K crossing below %D, signaling a bearish divergence from the overbought zone; however, both lines remain above 75, suggesting the pullback is a correction within the trend rather than a reversal.\nThe candle structure over the past week shows a series of small-bodied candles and doji near the 0.7080 to 0.7100 area, pointing to indecision and consolidation after the February 12 spike to 0.71473. Immediate support sits at Tuesday's low of 0.70283, followed by the 0.7000 psychological level. A break below 0.7000 would open the door to the late-January congestion zone near 0.6940 to 0.6960. On the upside, resistance stands at the 0.7100 handle and the 0.71473 year-to-date high; a daily close above that level would target the 0.7200 area. The wide gap between price and the 50-day EMA (over 230 pips) suggests the pair is extended, and further consolidation or a pullback toward the 0.7000 zone would be a healthy retracement before the next leg higher.\nAUD/USD daily chart\nAustralian Dollar FAQs\nOne of the most significant factors for the Australian Dollar (AUD) is the level of interest rates set by the Reserve Bank of Australia (RBA). Because Australia is a resource-rich country another key driver is the price of its biggest export, Iron Ore. The health of the Chinese economy, its largest trading partner, is a factor, as well as inflation in Australia, its growth rate and Trade Balance. Market sentiment – whether investors are taking on more risky assets (risk"
            },
            {
                "title": "AUD/USD Forecast: Labour data may force RBA rate rethink - Forex Factory",
                "source": "Forex Factory",
                "url": "https://www.forexfactory.com/news/1384427-audusd-forecast-labour-data-may-force-rba-rate",
                "body": "they'll soon realize they did too much, too fast. 400 pips in one month isn't sustainable for a pair that is already at 3 year highs. some form of mind fuckery will ensue over the coming days to try and throw people off their scent. the only good advice to ever remember is to zoom out, look at the totality of everything.\n-\nAUD/USD Forecast: Labour data may force RBA rate rethink\nToday’s focus will be on Australia's Wage Price Index. Quarterly growth of 0.8% is expected, an outcome that would leave the annual pace unchanged at 3.4%, assuming no meaningful revisions. Historically, this release has a strong track record of landing close to consensus, meaning it rarely generates sustained market reactions. On that basis, it may prove to be a nothingburger. However, with uncertainty lingering over whether we’re at the start of a policy recalibration or a tightening cycle from the RBA, any surprise could deliver ripple effects across Australian markets far larger than usual. The private sector ... (full story)"
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "1.2220",
            "open": "153.3650",
            "close": "153.2870",
            "high": "153.9170",
            "low": "152.6950"
        },
        "market_summary": "### USD/JPY Market Briefing  \n* **Key Drivers:** BoJ rate-hike expectations and reduced Fed easing bets.  \n* **Price Action:** Fluctuating near **153.50**, briefly dipped below **153.00**.  \n* **Technical Outlook:** Bearish bias below 200-day EMA; support eyed at **150.80**.  \n---  \n**Overall Sentiment:** Negative 📉  \n\n**Key Developments:**  \n- **BoJ Policy Shift:** Growing optimism over potential rate hikes in April, fueled by strong Japanese exports (16.8% YoY surge in January) and improved inflation outlook.  \n- **Fed Outlook:** Reduced near-term easing bets after resilient U.S. labor data and softer inflation (2.4% YoY in January). Markets price in two rate cuts this year, with June as a key focal point.  \n- **Technical Breakdown:** USD/JPY fell below critical **153.00** support, now testing the 200-day EMA. A sustained break could target **151.50** and **150.80**.  \n\n**Market Reaction:**  \n- Japanese Yen strengthened across the board, outperforming major currencies.  \n- USD/JPY range-bound but under pressure from bearish technicals and hawkish BoJ sentiment.  \n- Traders closely watching Fed January Minutes and U.S. GDP/PCE data for directional cues.  \n\n**Risk Factors:**  \n- BoJ policy normalization could accelerate Yen strength.  \n- Fed’s inflation focus may delay rate cuts, supporting USD.  \n- Geopolitical tensions and risk-off sentiment could boost safe-haven demand for Yen.  \n\n**Conclusion:** Bearish medium-term outlook dominates as BoJ hawkishness and technical weakness pressure USD/JPY lower.",
        "source_articles": [
            {
                "title": "USD/JPY fluctuates as Yen firms on BoJ rate-hike bets, USD steadied by Fed outlook - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-jpy-fluctuates-as-yen-firms-on-boj-rate-hike-bets-usd-steadied-by-fed-outlook-202602171816",
                "body": "USD/JPY fluctuates as Yen firms on BoJ rate-hike bets, USD steadied by Fed outlook\n- USD/JPY range-bound near 153.50 in post-holiday trade.\n- BoJ rate-hike expectations keep the Yen firm across the board.\n- Reduced near-term Fed easing bets lend underlying support to the US Dollar.\nThe Japanese Yen (JPY) trades little changed against the US Dollar (USD) on Tuesday, with USD/JPY seeing two-way price action as traders return following the long US Presidents’ Day weekend. At the time of writing, USD/JPY is hovering near 153.40, after touching an intraday low around 152.70.\nHowever, the pair lacks strong follow-through, as the Greenback struggles to extend its recovery, with structural headwinds continuing to weigh on broader sentiment.\nMeanwhile, the Japanese Yen remains firmly bid across the board, supported by growing optimism around Prime Minister Sanae Takaichi’s pro-stimulus policy agenda and strengthening expectations that the Bank of Japan (BoJ) could raise interest rates in the coming months.\nUS economic data offered the Greenback modest support earlier in the day. The NY Empire State Manufacturing Index rose to 7.1 in February, beating market expectations of 6, though easing slightly from the previous 7.7 reading. Meanwhile, the ADP Employment Change four-week average climbed to 10.3K, up from a revised 7.8K (previously reported as 6.5K)\nThe US Dollar Index (DXY), which tracks the Greenback’s performance against a basket of six major currencies, is trading near 97.24, easing from an intraday high of 97.54.\nEven so, fading near-term Federal Reserve (Fed) interest rate-cut expectations keep the Greenback broadly supported following its recent bout of weakness, as traders reassess the timing of policy easing after last week’s US labour market and inflation data.\nUS Nonfarm Payrolls (NFP) increased by 130K in January, rebounding sharply from December’s revised 48K gain, while the Unemployment Rate edged lower to 4.3% from 4.4%. Headline CPI rose 0.2% MoM, easing from 0.3% in December. On an annual basis, inflation moderated to 2.4% YoY, down from 2.7%.\nFed Governor Michael Barr said earlier in the day, “I want to see more evidence that inflation is moving back to our 2% target.” He added that “it is prudent for the Fed to take time and look at the data before changing policy again,” noting that recent figures “indicate a stabilizing job market.”\nMarkets are currently pricing in two rate cuts this year, with the probability of a third move gradually increasing. That said, the latest dot plot from the December FOMC meeting signalled only one rate cut in 2026. According to the CME FedWatch Tool, traders are widely anticipating the first rate reduction to come as early as June.\nLooking ahead, Japan’s economic calendar remains relatively light this week, with attention centred on Friday’s National Consumer Price Index (CPI) report. In the United States, traders will closely monitor the release of the Fed’s January Meeting Minutes on Wednesday for further clarity on the monetary policy stance.\nFocus will then shift to the core Personal Consumption Expenditures (PCE) Price Index, along with the advance estimate of fourth-quarter US Gross Domestic Product (GDP) due on Friday.\nJapanese Yen Price Today\nThe table below shows the percentage change of Japanese Yen (JPY) against listed major currencies today. Japanese Yen was the strongest against the British Pound.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Japanese Yen from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent JPY (base)/USD (quote).\nAuthor\nVishal Chaturvedi\nFXStreet\nI am a macro-focused research analyst with over four years of experience covering forex and commodities market. I enjoy breaking down complex economic trends and turning "
            },
            {
                "title": "Japanese Yen Forecast: USD/JPY Drops as Japanese Exports Surge - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/japanese-yen-forecast-usd-jpy-drops-as-japanese-exports-surge-1580183",
                "body": "USD/JPY briefly dropped below 153 this week despite softer-than-expected Japanese GDP numbers for Q4 2025. Notably, weaker-than-expected external demand left GDP growth short of forecasts, placing greater scrutiny on Japanese trade data, which was out in early trading on Wednesday, February 18.\nCrucially, exports soared in January, reinforcing the Bank of Japan’s view that US tariff risks have abated. January’s numbers also signaled a sharp pickup in economic momentum, reviving expectations of an April BoJ rate hike.\nBeyond the data, 10-year Japanese Government Bond (JGB) yields tumbled to their lowest level since January 12. Easing concerns that Prime Minister Sanae Takaichi’s fiscal spending would balloon Japan’s elevated debt-to-GDP ratio reduced risk premiums for holding JGBs.\nExpectations of an April BoJ rate hike and improved sentiment toward Prime Minister Takaichi’s fiscal spending plans support the bearish short- to medium-term outlook for USD/JPY.\nBelow, I’ll discuss the macro backdrop, near-term price catalysts, and technical levels traders should closely watch.\nOn February 18, Japanese trade data raised expectations of an April BoJ rate hike, driving demand for the yen. Japanese exports surged 16.8% year-on-year (YoY) in January, up sharply from 5.1% in December. Meanwhile, imports fell 2.5% YoY, after rising 5.3% in December.\nAccording to figures released by the Ministry of Finance:\nExport trends with the US aligned with sentiment among BoJ policymakers that the effect of US tariffs on demand for Japanese goods had eased as the pace of contraction slowed.\nTypically, increased demand for Japanese goods and services allows firms to raise prices, boosting profitability. Higher profits may lead to more employment and higher wages, a key focal point for the BoJ. Rising wages can lift consumer sentiment and spending, fueling demand-driven inflation. A higher inflation outlook would support a more hawkish BoJ rate path.\nUSD/JPY responded to the upswing in external demand, briefly climbing to a high of 153.217 before falling to a low of 153.091 early in the Wednesday session. The trade data reaffirmed the bearish short- to medium-term price outlook.\nWhile Japanese trade data strengthened the yen, FOMC Minutes and Fed chatter will influence sentiment toward the Fed’s policy stance and US dollar demand. Following the hotter-than-expected US jobs report and the softer US CPI report, insights into where the Fed’s focus lies vis-à-vis cutting rates will be key.\nMinutes underscoring concerns about elevated inflation over a resilient labor market would raise bets on a June Fed rate cut, given the softer CPI numbers after the FOMC meeting, weakening the US dollar. US headline inflation cooled from 2.7% in December to 2.4% in January, while core inflation eased from 2.6% to 2.5%.\nLast week’s hotter-than-expected jobs report overshadowed the CPI report, cooling bets on a June Fed rate cut. According to the CME FedWatch Tool, the probability of a June cut fell from 75.2% on February 10 to 63.6% on February 17.\nMarket expectations of a dovish Fed rate path and the BoJ’s more hawkish policy stance would reaffirm the negative short- to medium-term outlook.\nFor USD/JPY price trends, traders should closely assess technical indicators, key economic data, government policies, and central bank rhetoric.\nOn the daily chart, USD/JPY remains below its 50-day Exponential Moving Average (EMA), but holds above the 200-day EMA. The EMA positions indicate a bearish near-term but bullish longer-term bias. Nevertheless, positive yen fundamentals align with the short-term technicals, signaling a bearish medium-term outlook.\nA sustained drop below the 200-day EMA would indicate a bearish trend reversal, exposing the 150 support level. If breached, 145 would be the next key support level.\nSignificantly, a sustained fall through the EMAs would reaffirm the negative medium- to longer-term price outlook.\nIn my view, bets on multiple BoJ rate hikes and expe"
            },
            {
                "title": "USD/JPY Forecast: Critical Slide Below 153.00 Sparks Urgent Focus on 200-Day EMA - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/news/feed/7551f-usd-jpy-forecast-slides-ema",
                "body": "USD/JPY Forecast: Critical Slide Below 153.00 Sparks Urgent Focus on 200-Day EMA\nShare:\nBitcoinWorld\nUSD/JPY Forecast: Critical Slide Below 153.00 Sparks Urgent Focus on 200-Day EMA\nTOKYO, April 2025 – The USD/JPY currency pair has decisively broken below the critical 153.00 support level, triggering intense market scrutiny as it now approaches its long-term 200-day Exponential Moving Average. This significant movement reflects a pronounced strengthening of the Japanese Yen against the US Dollar, driven by evolving central bank policies and global macroeconomic shifts. Consequently, traders and analysts are urgently reassessing their medium-term outlook for the major currency pair.\nUSD/JPY Forecast: Technical Breakdown and Key Levels\nThe recent price action for USD/JPY reveals a clear bearish shift. After consolidating for several weeks above the 154.00 handle, selling pressure intensified, pushing the pair through the 153.00 psychological and technical barrier. This breakdown was not an isolated event; rather, it was confirmed by rising trading volumes and a simultaneous decline in other Dollar pairs. The immediate technical focus now rests squarely on the 200-day Exponential Moving Average (EMA), a benchmark long-term trend indicator widely monitored by institutional funds.\nHistorically, the 200-day EMA has acted as a robust dynamic support or resistance level for USD/JPY. A sustained break below this moving average could signal a deeper corrective phase, potentially targeting the 151.50 and 150.80 support zones established earlier in the year. Conversely, a firm bounce from the EMA would suggest the broader uptrend remains intact, albeit weakened. Market technicians are also watching the Relative Strength Index (RSI), which has dipped towards oversold territory, indicating the potential for a short-term consolidation or rebound.\nFundamental Drivers Behind the Japanese Yen’s Resurgence\nThe Japanese Yen’s newfound strength stems from a confluence of fundamental factors. Primarily, shifting expectations around the Bank of Japan’s (BoJ) monetary policy trajectory are providing core support. While the BoJ maintains an accommodative stance, persistent inflation readings above its 2% target and rising wage growth have fueled speculation about a further normalization of policy, potentially including additional interest rate hikes or a reduction in its massive bond-buying program.\nSimultaneously, market perceptions of the Federal Reserve’s path have moderated. Recent US economic data, including softer employment figures and retail sales, have tempered expectations for aggressive Fed tightening. This narrowing of the interest rate differential between the US and Japan reduces the carry trade appeal that has long weighed on the Yen. Furthermore, geopolitical tensions and risk-off sentiment in equity markets have periodically boosted demand for the Yen as a traditional safe-haven currency.\nExpert Analysis on Policy Divergence and Market Impact\nFinancial strategists point to the changing dynamics of global yield curves as a key driver. “The market is progressively pricing in a convergence of monetary policy,” notes a senior currency analyst at a major Tokyo bank. “The era of extreme BoJ dovishness is fading, while the Fed’s hawkish ceiling appears defined. This recalibration is fundamentally altering the USD/JPY valuation model.” Historical data supports this view; periods of BoJ policy adjustment have consistently led to heightened Yen volatility and trend reversals.\nThe impact extends beyond spot forex markets. Options markets show a sharp increase in demand for Yen calls (bets on Yen strength), and leveraged fund positioning data from the Commodity Futures Trading Commission (CFTC) indicates a rapid unwinding of net-long USD/JPY positions. This shift in sentiment is also affecting corporate hedging strategies, with Japanese exporters reportedly adjusting their foreign exchange risk management programs in anticipation of a stronger do"
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0064",
            "open": "1.3631",
            "close": "1.3636",
            "high": "1.3692",
            "low": "1.3628"
        },
        "market_summary": "### USD/CAD Market Briefing  \n* **Key Drivers:** Softer Canadian inflation (2.3% YoY) and lower crude oil prices weaken the Loonie.  \n* **Price Action:** Extended rebound to near **1.3645**, with resistance eyed at **1.3700**.  \n* **Technical Outlook:** Short-term bullish above **1.3600**, RSI trending upward.  \n\n---\n**Overall Sentiment:** Bullish 📈  \n\n**Key Highlights:**  \n- **Inflation Data:** Canada’s CPI slowed to 2.3% in January, below expectations, reinforcing BoC rate cut bets.  \n- **Oil Prices:** Crude oil weakness due to easing US-Iran tensions weighs on CAD, Canada’s key export.  \n- **Fed Minutes:** Market awaits FOMC Minutes for hints on USD direction; dovish tone could cap gains.  \n- **Technical Levels:** Support at **1.3600**, with a break below risking a retest of **1.3550**.  \n\n**Market Context:**  \nThe CAD faces dual pressure from softening inflation and falling oil prices, while USD strength hinges on Fed policy signals. The pair’s trajectory remains event-driven, with key resistance at **1.3700**.",
        "source_articles": [
            {
                "title": "Canadian Dollar weakens below 1.3650 on softer CPI inflation, lower crude oil prices - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/canadian-dollar-weakens-below-13650-on-softer-cpi-inflation-lower-crude-oil-prices-202602180146",
                "body": "Canadian Dollar weakens below 1.3650 on softer CPI inflation, lower crude oil prices\n- USD/CAD gathers strength to near 1.3645 in Wednesday’s Asian session.\n- Canada's annual inflation rate declined to 2.3% in January, softer than expected.\n- Traders brace for the FOMC Minutes later on Wednesday.\nThe USD/CAD pair gains ground to around 1.3645 during the Asian trading hours on Wednesday. The Canadian Dollar (CAD) weakens against the US Dollar (USD) on a softer inflation report and lower crude oil prices. All eyes will be on the Federal Open Market Committee (FOMC) Minutes, which are due later on Wednesday.\nData released by Statistics Canada on Tuesday showed that Canada’s Consumer Price Index (CPI) inflation eased to 2.3% YoY in January from 2.4% in December. This figure came in below the market consensus of 2.4%. This report reinforced the case that the Bank of Canada will cut the key interest rate again, weighing on the Loonie against the USD.\nMeanwhile, crude oil prices fall amid easing tensions between the US and Iran. Iranian Foreign Minister Abbas Araqchi stated on Tuesday that both countries reached an understanding on the main “guiding principles” in talks aimed at resolving their longstanding nuclear dispute, but that does not mean a deal is imminent. This headline undermines the commodity-linked CAD. It is worth noting that Canada is a major oil-exporting country, and low crude oil prices generally have a negative impact on the Loonie.\nThe attention will shift to the FOMC Minutes on Wednesday. The report could offer some hints about the US Federal Reserve's (Fed) future interest rate outlook. Any dovish stance of the Fed could drag the US Dollar (USD) lower in the near term.\nCanadian Dollar FAQs\nThe key factors driving the Canadian Dollar (CAD) are the level of interest rates set by the Bank of Canada (BoC), the price of Oil, Canada’s largest export, the health of its economy, inflation and the Trade Balance, which is the difference between the value of Canada’s exports versus its imports. Other factors include market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – with risk-on being CAD-positive. As its largest trading partner, the health of the US economy is also a key factor influencing the Canadian Dollar.\nThe Bank of Canada (BoC) has a significant influence on the Canadian Dollar by setting the level of interest rates that banks can lend to one another. This influences the level of interest rates for everyone. The main goal of the BoC is to maintain inflation at 1-3% by adjusting interest rates up or down. Relatively higher interest rates tend to be positive for the CAD. The Bank of Canada can also use quantitative easing and tightening to influence credit conditions, with the former CAD-negative and the latter CAD-positive.\nThe price of Oil is a key factor impacting the value of the Canadian Dollar. Petroleum is Canada’s biggest export, so Oil price tends to have an immediate impact on the CAD value. Generally, if Oil price rises CAD also goes up, as aggregate demand for the currency increases. The opposite is the case if the price of Oil falls. Higher Oil prices also tend to result in a greater likelihood of a positive Trade Balance, which is also supportive of the CAD.\nWhile inflation had always traditionally been thought of as a negative factor for a currency since it lowers the value of money, the opposite has actually been the case in modern times with the relaxation of cross-border capital controls. Higher inflation tends to lead central banks to put up interest rates which attracts more capital inflows from global investors seeking a lucrative place to keep their money. This increases demand for the local currency, which in Canada’s case is the Canadian Dollar.\nMacroeconomic data releases gauge the health of the economy and can have an impact on the Canadian Dollar. Indicators such as GDP, Manufacturing and Services PMIs, employment, and consumer"
            },
            {
                "title": "The decline in inflation, coupled with weakening oil prices, has extended the rebound of USD/CAD. - 富途牛牛",
                "source": "富途牛牛",
                "url": "https://news.futunn.com/en/post/68992921/the-decline-in-inflation-coupled-with-weakening-oil-prices-has",
                "body": "During the Asian trading session on Wednesday, USD/CAD extended its rebound, trading near 1.3645. The US dollar remained relatively firm ahead of key events, while the Canadian dollar was weighed down by multiple negative factors, showing overall weakness.\nThe latest data shows that Canada's CPI in January increased by 2.3% year-on-year, lower than the previous reading of 2.4% and market expectations of 2.4%. The decline in inflation has strengthened market expectations that the Bank of Canada may further ease its policy.\nCurrently, the momentum of Canada's economic growth remains sluggish, with pressure on the real estate market and consumer activity. Against this backdrop, policymakers may lean towards supporting the economy through interest rate cuts. Rising expectations of rate cuts have weakened the attractiveness of the Canadian dollar, causing it to fall against the US dollar.\nMeanwhile, the weakening of crude oil prices also exerted direct pressure on the Canadian dollar. News of phased progress in the US-Iran nuclear issue negotiations alleviated geopolitical tensions, reducing market risk premiums and leading to a decline in oil prices.\nGiven that Canada is one of the world’s major crude oil exporters, a drop in oil prices typically implies a decline in expected export revenues, thereby negatively impacting the Canadian dollar.\nOn the US dollar side, the market remains cautiously on hold. Investors are awaiting the release of the FOMC meeting minutes to assess the Federal Reserve's latest views on the inflation trajectory and economic outlook.\nIf the minutes signal a more dovish stance, confirming a future path of rate cuts, the US dollar may face short-term downward pressure; however, if the tone is cautious, emphasizing vigilance over inflation, the US dollar could receive further support.\nOverall, the current upward movement of USD/CAD is primarily driven by the weakening of the Canadian dollar, while the direction of the US dollar still needs confirmation from policy signals.\nFrom the daily chart perspective, USD/CAD has regained stability above the key level of 1.3600 after a prior pullback, with the short-term structure turning bullish. Prices have gradually moved back above the 20-day moving average, and if they can stabilize above 1.3650, there may be further testing of resistance around the 1.3700 level.\nThe RSI indicator is trending upward from the neutral zone, indicating a recovery in bullish momentum, but it has not yet entered the overbought region, leaving room for further upside. If the price breaks below 1.3600, the short-term rebound structure may be disrupted, with support to watch at 1.3550.\nThe 4-hour chart shows that the exchange rate has formed a short-term upward channel, with gradually rising lows. The short-term trend is biased towards bullishness. The moving averages are arranged in a bullish pattern, and the MACD is operating above the zero axis, with momentum bars maintaining positive values, indicating that upward momentum has not yet diminished.\nA breakout above the 1.3660–1.3680 region would open up further upside potential; however, a break below 1.3600 could lead to a retest of the lower boundary of the channel.\nEditorial View:\nThe current rebound in USD/CAD is primarily driven by the叠加影响 of weakening Canadian fundamentals and a pullback in oil prices. If the Federal Reserve minutes lean dovish, the US dollar may face short-term pressure, thereby limiting upside potential for the currency pair.\nHowever, if the minutes reflect a cautious stance, the Canadian dollar may continue to weaken under the dual pressures of slowing inflation and falling oil prices. Before policy signals become clear, the market is likely to maintain an event-driven volatility pattern."
            },
            {
                "title": "USD/CAD Surges: Softer Canada Inflation Meets Firm US Dollar in Critical 2025 Currency Shift - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/news/feed/83f24-usd-cad-gains-canada-inflation-dollar",
                "body": "USD/CAD Surges: Softer Canada Inflation Meets Firm US Dollar in Critical 2025 Currency Shift\nShare:\nBitcoinWorld\nUSD/CAD Surges: Softer Canada Inflation Meets Firm US Dollar in Critical 2025 Currency Shift\nTORONTO, March 2025 – The USD/CAD currency pair continues its upward trajectory this week, extending gains as softer Canadian inflation data collides with renewed US Dollar strength. This significant movement reflects broader economic divergences between North America’s two largest economies, with immediate implications for traders, businesses, and policymakers across both nations. Market analysts now closely monitor whether this trend represents a temporary adjustment or the beginning of a more sustained currency realignment.\nUSD/CAD Extends Gains Amid Diverging Economic Policies\nThe USD/CAD exchange rate climbed to 1.3850 during Thursday’s trading session, marking its highest level since November 2024. This represents a 2.3% increase over the past five trading days alone. Consequently, the Canadian Dollar now trades at its weakest point against the Greenback in nearly five months. This movement follows Statistics Canada’s latest Consumer Price Index report, which showed annual inflation cooling to 2.1% in February 2025.\nMeanwhile, the US Dollar Index (DXY) strengthened to 105.80 against a basket of major currencies. This dual dynamic – softer Canadian inflation and firmer US economic indicators – creates perfect conditions for USD/CAD appreciation. The Bank of Canada’s more dovish stance contrasts sharply with the Federal Reserve’s continued caution on rate cuts, amplifying the currency pair’s movement.\nAnalyzing the Inflation Data Divergence\nCanada’s inflation slowdown surprised many economists who expected more persistent price pressures. The February CPI reading of 2.1% represents a meaningful decline from January’s 2.4% and December’s 2.6%. Three core components drove this decrease:\n- Shelter costs: Moderated to 4.9% annual growth\n- Food prices: Increased just 2.3% year-over-year\n- Gasoline prices: Fell 1.2% from February 2024 levels\nConversely, US inflation data released last week showed the Core Personal Consumption Expenditures index remaining at 2.8% annually. This persistence above the Federal Reserve’s 2% target continues supporting the US Dollar’s relative strength. The table below illustrates key economic indicators driving the currency divergence:\nMonetary Policy Divergence Drives Currency Movements\nBank of Canada Governor Tiff Macklem indicated last week that the central bank might consider rate cuts as early as June 2025 if inflation continues trending toward their target. This dovish signaling immediately impacted currency markets. Meanwhile, Federal Reserve Chair Jerome Powell emphasized the need for more confidence in sustainable inflation reduction before considering policy easing.\nThis policy divergence creates what forex analysts call a “carry trade advantage” for the US Dollar. Higher US interest rates relative to Canadian rates make holding USD more attractive to international investors. Consequently, capital flows toward US dollar-denominated assets accelerate, further strengthening the currency pair. Historical data shows that interest rate differentials between the two nations explain approximately 60% of USD/CAD movements over the past decade.\nCommodity Price Impact on the Canadian Dollar\nTraditionally, the Canadian Dollar maintains strong correlation with commodity prices, particularly crude oil. However, recent weeks have shown this relationship weakening. Despite West Texas Intermediate crude trading above $78 per barrel, the loonie continues depreciating against the Greenback. This decoupling suggests monetary policy and inflation dynamics currently outweigh commodity influences in currency valuation.\nCanada’s trade balance data released yesterday showed a narrowing surplus, with exports declining 1.2% month-over-month. This economic softening provides additional context for the currency’s we"
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "2.2490",
            "open": "209.0500",
            "close": "207.9550",
            "high": "209.4730",
            "low": "207.2240"
        },
        "market_summary": "ERROR: All AI models failed to generate a summary.",
        "source_articles": [
            {
                "title": "GBP/JPY Plummets Below 208.50 as Yen Surges: Critical UK Jobs Data Looms - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/news/feed/089f2-gbp-jpy-slides-yen-strength",
                "body": "GBP/JPY Plummets Below 208.50 as Yen Surges: Critical UK Jobs Data Looms\nShare:\nBitcoinWorld\nGBP/JPY Plummets Below 208.50 as Yen Surges: Critical UK Jobs Data Looms\nLONDON, March 2025 – The GBP/JPY currency pair continues its downward trajectory, sliding further below the mid-208.00s as Japanese yen strength dominates forex markets. This movement occurs ahead of crucial UK employment data that could determine near-term direction for the volatile cross. Market participants globally monitor this development closely, particularly given recent Bank of Japan policy signals and ongoing UK economic uncertainty.\nGBP/JPY Technical Breakdown and Current Levels\nThe GBP/JPY pair currently trades around 207.80, representing a significant decline from recent highs above 210.00. This movement marks the third consecutive session of losses for the cross. Technical analysts highlight several key levels that now come into focus. Firstly, the 207.50 level represents immediate support, followed by the more substantial 206.80 zone. Conversely, resistance now appears at 208.50, then 209.20. The 50-day moving average currently sits at 208.75, adding technical significance to recent price action.\nMarket volume data shows increased activity during Asian trading sessions. This pattern suggests yen-driven movements rather than pound-specific flows. The Relative Strength Index (RSI) now reads 42, indicating neither overbought nor oversold conditions. However, momentum indicators show bearish divergence developing over the past five sessions. This technical setup creates uncertainty about whether current movements represent correction or trend reversal.\nJapanese Yen Strength: Drivers and Sustainability\nMultiple factors contribute to the Japanese yen’s current strength against major currencies. The Bank of Japan’s recent policy communications suggest potential normalization of ultra-loose monetary settings. Market participants increasingly price in possible yield curve control adjustments. Additionally, safe-haven flows benefit the yen amid global economic uncertainty. Japanese institutional investors also demonstrate repatriation behavior ahead of fiscal year-end.\nComparative interest rate differentials between Japan and other developed economies continue narrowing. The table below illustrates recent changes:\nThese narrowing differentials reduce carry trade attractiveness, supporting yen appreciation. Market positioning data from the Tokyo Financial Exchange shows speculators reducing short yen positions significantly. This adjustment reflects changing expectations about Japan’s monetary policy trajectory. However, questions remain about sustainability given Japan’s economic fundamentals.\nExpert Analysis: Yen Momentum and Policy Implications\nFinancial institutions provide mixed assessments of current yen strength. Goldman Sachs analysts note, “The yen’s appreciation reflects both technical repositioning and fundamental reassessment.” They highlight three key factors: reduced short positioning, changing BoJ expectations, and global risk sentiment shifts. Meanwhile, Nomura strategists emphasize seasonal patterns, stating, “Japanese fiscal year-end typically supports yen through repatriation flows.”\nThe Bank of Japan faces complex policy decisions. Inflation remains above target, yet wage growth shows only modest improvement. Governor Ueda recently commented about “gradual normalization” without specifying timing. This ambiguity creates market uncertainty that currently benefits the yen. Most analysts expect policy adjustments in second-quarter 2025 rather than immediate changes. However, markets increasingly price earlier moves, creating volatility.\nUK Economic Context and Upcoming Jobs Data\nThe British pound faces its own challenges ahead of Thursday’s employment report. Economists forecast several key metrics that will influence Bank of England policy expectations:\n- Unemployment Rate: Expected to hold at 4.2%\n- Average Earnings: Forecast at 5.7% year-ove"
            },
            {
                "title": "GBP/JPY rebounds from two-month low on weaker JPY; eyes on UK CPI - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-rebounds-from-two-month-low-on-weaker-jpy-retakes-20800-ahead-of-uk-cpi-202602180515",
                "body": "GBP/JPY rebounds from two-month low on weaker JPY; retakes 208.00 ahead of UK CPI\n- GBP/JPY gains some positive traction on Wednesday amid notable JPY weakness.\n- The divergent BoJ-BoE policy expectations should cap the upside for spot prices.\n- Traders now look forward to the UK consumer inflation figures for a fresh impetus.\nThe GBP/JPY cross attracts some buyers during the Asian session on Wednesday and moves away from a two-month trough, around the 207.25-207.20 area, which it touched the previous day. The uptick is sponsored by a broadly weaker Japanese Yen (JPY) and lifts spot prices back above the 208.00 mark, though the broader fundamental backdrop warrants some caution for bulls.\nWorries about Japan's public finances resurfaced after the International Monetary Fund (IMF) warned against cutting the consumption tax, saying that it would erode Japan's fiscal space and raise debt risks. Moreover, expectations that Japan's Prime Minister Takaichi will push back against further interest rate hikes by the Bank of Japan (BoJ) undermine the JPY amid a generally positive risk tone.\nInvestors, however, remain hopeful that Takaichi could be fiscally responsible and that her policies will boost the economy. This might prompt the BoJ to stick to its policy normalization path, which should limit the JPY losses. Furthermore, bets for a rate cut by the Bank of England (BoE) in March, bolstered by Tuesday's disappointing UK jobs report, undermine the British Pound (GBP) and should cap the GBP/JPY cross.\nMarket participants now look forward to the release of the latest UK consumer inflation figures for some meaningful impetus. Apart from this, Japan's National Consumer Price Index (CPI) and the monthly UK Retail Sales data on Friday would help in determining the near-term trajectory for the GBP/JPY cross. Nevertheless, the fundamental backdrop suggests that the path of least resistance for spot prices is to the downside.\nEconomic Indicator\nConsumer Price Index (YoY)\nThe United Kingdom (UK) Consumer Price Index (CPI), released by the Office for National Statistics on a monthly basis, is a measure of consumer price inflation – the rate at which the prices of goods and services bought by households rise or fall – produced to international standards. It is the inflation measure used in the government’s target. The YoY reading compares prices in the reference month to a year earlier. Generally, a high reading is seen as bullish for the Pound Sterling (GBP), while a low reading is seen as bearish.\nRead more.Next release: Wed Feb 18, 2026 07:00\nFrequency: Monthly\nConsensus: 3%\nPrevious: 3.4%\nSource: Office for National Statistics\nThe Bank of England is tasked with keeping inflation, as measured by the headline Consumer Price Index (CPI) at around 2%, giving the monthly release its importance. An increase in inflation implies a quicker and sooner increase of interest rates or the reduction of bond-buying by the BOE, which means squeezing the supply of pounds. Conversely, a drop in the pace of price rises indicates looser monetary policy. A higher-than-expected result tends to be GBP bullish.\nAuthor\nHaresh Menghani\nFXStreet\nHaresh Menghani is a detail-oriented professional with 10+ years of extensive experience in analysing the global financial markets."
            },
            {
                "title": "GBP/JPY Price Forecast: Short-term trend turns negative below 210.00 handle - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-price-forecast-short-term-trend-turns-negative-below-21000-handle-202602171322",
                "body": "GBP/JPY Price Forecast: Short-term trend turns negative below 210.00 handle\n- GBP/JPY trades on the defensive after disappointing UK jobs data reinforced bets on BoE interest rate cuts this year.\n- On a 4-hour chart, technical indicators align with the bearish bias, as moving averages slope lower and momentum oscillators remain in negative territory.\n- Immediate resistance stands at 208.50-209.00, while a break below 207.00 could open the door toward the 205.00 support zone.\nGBP/JPY snaps a two-day winning streak on Tuesday as weak UK labour market data fuels expectations of Bank of England (BoE) interest rate cuts, weighing on the British Pound (GBP). At the time of writing, GBP/JPY is trading around 207.28, down nearly 0.93% on the day and hovering near a two-month low.\nFollowing the UK labour market data, markets are now fully pricing in two rate cuts by the BoE this year, with expectations building for the first reduction as early as March.\nMeanwhile, the Japanese Yen (JPY) holds firm across the board, underpinned by growing optimism around Prime Minister Sanae Takaichi’s pro-stimulus policy agenda and firming expectations that the Bank of Japan (BoJ) could raise interest rates in the coming months.\nFrom a technical perspective, the four-hour chart suggests the short-term structure has turned decisively bearish, with price action slipping below key moving averages.\nGBP/JPY reversed sharply from multi-year highs after failing to sustain gains above the 214.00 mark earlier this month. Bearish momentum accelerated once the pair broke and retested the 210.00 psychological level, paving the way for fresh lower lows.\nThe 21-period Simple Moving Average (SMA) has crossed below the 50-period SMA and is now acting as immediate resistance near 208.58, reinforcing the negative bias. Both moving averages continue to slope lower, while prices remain capped beneath them.\nOn the downside, the 207.00 level may offer near-term support. A sustained break below this zone would likely intensify selling pressure and expose the next support around 205.00. Conversely, a decisive move back above 210.00 would be required to ease the downside bias, with 212.00 emerging as the next resistance zone.\nMomentum indicators align with the bearish outlook. The Moving Average Convergence Divergence (MACD) histogram has slipped slightly below the zero line, signaling a bearish crossover and fading upside momentum.\nMeanwhile, the Relative Strength Index (RSI) hovers near 31, approaching oversold territory, reflecting persistent selling pressure.\nJapanese Yen Price Today\nThe table below shows the percentage change of Japanese Yen (JPY) against listed major currencies today. Japanese Yen was the strongest against the British Pound.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Japanese Yen from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent JPY (base)/USD (quote).\nAuthor\nVishal Chaturvedi\nFXStreet\nI am a macro-focused research analyst with over four years of experience covering forex and commodities market. I enjoy breaking down complex economic trends and turning them into clear, actionable insights that help traders stay ahead of the curve."
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "2,673.0000",
            "open": "68,831.5000",
            "close": "67,620.5000",
            "high": "69,211.5000",
            "low": "66,538.5000"
        },
        "market_summary": "### BTC/USD Market Briefing\n* **Key Drivers:** Institutional accumulation via IBIT; Abu Dhabi funds hold **$1B+** in BlackRock Bitcoin ETF.\n* **Price Action:** Trading near **$67,000**, down **23%** YTD 2026.\n* **Institutional Flow:** Mubadala + Al Warda increased IBIT stakes; combined exposure now **$800M** (down from $1B).\n---\n**Overall Sentiment:** Cautious 📉\n*Long-term institutional positioning persists despite short-term price weakness.*",
        "source_articles": [
            {
                "title": "Abu Dhabi’s Al Warda Raises Bitcoin ETF Stake to 8.2 Million IBIT Shares in Q4 Filing - Bitcoin Magazine",
                "source": "Bitcoin Magazine",
                "url": "https://bitcoinmagazine.com/news/ai-warda-raises-ibit-bitcoin-etf-stake",
                "body": "Abu Dhabi-based Al Warda Investments continued to expand its exposure to bitcoin through BlackRock’s iShares Bitcoin Trust (IBIT) in the fourth quarter of 2025, extending a strategy shift that began earlier in the year.\nIn a filing released today, Al Warda reported owning 8,218,712 shares of IBIT as of Dec. 31, up from 7,963,393 shares at the end of the third quarter. The increase follows a sharp Q3 buildup, when the firm more than tripled its stake and raised its bitcoin ETF exposure to $517.6 million.\nAl Warda operates under the Abu Dhabi Investment Council (ADIC), part of Mubadala Investment Co., one of the region’s leading sovereign wealth groups. The council has rarely taken public positions in listed digital assets, typically favoring private market investments such as buyouts, infrastructure, and real estate.\nIts growing allocation through a U.S.-listed bitcoin ETF signals a shift in institutional positioning within the Gulf. A spokesperson for ADIC previously told Bloomberg that bitcoin is increasingly viewed as a long-term store of value alongside gold, citing its role in portfolio diversification as financial markets move toward a more digital future.\nThe Q4 increase comes after bitcoin surged toward an October peak near $126,000 before retreating below $90,000 in November. Bitcoin is currently trading near $67,000.\nOther institutions exploring Bitcoin via IBIT\nLast week, Goldman Sachs disclosed roughly $2.36 billion in total crypto exposure, including a $1.1 billion position in IBIT, signaling a shift from its earlier skepticism toward bitcoin.\nSEC filings also showed smaller holdings in Fidelity’s Bitcoin fund, bitcoin-related companies, and options positions tied to IBIT, alongside exposure to Ethereum, XRP, and Solana.\nIn November of last year, Texas became the first U.S. state to purchase Bitcoin for its Strategic Reserve, acquiring $5 million IBIT shares worth approximately $87,000 per BTC. The purchase was made through BlackRock’s iShares Bitcoin Trust (IBIT) while the state finalizes plans for self-custody of the asset.\nTexas had previously explored legislation to establish a strategic Bitcoin reserve without using taxpayer funds. In June, the governor signed the law creating the state’s Strategic Bitcoin Reserve.\nHarvard also adjusted its crypto holdings in Q4 2025, cutting its Bitcoin position by 21% to 5.35 million IBIT shares ($265.8 million) while establishing a new $86.8 million stake in BlackRock’s iShares Ethereum Trust.\nCombined crypto exposure totaled $352.6 million, with Bitcoin remaining the endowment’s largest publicly disclosed equity."
            },
            {
                "title": "Bitcoin (BTC) 13F news: Mubadala Investment Company and Al Warda boosted IBIT stakes in Q4 - CoinDesk",
                "source": "CoinDesk",
                "url": "https://www.coindesk.com/markets/2026/02/17/abu-dhabi-funds-bought-the-bitcoin-dip-as-they-increased-exposure-to-blackrock-s-ibit",
                "body": "Abu Dhabi wealth funds bitcoin ETF holdings topped $1 billion at end of 2025\nBoth Mubadala Investment Company and Al Warda Investments lifted investments in BlackRock's iShares Bitcoin ETF (IBIT) in the fourth quarter.\nWhat to know:\n- Two major Abu Dhabi investment firms, Mubadala Investment Company and Al Warda Investments, increased their holdings of BlackRock’s iShares Bitcoin Trust (IBIT) in the fourth quarter of 2025 as bitcoin’s price fell.\n- Mubadala lifted its IBIT stake to 12.7 million shares and Al Warda to 8.2 million shares.\n- Together, they held a combined position that exceeded $1 billion at the end of 2025 but has since declined to just over $800 million amid further bitcoin losses in 2026.\nTwo of Abu Dhabi’s major investment firms increased their exposure to bitcoin\nMubadala Investment Company, a sovereign wealth fund backed by the Abu Dhabi government, added nearly four million shares of BlackRock’s iShares Bitcoin Trust (IBIT) between October and December, bringing its total holdings to 12.7 million shares. The move came as bitcoin fell roughly 23% during the quarter.\nMubadala made its first purchases in IBIT in late 2024 and has been adding since.\nAl Warda Investments, another Abu Dhabi-based investment management firm that oversees diversified global assets on behalf of government-related entities, held 8.2 million shares at the end of the fourth quarter, up slightly from 7.96 million shares three months earlier.\nTogether, the two funds held more than $1 billion worth of bitcoin via IBIT at the end of 2025. However, with bitcoin down another 23% year-to-date in 2026, the current value of their combined holdings has dropped to just over $800 million as of Tuesday (assuming they haven't continued adding in 2026).\nThe disclosure, made through 13F filings with the U.S. Securities and Exchange Commission, reflects growing institutional interest in spot bitcoin ETFs, even during periods of market stress. BlackRock’s IBIT, which launched in early 2024, has quickly become the dominant vehicle for regulated exposure to bitcoin in the U.S.\nWhile the crypto market has faced ongoing headwinds in early 2026 — including low volatility, reduced retail participation, and macroeconomic uncertainty — some long-term investors appear to be using the downturn to build positions in regulated, liquid products tied to digital assets.\nBlackRock head of digital assets, Robert Mitchnick, said on a recent panel that there is a mistaken belief that hedge funds using ETFs are driving volatility and heavy selling, but that does not match what the firm is observing. Instead, he said, IBIT holders are in it for the long term.\nMore For You\nPeter Thiel's Founders Fund dumps every ETHZilla share\nPeter Thiel's Founders Fund held zero shares in ether treasury firm ETHZillan at the end of 2025, per SEC filings.\nWhat to know:\n- Peter Thiel's Founders Fund held zero shares in ether treasury firm ETHZillan at the end of 2025, per SEC filings.\n- At its peak, the firm hoarded over 100,000 ether, then panic-sold after the market peaked in October."
            },
            {
                "title": "Abu Dhabi Funds Hit $1B in BlackRock Bitcoin ETF by End of 2025 - Eudaimonia and Co",
                "source": "Eudaimonia and Co",
                "url": "https://eand.co/abu-dhabi-funds-hit-1b-in-blackrock-bitcoin-etf-by-end-of-2025",
                "body": "Abu Dhabi sovereign funds, including Mubadala Investment Company and Al Warda Investments, collectively held over $1 billion in BlackRock’s spot Bitcoin ETF (IBIT) by the end of 2025, according to reports from the U.S. Securities and Exchange Commission (SEC) Q4 2025 13F filings. Based on the values from the time of the report, Mubadala owned around $630 million in IBIT, and Al Warda maintained a $408 million stake.\nCombined Holdings Surpass $1 Billion\nMubadala Investment Company, a sovereign wealth fund backed by the Abu Dhabi government, added about 4 million shares of BlackRock’s iShares Bitcoin Trust (IBIT) between October and December, which accounts for a total holdings of 12.7 million shares. This move was followed by Bitcoin’s downturn to roughly 23% during the quarter. The firm made its first purchase in IBIT in late 2024 and has since been adding to it. Meanwhile, Al Warda Investments is a strategic arm of the Abu Dhabi Investment Council (ADIC) that oversees the diversified global assets on behalf of government-related entities. They held over 8.2 million shares at the end of the fourth quarter, up slightly from 7.96 million shares three months earlier.\nTogether, the two funds held more than $1 billion worth of bitcoin through IBIT at the end of 2025. However, with Bitcoin’s price trending downward with 23% year-to-date in 2026, the current value of their holdings has dropped to just over $800 million as of 17th February. The reports of the SEC reflect a growing institutional interest in spot bitcoin ETFs, even during periods of market volatility. Khaldoon Al Mubarak, the CEO of Mubadala, oversaw the fund’s shift toward digital assets as a store of value. Digital Gold is the primary narrative used by ADIC/Mubadala to justify Bitcoin as a long-term hedge. Moreover, the UAE’s economic diversification strategy, which is often associated with ‘Vision 2030’ and ‘We the UAE 2031’, has become a catalyst in driving sovereign funds like Mubadala and Al Warda Investments’ exposure into non-correlated digital assets like bitcoin. BlackRock’s IBIT was launched in 2024, and since then, it started to act as a dominant vehicle for regulated exposure to bitcoin in the U.S.\nLong-Term Digital Asset Diversification Strategy Remains Intact\nThe current financial maneuver demonstrates that the temporary price pullbacks do not intimidate the large state-owned capital. On the contrary, the steadfastness of these United Arab Emirates government entities underscores a diversification strategy into digital assets, amid stability and growth over a multi-year horizon. Although the value of the holdings fluctuated at the beginning of 2026 due to recent market corrections, the commitment of these sovereign wealth funds remains unchanged.\nGoldman Sachs last week disclosed roughly $2,3 billion in total crypto exposure, including a $1.1 billion position in IBIT. This signaled a shift from its earlier skepticism towards bitcoin. Harvard also adjusted its crypto holdings in Q4 2025, cutting its bitcoin position by 21% to 3.5 million IBIT shares, while also establishing a new $86.8 million stake in BlackRock’s iShares Ethereum Trust. The SEC filings also portrayed smaller holdings in Fidelity’s Bitcoin fund, bitcoin-related companies, and options positions tied to IBIT, alongside the exposure to Ethereum, XRP, and Solana.\nInstitutional Holders Signal Structural Market Support\nBitcoin is trading today at $67,787.60, down 0.94%. The crypto market faced ongoing headwinds in early 2026, such as low volatility, reduced retail participation, and macroeconomic uncertainty. Some long-term investors appeared to be using the downturn as an opportunity to build positions in the regulated, liquid products tied to digital assets. Robert Mitchnick, Head of Digital Assets at BlackRock, analyzed that the perception of hedge funds being responsible for selling pressure is erroneous. Instead, the SEC Q4 2025 13F filings suggested that large IBIT holders are maintaining "
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "74.7000",
            "open": "1,997.8800",
            "close": "1,997.1500",
            "high": "2,013.7000",
            "low": "1,939.0000"
        },
        "market_summary": "### ETH/USD Market Briefing\n* **Key Drivers:** BlackRock's ETHB ETF to capture **18%** of staking revenue, institutional dominance intensifies.\n* **Price Action:** ETHB expected to yield **2.8%** annually, positioning BlackRock as Ethereum ETF leader with **$9.1B** AUM.\n* **Technical Outlook:** ETHB to stake **70-95%** of assets, balancing yield vs. liquidity risk.\n\n---\n**Overall Sentiment:** Mixed ⚖️  \n*Institutional inflows vs. centralization concerns.*",
        "source_articles": [
            {
                "title": "BlackRock, Coinbase to keep 18% of Ethereum staking revenue in new ETF - dlnews.com",
                "source": "dlnews.com",
                "url": "https://www.dlnews.com/articles/defi/blackrock-to-take-fifth-of-ether-staking-revenue-in-new-etf/",
                "body": "- BlackRock and Coinbase will take an 18% cut of staking revenue from ETHB.\n- It is well-positioned to become the largest Ethereum ETF on the market.\nBlackRock and Coinbase will take an 18% cut of the staking revenue generated by BlackRock’s forthcoming Ethereum exchange-traded fund, ETHB.\nThe revelation came in a document filed with the securities and exchange commission Tuesday.\nBlackRock, the world’s largest asset manager, dominates the market for crypto exchange-traded products. Its Ethereum ETF, ETHA, sports more than $9.1 billion in assets under management, according to DefiLlama data. Grayscale’s ETHE sits in a distant second, holding Ether worth $2.3 billion.\nETHB is well-placed to become the largest Ethereum ETF. Unlike its predecessor, it would generate staking yield, which on Tuesday was estimated at 2.8% annualised.\nThe SEC approved Ethereum ETFs early last year, but those products did not include staking rewards. In May, the SEC issued guidance that clarified that certain staking products aren’t securities, paving the way for staking ETFs.\nETHB will share 82% of its staking rewards with investors. The other 18% will be split between BlackRock, Coinbase — the ETF’s prime execution agent — and\n“This arrangement creates a financial incentive for the Sponsor to maximize the amount of Ether staked by the Trust,” the filing reads.\nBut ETHB will only stake between 70% and 95% of its Ether under management, in order to ensure it can honour investors’ redemption requests.\nStaking an “excessive” share of the fund’s Ether could make it difficult to honour those redemption requests, “potentially causing the Shares to trade at significant premiums or discounts to NAV.”\nWhile ETFs give US investors a familiar way to invest in crypto — a fact that fueled Bitcoin’s 2024 rally — some in the industry have been wary of large asset managers’ growing clout.\nThe same week that BlackRock first detailed its plans for a staked Ethereum ETF, Ethereum co-founder Vitalik Buterin warned that a high concentration of Ethereum ownership on Wall Street could distort the blockchain’s governance and create centralised chokepoints.\nBlackRock wouldn’t be the first asset manager to introduce a staked Ethereum ETF.\nGrayscale’s Ethereum ETFs, ETHE and ETH, both generate yield via staking. VanEck, like BlackRock, has filed to introduce a staked Ethereum ETF.\nAleks Gilbert is DL News’ New York-based DeFi correspondent. You can reach him at aleks@dlnews.com."
            },
            {
                "title": "ETHDenver becomes policy stage with SEC and White House officials attending - AOL.com",
                "source": "AOL.com",
                "url": "https://www.aol.com/finance/ethdenver-becomes-policy-stage-sec-174619443.html",
                "body": "ETHDenver becomes policy stage with SEC and White House officials attending\nETHDenver is no longer just a developer conference. It is becoming a policy forum.\nWith SEC officials and White House representatives scheduled to attend, the event reflects a broader shift in how outsiders view the Ethereum ecosystem.\nDuring a recent Street Roundtable discussion, John Paller, founder of ETHDenver addressed what it means to see names like SEC Commisioner Hester Peirce and White House advisor Patrick Witt on the agenda.\nPolicymakers haven't understood web3\nRelated: Mysterious trader bets millions right after latest BlackRock announcement\n“I’m not sure that a lot of people in the policy making space really understand web three,” Paller said. “They largely see Ethereum as a modernization of the plumbing for financial settlements and payments, and certainly stablecoins are probably the most prominent use case that has product market fit. It’s an obvious use case. It’s inevitable. Everything’s going to be digital.”\nAfter years of tension between regulators and the crypto industry, the conversation has moved from avoidance to engagement.\nAdvertisement\n“I think the regulatory conversation is needed and necessary,” Paller said. “A lot of the industry historically avoided it. Our political contribution was just building new things and not really talking to the government because they were part of the problem. But we need permission to go permissionless.”\nAs digital assets intersect more directly with traditional finance, policymakers are paying closer attention. Events that once centered purely on protocol upgrades now include discussions about compliance frameworks and legislative clarity.\nA warning to regulators\nAt the same time, Paller warned Organizers say policy is no longer something the industry can ignore.\n“Let’s not turn this into a mega regulated centralized business opportunity,” he said. “If we lose decentralization and censorship resistance, what are we building.”\nMore news:\nHe described the current moment as a turning point rather than a crackdown. Engagement with lawmakers, he argued, is beginning to produce tangible progress.\n“We’ve made more progress in the past year than the past eight,” Paller said.\nFor ETHDenver, the presence of policymakers reflects an industry entering a new phase. Regulation is no longer an external force operating in opposition to crypto. It is becoming part of the conversation shaping its next stage.\nETHDenver is a free event. If you would like to see Commissioner Pierce, Witt, and many more in person, get a ticket here.\nThis story was originally published by TheStreet on Feb 11, 2026, where it first appeared in the Policy section. Add TheStreet as a Preferred Source by clicking here."
            },
            {
                "title": "BlackRock’s new Ethereum ETF gives investors 82% of staking yield - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/news/feed/d9ff1-blackrock-etf-lets-investors-keep-82-of-eth",
                "body": "BlackRock’s new Ethereum ETF gives investors 82% of staking yield\nShare:\nBlackRock has updated its SEC filing for the iShares Staked Ethereum Trust ETF, allowing it to capture 18% of staking rewards while institutional investors keep 82%. The ETF is expected to yield 2.8% annually and positions BlackRock for dominance in the Ethereum ETF market, managing over $9.1 billion in assets compared to Grayscale's $2.3 billion. Concerns arise over potential centralization of Ethereum as major asset managers gain power.\nBlackRock, the world’s largest asset manager and a leading provider of investment services, made a significant strategic move in its operations after updating its SEC filing (S-1) for the proposed iShares Staked Ethereum Trust ETF. This amended S-1 registration statement implied that 18% of the gross staking rewards will be split as a fee between the sponsor and the prime execution agent.\nThe revised filing noted that the trust retains 82% of the remaining shares. Consequently, sources mentioned that shareholders retain 82% of staking rewards, while the two companies take an 18% cut. Moreover, these shareholders will be required to make an annual sponsor fee payment of 0.12% to 0.25% of their investment value.\nBlackRock and Coinbase adopt a strategic move in their operation\nRegarding BlackRock and Coinbase’s new approach, sources said the two firms will claim an 18% share of the staking yields from BlackRock’s iShares Ethereum Staking ETF (ticker: ETHB), citing a document issued to the US Securities and Exchange Commission on Tuesday, February 17.\nAt this moment, reports claim that BlackRock is positioning itself as a leader in the cryptocurrency exchange-traded products market. To support this argument, data from DefiLlama highlighted that ETHA, the firm’s Ethereum ETF, manages over $9.1 billion in assets. In contrast, Grayscale’s ETHE lags behind significantly, holding $2.3 billion in Ether.\nFollowing this finding, analysts concluded that with its staking capabilities, ETHB is set to dominate the Ethereum ETF market. Unlike the previous version, it is expected to yield 2.8% annually, according to reports released on Tuesday.\nThey also conducted research and discovered that, while the SEC approved the Ethereum ETFs early last year, the process lacked a staking rewards component. This was after the federal regulatory agency issued a statement in May 2025 stating that certain staking activities are not securities.\nThis scenario created an opportunity for staking-enabled ETFs. The ETF’s structure specifically benefits institutional investors seeking daily liquidity, transparent fees, and regulatory compliance.\nMeanwhile, by collaborating with Coinbase on staking infrastructure, BlackRock utilizes existing blockchain expertise. Such an approach is important in the crypto industry as it fosters rapid crypto adoption among institutions by integrating traditional finance with decentralized networks\nVitalik Buterin raises concerns about Wall Street’s control over Ethereum\nConcerning the Coinbase-BlackRock partnership, analysts argued that ETFs offer US investors a simplified avenue for cryptocurrency exposure, which played a crucial role in strengthening Bitcoin’s rally in 2024. Nonetheless, industry insiders are raising concerns regarding the growing concentration of power among major asset managers.\nIn the same week BlackRock unveiled plans for a staked Ethereum ETF, Vitalik Buterin, the primary co-founder of Ethereum, warned that a surge in Wall Street control over Ethereum poses a risk of centralizing the network and undermining its decentralized structure.\nIn the meantime, reports mentioned that BlackRock is not the first to launch a staked Ethereum ETF. Grayscale has ETHE and ETH, two Ethereum ETFs that earn yields via staking. In addition, like BlackRock, VanEck also submitted an SEC filing to introduce a staked Ethereum ETF.\nDon’t just read crypto news. Understand it. Subscribe to our newsletter. It's free.\nBlackRock’s "
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "4.7400",
            "open": "85.9100",
            "close": "85.1300",
            "high": "87.5600",
            "low": "82.8200"
        },
        "market_summary": "### SOL/USD Market Briefing\n* **Key Drivers:** RWA ecosystem hits **$1.66B**, institutional adoption accelerates.\n* **Price Action:** Trading near **$127.31**, down from **$295** ATH.\n* **Technical Outlook:** Volatile, support levels under pressure.\n\n---\n**RWA Ecosystem Milestone:** Solana's tokenized assets reach **$1.66B**, led by **$890M** in US Treasury tokens. Private credit market grows to **$420M**, real estate/commodities at **$350M**.\n\n**Institutional Validation:** Morgan Stanley discloses **$15.3M** Bitwise Solana ETF (BSOL) position. Major TradFi firms explore Solana for tokenization infrastructure.\n\n**Market Sentiment:** Positive 📈 as institutional capital flows in, reducing reliance on retail-driven volatility. Solana positions as Ethereum/XRP Ledger competitor in RWA space.\n\n**Overall Sentiment:** Positive 📈",
        "source_articles": [
            {
                "title": "The Value of Knowing Solana’s Price - FinanceFeeds",
                "source": "FinanceFeeds",
                "url": "https://financefeeds.com/the-value-of-knowing-solanas-price/",
                "body": "The price of Solana is more than just a number. It shows how confident the market is in Solana’s blockchain ecosystem right now, based on factors such as adoption, utility, developer activity, and the broader economic environment. It also shows how much investors think a high-performance, scalable blockchain is worth. You can measure market sentiment by tracking the Solana price against the USD. You can also review your portfolio to see how changes impact SOL’s real-world value.\nSolana: A High-Performance Blockchain\nSolana supports smart contracts and is made to handle a lot of transactions quickly and cheaply. It can handle thousands of transactions per second and has lower fees than many older blockchains. The coin is quickly becoming popular in the blockchain world because it is cheap, and transactions happen quickly. Solana is a strong competitor in the crypto market because of its developing ecosystem and improving technology. One crypto expert said, “Solana is a high-performance public blockchain platform that provides fast transaction speeds and low fees for developers and users.”\nSolana is a layer-1 blockchain designed for scalability. Its goal is to provide developers with a platform to build decentralized applications without worrying about performance issues such as high fees or limited transaction capacity. All of these factors make SOL the primary currency for a blockchain that hosts decentralized applications (dApps), NFTs, and DeFi. This gives SOL both usefulness and demand.\nWhat are Blockchains?\nYou need to understand blockchains, as cryptocurrencies rely on them. A blockchain is a database that spreads across a network of computer nodes. It can securely and decentralize transaction records, making it ideal for cryptocurrencies. However, it can serve purposes beyond digital currencies. Blockchains can also make data in various fields unchangeable, preventing tampering.\nBlockchain makes it less necessary to rely on trusted third parties, like auditors or people, who can add costs and mistakes. Blockchain systems try to make a real, tamper-proof record of transactions with as few mistakes as possible. So, using blockchain in Solana makes it much more efficient and optimized. The platform can handle thousands of transactions per second without losing its decentralized nature, which solves the scalability problems that many other blockchains have.\nSOL to USD is Volatile\nRecent data shows that SOL trades for about $127.31 USD per SOL. Its price has declined significantly over the past year, consistent with broader crypto market volatility and ecosystem-specific events. Because of this, it is important to use current price feeds or charts when converting SOL to USD or making decisions.\nSolana’s History\nSolana’s origins trace back to late 2017, when Anatoly Yakovenko released a whitepaper draft describing a new timekeeping method for distributed systems called Proof-of-History. This is a way to automate blockchain transaction ordering to enable fast transaction speeds and quick settlement times.\nWhere other forms of cryptocurrency utilize proof-of-work algorithms to define the blocks of their blockchains, Solana is notably different. Proof-of-work uses a consensus mechanism that relies upon miners to determine the next block.\nAs a result, Solana’s unique proof-of-history system sets it apart from other blockchains, enabling very fast transaction speeds and very low fees. The proof-of-history consensus mechanism on the Solana blockchain uses timestamps to determine the next block in the chain.\nSolana’s all-time high was nearly $294–$295 USD per SOL. But it could only keep this value for a short time. These swings reflect both the positive and negative aspects of growth and adoption, including market cycles, competition, the regulatory environment, and the broader crypto market sentiment.\nUse Cases for Monitoring SOL to USD\nHere are practical situations where tracking Solana’s price matters:\n- Portfolio valuation & cryp"
            },
            {
                "title": "DeFi Development Corp. Provides SPS Guidance Update - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605204726",
                "body": "BOCA RATON, FL, Feb. 17, 2026 (GLOBE NEWSWIRE) --\nThe Company’s SPS guidance for June 2026 is now 0.085, compared to prior guidance of 0.1650. The Company’s long-term target of 1.0 SPS by December 2028 remains unchanged. The Company will provide additional detail, including underlying assumptions, in its upcoming fourth quarter 2025 earnings investor letter.\nThe Company is an AI-powered online platform that connects the commercial real estate industry by providing data and software subscriptions, as well as value-add services, to multifamily and commercial property professionals, as the Company connects the increasingly complex ecosystem that stakeholders have to manage.\nThe Company currently serves more than one million web users annually, including multifamily and commercial property owners and developers applying for billions of dollars of debt financing per year, professional service providers, and thousands of multifamily and commercial property lenders, including more than 10% of the banks in America, credit unions, real estate investment trusts (“REITs”), debt funds, Fannie Mae® and Freddie Mac® multifamily lenders, FHA multifamily lenders, commercial mortgage-backed securities (“CMBS”) lenders, Small Business Administration (“SBA”) lenders, and more. The Company’s data and software offerings are generally offered on a subscription basis as software as a service (“SaaS”)."
            },
            {
                "title": "Solana’s RWA Ecosystem Hits $1.66 Billion Milestone: A Definitive Turning Point for SOL - Eudaimonia and Co",
                "source": "Eudaimonia and Co",
                "url": "https://eand.co/solanas-rwa-ecosystem-hits-1-66-billion-milestone-a-definitive-turning-point-for-sol",
                "body": "The digital asset landscape is witnessing a seismic shift as Solana’s Real-World Asset (RWA) ecosystem reaches a historic valuation of $1.66 billion. This surge to an all-time peak represents a fundamental change in how the financial market perceives the Solana blockchain.\nLong characterized as a high-speed hub for retail speculation and memecoin frenzies, Solana is rapidly maturing into a sophisticated financial layer capable of supporting massive institutional capital. This milestone suggests that the network is successfully bridging the gap between decentralized finance and the multi-trillion-dollar world of traditional finance, potentially marking a permanent turning point for the native SOL token.\nSolana’s RWA Tokenization Market Hits $1.66 Billion\nThe driving force behind this $1.66 billion valuation is a diverse array of tokenized assets that bring tangible, off-chain value into the Solana ecosystem. Leading the charge is the tokenization of U.S. Treasuries at approximately $890 million, which now accounts for over 53% of total value in tokenized products. By placing government-backed debt on-chain, Solana offers investors a way to earn stable, low-risk yields without ever leaving the network.\nThis is further bolstered by the expansion of private credit markets and the fractionalization of real estate and commodities, which allow for greater liquidity and accessibility in markets that were previously opaque or restricted to elite investors. The private credit market on Solana, now valued at $420 million, has seen massive growth, particularly through platforms like Credix, which tokenizes loans for business in emerging markets. Meanwhile, the $350 million real estate and commodities market on the blockchain enables fractionalized ownership of property and gold-backed tokens.\nThe ability to trade these assets with Solana’s signature sub-second finality and near-zero fees has created a value proposition that traditional financial rails simply cannot match.\nMorgan Stanley Discloses Exposure to Solana Through Bitwise’s BSOL ETF\nPerhaps the most telling sign of this shift is the changing profile of the participants within the ecosystem. Recent market data and reports indicate that major TradFi institutions, including titans like Morgan Stanley, are increasingly “loading up” on SOL and exploring its infrastructure for tokenization efforts. According to a recent Form 13F filing with the U.S. Securities and Exchange Commission (SEC), the firm holds 932,922 shares in Bitwise Solana Staking ETF (BSOL), worth $15.30 million. Morgan Stanley also revealed holdings in NASDAQ-listed digital asset treasury firm Solana Company, purchasing 86,105 HSDT shares as of December 2025.\nThis institutional accumulation suggests a growing confidence in Solana’s long-term stability and its utility as a settlement layer for regulated financial products.\nUnlike the volatile retail-driven pumps of previous cycles, this current growth is backed by institutional capital that seeks long-term yield and operational efficiency. The presence of Wall Street entities provides a layer of legitimacy that could insulate Solana from the broader market’s typical boom-and-bust cycles.\nSolana Rivals Ethereum and XRP Ledger in RWA Tokenization\nAnalysts are now closely watching how this RWA explosion will impact the price of SOL. Historically, the token’s value was largely tied to network activity revolving around NFT mints and decentralized exchange volumes. However, as $1.66 billion in real-world value has been settled on the network, the demand for SOL as a functional utility token increases exponentially. Every transaction involving tokenized bonds or real estate requires SOL for gas, and the security of these high-value tokens relies on the staked SOL that supports the blockchain. This creates a supply-demand dynamic that is less dependent on social media hype and rooted more in the actual economic throughput of the global financial system.\nFurthermore, this develo"
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "553.250",
            "open": "49,572.240",
            "close": "49,548.120",
            "high": "49,722.590",
            "low": "49,169.340"
        },
        "market_summary": "### US30 Market Briefing  \n* **Key Drivers:** AI disruption fears, inflation data, and Fed policy outlook.  \n* **Price Action:** Mixed performance with Dow inching up **0.07%** to **49,533.31**, while Nasdaq and S&P 500 declined.  \n* **Technical Outlook:** Dow faces fourth down week in five sessions; Nasdaq extends fifth consecutive week of losses.  \n---  \n**Overall Sentiment:** Cautious ⚖️  \n\n### Key Highlights:  \n- **AI Disruption:** Concerns over AI’s impact on traditional industries weighed on tech stocks like Meta (-0.8%), Nvidia (-0.8%), and Palantir (-2%).  \n- **Fed Focus:** Markets await PCE inflation data and Fed meeting minutes for rate-cut signals. CME’s FedWatch Tool prices a **52%** chance of a June rate cut.  \n- **Earnings Season:** Over **73%** of S&P 500 companies have reported, with **74.5%** beating estimates. Key earnings this week include Palo Alto Networks, DoorDash, Walmart, and Wayfair.  \n- **Corporate Activity:** Notable moves include Norwegian Cruise Line (+6.4% on activist stake), Zim Integrated Shipping (+35% on acquisition), and Masimo (+34% on acquisition talks.  \n- **Nvidia’s Impact:** Nvidia’s **40.2%** surge in 2025, driven by AI GPU demand and record revenues, helped power the Dow to all-time highs.  \n\n### Market Sentiment:  \n- **Negative:** Tech stocks under pressure from AI fears and sector rotation.  \n- **Positive:** Financials like JPMorgan and American Express supported the Dow.  \n- **Uncertain:** Inflation data and Fed policy remain key watchpoints.  \n\n**Bottom Line:** US30 faces headwinds from AI disruption and cautious Fed outlook, but Nvidia’s strength and resilient financials provide support. Investors should monitor inflation data and earnings for direction. 📊",
        "source_articles": [
            {
                "title": "Dow Jones futures slip as AI fears, earnings and Fed outlook weigh - Invezz",
                "source": "Invezz",
                "url": "https://invezz.com/pk/news/2026/02/17/sandampp-and-dow-jones-futures-slip-as-ai-fears-weigh-on-markets/",
                "body": "S&P and Dow Jones futures slip as AI fears weigh on markets\n- US futures dip as AI disruption fears and tech stocks weigh on markets.\n- Investors eye Fed inflation data and earnings for rate-cut signals.\n- M&A deals and activist stakes drive sharp moves in select stocks.\nUS stock index futures moved lower on Tuesday, as investors struggled to regain confidence following another losing week on Wall Street and continued uncertainty around artificial intelligence’s impact on business models.\nFutures tied to the S&P 500 fell 0.29%, while Nasdaq 100 futures dropped 0.76%.\nDow Jones Industrial Average futures declined 62 points, or about 0.13%.\nMarkets will reopen on Tuesday after the New York Stock Exchange was closed Monday for Presidents’ Day.\nMajor technology names weighed on sentiment in premarket trading.\nMeta Platforms and Nvidia each lost around 0.8%, while Palantir Technologies fell 2%.\nMicrosoft and Apple also edged down about 0.4%.\nAI disruption fears unsettle markets\nWall Street’s recent weakness has been driven largely by concerns about artificial intelligence changing traditional industries.\nSoftware firms, brokerages, and trucking companies were among the sectors hit hardest last week, contributing to the steepest weekly declines for the three major US indexes since mid-November.\nThe S&P 500 and Dow Jones Industrial Average both fell more than 1% last week, while the Nasdaq Composite lost more than 2%.\nThe Dow and S&P 500 have posted four losing weeks out of the last five, and the Nasdaq recorded its fifth straight negative week, its longest losing streak since 2022.\nEconomists say the technology shift is being interpreted more as sector rotation than broad risk aversion.\nPotential risks from Chinese artificial intelligence developments added to the uncertainty.\nAlibaba unveiled its Qwen 3.5 AI model designed to independently perform complex tasks, and its US-listed shares rose about 1% in premarket trading.\nInflation data and Fed outlook in focus\nDespite a softer-than-expected consumer price index reading last week, markets remained cautious.\nInvestors are now focused on the personal consumption expenditure report due Friday, the Federal Reserve’s preferred inflation gauge, along with Fed meeting minutes scheduled for Wednesday.\nThe cooler inflation data slightly increased expectations for monetary easing.\nAccording to CME’s FedWatch Tool, traders are pricing in a 25-basis-point rate cut in June with roughly 52% probability, compared with about 49% a week earlier.\nSpeeches from Federal Reserve Governor Michael Barr and San Francisco Fed President Mary Daly later in the day are also expected to provide additional policy guidance.\nEarnings and corporate activity drive individual stocks\nCorporate earnings will play a central role this week.\nPalo Alto Networks reports results Tuesday, with DoorDash, Walmart, and Wayfair set to follow.\nMore than 73% of S&P 500 companies have reported earnings this quarter, and 74.5% have exceeded analysts’ estimates, above the typical 67% beat rate, according to LSEG data.\nOther corporate developments generated notable moves in individual stocks.\nNorwegian Cruise Line rose about 6.4% after reports that activist investor Elliott had built a stake exceeding 10%.\nShares of Zim Integrated Shipping jumped roughly 35% after Germany’s Hapag-Lloyd agreed to acquire the company for $4.2 billion.\nMasimo surged about 34% following reports that Danaher was nearing a nearly $10 billion acquisition deal, though Danaher shares fell 6.8%.\nInvestors will also watch Friday for a potential Supreme Court ruling related to US President Donald Trump’s tariffs, adding another layer of uncertainty to markets.\nLoading articles...\nFailed to load articles. Please try again."
            },
            {
                "title": "US Stock Market Today: Dow Hits Record High, S&P 500 & Nasdaq Rally on AI Chip Surge as Silver Plunged to $74.85 & Bitcoin Dips Under $68,272 - The Sunday Guardian",
                "source": "The Sunday Guardian",
                "url": "https://sundayguardianlive.com/business/us-stock-market-today-dow-hits-record-high-sp-500-nasdaq-rally-on-ai-chip-surge-as-silver-plunged-to-7485-bitcoin-dips-under-68272-170965/",
                "body": "US Stock Market Today Updates: Wall Street meandered through a volatile day on February 17, 2026, after President’s Day, as concerns about the potential for AI to disrupt the software leaders competed with the resilience of the financial groups. The Dow Jones industrials advanced by small increments, but the Standard & Poor’s 500 and Nasdaq Composite fell at the open as investors worried about the potential for AI to disrupt the leaders like ServiceNow, down about 31% this year, Salesforce, down about 30% and Autodesk, down 23%.\nThe overall market mood was dampened by discussions about the US-Iran nuclear talks, but the Indian markets continued to hold their ground with Sensex rising 174 points to 83,451 and Nifty rising 43 points to 25,725, boosted by the flow into the banking stocks. The crypto and precious metals underperformed, indicating a negative tone in those markets, even as the data on inflation and employment came in strong.\nU.S. Market Snapshot\nDow Jones\nThe Dow inched up on the day, rising by about 32.38 points or 0.07%, to end at 49,533.31, buoyed by financials like JPMorgan Chase and American Express. It was a tough week for the blue chips as they saw their fourth down week in five sessions, losing more than 1% last week as funds shifted out of tech stocks amid concerns about artificial intelligence and the VIX volatility index spiked to 22.50 from 17.\nNasdaq\nThe Nasdaq Composite fell by 151.9 points or 0.67%, to open at 22,394.76, extending its fifth consecutive week of losses, the longest losing streak since 2022 with the Nasdaq Composite slipping more than 2% this week. Software shares, including Salesforce, which fell 2.56%, contributed to the Nasdaq Composite’s decline with the Nasdaq Composite now down more than 30% so far this year. The iShares Technology Software ETF or IGV, declined 2%, taking its year to date loss to about 23% on worries about the impact of AI on human labor. The Nasdaq 100, which tracks technology shares, fell 0.23% to 24,676.89.\nS&P 500\nS&P 500 opened lower by 0.24% to 6,819.86, but then stabilized near flat, around 6,836.72 (+0.01%), following two consecutive weeks of declines exceeding 1%. The broader markets moved in line with shifting sectors, where financials moved higher and software fell due to concerns over AI while energy and materials, which had been leaders in the rally, eased off with a softer January CPI and positive jobs data were the backdrop, but the story remained dominated by AI.\nNYSE\nThe NYSE Composite made a slight decline, down 0.09% to 23,305.57 as the markets closed on the holiday Monday. The utilities sector made a slight increase, rising 0.12% to 1,172.58 and the transports sector far outperformed, gaining 0.95% to 19,526.54. The small caps, represented by the Russell 2000, fell 0.07% to 2,644.86, as the markets continued to trade lightly after the weekend. Investors are awaiting the release of the minutes from the Fed on Wednesday and the PCE inflation data on Friday.\nFirst GIFT City IPO\nGIFT City is nearing the launch of its first public offering with XED Executive Development making the Red Herring Prospectus to raise about $12 million through a dollar-denominated listing on the IFSC platforms. The issue is expected to open in the first week of March, subject to regulatory approvals. This move highlights the government’s efforts to establish GIFT City as a major offshore fundraising center and the successful launch of the IPO will place GIFT City firmly in the spotlight.\nEternal-OpenAI Partnership\nEternal extended its agreement with OpenAI to integrate AI even more into Zomato, Blinkit, District, Hyperpure, Feeding India and Nugget ventures. Through the Enterprise API, Eternal is looking to have smarter customer conversations, app integration for its partners, and internal orchestration of AI, which is essential for the Indian digital commerce landscape that is growing rapidly because AI is a game-changer in quick commerce and the food delivery industry.\nS"
            },
            {
                "title": "NVIDIA’s +40% Surge in the Dow Jones: Why 2025 Was Not Just AI Hype - Disruption Banking",
                "source": "Disruption Banking",
                "url": "https://www.disruptionbanking.com/2026/02/17/nvidias-40-surge-in-the-dow-jones-why-2025-was-not-just-ai-hype/",
                "body": "The Dow Jones Industrial Average (DJIA) closed 2025 at all-time highs, but the rally was narrow, dominated by a few giants. NVIDIA (ticker: NVDA) stood out. Its stock jumped 40.2% in 2025. That eye-popping gain made Nvidia one of the top five performers in the 30-stock index.\nCritically, this surge wasn’t just Wall Street’s AI fever. It stemmed from real demand for Nvidia’s GPUs and record revenues, backed by bullish guidance.\nWe unpack how Nvidia’s 40% leap helped power the Dow Jones, and why analysts see room for more growth in 2026.\nDow 2025: Record Rally Fueled by Tech and Finance\nIn 2025 the Dow Jones climbed roughly 13% (closing near 48,060 on December 31), extending a three-year winning streak. But the advance was highly uneven. A handful of stocks, especially those tied to AI and financials, drove most of the gains.\nFor example, Caterpillar rallied ~60% and Goldman Sachs ~56%, while staples and utilities barely budged. NVIDIA (a Dow member since November 2024) replaced Intel in the index and stood out with its +40.2% return.\nIn sum, the Dow’s record year was powered by data-center demand and bank dealmakers. NVIDIA’s performance alone “helped push the Dow Jones to all-time highs,” even as many other Dow stocks had flat or modest returns.\n$57B Quarter, +62% Growth: The Earnings Engine Behind the AI Trade\nNVIDIA’s surge was built on product and earnings momentum, not just hype. After joining the DJIA, the AI-chip maker continued to smash records. In Q3 FY2026 (ended October 2025), Nvidia reported $57 billion in revenue, up 62% year-over-year (YoY), powered by a sell-out of its AI GPUs (the new “Blackwell” series).\nCEO Jensen Huang proclaimed that Nvidia was in the “virtuous cycle of AI” as demand exploded. The company also repurchased shares aggressively (returning $37B to shareholders YTD) and maintained rock-solid margins. Over the full year, Nvidia delivered roughly 40% gains for investors, mirroring its stock jump.\nKey factors behind Nvidia’s 2025 performance include:\n- Dominant AI GPUs: Nvidia’s GPUs are the industry standard for AI data centers. Its latest H100/Blackwell chips offer 10–50x more performance than prior generations, and customers are snapping them up. NVIDIA’s record Q3 data-center revenue (approximately $51.2B) beat estimates, underscoring vast unmet demand.\n- Blowout Financials: Q3 GAAP EPS was $1.30, up 67% from a year ago. Management guided Q4 revenue around $65B, well above Wall Street’s ~$62B estimate. This implies fiscal-2026 revenue of ~$212B (roughly +60% YoY), a company record.\n- New Products and Scale: Nvidia already dominates AI training chips. In 2024–2025 it unveiled the next-gen “Blackwell Ultra” GPUs. Now it’s developing a new “Rubin” architecture (2026) said to be 3.3x more powerful than Blackwell Ultra. Rubin will come when demand is already far outstripping supply, giving Nvidia pricing power and future growth.\n- Huge Addressable Market: CEO Huang projects that by 2030, hyperscalers will spend up to $4 trillion annually on AI infrastructure, a market where Nvidia is “everywhere” (cloud, on-prem, AI labs). Only a sliver of enterprises have fully adopted AI so far, so the runway remains enormous.\n- Index Inclusion and Flows: Joining the Dow Jones in 2024 brought more institutional buyers (index funds and ETFs). With Nvidia’s share price split 10-for-1 in 2024, it became accessible to more investors. The combination of index flows and fear-of-missing-out (FOMO) on AI stocks amplified buying during 2025.\nDespite these strengths, some investors caution that the AI frenzy could fade. As Reuters notes, “the concern that AI infrastructure spending growth is not sustainable is not likely to ebb,” warned Ruben Roy, Stifel analyst.\nNVIDIA also faces political headwinds (new chip export curbs) and rising competition (AMD, Google, and even self-made chips by hyperscalers). But on balance, 2025’s earnings and guidance show Nvidia riding real economic momentum, not a mere bubble.\nBeyond the Hype: "
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "144.200",
            "open": "10,464.130",
            "close": "10,569.130",
            "high": "10,586.330",
            "low": "10,442.130"
        },
        "market_summary": "### UK100 Market Briefing\n* **Key Drivers:** Record closing high for the **10th time this year**; LSE reform plans to attract global firms.\n* **Price Action:** Gained **5.8% YTD**; further recovery in data stocks and banks offset gold price dip.\n* **Technical Outlook:** Index remains at record levels; valuations still undemanding.\n---\n**Overall Sentiment:** Positive 📈",
        "source_articles": [
            {
                "title": "FTSE 100 hits record high as rate cut hopes rise - Yahoo Finance UK",
                "source": "Yahoo Finance UK",
                "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_1dd89140-45ff-41cf-b59e-04ee40829aa0",
                "body": "Your privacy is important to us\nYahoo is part of the Yahoo family of brands.\nWhen you use our sites and apps, we use cookies to:\n- provide our sites and apps to you\n- authenticate users, apply security measures, and prevent spam and abuse, and\n- measure your use of our sites and apps\nYour privacy choices\nIf you click '\nAccept all', we and\nour partners, including 245 who are part of the IAB Transparency & Consent Framework, will also store and / or access information on a device (in other words, use cookies) and use precise geolocation data and other personal data such as\ntechnical identifiers and browsing and search data, for analytics, personalised advertising and content, advertising and content measurement, and audience research and services development.\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\nIf you would like to customise your choices, click 'Manage privacy settings'.\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy and Cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our Privacy Policy and Cookie Policy."
            },
            {
                "title": "FTSE 100 Outlook Brightens as LSE Reform Plans Attract Global Firms - Investing.com UK",
                "source": "Investing.com UK",
                "url": "https://uk.investing.com/analysis/ftse-100-outlook-brightens-as-lse-reform-plans-attract-global-firms-200622350",
                "body": "Gold prices rebound on dip buying; traders eye Fed outlook clues\nIn the UK, the economy remains in a difficult spot, with unemployment uncomfortably high at a five-year high of 5.2% in a sign of a deteriorating jobs market, which adds to low growth and productivity. One bright spot is slowing wage growth, which helps the likelihood that inflation appears to be stabilising, which could be confirmed in the latest release tomorrow. This in turn could open the door to an interest rate cut from the Bank of England in its next meeting in reflection of an economy in need of stimulus.\nOf course, any such economic concerns have a limited effect on the primary index, which derives the majority of earnings from overseas. Indeed, the FTSE 100 hit a record closing high yesterday for the tenth time this year and further changes are afoot which could bolster its appeal as an investment destination.\nThe London Stock Exchange recently announced plans which could make it easier for international companies to join the FTSE 100 by reducing the number of shares required to be publicly traded. Early reports suggested that this could entice the likes of Visma, a Norwegian software company, and Uzbekistan state-owned gold producer Navoi Mining to the index, which would further consolidate the appeal of the primary index as a quasi-global tracker.\nIn the meantime, the index remains at the core of global investor attention, with the opening rise adding to the record closing high and taking the FTSE 100 to a gain of 5.8% in the year so far. Quite apart from the fact that valuations remain undemanding, as evidenced by approaches for the likes of Beazley and Schroders, the more recent appeal of the defence, resource, and bank sectors is largely intact.\nA dip in the gold price weighed on the likes of Fresnillo (LON:FRES) and Endeavour Mining (LON:EDV) at the open, but this was more than offset by further recovery in data stocks such as Experian and RELX as well as the banks, with pleasing numbers and a share buyback programme also lifting InterContinental Hotels. Housebuilders were also in demand as the latest data strengthened the case for a further interest rate cut.\nMeanwhile, trading will resume today in the US after Presidents’ Day, with early futures indicating declines of up to 1% for the main indices.\nAI concerns remain front and centre, as investors continue to assess the direct and indirect impacts of a rapidly changing backdrop. While the weakness in the S&P 500 and Nasdaq this year has led to cheaper valuations which could lead to some of the hardest hit stocks prone to bargain hunting, the overarching concern has not gone away.\nIn the meantime, as the week unfolds, updates from Walmart (NASDAQ:WMT) and Deere & Company (NYSE:DE) will provide some indication of the current state of the nation, in addition to which Federal Reserve minutes and GDP data on Friday will provide further colour.\nMost Asian markets are also closed for the Lunar New Year holiday with the notable exception of Japan, where the Nikkei 225 drifted once more after a lacklustre start to the week. Weak economic data on Monday weighed on sentiment, while tech giant SoftBank fell by more than 6% adding to the downward pressure. It is unclear whether the new administration will follow through on the expected tax cuts and increase in government spending to shore up the economy, despite which the main index is still ahead by more than 9% in the year so far.\nWhich stock should you buy in your very next trade?\nAI computing powers are changing the stock market. Investing.com's ProPicks AI includes dozens of winning stock portfolios chosen by our advanced AI.\nYear to date, 2 out of 3 global portfolios are beating their benchmark indexes, with 88% in the green. Our flagship Tech Titans strategy doubled the S&P 500 within 18 months, including notable winners like Super Micro Computer (+185%) and AppLovin (+157%).\nWhich stock will be the next to soar?"
            },
            {
                "title": "Top TSX Growth Companies With High Insider Ownership - Yahoo Finance UK",
                "source": "Yahoo Finance UK",
                "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_dfe35408-8544-48fa-8d9f-1bbe5f7a053d",
                "body": "Your privacy is important to us\nYahoo is part of the Yahoo family of brands.\nWhen you use our sites and apps, we use cookies to:\n- provide our sites and apps to you\n- authenticate users, apply security measures, and prevent spam and abuse, and\n- measure your use of our sites and apps\nYour privacy choices\nIf you click '\nAccept all', we and\nour partners, including 245 who are part of the IAB Transparency & Consent Framework, will also store and / or access information on a device (in other words, use cookies) and use precise geolocation data and other personal data such as\ntechnical identifiers and browsing and search data, for analytics, personalised advertising and content, advertising and content measurement, and audience research and services development.\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\nIf you would like to customise your choices, click 'Manage privacy settings'.\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy and Cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our Privacy Policy and Cookie Policy."
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "372.600",
            "open": "24,839.490",
            "close": "25,029.490",
            "high": "25,048.090",
            "low": "24,675.490"
        },
        "market_summary": "### GER40 Market Briefing\n* **Key Drivers:** Geopolitical tensions in the Middle East, German inflation data, and ZEW economic sentiment survey.\n* **Price Action:** DAX futures down 0.39% to 24,774, reflecting cautious market sentiment.\n* **Economic Data:** German CPI for January and ZEW surveys for the Eurozone and Germany are key focal points today.\n---\n**Overall Sentiment:** Neutral ⚖️\n\n**Key Developments:**\n- **Geopolitical:** U.S.-Iran talks in Geneva could de-escalate tensions, but oil prices remain higher.\n- **Central Banks:** RBA’s rate hike highlights inflation concerns, with Fed minutes and U.S. GDP data upcoming.\n- **Market Performance:** GER40 futures declined, while the index itself closed up 0.80% to 24,998.40 points on February 17.\n- **Upcoming Data:** Germany CPI final, ZEW surveys, and UK jobs data are critical for market direction.",
        "source_articles": [
            {
                "title": "Morning Bid: Quiet markets, loud diplomacy: All eyes on Iran - KFGO",
                "source": "KFGO",
                "url": "https://kfgo.com/2026/02/17/morning-bid-quiet-markets-loud-diplomacy-all-eyes-on-iran/",
                "body": "A look at the day ahead in European and global markets from Rocky Swift\nWith much of Asia shut for Lunar New Year holidays, all eyes turned to the Middle East on hopes that talks between the U.S. and Iran will de-escalate geopolitical tensions.\nOil prices were higher and gold fell after U.S. President Donald Trump said that he would be involved “indirectly” in talks over Tehran’s nuclear program set for Tuesday in Geneva, adding he believed Tehran wanted to make a deal.\nMainland Chinese, Hong Kong, Singapore, Taiwan and South Korea markets were closed, keeping activity subdued in financial markets following a break in the U.S. for Presidents’ Day.\nWith few catalysts on the day, traders looked ahead to other key data points this week, including Fed minutes on Wednesday and U.S. GDP figures on Friday.\nBritain, Canada and Japan are also due to publish inflation data this week. These price readings have become even more crucial for markets after the Reserve Bank of Australia earlier this month became the first major central bank, excluding Japan’s special case, to raise rates after the post-COVID easing cycle.\nThe RBA said on Tuesday it had concluded inflation would stay stubbornly high if it had not hiked interest rates.\nIn early European trades, the pan-region Euro Stoxx 50 futures were down 0.35% to 5,975, German DAX futures slid 0.39% to 24,774, and FTSE futures lost 0.18% to 10,422. U.S. stock futures, the S&P 500 e-minis, were down 0.46% at 6,819.\nKey developments that could influence markets on Tuesday:\n– Earnings from Kerry Group, InterContinental Hotels, Carrefour SA\n– Germany CPI final for January\n– ZEW surveys for euro zone, Germany\n– UK jobs data\n– Debt: reopening of 2-year debt auction in Germany, reopening of 2-year and 6-year auctions in the UK\n(Editing by Shri Navaratnam)"
            },
            {
                "title": "DAX Index Blinks Green; German Inflation Accelerates, Economic Sentiment Falls - marketscreener.com",
                "source": "marketscreener.com",
                "url": "https://www.marketscreener.com/news/dax-index-blinks-green-german-inflation-accelerates-economic-sentiment-falls-ce7e5dd9da88f325",
                "body": "Access Denied\nYou don't have permission to access \"http://www.marketscreener.com/news/dax-index-blinks-green-german-inflation-accelerates-economic-sentiment-falls-ce7e5dd9da88f325\" on this server.\nReference #18.512b3417.1771398084.9851383\nhttps://errors.edgesuite.net/18.512b3417.1771398084.9851383"
            },
            {
                "title": "European Stocks - 17-02-26 - Armenpress",
                "source": "Armenpress",
                "url": "https://armenpress.am/en/article/1242438/amp",
                "body": "European main indexes values for 17 February:\nThe value of German DAX up by 0.80% to 24998.40 points, French CAC 40 up by 0.54% to 8361.46 points, British FTSE up by 0.79% to 10556.17 points, and Russian RTSI down by 0.77% to 1135.20 points.\nThe German Stock Index is a total return index of 30 selected German blue chip stocks traded on the Frankfurt Stock Exchange. The equities use free float shares in the index calculation. The DAX has a base value of 1,000 as of December 31, 1987. As of June 18, 1999 only XETRA equity prices are used to calculate all DAX indices.\nThe CAC 40 (Cotation Assistée en Continu) is a benchmark French stock market index. The index represents a capitalization-weighted measure of the 40 most significant values among the 100 highest market caps on the Euronext Paris (formerly the Paris Bourse).\nThe FTSE UK Index Series is designed to represent the performance of UK companies, providing market participants with a comprehensive and complementary set of indices that measure the performance of all capital and industry segments of the UK equity market.\nRTS Index is cap-weighted composite index calculated based on prices of the 50 most liquid Russian stocks of the largest and dynamically developing Russian issuers presented on the Moscow Exchange. RTS Index was launched on September 1, 1995 at base value 100. The Index is calculated in real time by Moscow Exchange in US dollars and disseminated by the S&P Dow Jones Indices, “Armenpress” reports."
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "439.250",
            "open": "24,691.350",
            "close": "24,698.140",
            "high": "24,816.970",
            "low": "24,377.720"
        },
        "market_summary": "### NDX100 Market Briefing  \n* **Key Drivers:** AI disruption concerns, Fed minutes, US-Iran tensions, Japan trade deal.  \n* **Price Action:** Nasdaq 100 futures down 46 points in Asian session; below 50-day EMA, above 200-day EMA.  \n* **Technical Outlook:** Bearish near-term, bullish longer-term. Support at 200-day EMA.  \n---\n**Overall Sentiment:** Cautious 📉  \n\n**Key Events This Week:**  \n- **Fed Minutes (Wednesday):** Focus on inflation outlook and rate cut signals.  \n- **PCE Index (Friday):** Key inflation data for Fed policy.  \n\n**Market Context:**  \n- AI spending and competition pressure tech stocks (e.g., MSTR -3%, CRWD -3.6%).  \n- US-Iran tensions weigh on risk sentiment; Japan trade deal provides support.  \n- Fed rate cut expectations eased (June probability: 63.6% vs. 75.2% prior).  \n\n**Near-Term Levels:**  \n- Support: 200-day EMA (~$19,500).  \n- Resistance: 50-day EMA (~$20,200).  \n\n**Overall Sentiment:** Cautious 📉",
        "source_articles": [
            {
                "title": "Stock market today: Dow, S&P 500, Nasdaq futures steady with AI disruption in focus, Fed minutes ahead - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-steady-with-ai-disruption-in-focus-fed-minutes-ahead-235322865.html",
                "body": "Stock market today: Dow, S&P 500, Nasdaq futures steady with AI disruption in focus, Fed minutes ahead\nUS stock futures hovered near the flatline Tuesday evening following a muted day on Wall Street, as investors looked ahead to fresh signals on inflation and monetary policy.\nContracts linked to the Dow Jones Industrial Average (YM=F), the S&P 500 (ES=F) and the Nasdaq 100 (NQ=F) all hovered around the baseline.\n(ES=F)\nDuring regular trading, the major benchmarks eked out modest gains. The S&P 500 (^GSPC) and the Nasdaq Composite (^IXIC) each rose about 0.1%. The 30-stock Dow Jones Industrial Average (^DJI) added roughly 32 points, or just under 0.1%.\nTechnology shares, particularly in software, remained under pressure as investors continue to weigh the long-term impact of AI on business models and corporate competition. Business intelligence firm and bitcoin asset investor Strategy (MSTR) fell 3%, while cybersecurity firm CrowdStrike (CRWD) fell 3.6%.\nInvestors now turn their attention to the Federal Reserve’s January meeting minutes, due Wednesday, for additional insight into policymakers’ thinking. The week’s key macro event, however, arrives Friday with the release of the Personal Consumption Expenditures index.\nOn the corporate calendar, earnings from DoorDash (DASH), eBay (EBAY) and Analog Devices (ADI) are set for release Wednesday.\nLIVE 1 update"
            },
            {
                "title": "Dow Jones & Nasdaq 100: Fed Minutes in Focus for US Futures - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/dow-jones-nasdaq-100-fed-minutes-in-focus-for-us-futures-1580201",
                "body": "US stock futures came under a second morning of selling pressure during the Asian session on Wednesday, February 18. Rising US-Iran tensions weighed on sentiment amid ongoing concerns over AI -related spending, returns on investments, and disruption.\nMeanwhile, Japanese trade data and a US-Japan trade deal sent the Nikkei 225 sharply higher as Japanese Government Bond (JGB) yields dropped toward 2026 lows.\nDespite the morning pullback, lingering bets on an H1 2026 Fed rate cut and a robust US economy continue to support a medium-term outlook for US stock futures. Later on Wednesday, the FOMC Minutes will influence risk sentiment ahead of Friday’s crucial US economic data.\nBelow, I’ll outline the key market drivers, the medium-term outlook, and the technical levels traders should watch.\nThe US and Iran held talks in Geneva on February 17. While Iran’s foreign minister stated that they made good progress, President Trump’s Truth Social Media continued to fuel concerns about a broader Middle East Conflict. Iran’s Supreme Leader Ayatollah Ali Khamenei reportedly threatened to sink US carriers in case of war. Significantly, the White House reportedly told Israel that nuclear talks were at a dead end, with Tehran unwilling to agree to President Trump’s demands.\nDevelopments in the Middle East will be key to near-term demand for risk assets. An escalation and the threat of a broader Middle East conflict could challenge the bullish medium-term outlook for US stock futures.\nWhile tensions in the Gulf will continue to affect sentiment, a US-Japan trade deal cushioned the downside for US stock futures. President Trump announced the deal, stating:\n“Our MASSIVE Trade Deal with Japan has just launched! Japan is now officially, and financially, moving forward with the FIRST set of Investments under its $550 BILLION Dollar Commitment to invest in the United States of America — part of our Historic Trade Deal to REVITALIZE the American Industrial Base, create HUNDREDS OF THOUSANDS of GREAT American Jobs, and strengthen our National and Economic Security like never before.”\nThe announcement came ahead of January’s Japanese trade data, which showed exports surge 16.8% year-on-year, up from 5.1% in December. However, Japanese exports to the US dropped 5.0% after declining 11.1% in December despite overall exports rising. The trade deal highlighted President Trump’s push for foreign investment into the US, bullish for US stock futures.\nUS futures posted modest losses during the Asian session on February 18. The Dow Jones E-mini fell 39 points, while the Nasdaq 100 E-mini and the S&P 500 E-mini dropped 46 points and 8 points, respectively.\nLater in Wednesday’s session, the FOMC Meeting Minutes will face scrutiny after last week’s US jobs and CPI reports. Support for rate cuts in the event that inflation cools would boost demand for US index futures, given January’s cooler inflation numbers.\nLast week’s stronger-than-expected US jobs report overshadowed softer inflation, tempering bets on a June Fed rate cut. Revived bets on a June cut would support expectations of multiple cuts in 2026. Lower borrowing costs can lift profits and stock valuations, bringing all-time highs into play.\nAccording to the CME FedWatch Tool, the probability of a June Fed cut fell from 75.2% on February 10 to 63.6% on February 17.\nFollowing Wednesday morning’s losses, the Nasdaq 100 E-mini and the S&P 500 E-mini traded below their 50-day EMAs, while remaining above their 200-day EMAs. The EMA positions indicated a bearish near-term but bullish longer-term outlook. Meanwhile, the Dow Jones E-mini remained above its 50-day and 200-day EMAs, signaling a bullish bias that aligns with positive fundamentals.\nNear-term trends will hinge on US economic indicators, central bank chatter, and geopolitical risks. Key levels to monitor include:\nDow Jones\nNasdaq 100\nS&P 500\nIn my opinion, the short-term price outlook remains cautiously bullish. Meanwhile, bets on an H1 2026 Fed rate cut r"
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "29.630",
            "open": "6,846.360",
            "close": "6,857.990",
            "high": "6,862.740",
            "low": "6,833.110"
        },
        "market_summary": "### SPX500 Market Briefing\n* **Market Status:** No relevant financial news identified.\n* **Data Availability:** Obituaries and personal announcements dominate content.\n* **Analysis Limitation:** No actionable market insights derivable.\n---\n**Overall Sentiment:** Neutral ⚖️\n\n*Note: Content analysis revealed no economic, corporate, or financial data relevant to SPX500 performance.*",
        "source_articles": [
            {
                "title": "Obituary for Sheila S. Oglesby - Bentley and Sons Funeral Home",
                "source": "Bentley and Sons Funeral Home",
                "url": "https://www.bentleyandsonsmacon.com/obituary/Sheila-Oglesby",
                "body": "We would like to offer our sincere support to anyone coping with grief. Enter\nyour email below for our complimentary daily grief messages. Messages run for up to one year and you\ncan stop at any time. Your email will not be used for any other purpose.\nOfficial Obituary of\nSheila S. Oglesby\n1 Tree, Flower, or Condolence has been shared with support of Sheila's family - View on Tribute Wall\n1 New Post\nObituary & Services\nSheila Oglesby Obituary\nAn obituary is not available at this time for Sheila S. Oglesby. We welcome you to provide your thoughts and memories on our Tribute Wall."
            },
            {
                "title": "Karen S. McNamara - Post Bulletin",
                "source": "Post Bulletin",
                "url": "https://www.postbulletin.com/obituaries/obits/karen-s-mcnamara-saowgryjbacedelo7rpl",
                "body": "Karen S. McNamara\nKaren S. McNamara, age 72, of Rochester, MN, passed away on February 12, 2026, at Spring Valley Living Center of Spring Valley, MN, surrounded by family following a long battle with early-onset dementia.\nKaren S. Stevens was born on January 3, 1954, to Ardean and Frances (Cooper) Stevens in Rochester. She graduated from Mayo High School in 1972. Shortly thereafter, she married Gary Hanna, and to this union, two girls, Jennifer and Amanda, were born. The couple later divorced.\nKaren met her soulmate, John McNamara, in 1990, and they were later married at the Little Brown Church in Nashua, Iowa. To this union, a daughter, Katrina, was born.\nOver the years, Karen became well known for her fashionable sense of style and glowing appearance. She will be remembered fondly for her stubborn and feisty attitude, beautiful smile, and loud, boisterous laugh that could breathe life into any room.\nIn her early years, Karen enjoyed boating and fishing up-north with family. For over 27 years, she was a dedicated retail manager at K-Mart in Rochester before retiring at the age of 47. She later worked for the USPS in Rochester for a short time.\nIn her spare time, Karen enjoyed long motorcycle rides with John and friends, basking in the sun on the deck at her home, and cooking and baking for family and friends—her famous Special K Bars were always a hit, having been dubbed “Special Karen Bars” by her son-in-law. She loved hunting for a good deal, rummaging through estate and garage sales, frequenting the shops of local small towns like Lanesboro, Harmony, and Decorah, as well as traveling to new places and exploring with her family. During her downtime, Karen loved reading. She could often be found curled up on the couch by lamplight, immersed in a novel.\nKaren was a wonderful grandmother to her grandchildren and loved to snuggle with them, play, and read stories. She will be deeply missed by all who loved her.\nKaren is survived by her loving husband, John McNamara, of Rochester; her daughters, Jennifer Nielsen, Amanda (Tim) Wolfgram, and Katrina (Charlie) Hain; her stepson, David (Joanna) Bain; siblings Randy (Nancy) Stevens and Kathy (Tod) Rogers; and her grandchildren, Isabella, Justin, Ryan, Sophia, Oliver, Adrianna, Jonathan, Sapphire, Valentino, Austin, and Levi. She was preceded in death by her parents, Ardean and Frances Stevens, and her in-laws, Lyle and Mary Ellen McNamara.\nHer family will fondly remember all the life lessons she shared and the joy she brought to their lives.\nThe Memorial Service for Karen will be held on Saturday, March 7, 2026, at 11:00 a.m. in River Park Chapel at Macken Funeral Home, with Rev. Jon Marburger officiating. Visitation will begin at 9:30 a.m. prior to the service at the chapel. Burial will be in Millet Cemetery, Rural Spring Valley, at a later date.\nA Special thank-you is extended to Jennifer McNamara for providing in-home care to Karen in the early years following her dementia diagnosis, the staff at Spring Valley Living Center, and St. Croix Hospice.\nOnline condolences are welcome: www.mackenfuneralhome.com\nADVERTISEMENT"
            },
            {
                "title": "Carol S. Gehl Obituary February 15, 2026 - Pederson-Volker Funeral Chapel & Cremation Services",
                "source": "Pederson-Volker Funeral Chapel & Cremation Services",
                "url": "https://www.pedersonvolker.com/obituaries/carol-gehl",
                "body": "Invite friends and family to read the obituary and add memories.\nWe'll notify you when service details or new memories are added.\nYou're now following this obituary\nWe'll email you when there are updates.\nPlease select what you would like included for printing:\nCarol Sue (TeStrake) Gehl (4/4/1941 to 2/15/2026), born in Muscatine, Iowa and raised in Marshfield, Wisconsin, was the beloved eldest daughter of Margaret and Harvey TeStrake. As the oldest of five, she grew up alongside her brothers Bernard, Willard, and Gary, and her baby sister, Sally, offering steady guidance and setting a loving example from the very beginning.\nIn 1964, she married Dr. Gerald “Jerry” Gehl, beginning a love story that spanned over six decades. Their early married life took them to San Diego while Jerry served in the United States Navy, where they welcomed their first daughter, Holly.\nFollowing their time in California, Carol and Jerry returned to Wisconsin and settled in Madison. There they experienced both profound sorrow and deep joy, losing their beloved son, Paul, at the age of two and welcoming their cherished daughter, Sara. Through every season of life, Carol showed what it meant to move forward with grace. The family later lived in Neenah before ultimately settling in Chippewa Falls, which they called home for the past 35 years.\nCarol was a devoted mother and an extraordinary role model for her daughters. As a registered nurse, she lived out her calling to care for others with skill and compassion. She was also deeply committed to defending the rights of women and gave generously of her time in service to her community. Among her many contributions, she was instrumental in creating a car seat distribution program for newborns when car seat laws were first enacted in the 1970s, a legacy that continues to protect families.\nCarol loved art and music and was an incredible seamstress, cook, and pianist. Her music filled the house, her meals gathered family, and her handmade creations became treasured heirlooms. She and Jerry also shared a love of travel and were fortunate to enjoy many adventures together, building a lifetime of memories side by side.\nCarol was preceded in death by her husband, Jerry, in 2023, and by her son, Paul. We take comfort in imagining their reunion and the continuation of a love that endures.\nShe is lovingly survived by her daughters, Holly (Tim) Reiter and Sara (Scott) Eidam; her grandchildren, Sophia and Joel Reiter, Gale and Andrew Eidam; and her great-grandson, Atlas, born in 2025. Carol was overjoyed to meet Atlas in December, a moment of pure happiness.\nIn every era of her life, Carol led with steadfast love, resilience, service, and strength. She leaves behind a family shaped by her example and a community better because she lived in it.\nThe family is deeply grateful to St. Croix Hospice for the extraordinary compassion, dignity, and comfort they provided during Carol’s final days.\nA private family service will be held.\nIn lieu of flowers, those wishing to honor Carol’s legacy of compassion and advocacy may consider a donation to Family Support Center, Planned Parenthood of Wisconsin, or the ACLU of Wisconsin, organizations whose missions reflect the causes she cared about deeply.\nVisits: 973\nThis site is protected by reCAPTCHA and the\nGoogle Privacy Policy and Terms of Service apply.\nService map data © OpenStreetMap contributors"
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "1,055.000",
            "open": "56,757.020",
            "close": "57,026.310",
            "high": "57,197.020",
            "low": "56,142.020"
        },
        "market_summary": "### JPN225 Market Briefing\n* **Key Drivers:** Strong exports (+16.8%) and narrowing trade deficit (¥1.152T) offset by Fed rate uncertainty.\n* **Price Action:** Index opened higher on export data and US-Japan energy/minerals deal ($36B tranche of $550B plan).\n* **Technical Outlook:** Bullish near-term bias supported by improved trade balance and supply chain security focus.\n\n---\n**Overall Sentiment:** Cautious Bullish ▲  \n\n**Supporting Factors:**\n- Export growth to China driving manufacturing optimism\n- US-Japan strategic investment plan reducing input risk for autos/electronics\n- JGB market stabilizing post-LDP election win\n\n**Key Risks:**\n- Fed rate trajectory impacting yen strength and exporter profits\n- AI sector volatility spilling into broader tech sentiment\n- Domestic demand weakness reflected in import decline\n\n**Market Context:** Asian markets mixed with Lunar New Year closures; global focus on AI spending sustainability and tariff concerns.",
        "source_articles": [
            {
                "title": "Nikkei Edges Up On Strong Exports And US-Japan Deal News - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/nikkei-edges-up-on-strong-exports-and-us-japan-deal-news",
                "body": "Japan’s narrower trade deficit and Trump’s first $36 billion tranche under a $550 billion plan helped lift stocks, while investors kept one eye on the Fed’s next move.\n1 min\nWhat’s going on here?\nJapanese stocks opened higher after Japan reported a sharp January export jump and the US outlined a first $36 billion slice of a broader US–Japan energy and minerals investment plan.\nWhat does this mean?\nJapan’s trade picture improved in January as the deficit narrowed to 1.152 trillion yen, helped by a 16.8% rise in exports while imports fell 2.5%. Exports to China did much of the work, which reassured investors that overseas demand is still propping up big manufacturers in the Nikkei. Separately, President Donald Trump said the initial tranche of a $550 billion commitment would fund US energy and mineral projects, ahead of a planned March meeting with Japa..\nn’s Prime Minister Sanae Takaichi. That backdrop matters because supply chains for fuel and critical materials are becoming a bigger input to corporate costs – and markets are also weighing how long US interest rates stay high.\nWhy should I care?\nFor markets: Exports are carrying the story.\nStronger shipments are supportive for globally exposed Japanese firms, but the import drop hints that some of the improvement comes from softer domestic demand. If the yen moves with changing Fed rate expectations, it could quickly reshape profit outlooks for exporters and the valuations investors are willing to pay.\nThe bigger picture: Trade deals are morphing into supply security.\nBig headline numbers increasingly translate into targeted capital spending on energy and critical minerals, not just lower tariffs. If more of the US–Japan package turns into concrete projects, it could reduce input risk for industries like autos and electronics – but it will take timelines, permits, and prices to make it real.\nThis content is free, but you must be logged in to continue reading.\nAlready have an account?"
            },
            {
                "title": "Overseas investors tap brakes on JGB selling post-election - Nikkei Asia",
                "source": "Nikkei Asia",
                "url": "https://asia.nikkei.com/business/markets/bonds/overseas-investors-tap-brakes-on-jgb-selling-post-election",
                "body": "BondsOverseas investors tap brakes on JGB selling post-election\nLDP landslide eases concerns about fiscal policy as market focus shifts to BOJ\nBank of Japan Gov. Kazuo Ueda, left, and Japanese Prime Minister Sanae Takaichi at the prime minister's office in Tokyo on Feb. 16. (Photo by Ken Suzuki)\nSHINICHI ARAKAWA, AKIRA YAMASHITA and MOMOE BAN\nFebruary 18, 2026 07:00 JST\nTOKYO/LONDON/NEW YORK -- The Japanese government bond market is regaining stability following the Liberal Democratic Party's victory in a snap election, easing the sharp rise in interest rates for bonds with long maturities and triggering buying among domestic and foreign institutional investors."
            },
            {
                "title": "Global shares advance, while most Asian markets are closed for the Lunar New Year - The Globe and Mail",
                "source": "The Globe and Mail",
                "url": "https://www.theglobeandmail.com/investing/markets/indices/IXHC/pressreleases/246975/global-shares-advance-while-most-asian-markets-are-closed-for-the-lunar-new-year/",
                "body": "US stocks edge higher after swinging through worries about AI and the economy\nNEW YORK (AP) — A quiet finish for the U.S. stock market on Tuesday masked big swings underneath the surface as companies talked about how discouraged their customers are feeling and some tech stocks continued to feel the downside of the artificial-intelligence boom.\nThe S&P 500 rose 0.1% after flipping earlier between a gain of 0.5% and a loss of nearly 1%. The Dow Jones Industrial Average added 32 points, or 0.1%, and the Nasdaq composite gained 0.1%.\nParamount Skydance helped lead the market and rose 4.9% after Warner Bros. Discovery said it would allow Paramount a chance to give its “best and final” bid to buy the entertainment company. Paramount is trying to top an offer from Netflix.\nWarner Bros. Discovery rose 2.7%, and Netflix added 0.2%.\nOn the losing end of Wall Street was General Mills, which sank 7% after warning that its customers are feeling uneasy. The company behind the Cheerios, Nature Valley and Pillsbury brands cut its forecast for an underlying measure of profit for 2026, saying declines would likely be sharper than it earlier expected.\nSeveral surveys have recently shown weak confidence among U.S. households, which are struggling with inflation that remains higher than anyone would like, a job market coming off a weak year of growth and worries about tariffs.\nGenuine Parts, which sells auto and industrial replacement parts, said it’s also “navigating a dynamic environment” while reporting weaker results for the latest quarter than analysts expected.\nIt plans to split into two separate, publicly traded companies in early 2027, with one focusing on auto parts and the other on industrial parts. Genuine Parts’ stock fell 14.6%\nDrops for some Big Tech stocks were the heaviest weights on the market Tuesday, including a 1.2% fall for Alphabet.\nThe moves were tentative, though, and Nvidia swung between being one of the market’s heaviest weights and one of its biggest strengths.\nMarkets need such Big Tech companies to stabilize and “need to see less sell first/ask questions later behavior from investors,” according to Sameer Samana, head of global equities and real assets at Wells Fargo Investment Institute.\nLast week, Wall Street shook when stocks of software and other companies tumbled as investors hunted for companies that could be potential losers if AI ends up remaking the world and their industries.\n“Overall, the market is still close to records highs, but it may not feel that way to some investors because of the sharp sell-offs that seem to derail upswings almost as soon as they begin,” according to Chris Larkin, managing director, trading and investing, at E-Trade from Morgan Stanley.\nThe market has seen a sharp turnaround from prior years, when the promise of AI helped drive U.S. stock indexes to record after record. Now, companies in industries as varied as software and legal services and trucking have seen investors suddenly turn against them when worries flare that AI-powered competitors could steal their customers.\nThe companies spending big on AI are feeling their own pressure, too.\nGlobal fund managers say they’re worried about the risk that companies are pouring too many dollars into AI data centers and chips. Those companies will need to see tremendous profits and productivity to make their investments worth it. Alphabet, for example, said its spending on AI and other investments could double this year to roughly $180 billion.\nA survey of global fund managers by Bank of America found a record percentage is saying that companies are “overinvesting.” That could mean an eventual pullback in spending on chips from Nvidia and other companies.\nAll told, the S&P 500 added 7.05 points to 6,843.22. The Dow Jones Industrial Average rose 32.26 to 49,553.19, and the Nasdaq composite gained 31.71 to 22,578.38.\nIn the bond market, Treasury yields held relatively steady.\nThe yield on the 10-year Treasury edged up to 4.05% from 4.04% lat"
            }
        ]
    }
]