[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "61.700",
            "open": "3,763.690",
            "close": "3,736.120",
            "high": "3,779.280",
            "low": "3,717.580"
        },
        "market_summary": "Gold is consolidating just below its recent record highs after a powerful rally. The pause is attributed to a strengthening US Dollar and a cautious, data-dependent Federal Reserve, which have prompted some profit-taking. However, the underlying bullish fundamentals remain intact, supported by expectations for further interest rate cuts, persistent geopolitical tensions, and strong performance in gold miner ETFs.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "US Dollar Bounces, Gold Pauses Rally: What’s Next for Bitcoin? - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/us-dollar-bounces-gold-pauses-044140531.html",
                "body": "Bitcoin is stuck in a macro tug of war as the U.S. dollar strengthens following the U.S. Federal Reserve’s measured dovishness, with gold settling lower after Wednesday’s record high.\nThe conflicting signals have left the crypto trading in a tight range, lagging the record-breaking momentum in equity markets and gold.\nThe Fed’s quarter-point “insurance cut” last week successfully calmed front-end rates but sparked a sell-off in long-term Treasuries, pushing yields higher, Singapore-based trading desk QCP Capital noted in a Wednesday post.\nFed Chair Jerome Powell’s emphasis on a cautious path forward provided much-needed relief for the U.S. Dollar Index (DXY), which measures the dollar's performance against a basket of currencies, leading to a 1.63% bounce from Wednesday’s low of 97.22, according to MarketWatch data.\nAmid the strengthening dollar, both gold & the S&P 500 index have settled lower after touching record highs on Tuesday.\nBitcoin’s Slump Widens Safe Haven Divergence for Gold\n“Gold's reversal from fresh highs looks like profit-taking or hedging shifts,” Derek Lim, head of research at crypto market-making and trading firm Caladan, told Decrypt. “While some of those flows might rotate into Bitcoin, the effect gets muted if the dollar keeps strengthening.”\nWith the core inflation near 3%, Lim expects August’s Core PCE release to set the tone on how equities, gold, and Bitcoin will react.\nA positive surprise would “force the markets to reprice rate-cut expectations,” he said, making equities, gold, and Bitcoin vulnerable. At the same time, a softer print would strengthen the dovish case, pushing these assets higher.\nWill Traders in Asia Drive Next Phase of the Bitcoin Bull Run?\nThe Fed’s “measured dovishness is calming markets,” discounting the U.S. dollar’s bounce and recent drop in both equities and gold, Ryan McMillin, chief investment officer at crypto fund manager Merkle Tree, told Decrypt.\nHe said the market is in agreement with the Fed’s stance and points to the reduced volatility in the bond markets as proof, expecting this macro backdrop to help end Bitcoin’s September slump and push it to new highs heading into a historically bullish fourth quarter.\nBitcoin is currently trading at $111,800, down less than a percent on the day, CoinGecko data shows."
            },
            {
                "title": "Gold consolidates below record highs as Fed caution and US Dollar strength weigh - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gold-consolidates-below-record-highs-as-fed-caution-and-us-dollar-strength-weigh-202509241217",
                "body": "- Gold pauses its record-breaking run after setting a fresh all-time high at $3,791.\n- Fed’s cautious stance and a firmer US Dollar cap upside, while geopolitical tension and rate-cut expectations cushion downside.\n- Market focus shifts to upcoming US data and Fed commentary, with PCE inflation on Friday in the spotlight.\nGold (XAU/USD) is trading under renewed selling pressure on Wednesday, retreating after reaching a record high of $3,791 the previous day. At the time of writing, XAU/USD is trading near $3,735, easing from an intraday high of $3,779, as traders weigh the Federal Reserve’s (Fed) cautious stance on the path of monetary policy easing.\nA rebound in the US Dollar (USD) and rising Treasury yields are capping upside attempts in Gold, though market bets remain firm on the prospect of additional interest rate cuts before year-end following last week’s 25-basis-point (bps) reduction. Persistent geopolitical tensions and the broader fundamental and technical outlook continue to cushion downside risks, keeping dip-buyers engaged even as momentum stalls near record territory.\nFed Chair Jerome Powell, speaking in Washington on Tuesday, stuck to his familiar script, stressing that monetary policy remains \"data-dependent” and that “there is no preset path” for future interest rate decisions. He acknowledged that the balance of risks has shifted, with downside threats to employment rising, but cautioned that easing too aggressively could leave “the inflation job unfinished.”\nLooking ahead, the Fed’s dual mandate presents a delicate balancing act, though the tilt is increasingly toward safeguarding the labor market. Progress toward the 2% inflation goal appears to be stalling, but upside risks to prices are not materializing yet. With policy still firmly in restrictive territory, keeping rates elevated for too long risks inflicting unnecessary damage on employment, suggesting the Fed’s bias should lean dovish even as it moves cautiously.\nMarket movers: Fed caution lifts Dollar, US government shutdown fears grow\n- Fed commentary on Tuesday offered mixed signals beyond Powell’s remarks. Vice Chair Michelle Bowman struck a dovish tone, warning the Fed risks being “behind the curve” on supporting jobs if it does not cut more decisively. Chicago Fed President Austan Goolsbee said there is “room to cut rates” if inflation continues to ease, while Atlanta Fed President Raphael Bostic cautioned that inflation risks remain present in the economy, citing persistent cost pressure in business plans.\n- The US Dollar Index (DXY), which tracks the value of the Greenback against a basket of six major currencies, edges higher on Wednesday, snapping a two-day losing streak and rising nearly 0.65% to trade around 97.87.\n- Geopolitical tensions remain elevated. Russian MiG-31 aircraft entered Estonian airspace on Tuesday, prompting NATO to deploy fighter jets and Tallinn to call for Article 4 consultations. Additionally, Ukraine stepped up drone strikes on Russian energy infrastructure.\n- US President Donald Trump, addressing the United Nations General Assembly in New York on Tuesday, said Ukraine “can win back all the territory” lost to Russia with support from NATO and Europe. He urged alliance members to “shoot down Russian aircraft” if they violated their airspace. Trump also criticized European nations for continuing to purchase Russian energy, calling it “embarrassing” that NATO countries were indirectly funding Moscow’s war effort.\n- The US faces a potential government shutdown from October 1 if Congress fails to pass new funding legislation. Lawmakers remain deadlocked after the Senate rejected a House-passed stopgap bill that excluded Democratic priorities such as healthcare subsidies, while President Trump on Tuesday canceled a planned meeting with Democratic leaders, accusing them of making “unserious and ridiculous demands.”\n- Wednesday’s US economic calendar is light with only tier 2 data in the form of New Home Sales, while San Fra"
            },
            {
                "title": "Gold Miner ETFs Are Going Beast Mode—And It's Not About Inflation - Benzinga",
                "source": "Benzinga",
                "url": "https://www.benzinga.com/etfs/sector-etfs/25/09/47854077/gold-miner-etfs-are-going-beast-mode-and-its-not-about-inflation",
                "body": "Investors who want to capitalize on the gold rally are increasingly opting for gold miners ETFs, which provide exposure to gold mining stocks rather than the bullion, often amplifying gains and losses. Some of the most important options available in the market are:\nVanEck Gold Miners ETF GDX – The largest and most liquid, with one-month average volume of 19.69 million shares and $21.44 billion in assets. Tracks a broad portfolio of leading gold mining companies. Prices of this fund have appreciated 105% year-to-date (YTD).\nSprott Gold Miners ETF SGDM – Suitable for momentum investors, SGDM reached a 52-week high on Monday. It tracks the Solactive Gold Miners Custom Factors Index, targeting large-cap gold miners on Canadian and US exchanges. The fund is up 105% YTD.\nVanEck Junior Gold Miners ETF GDXJ – Targets smaller, higher-risk gold mining firms, providing the possibility of higher returns. The fund has gained almost 108% this year so far.\nSprott Junior Gold Miners ETF SGDJ – An inexpensive option with a 0.50% yearly fee, focusing on smaller miners with potential for growth. The fund is up 94% YTD.\nThe ETFs have proven popular in a context of macroeconomic uncertainty, increasing gold prices, and global central banks adding gold to their reserves. Gold has risen around 10% over the last month and 42% year-to-date, boosted by safe-haven buying, Fed cuts, and the declining U.S. dollar.\nAlso, U.S. gold reserves have fallen to their lowest level in 90 years, contrasting sharply with the rest of the world's central banks, which are amassing gold at levels not seen in nearly half a century. At one time, the U.S. held over 50% of the world's reserves; today, that share is just 20%, while global gold holdings outside the U.S. have reached a 49-year high. Macro strategist Otavio Costa of Crescat Capital observes that this divergence could potentially lead to U.S. policymakers reconsidering their position.\nContinued expectations of Fed rate reductions also bolster gold’s rally. As per the CME FedWatch tool, there’s a 94.1% chance of a reduction in October and a 75.2% chance in December. Reductions in interest rates weaken the U.S. dollar, making gold a favorite among foreign investors. The U.S. Dollar Index has declined around 10% year-to-date, enhancing gold’s appeal.\nFor investors seeking to hedge against market volatility while potentially profiting from gold’s upward trajectory, the miners ETFs offer a strategic entry point. GDX and SGDM offer liquidity and potential growth, whereas GDXJ and SGDJ provide a higher-risk, higher-reward investment opportunity in junior miners. As long as gold fundamentals remain strong and macro risks continue to build, these ETFs could continue to attract investor eyeballs well into 2026.\nRead Next:\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.715",
            "open": "67.719",
            "close": "68.802",
            "high": "69.014",
            "low": "67.299"
        },
        "market_summary": "Saudi Arabia is increasing crude supply to China in October through a significant price cut, aiming to reclaim market share. This comes as OPEC+ plans a modest production increase, adding to a broader supply boost since April. However, these bearish supply signals are being countered by an unexpected draw in US oil inventories and ongoing geopolitical risks, creating a complex and volatile price environment.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Saudi Crude Oil Supply to China Set to Surge in October, Trade Sources Say - EnergyNow.com",
                "source": "EnergyNow.com",
                "url": "https://energynow.com/2025/09/saudi-crude-oil-supply-to-china-set-to-surge-in-october-trade-sources-say/",
                "body": "(Reuters) – Saudi Arabia’s crude oil exports to China are set to surge in October after a deep cut in prices, several trade sources said on Thursday.\nState oil company Saudi Aramco will ship about 51 million barrels to China in October, about 1.65 million barrels per day (bpd), a tally of allocations to Chinese refiners showed.\nThe October plan compares with 1.43 million bpd allocated in September and matches the volume in August which was the highest since April 2023.\nCompanies which planned to increase Saudi crude liftings next month were Asia’s top refiner Sinopec , Hengli Petrochemical and Shenghong Petrochemical, the sources said.\nAramco did not immediately respond to a request for comment about its October allocation to China.\nEarlier Reuters reported that Aramco spoke to Asian buyers on the sidelines of this week’s APPEC conference in Singapore, nudging them to lift more crude in October as it seeks to reclaim market share.\nThe state producer set the October price for its flagship Arab Light crude to Asia at $2.20 a barrel above the Oman/Dubai average, down $1 per barrel from a five-month high in September.\nThe price cut followed a weekend decision by the Organization of the Petroleum Exporting Countries and allies led by Russia, known as OPEC+, to raise production by 137,000 barrels per day in October.\nThe group, which is led by Saudi Aramco and pumps about half of the world’s oil, has already boosted production targets by 2.5 million bpd since April, equivalent to about 2.4% of global demand.\nReporting by Siyi Liu in Singapore Editing by David Goodman, Elaine Hardcastle"
            },
            {
                "title": "How geopolitical shocks are rippling through OPEC and the global markets - Nation Thailand",
                "source": "Nation Thailand",
                "url": "https://www.nationthailand.com/pr-news/pr-news/40055893",
                "body": "Market analysis by Quoc Dat Tong, Senior Financial Markets Strategist at Exness.\nWhen tensions in the Middle East began to escalate earlier this year, markets braced for the familiar chain reaction: fears of disrupted supply, speculative spikes in crude prices, and renewed volatility across global assets. In oil, these shifts are amplified. A targeted attack on infrastructure, a diplomatic breakdown, or a sudden production cut by an OPEC member can trigger price movements that ripple from regional economies to the world’s largest financial centres.\nToday, those ripples are colliding with other fault lines, creating one of the most complex oil market environments seen in years. Understanding this landscape means understanding not just OPEC’s influence, but the geopolitical forces shaping its every move.\nIn oil markets, a “shock” is less about surprise and more about scale. It’s an event sudden enough to jolt supply, demand, or both. Wars, sanctions, unrest, and infrastructure attacks can choke supply almost overnight. On the other side of the equation, shifts in economic policy, trade restrictions, or even sudden surges in industrial activity can upend demand patterns just as quickly.\nIn practice, these shocks rarely happen in isolation. A supply cut triggered by conflict can also spark speculative buying, amplifying price swings. This is why understanding the source, whether it’s a pipeline sabotage, a tariff dispute, or a regional conflict, is crucial for anyone trying to navigate oil’s notoriously sensitive price dynamics.\nThe last few years have shown just how quickly a single geopolitical event can redraw the oil map. The Russia-Ukraine conflict is a prime example. Prior to the war, the EU sourced a quarter of its crude oil and 40% of its diesel from Russia. Within months, sanctions and outright bans from the US and EU cut those flows almost entirely.\nIn response, the Organization for Economic Co-operation and Development (OECD) released 60 million barrels from strategic reserves to ease prices. But the real shift was structural. Gulf states increased imports of discounted Russian crude, rerouting refined products back to Europe. Prices briefly spiked above 110 USD per barrel before settling into a lower range as new trade patterns took hold.\nThree years on, the EU has replaced much of its Russian fossil fuel imports with alternative suppliers and, crucially, ramped up renewable energy. Green energy’s share of EU production has more than doubled since 2021, and if that trajectory continues, it could further soften oil demand and prices in the years ahead.\nWhen tensions flare in the Middle East, oil markets react. Prices shift on mere whispers of supply disruption, shipping routes are reassessed, and traders weigh the likelihood of escalation. In a commodity as globally integrated as oil, even localized conflict can send ripples across the globe, reshaping trade flows and market sentiment in real time.\nRecent flare-ups involving Israel, Iran, Yemen, and Saudi Arabia have done just that, heightening supply fears. These developments come on top of unrest in Libya and Venezuela, all oil-producing countries, compounding uncertainty in a market already sensitive to political risk.\nThe organization’s ability to stabilize prices for members adhering to agreed production quotas. But compliance isn’t always guaranteed. Iraq, Kazakhstan, and Russia have all been frequent overproducers, sometimes driven by economic necessity or political pressure. Even Saudi Arabia, OPEC’s de facto leader, has exceeded agreed limits.\nManaging this balance is even more complex when members are under sanctions or engaged in conflict. Russia’s current status—under heavy Western sanctions but also the world’s third-largest oil producer—complicates OPEC’s decision-making. The group must avoid alienating Western buyers while also protecting its members’ economic interests.\nAdding to the challenge, major oil producers outside OPEC+, such as the US, Canada, a"
            },
            {
                "title": "US Oil Inventories Drop Unexpectedly While Prices Move Up - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/us-oil-inventories-drop-unexpectedly-while-prices-move-up",
                "body": "about 10 hours ago • 1 min\nJoin the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nUS commercial crude oil inventories took markets by surprise last week, falling by 600,000 barrels to 414.8 million. Oil prices jumped on the news, even as expectations for higher production and future supply capped optimism.\nWhat does this mean?\nMost analysts were expecting US oil inventories to grow, but the latest Energy Information Administration data showed a draw instead. Stocks of distillate and gasoline slid by 1.7 million and 1.1 million barrels, revealing stronger seasonal demand and heightened refinery activity. That under-the-radar drop triggered a quick 2.4% bump for West Texas Intermediate futures, with Brent crude also moving higher. At the same time, Russian fuel shortages—sparked by recent Ukrainian drone attacks—have added extra global volatility. Still, some experts warn that rising output from OPEC+ and other suppliers could tip the balance back to oversupply by 2026, with oil prices potentially settling below $55 per barrel if those trends hold.\nWhy should I care?\nFor markets: Supply surprises shake up prices.\nThe sudden inventory draw lit a fire under oil markets, with prices rallying quickly as traders adjusted their bets. But this rally comes with a caveat: if OPEC and other major producers ramp up supply as planned, these price gains may not stick—especially if global demand doesn’t rise to match.\nThe bigger picture: Energy markets walk a tightrope.\nInternational risks—like Russian fuel disruptions—remind investors how fragile supply chains can be. Yet in the long run, strategic moves by OPEC+ could outweigh temporary shocks, potentially pushing oil prices lower and signaling a market adapting to shifting energy landscapes worldwide.\nYou read that right: you can win two return flights to London, a three-night stay at a hotel in the capital, and in-person tickets to our Modern Investor Summit. Even better, your trip will be created in partnership with Echo Bravo – the experts in hassle-free business travel and round-the-clock human support.\nSo not only can you skip the bill, but you can leave the planning to the pros, too.\nAll you need to do is register for the Summit… and decide who you’d share that room with, of course.\nT&C's apply. Click here for details.\nMentioned in story\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nInsight\nTheodora Lee Joseph, CFA • about 15 hours ago\nQuick Take\nFinimize Newsroom • about 17 hours ago\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article is based on reporting by MT Newswires. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies.\nGet the two biggest stories in finance, and the reasons why you should care, delivered to your inbox every day."
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.790",
            "open": "63.960",
            "close": "65.135",
            "high": "65.365",
            "low": "63.575"
        },
        "market_summary": "Saudi Arabia is increasing crude oil supply to China in October following a significant price cut, as OPEC+ plans to raise production. Meanwhile, US crude inventories fell unexpectedly, providing a short-term boost to prices, though this is tempered by expectations of future oversupply from OPEC+ and other producers. The market is balancing immediate supply disruptions and strong demand against a longer-term outlook for increased production.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Saudi Crude Oil Supply to China Set to Surge in October, Trade Sources Say - EnergyNow.com",
                "source": "EnergyNow.com",
                "url": "https://energynow.com/2025/09/saudi-crude-oil-supply-to-china-set-to-surge-in-october-trade-sources-say/",
                "body": "(Reuters) – Saudi Arabia’s crude oil exports to China are set to surge in October after a deep cut in prices, several trade sources said on Thursday.\nState oil company Saudi Aramco will ship about 51 million barrels to China in October, about 1.65 million barrels per day (bpd), a tally of allocations to Chinese refiners showed.\nThe October plan compares with 1.43 million bpd allocated in September and matches the volume in August which was the highest since April 2023.\nCompanies which planned to increase Saudi crude liftings next month were Asia’s top refiner Sinopec , Hengli Petrochemical and Shenghong Petrochemical, the sources said.\nAramco did not immediately respond to a request for comment about its October allocation to China.\nEarlier Reuters reported that Aramco spoke to Asian buyers on the sidelines of this week’s APPEC conference in Singapore, nudging them to lift more crude in October as it seeks to reclaim market share.\nThe state producer set the October price for its flagship Arab Light crude to Asia at $2.20 a barrel above the Oman/Dubai average, down $1 per barrel from a five-month high in September.\nThe price cut followed a weekend decision by the Organization of the Petroleum Exporting Countries and allies led by Russia, known as OPEC+, to raise production by 137,000 barrels per day in October.\nThe group, which is led by Saudi Aramco and pumps about half of the world’s oil, has already boosted production targets by 2.5 million bpd since April, equivalent to about 2.4% of global demand.\nReporting by Siyi Liu in Singapore Editing by David Goodman, Elaine Hardcastle"
            },
            {
                "title": "US Shale Bosses Decry ‘Broken’ Business as Trump Wants More Oil - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/articles/2025-09-24/us-shale-bosses-decry-broken-business-as-trump-wants-more-oil",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            },
            {
                "title": "US Oil Inventories Drop Unexpectedly While Prices Move Up - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/us-oil-inventories-drop-unexpectedly-while-prices-move-up",
                "body": "about 10 hours ago • 1 min\nJoin the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nUS commercial crude oil inventories took markets by surprise last week, falling by 600,000 barrels to 414.8 million. Oil prices jumped on the news, even as expectations for higher production and future supply capped optimism.\nWhat does this mean?\nMost analysts were expecting US oil inventories to grow, but the latest Energy Information Administration data showed a draw instead. Stocks of distillate and gasoline slid by 1.7 million and 1.1 million barrels, revealing stronger seasonal demand and heightened refinery activity. That under-the-radar drop triggered a quick 2.4% bump for West Texas Intermediate futures, with Brent crude also moving higher. At the same time, Russian fuel shortages—sparked by recent Ukrainian drone attacks—have added extra global volatility. Still, some experts warn that rising output from OPEC+ and other suppliers could tip the balance back to oversupply by 2026, with oil prices potentially settling below $55 per barrel if those trends hold.\nWhy should I care?\nFor markets: Supply surprises shake up prices.\nThe sudden inventory draw lit a fire under oil markets, with prices rallying quickly as traders adjusted their bets. But this rally comes with a caveat: if OPEC and other major producers ramp up supply as planned, these price gains may not stick—especially if global demand doesn’t rise to match.\nThe bigger picture: Energy markets walk a tightrope.\nInternational risks—like Russian fuel disruptions—remind investors how fragile supply chains can be. Yet in the long run, strategic moves by OPEC+ could outweigh temporary shocks, potentially pushing oil prices lower and signaling a market adapting to shifting energy landscapes worldwide.\nYou read that right: you can win two return flights to London, a three-night stay at a hotel in the capital, and in-person tickets to our Modern Investor Summit. Even better, your trip will be created in partnership with Echo Bravo – the experts in hassle-free business travel and round-the-clock human support.\nSo not only can you skip the bill, but you can leave the planning to the pros, too.\nAll you need to do is register for the Summit… and decide who you’d share that room with, of course.\nT&C's apply. Click here for details.\nMentioned in story\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nInsight\nTheodora Lee Joseph, CFA • about 15 hours ago\nQuick Take\nFinimize Newsroom • about 17 hours ago\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article is based on reporting by MT Newswires. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies."
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0091",
            "open": "1.1811",
            "close": "1.1737",
            "high": "1.1819",
            "low": "1.1728"
        },
        "market_summary": "The EUR/USD is trading near 1.1750, pressured by a stronger US Dollar and disappointing German economic data, specifically a weak IFO Business Climate index. The pair is finding some support from market expectations of imminent Fed rate cuts, but faces a key test with upcoming US PCE inflation data. Technical analysis suggests a bearish bias with the pair breaking below support levels.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "EUR/USD gains near 1.1750 ahead of German GfK Consumer Confidence Survey, Fedspeak - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/eur-usd-gains-near-11750-ahead-of-german-gfk-consumer-confidence-survey-fedspeak-202509250414",
                "body": "- EUR/USD maintains its position ahead of the German GfK Consumer Confidence Survey.\n- The Euro struggled following the disappointing headline German IFO Business Climate Index released on Wednesday.\n- CME FedWatch tool indicates nearly a 92% possibility of a Fed rate cut in October.\nEUR/USD rebounds after registering more than 0.5% losses in the previous session, trading around 1.1750 during the Asian hours on Thursday. The pair holds ground ahead of the German GfK Consumer Confidence Survey due later in the day.\nThe Euro (EUR) faced challenges against its peers following the disappointing headline German IFO Business Climate Index released on Wednesday, which unexpectedly fell to 87.7 in September from 89.0 in August. The data undermined the market expectations of 89.3.\nHowever, the EUR/USD pair maintains its position as the US Dollar (USD) struggles ahead of the Fedspeak later in the day. Focus will shift toward Personal Consumption Expenditures (PCE) Price Index data, the Federal Reserve’s preferred inflation gauge, due later on Friday.\nThe US Dollar (USD) appreciated as the US Federal Reserve (Fed) Chair Jerome Powell struck a cautious note, stressing that the US central bank must weigh stubborn inflation against a softening job market, calling it “a challenging situation” and reiterating comments from last week. However, the CME FedWatch tool suggests that money markets are currently pricing in nearly a 92% possibility of a Fed rate cut in October, up from 87% a week earlier.\nSan Francisco Fed President Mary Daly said on Wednesday that further rate reductions are likely to be needed, as the central bank works to restore price stability and provide necessary support to the labor market. Chicago Fed President Austan Goolsbee broke away from the overarching narrative of consecutive Fed rate cuts heading through the end of the year, widening the narrative gap between Fed incumbents and Donald Trump's newly minted Fed pick, Stephen Miran.\nEuro FAQs\nThe Euro is the currency for the 19 European Union countries that belong to the Eurozone. It is the second most heavily traded currency in the world behind the US Dollar. In 2022, it accounted for 31% of all foreign exchange transactions, with an average daily turnover of over $2.2 trillion a day. EUR/USD is the most heavily traded currency pair in the world, accounting for an estimated 30% off all transactions, followed by EUR/JPY (4%), EUR/GBP (3%) and EUR/AUD (2%).\nThe European Central Bank (ECB) in Frankfurt, Germany, is the reserve bank for the Eurozone. The ECB sets interest rates and manages monetary policy. The ECB’s primary mandate is to maintain price stability, which means either controlling inflation or stimulating growth. Its primary tool is the raising or lowering of interest rates. Relatively high interest rates – or the expectation of higher rates – will usually benefit the Euro and vice versa. The ECB Governing Council makes monetary policy decisions at meetings held eight times a year. Decisions are made by heads of the Eurozone national banks and six permanent members, including the President of the ECB, Christine Lagarde.\nEurozone inflation data, measured by the Harmonized Index of Consumer Prices (HICP), is an important econometric for the Euro. If inflation rises more than expected, especially if above the ECB’s 2% target, it obliges the ECB to raise interest rates to bring it back under control. Relatively high interest rates compared to its counterparts will usually benefit the Euro, as it makes the region more attractive as a place for global investors to park their money.\nData releases gauge the health of the economy and can impact on the Euro. Indicators such as GDP, Manufacturing and Services PMIs, employment, and consumer sentiment surveys can all influence the direction of the single currency. A strong economy is good for the Euro. Not only does it attract more foreign investment but it may encourage the ECB to put up interest rates, which will directl"
            },
            {
                "title": "EUR/USD Price Forecast: EUR to USD Pair Slides to 1.1750 as German IFO Drops to 87.7, Fed Stays Cautious - tradingnews.com",
                "source": "tradingnews.com",
                "url": "https://www.tradingnews.com/news/eur-usd-price-forecast-eur-to-usd-slips-german-ifo-weakness-and-fed-signals-policy-caution",
                "body": "EUR/USD Price Forecast: Euro to USD Slips to 1.1750 as German IFO Weakens and Fed Signals Policy Caution\nThe euro retreats on soft German sentiment and cautious Fed messaging, with traders eyeing 1.1730 support and 1.1820 resistance ahead of critical US PCE inflation data | That's TradingNEWS\nEUR/USD Slides to 1.1750 as German Data Disappoints and Fed Division Strengthens the Dollar\nThe EUR/USD pair is under heavy pressure, trading in the mid-1.1700s after failing to hold the 1.1820 ceiling earlier this week. The selloff was triggered by a sharp decline in Germany’s IFO Business Climate index, which fell to 87.7 in September from 89.0 in August, undershooting expectations of 89.3. Both the current assessment and forward-looking expectations deteriorated, reflecting deepening concern inside Europe’s largest economy. Weak manufacturing readings reinforced the drag, with German PMI sliding to 48.5 and France’s manufacturing index tumbling to 48.1, a three-month low.\nFed Voices Split While the Dollar Gains\nAcross the Atlantic, the U.S. dollar regained strength as the Federal Reserve’s messaging remained cautious. Chair Jerome Powell warned that aggressive rate cuts are not guaranteed, even as markets still price in up to two more reductions before year-end. He highlighted the “challenging balance” between curbing inflation and supporting a labor market already showing cracks. Meanwhile, new Trump-appointed governor Stephen Miran pushed for bolder easing, even suggesting a 200-basis point cut, while Michelle Bowman argued employment should take priority over inflation. Despite the noise, the dollar index surged above 97.30, helping drive EUR/USD lower.\nEurozone Data Contrast: Services Resilient, Manufacturing in Decline\nThe broader eurozone PMI showed a stark divergence. Services activity surprised with an uptick to 51.4, above the expected 50.5, while manufacturing dropped to 49.5, undershooting the 50 expansion threshold. France’s service sector remained in contraction, with the index at 48.9, while Germany’s service sector outperformed at 52.5, pointing to a growing reliance on services as factories struggle. This split underlines why the European Central Bank has been reluctant to commit to additional cuts after leaving rates unchanged in September, keeping policy divergence with the Fed alive.\nU.S. PMI Confirms Slowdown but Still Expansionary\nPreliminary September PMI data out of the U.S. confirmed cooling momentum but not outright weakness. Services slipped to 53.9 from 54.5, and manufacturing eased to 52.0 from 53.0, both in line with consensus. The composite index printed at 53.6, still comfortably above the 50 expansion threshold. Rising input costs combined with slower output price growth highlighted margin compression, but resilience in the data gave the Fed cover to resist aggressive easing for now.\nTechnical Picture for EUR/USD Signals Further Downside\nFrom a technical standpoint, EUR/USD breached the 1.1780 support, exposing the key trendline around 1.1740. The RSI has fallen below 50, confirming weakening momentum, while the MACD crossed beneath the signal line, reinforcing bearish bias. A clean break below 1.1740 opens the path toward the September 22 low at 1.1730 and then the September 12 trough at 1.1700. On the upside, the 1.1820 cap remains the first barrier, followed by 1.1850 and 1.1878.\nRead More\n-\nAVUV ETF Forecast: Small-Cap Value ETF Holds $100.18 as Historic Spreads, Fed Policy, and Earnings Momentum Converge\n24.09.2025 · TradingNEWS ArchiveStocks\n-\nBitcoin ETF Inflows - BTC-USD at $113,600 as $246M Inflows Reverse to $363M Outflows\n24.09.2025 · TradingNEWS ArchiveCrypto\n-\nNatural Gas Price Forecast: Futures Steady at $2.858 as LNG Growth, EU Storage, and Winter Outlook Collide\n24.09.2025 · TradingNEWS ArchiveCommodities\n-\nUSD/JPY Price Forecast: Dollar-Yen at 148.78 as Fed Holds Cautious Tone and BoJ Faces Policy Divide\n24.09.2025 · TradingNEWS ArchiveForex\nInvestor Positioning and Sentiment in EUR/USD\n"
            },
            {
                "title": "EUR/USD, USD/JPY Forecast: Two trades to watch - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/eur-usd-usd-jpy-forecast-two-trades-to-watch-09-24-25/?amp=true",
                "body": "EUR/USD, USD/JPY Forecast: Two trades to watch\nEUR/USD falls as German business morale weakens & on a stronger USD.\n- German IFO business sentiment fell to 87.7 from 89\n- Eurozone Composite PMI rose to a 16-month high\n- EUR/USD eases below 1.18\nEUR/USD is falling modestly after weaker-than-forecast German IFO business sentiment and amid renewed USD strength following Fed Powell’s cautious tone yesterday.\nGerman IFO business sentiment unexpectedly fell in September to 87.7, down from a yearly high of 89 in August and below forecasts of 89.3. The current assessment also declined to 85.7, down from 86.4.\nThe data followed PMI figures released yesterday, which showed that business activity in the eurozone rose to a 16-month high in September thanks to a stronger service sector.\nWith inflation in the region at the target 2% level and growth stagnant the ECB left rates unchanged for a second month in September and may not cut rates again this year. This divergence from the Fed is keeping the EUR/USD supported.\nThe market is still pricing in two more rate cuts from the Fed this year, even after Powell struck a more cautious tone in his speech.\nEUR/USD forecast -technical analysis\nEUR/USD broke out of its rising trendline resistance, rising to a peak of 1.1915 before easing back below 1.18. The price trades above the rising trendline but is struggling to retake 1.1830, the July high. Buyers need to break above this level to extend the bullish trend towards 1.1920.\nFailure to rise above 1.1830 could see the price fall lower, breaking below the near-term rising trendline support to test the 1.17 round number. Below here 1.1580 comes into play.\nUSD/JPY rises amid a firmer USD as Powell adopts a cautious tone to further cuts\n- Fed Powell reiterated the fine balance between jobs and inflation\n- Japanese PMIs weakened, BoJ minutes are up next\n- USD/JPY trades in a range, approaching 148\nThe USD/JPY is rising amid a weaker yen, following softer-than-expected PMI data and as the USD steadies after two days of losses. This is due to Federal Reserve Chair Jerome Powell adopting a cautious stance in his speech towards potential rate cuts.\nFed Chair Powell adopted a cautious stance on further monetary policy easing, emphasizing the delicate balance between jobs and inflation. His comments fell short of the markets' more dovish expectations after the sharp weakening in the US labour market; however, traders have retained bets for two more interest rate cuts this year in line with the Fed's dot plot at the meeting last week.\nToday's attention is on U.S. new home sales and a speech from Federal Reserve official Mary Daly. Tomorrow sees the release of US GDP data, initial jobless claims, and more Fed speakers, as well as the US core PCE on Friday, which could make for a busy end to the week for the US dollar.\nThe Japanese yen is falling after the manufacturing and service sector PMI was weaker than expected. The manufacturing PMI showed a deeper contraction of 48.4, down from 49.7, while the services PMI saw growth slow modestly to 53 in September, down from 53.1. The data adds to the uncertainty surrounding Bank of Japan rate hikes.\nTraders are also assessing candidates for the position of Japanese Prime Minister. One of the front-runners, Takaichi, also a fiscal and monetary dove, noted that higher rates could impact mortgage rates and corporate investment.\nBank of Japan meeting minutes are due later. The minutes are from the meeting where the BoJ left policy unchanged last week; however, a growing division among policy members has led to hawkish signals, prompting investors to speculate about whether the BoJ will hike rates next month.\nUSD/JPY forecast – technical analysis\nUSD/JPY trades within a holding pattern, capped by the 200 SMA on the upside and by 146.25 on the downside. This setup is for a breakout trade.\nBuyers will look to rise above the 200 SMA and horizontal resistance at 148.50 to extend gains towards 150, the round number.\nSellers w"
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0102",
            "open": "1.3517",
            "close": "1.3446",
            "high": "1.3528",
            "low": "1.3426"
        },
        "market_summary": "The GBP/USD pair is under significant pressure, trading near multi-week lows around $1.3435. This weakness is driven by a combination of a strong US Dollar, bolstered by a cautious Fed stance and resilient US economic data, and a dovish Bank of England amid soft UK PMI data. Technically, the pair has broken below key moving averages, with immediate support at the 1.3400 level, leaving it vulnerable to further declines.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "GBP/USD Price Forecast: Pound to Dollar Slips to $1.3435 as Dollar Strengthens, 1.3400 Support in Focus - tradingnews.com",
                "source": "tradingnews.com",
                "url": "https://www.tradingnews.com/news/gbp-usd-pound-to-dollar-13435-usd-as-dollar-strengthen",
                "body": "GBP/USD Price Forecast: Pound to Dollar Slips to $1.3435 as Dollar Strengthens, 1.3400 Support in Focus\nSterling weakens after soft UK PMIs and BoE dovish signals, while Powell’s cautious Fed stance drives DXY to 97.70, leaving GBP/USD vulnerable to deeper losses toward 1.3333 | That's TradingNEWS\nGBP/USD Slips Toward $1.3435 as Dollar Strengthens\nThe British pound weakened sharply, with GBP/USD trading near 1.3435, its lowest in more than two weeks after losing 0.65% intraday. Sellers took control as the pair failed to hold above its 21-day SMA at 1.3521 and broke below the 50-day SMA at 1.3470. A firm U.S. Dollar Index (DXY) at 97.70 added pressure, lifting the greenback against all majors after Fed Chair Jerome Powell flagged stretched equity valuations and maintained caution on monetary easing. Momentum indicators confirm bearish control: RSI slipped to 44, while the MACD shows widening red bars after a fresh bearish crossover. Immediate support rests at 1.3400, with the September swing low at 1.3333 next if pressure continues. Resistance is layered at 1.3525, 1.3550, and 1.3600.\nPolicy Divergence Between BoE and Fed Intensifies Pressure\nThe policy backdrop remains tilted against sterling. The Bank of England under Governor Andrew Bailey has turned dovish, while the Fed keeps the door open for restrictive policy, allowing the dollar to attract safe-haven inflows. UK PMIs added to the weakness, with September’s composite cooling and reinforcing the risk that Britain’s fragile economy could underperform. Powell’s U.S. commentary further widened the gap: his statement that equities look “fairly highly valued” supported the case for a stronger dollar, underpinning downside momentum in GBP/USD. Unless UK data surprise to the upside, the policy divergence suggests further risk toward 1.34 or below.\nSterling’s Technical Landscape Shows Sellers in Control\nThe technical picture leaves little doubt that momentum is bearish. Having broken below both short- and medium-term moving averages, GBP/USD is tracking toward 1.3400, where a break could accelerate losses into 1.3333. The 21-day SMA at 1.3521 is now a first upside test for any rebound, while 1.3600 stands as a critical pivot that bulls would need to reclaim to shift sentiment. Traders watching intraday flows note that volumes have risen as the pair tested 1.3450–1.3430, suggesting strong conviction from sellers.\nRead More\n-\nAVUV ETF Forecast: Small-Cap Value ETF Holds $100.18 as Historic Spreads, Fed Policy, and Earnings Momentum Converge\n24.09.2025 · TradingNEWS ArchiveStocks\n-\nBitcoin ETF Inflows - BTC-USD at $113,600 as $246M Inflows Reverse to $363M Outflows\n24.09.2025 · TradingNEWS ArchiveCrypto\n-\nNatural Gas Price Forecast: Futures Steady at $2.858 as LNG Growth, EU Storage, and Winter Outlook Collide\n24.09.2025 · TradingNEWS ArchiveCommodities\n-\nUSD/JPY Price Forecast: Dollar-Yen at 148.78 as Fed Holds Cautious Tone and BoJ Faces Policy Divide\n24.09.2025 · TradingNEWS ArchiveForex\nRelative Currency Strength Adds Context\nSterling’s weakness is highlighted by cross-currency performance. The pound lost 0.68% against USD, 0.60% versus AUD, and 0.36% against CAD, while barely holding against the euro with a marginal -0.01% move. The dollar outperformed across the board, posting 0.74% gains versus JPY and 0.66% against EUR. This broad greenback strength emphasizes that cable’s weakness is not isolated but part of a wider dollar resurgence driven by Powell’s tone and renewed market caution.\nMacro Headwinds and Inflation Dynamics\nBeyond technicals, macro headwinds weigh on sterling. Sticky UK inflation keeps the BoE trapped, unable to pivot aggressively to support growth, yet not tightening enough to defend the pound. Meanwhile, U.S. data shows resilience, with Powell signaling the Fed can afford patience while retaining a hawkish tilt. This combination leaves GBP/USD exposed to downside risk in the short term. Analysts note that if sterling loses the $1.34 handle, momentum could"
            },
            {
                "title": "Pound Sterling Price News and Forecast: GBP/USD strengthens near 1.3460 in the Asian session - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/pound-sterling-price-news-and-forecast-gbp-usd-strengthens-near-13460-in-the-asian-session-202509250506",
                "body": "GBP/USD edges higher above 1.3450 as traders await Fedspeak, key US data\nThe GBP/USD pair recovers some lost ground to around 1.3460 during the Asian trading hours on Thursday. The US Dollar (USD) weakens against the Pound Sterling (GBP) as traders await more cues from the Fedspeak later on Tuesday. Also, the final print of the US Gross Domestic Product (GDP) growth for the second quarter (Q2), Durable Goods Orders and weekly Initial Jobless Claims will be published.\nTraders weighed the prospect of a Federal Reserve (Fed) easing cycle in the wake of a cautious tone from policymakers while awaiting data that may outline the impact of tariffs. Fed’s Powell struck a cautious tone on further easing on Tuesday, saying that the US central bank needs to continue balancing the competing risks of high inflation and a weak job market in coming policy decisions. Read more...\nGBP/USD flubs bullish recovery, falls back below key technical levels\nGBP/USD fumbled a near-term bullish correction on Wednesday, slipping back below the 50-day Exponential Moving Average (EMA) near 1.3500 and snapping a two-day winning streak. Broad-market risk appetite sharply reversed course heading through the midweek market session as investors weighed a looming US government shutdown and a rapidly approaching round of key US Personal Consumption Expenditure Price Index (PCE) inflation figures.\nCable tested its lowest bids in three weeks on Wednesday, retreating a little over one-half of one percent through the day’s market sessions. GBP/USD has fallen back below the 50-day EMA, but further declines should find a technical floor from the 1.3400 handle. Read more...\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice.\nRecommended content\nEditors’ Picks\nAUD/USD trade firm near 0.6600 amid a pause in the USD upswing\nAUD/USD is attempting another run to regain 0.6600 in the Asian session on Thursday. The US Dollar rally, led by easing expectations of an imminent Fed interest rate cut, takes a breather and allows the pair to recover some ground amid a quiet Asian economic docket.\nUSD/JPY turns lower toward 148.50, follows USD's footsteps\nUSD/JPY sees reneewed seling al"
            },
            {
                "title": "GBP/USD Forecast: Pound Sterling Holds Lower as Dollar Awaits GDP Jump - currencynews.co.uk",
                "source": "currencynews.co.uk",
                "url": "https://www.currencynews.co.uk/forecast/20250924-44116_gbp-usd-forecast-pound-sterling-holds-lower-as-dollar-awaits-gdp-jump.html",
                "body": "Known as one of the more hawkish voices on the MPC, a repeat of her warnings about slowing disinflation could hint at higher-for-longer rates and help steady Sterling.\nGBP/USD Forecasts: US Data to Steer Direction\nLooking to Thursday, US durable goods orders and second-quarter GDP figures are likely to set the tone.\nDurable goods are forecast to rebound from -2.8% to -0.5%, while GDP is expected to accelerate sharply from -0.5% to 3.3%.\nIf realised, the releases could give the Dollar fresh momentum.\nFor the Pound, focus will be on the CBI distributive trades survey. An improvement from -32 to -26 would still signal weak retail activity, but any upside surprise could lend Sterling modest support towards the end of the week.\nLike this piece? Please share with your friends and colleagues:\nInternational Money Transfer? Ask our resident FX expert a money transfer question or try John's new, free, no-obligation personal service! ,where he helps every step of the way,\nensuring you get the best exchange rates on your currency requirements."
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0053",
            "open": "0.6588",
            "close": "0.6581",
            "high": "0.6627",
            "low": "0.6574"
        },
        "market_summary": "The Australian Dollar is experiencing pressure from a resilient US Dollar, bolstered by Fed Chair Powell's cautious stance on rate cuts which emphasizes balancing inflation and labor market risks. However, the AUD is finding underlying support from stronger-than-expected Australian CPI data, which has significantly reduced expectations for an imminent RBA rate cut and highlighted a potential policy divergence between the two central banks. The pair is currently trading in a tight range as traders await key US data releases and the upcoming RBA meeting for further direction.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Australian Dollar weakens below 0.6600 on Fed Powell's cautious rate outlook - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/aud-usd-weakens-below-06600-on-fed-powells-cautious-rate-outlook-202509242338",
                "body": "- AUD/USD softens to around 0.6585 in Thursday’s early Asian session.\n- Fed’s Powell highlighted the balance between jobs and inflation.\n- Traders reduce their bets on an RBA rate cut after hotter Australia CPI inflation data.\nThe AUD/USD pair loses ground to near 0.6585 during the early Asian session on Thursday. The cautious rate outlook of the US Federal Reserve (Fed) Chair Jerome Powell provides some support to the US Dollar (USD) against the Australian Dollar (AUD). The final reading of the US Gross Domestic Product (GDP) for the second quarter (Q2) will be released later on Thursday.\nFed’s Powell struck a cautious tone on further easing on Tuesday, saying that the US central bank needs to continue balancing the competing risks of high inflation and a weak job market in coming policy decisions. His remarks lift the Greenback and create a headwind for the pair. Powell further stated that the interest rates are in a good place to deal with either threat, suggesting he sees no urgency to lower rates aggressively.\nOn Wednesday, San Francisco Fed President Mary Daly said that further rate reductions likely will be needed, as the central bank works to restore price stability and provide needed support to the labor market. Meanwhile, Chicago Fed President Austan Goolsbee warned against a series of rate cuts. Traders slightly pared back bets for a Fed rate cut by year-end to about 33%, according to LSEG data. Markets continue to expect no change to policy in the October meeting.\nOn the other hand, Australia’s monthly Consumer Price Index (CPI) inflation rose at the fastest annual pace in a year in August, suggesting some upside to inflation that prompted traders to pare back the bets of imminent policy easing. According to Reuters, prospects for a rate reduction at its November meeting faded to 50% from almost 70% before the data. This, in turn, could underpin the Aussie against the USD in the near term.\nAustralian Dollar FAQs\nOne of the most significant factors for the Australian Dollar (AUD) is the level of interest rates set by the Reserve Bank of Australia (RBA). Because Australia is a resource-rich country another key driver is the price of its biggest export, Iron Ore. The health of the Chinese economy, its largest trading partner, is a factor, as well as inflation in Australia, its growth rate and Trade Balance. Market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – is also a factor, with risk-on positive for AUD.\nThe Reserve Bank of Australia (RBA) influences the Australian Dollar (AUD) by setting the level of interest rates that Australian banks can lend to each other. This influences the level of interest rates in the economy as a whole. The main goal of the RBA is to maintain a stable inflation rate of 2-3% by adjusting interest rates up or down. Relatively high interest rates compared to other major central banks support the AUD, and the opposite for relatively low. The RBA can also use quantitative easing and tightening to influence credit conditions, with the former AUD-negative and the latter AUD-positive.\nChina is Australia’s largest trading partner so the health of the Chinese economy is a major influence on the value of the Australian Dollar (AUD). When the Chinese economy is doing well it purchases more raw materials, goods and services from Australia, lifting demand for the AUD, and pushing up its value. The opposite is the case when the Chinese economy is not growing as fast as expected. Positive or negative surprises in Chinese growth data, therefore, often have a direct impact on the Australian Dollar and its pairs.\nIron Ore is Australia’s largest export, accounting for $118 billion a year according to data from 2021, with China as its primary destination. The price of Iron Ore, therefore, can be a driver of the Australian Dollar. Generally, if the price of Iron Ore rises, AUD also goes up, as aggregate demand for the currency increases. The opposi"
            },
            {
                "title": "AUD/USD Forecast: Upbeat CPI Overcomes Dollar’s Resilience - Forex Crunch",
                "source": "Forex Crunch",
                "url": "https://www.forexcrunch.com/blog/2025/09/24/aud-usd-forecast-upbeat-cpi-overcomes-dollars-resilience/",
                "body": "- AUD/USD forecast remains up as the pair climbs near 0.6630 amid stronger-than-expected Australian CPI data.\n- The Fed remains cautious on rate cuts, with Powell stressing inflation risks, while Bowman advocates for faster easing to protect the labor market.\n- The RBA is seen as more hawkish than the Fed, with Barclays forecasting the AUD/USD to break above its months-long trading range in Q4.\nThe AUD/USD price trades above the 0.6600 handle during the European session on Wednesday. The pair gains despite the dollar’s firm footing. The move came despite Fed Chair Powell’s remarks, who reiterated that the inflation risk remains high and the Fed might not rush into further rate cuts.\n–Are you interested in learning more about MT5 brokers? Check our detailed guide-\nThe US dollar index (DXY) gained above 97.00, reflecting a broader dollar resilience. Powell highlighted that the current interest rate range keeps the Fed well-positioned to respond to future developments, signaling flexibility but a reluctance to accelerate easing. Contrarily, Fed Governor Bowman argued for quicker rate cuts to cope with the softening labor market, revealing a divide within the FOMC.\nMeanwhile, the Australian dollar outperformed its peers as the Australian CPI data came in upbeat at 3% year-over-year (y/y), against the expected 2.9%. It marked the highest reading since July 2024, indicating sticky inflation and deterring the Reserve Bank of Australia from reducing rates at its next policy meeting.\nAccording to Barclays Bank, the AUD/USD is expected to break above the 0.64-0.66 range that has been in place for recent months. The bank cites higher commodity prices and a hawkish RBA as tailwinds, while the Fed looks to ease further.\nKey Events Ahead\n- RBA Policy Meeting (next week): The Market focuses on whether substantial CPI data delays expected rate cuts.\n- US Economic Data Releases (GDP, PCE inflation): Critical for Fed policy trajectory and USD strength.\n- November RBA Meeting: Markets still pricing in potential easing; inflation and labour market data will be decisive.\n- Fed Communication & November Meeting: Any signs of policy divergence between the Fed and RBA will be pivotal for AUD/USD direction.\nAUD/USD technical forecast: Corrective downside\nThe recent 2% pullback from the 17th September highs of 0.6700 to the 0.6570 area appears corrective, with a probability of posting another leg higher. The price stays above the confluence of 20- and 100-period MA on the 4-hour chart. However, the gains could be capped by a 50-period MA at 0.6630. The MAs signal consolidation as there’s no clear short-term trend.\n–Are you interested in learning more about forex signals telegram groups? Check our detailed guide-\nThe strong support is evident at the 200-period MA, located near 0.6550, while the ultimate resistance is positioned near 0.6700. The uptrend needs a catalyst to break out of consolidation.\nLooking to trade forex now? Invest at eToro!\n68% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money."
            },
            {
                "title": "AUD/USD slips to 0.6590 as Powell highlights dual mandate challenges - Mitrade",
                "source": "Mitrade",
                "url": "https://www.mitrade.com/insights/news/live-news/article-1-1146916-20250924",
                "body": "The Australian Dollar drops versus the US Dollar on Wednesday amid the lack of catalyst, following remarks by the Fed Chair Jerome Powell, who said that the Fed would continue to balance the dual mandate of the central bank. The AUD/USD trades at 0.6590, down 0.11%.\nOn Tuesday, Powell said that the policy path is difficult for the Fed, which must look at both goals of the dual mandate “equally,” pushing back against almost certain rate cuts coming in the subsequent meetings. Nevertheless, market participants seem confident that the US central bank will reduce rates twice towards the end of the year.\nPowell added that risks in the labor market had risen and that inflation remains somewhat elevated. He acknowledged that policy remains modestly restrictive, but “well positioned to respond to potential economic developments.”\nData-wise, New Home Sales in August improved sharply, from 0.664 million to 0.8 million, a 20.5% increase exceeding forecasts of 0.65 million. Although the data was positive, the latest S&P Global Purchasing Managers Index (PMI) prints in the services and manufacturing sector, indicating the economy is cooling.\nAhead, traders will eye the release of Jobless Claims, Gross Domestic Product (GDP) figures and the Fed’s inflation gauge, the Core PCE Price Index for August.\nIn Australia inflation metrics witnessed the CPI climbing from 2.8% to 3.0% — the top end of the RBA's target range. Consequently, the chances for additional easing by the Reserve Bank of Australia (RBA) remain slim, just at 8%. The RBA will meet next week on September 30, with markets participants expecting the bank to hold rates.\nThe technical picture suggests that the AUD/USD could test lower prices, despite hoovering around the 20-day SMA at 0.6593. Buyers need a daily close above 0.6600 so they could challenge daily highs of 0.6628 ahead of 0.6650. Conversely, a drop below the 20-day SMA clears the path to challenge weekly lows of 0.6574, before extending its losses to the 50-day SMA at 0.6538. the next support lies at the 100-day SMA a 0.6514.\nThe table below shows the percentage change of Australian Dollar (AUD) against listed major currencies this month. Australian Dollar was the strongest against the New Zealand Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Australian Dollar from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent AUD (base)/USD (quote)."
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "1.3980",
            "open": "147.5710",
            "close": "148.8850",
            "high": "148.9090",
            "low": "147.5110"
        },
        "market_summary": "The USD/JPY is strengthening, trading near 149.00, driven by a combination of a cautious Fed outlook that supports the US Dollar and weak Japanese economic data, including a contracting Manufacturing PMI. Political uncertainty in Japan and a divided BoJ, revealed in its meeting minutes, are contributing to the Yen's weakness. Key upcoming US data, including GDP and PCE, could influence the pair's near-term direction.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Japanese Yen tumbles below 149.00 ahead of BoJ Meeting Minutes - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-jpy-rises-above-14850-ahead-of-boj-meeting-minutes-202509242300",
                "body": "- USD/JPY gathers strength around 148.80 in Thursday’s early Asian session.\n- Fed Powell's cautious rate outlook boosts the US Dollar.\n- BoJ Meeting Minutes and the final reading of the US Q2 GDP report will be the highlights later on Thursday.\nThe USD/JPY pair rises to near 148.80 during the early Asian session on Thursday. The US Dollar (USD) strengthens to near its highest in three weeks against the Japanese Yen (JPY) due to a fresh round of risk aversion across the financial markets and a cautious tone from the US central bank.\nFederal Reserve (Fed) Chair Jerome Powell struck a cautious tone on further easing on Tuesday, supporting the Greenback. Powell said that the Fed needs to continue balancing the competing risks of high inflation and a weakening job market in its upcoming rate decisions. He added that the interest rates are in a good place to deal with either threat, suggesting he sees no urgency to lower rates aggressively.\nFinancial markets anticipate quarter-point rate cuts at the remaining two Fed meetings this year and another in the first quarter of 2026, in line with the Fed's guidance after last week's meeting.\nThe S&P Global flash Japan Manufacturing Purchasing Managers' Index (PMI) fell at the fastest pace in six months in September, which dragged the JPY lower. Additionally, concerns over political uncertainty in Japan ahead of the Liberal Democratic Party (LDP) leadership election scheduled for October 4 could prompt the Bank of Japan (BoJ) to delay raising interest rates. This, in turn, might contribute to the JPY’s downside.\nTraders will keep an eye on the Bank of Japan (BoJ) Meeting Minutes and the final reading of US Gross Domestic Product (GDP) for the second quarter (Q2), which is due later on Thursday. Any signs of weakness in the US economy could undermine the USD against the JPY in the near term.\nJapanese Yen FAQs\nThe Japanese Yen (JPY) is one of the world’s most traded currencies. Its value is broadly determined by the performance of the Japanese economy, but more specifically by the Bank of Japan’s policy, the differential between Japanese and US bond yields, or risk sentiment among traders, among other factors.\nOne of the Bank of Japan’s mandates is currency control, so its moves are key for the Yen. The BoJ has directly intervened in currency markets sometimes, generally to lower the value of the Yen, although it refrains from doing it often due to political concerns of its main trading partners. The BoJ ultra-loose monetary policy between 2013 and 2024 caused the Yen to depreciate against its main currency peers due to an increasing policy divergence between the Bank of Japan and other main central banks. More recently, the gradually unwinding of this ultra-loose policy has given some support to the Yen.\nOver the last decade, the BoJ’s stance of sticking to ultra-loose monetary policy has led to a widening policy divergence with other central banks, particularly with the US Federal Reserve. This supported a widening of the differential between the 10-year US and Japanese bonds, which favored the US Dollar against the Japanese Yen. The BoJ decision in 2024 to gradually abandon the ultra-loose policy, coupled with interest-rate cuts in other major central banks, is narrowing this differential.\nThe Japanese Yen is often seen as a safe-haven investment. This means that in times of market stress, investors are more likely to put their money in the Japanese currency due to its supposed reliability and stability. Turbulent times are likely to strengthen the Yen’s value against other currencies seen as more risky to invest in.\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any "
            },
            {
                "title": "USD/JPY Price Forecast: Pair Climbs to 148.78 as Fed Caution, Weak Japan PMI and BoJ Minutes Drive Volatility - tradingnews.com",
                "source": "tradingnews.com",
                "url": "https://www.tradingnews.com/news/usd-jpy-price-forecast-dollar-yen-at-148-as-fed-holds-cations-tone-and-boj-faces",
                "body": "USD/JPY Price Forecast: Dollar-Yen at 148.78 as Fed Holds Cautious Tone and BoJ Faces Policy Divide\nThe yen weakens as U.S. dollar strength returns, Japan’s factory activity contracts, and BoJ minutes reveal hawkish dissent, leaving USD/JPY trapped between 147.00 support and 150.00 resistance | That's TradingNEWS\nUSD/JPY Price Forecast: Pair Trades Near 148.80 as Fed Caution Meets BoJ Uncertainty\nDollar Strength Pushes USD/JPY Toward 149.00\nThe USD/JPY pair advanced to 148.78, its highest level since early September, gaining almost 0.80% intraday. The move was driven by renewed U.S. dollar strength following Jerome Powell’s warning that “there is no risk-free path” in balancing inflation and employment. His cautious stance limited expectations of aggressive rate cuts, reinforcing near-term support for the greenback. The broader dollar index (DXY) also climbed 0.65% to 97.52, giving USD/JPY enough momentum to test resistance levels near the 148.65–150.00 corridor.\nJapanese PMIs Deepen Yen Weakness\nThe yen’s weakness accelerated after Japanese data showed the Manufacturing PMI fell to 48.4, from 49.7 in August, well below forecasts of 50.2. The services sector remained in expansion, but only modestly, at 53.0 versus 53.1 previously. These figures highlight the challenge facing the Bank of Japan: while inflation edges closer to its 2% target, weak factory activity and uneven growth make aggressive rate hikes politically and economically difficult. Market attention now turns to the upcoming BoJ meeting minutes, which revealed a 7–2 vote with two members pushing for a 25 bps hike, showing deep policy divisions inside the board.\nFed-BoJ Divergence Creates Tense Standstill\nThe policy divergence remains the critical driver. The Federal Reserve is leaning toward two more cuts before the end of 2025, but Powell’s remarks kept traders cautious. Meanwhile, the BoJ is under pressure as Governor Kazuo Ueda admitted inflation is “approaching 2%,” while risks from food prices and U.S. tariffs persist. This split between a Fed pivot and possible BoJ tightening should, in theory, weigh on USD/JPY, yet price action has resisted downside, signaling strong speculative positioning and carry trade demand above 145.00.\nKey Technical Levels for USD/JPY\nUSD/JPY faces stiff resistance in the 148.65–150.00 zone, a band that capped rallies earlier this year and during July’s failed breakout. A decisive close above 150.77 would shift sentiment firmly bullish. On the downside, support lies at 147.00, followed by 146.00 trendline support, and deeper at 145.00, where liquidity from prior lows rests. Technical momentum is consolidating with multiple weekly doji candles, indicating indecision before a likely sharp move. The 200-day moving average continues to cap rallies, maintaining a medium-term bearish tilt unless broken convincingly.\nRead More\n-\nAVUV ETF Forecast: Small-Cap Value ETF Holds $100.18 as Historic Spreads, Fed Policy, and Earnings Momentum Converge\n24.09.2025 · TradingNEWS ArchiveStocks\n-\nBitcoin ETF Inflows - BTC-USD at $113,600 as $246M Inflows Reverse to $363M Outflows\n24.09.2025 · TradingNEWS ArchiveCrypto\n-\nNatural Gas Price Forecast: Futures Steady at $2.858 as LNG Growth, EU Storage, and Winter Outlook Collide\n24.09.2025 · TradingNEWS ArchiveCommodities\n-\nGBP/USD Price Forecast: Pound to Dollar Slips to $1.3435 as Dollar Strengthens, 1.3400 Support in Focus\n24.09.2025 · TradingNEWS ArchiveForex\nMarket Risks and Event Triggers\nUpcoming U.S. GDP revisions, durable goods data, and the Core PCE inflation index later this week are likely catalysts. In Japan, Tokyo CPI on Friday will be pivotal: a reading above expectations could give the BoJ more confidence to tighten, potentially weighing on USD/JPY. Political uncertainty also looms, with leadership contenders like Sanae Takaichi warning about the risks of higher mortgage costs if the BoJ hikes prematurely. Traders remain wary of a sudden policy shock, similar to past yen interventions when U"
            },
            {
                "title": "EUR/USD, USD/JPY Forecast: Two trades to watch - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/eur-usd-usd-jpy-forecast-two-trades-to-watch-09-24-25/?amp=true",
                "body": "EUR/USD, USD/JPY Forecast: Two trades to watch\nEUR/USD falls as German business morale weakens & on a stronger USD.\n- German IFO business sentiment fell to 87.7 from 89\n- Eurozone Composite PMI rose to a 16-month high\n- EUR/USD eases below 1.18\nEUR/USD is falling modestly after weaker-than-forecast German IFO business sentiment and amid renewed USD strength following Fed Powell’s cautious tone yesterday.\nGerman IFO business sentiment unexpectedly fell in September to 87.7, down from a yearly high of 89 in August and below forecasts of 89.3. The current assessment also declined to 85.7, down from 86.4.\nThe data followed PMI figures released yesterday, which showed that business activity in the eurozone rose to a 16-month high in September thanks to a stronger service sector.\nWith inflation in the region at the target 2% level and growth stagnant the ECB left rates unchanged for a second month in September and may not cut rates again this year. This divergence from the Fed is keeping the EUR/USD supported.\nThe market is still pricing in two more rate cuts from the Fed this year, even after Powell struck a more cautious tone in his speech.\nEUR/USD forecast -technical analysis\nEUR/USD broke out of its rising trendline resistance, rising to a peak of 1.1915 before easing back below 1.18. The price trades above the rising trendline but is struggling to retake 1.1830, the July high. Buyers need to break above this level to extend the bullish trend towards 1.1920.\nFailure to rise above 1.1830 could see the price fall lower, breaking below the near-term rising trendline support to test the 1.17 round number. Below here 1.1580 comes into play.\nUSD/JPY rises amid a firmer USD as Powell adopts a cautious tone to further cuts\n- Fed Powell reiterated the fine balance between jobs and inflation\n- Japanese PMIs weakened, BoJ minutes are up next\n- USD/JPY trades in a range, approaching 148\nThe USD/JPY is rising amid a weaker yen, following softer-than-expected PMI data and as the USD steadies after two days of losses. This is due to Federal Reserve Chair Jerome Powell adopting a cautious stance in his speech towards potential rate cuts.\nFed Chair Powell adopted a cautious stance on further monetary policy easing, emphasizing the delicate balance between jobs and inflation. His comments fell short of the markets' more dovish expectations after the sharp weakening in the US labour market; however, traders have retained bets for two more interest rate cuts this year in line with the Fed's dot plot at the meeting last week.\nToday's attention is on U.S. new home sales and a speech from Federal Reserve official Mary Daly. Tomorrow sees the release of US GDP data, initial jobless claims, and more Fed speakers, as well as the US core PCE on Friday, which could make for a busy end to the week for the US dollar.\nThe Japanese yen is falling after the manufacturing and service sector PMI was weaker than expected. The manufacturing PMI showed a deeper contraction of 48.4, down from 49.7, while the services PMI saw growth slow modestly to 53 in September, down from 53.1. The data adds to the uncertainty surrounding Bank of Japan rate hikes.\nTraders are also assessing candidates for the position of Japanese Prime Minister. One of the front-runners, Takaichi, also a fiscal and monetary dove, noted that higher rates could impact mortgage rates and corporate investment.\nBank of Japan meeting minutes are due later. The minutes are from the meeting where the BoJ left policy unchanged last week; however, a growing division among policy members has led to hawkish signals, prompting investors to speculate about whether the BoJ will hike rates next month.\nUSD/JPY forecast – technical analysis\nUSD/JPY trades within a holding pattern, capped by the 200 SMA on the upside and by 146.25 on the downside. This setup is for a breakout trade.\nBuyers will look to rise above the 200 SMA and horizontal resistance at 148.50 to extend gains towards 150, the round number.\nSellers w"
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0078",
            "open": "1.3831",
            "close": "1.3893",
            "high": "1.3906",
            "low": "1.3828"
        },
        "market_summary": "The USD/CAD has rallied to a fresh monthly high, driven by a combination of USD strength and CAD weakness. The US Dollar found strength as the Fed's rate cut was perceived as less dovish than expected, while the Bank of Canada's cut and dovish signals have reduced the appeal of the Canadian Dollar. This dynamic, coupled with softer Canadian domestic data, has pushed the pair to test key resistance levels.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Canadian Dollar Forecast: USD/CAD Rally to Monthly High - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/canadian-dollar-forecast-usd-cad-usdcad-rally-to-monthly-high/?amp=true",
                "body": "Canadian Dollar Forecast: USD/CAD Rally to Monthly High\nCanadian Dollar, USD/CAD Talking Points:\n- USD/CAD has jumped up to a fresh monthly high today.\n- The pair remains one of the more attractive major FX pairs for USD-strength, as followed over the past month and change.\n- Last week saw rate cuts from both the Fed and BoC, but USD/CAD held a higher-low by one-tenth of a pip, and that higher-low has allowed for a strong rally up to a key resistance zone.\n- I’ve been tracking this setup closely in webinars, and you’re welcome to join the next. Click here to register.\nUSD/CAD is at a fresh monthly high this morning and that extends the sequence following last week’s hold of a higher-low on Fed and BoC day.\nWhile both central banks cut rates, the response in the USD so far has been strength as the Fed was slightly less dovish than what markets had priced in. Markets were looking for 50-75 bps in cuts next year and the Fed instead indicated that they’re looking at 25 bps; so even though the bank cut rates and highlighted another 50 bps in cuts for this year, USD shorts have been squeezed with the US dollar pushing back up to an area of resistance at prior support.\nAs followed for most of Q3, USD/CAD remains one of the more attractive venues for USD-strength and that’s something that can even be dialed back to last quarter, as USD/CAD was setting higher-lows even as DXY was setting fresh lows.\nUSD/CAD built an ascending triangle formation as those higher-lows went along with horizontal resistance at 1.3750 – and that formation gave way in late-July. It’s what happened after that makes matters more interesting, however, as that prior resistance of 1.3750 became support with bulls holding successively higher-lows, even into last week’s pullback around the Fed and BoC rate decisions.\nAs tracked in the webinar on the Tuesday before, the big test was whether buyers could hold a higher-low, illustrating a degree of bullish anticipation. And that’s precisely what happened, with last Wednesday’s low printing just one-tenth of one pip, aka a ‘pipette’ above the prior swing low. And as USD strength has come back in the aftermath of the Fed meeting, USD/CAD has shined with prices rallying up to resistance.\nUSD/CAD Daily Chart\nChart prepared by James Stanley; data derived from Tradingview\nUSD/CAD Bigger Picture\nAt this point there’s a few important USD markets testing key spots, such as EUR/USD and GBP/USD, not to mention USD/JPY. Whether the Dollar can continue to breakout will likely have something to do whether those majors markets can see greater forms of breakdowns or breakouts, but if we can see USD bulls continuing to push, USD/CAD remains situated in an attractive spot with the 1.4000 level lurking overhead as the next key zone of resistance potential.\nAbove that, it’s the 1.4151-1.4178 zone of resistance-turned-support and that’s also around the 50% mark of the earlier-year sell-off. If that comes into play at some point in Q4, that becomes a significant decision point for the pair.\nOn a shorter-term basis, the 23.6% Fibonacci retracement of that same major move remains of interest for possible support and that plots at 1.3638.\nUSD/CAD Weekly Price Chart\nChart prepared by James Stanley; data derived from Tradingview\n--- written by James Stanley, Senior Strategist\nThe information on this web site is not targeted at the general public of any particular country. It is not intended for distribution to residents in any country where such distribution or use would contravene any local law or regulatory requirement. The information and opinions in this report are for general information use only and are not intended as an offer or solicitation with respect to the purchase or sale of any currency or CFD contract. All opinions and information contained in this report are subject to change without notice. This report has been prepared without regard to the specific investment objectives, financial situation and needs of any particular recipie"
            },
            {
                "title": "USD/CAD holds losses below 1.3900 ahead of US Q2 GDP Annualized - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-cad-holds-losses-below-13900-ahead-of-us-q2-gdp-annualized-202509250238",
                "body": "- USD/CAD depreciates as the US Dollar weakens ahead of Q2 GDP Annualized data.\n- San Francisco Fed’s Daly said more rate cuts may be needed to restore price stability and support jobs.\n- BoC Governor Tiff Macklem said that Canada needs to take a “more independent path” from the US.\nUSD/CAD halts its three-day winning streak, trading around 1.3890 during the Asian hours on Thursday. The pair loses ground as the US Dollar (USD) corrects downwards after registering more than 0.5% gains in the previous session.\nTraders would likely observe the upcoming US Q2 Gross Domestic Product Annualized later in the day. Focus will shift toward Personal Consumption Expenditures (PCE) Price Index data, the Federal Reserve’s preferred inflation gauge, due later on Friday.\nThe US Dollar gained ground as the US Federal Reserve (Fed) Chair Jerome Powell struck a cautious note, stressing that the US central bank must weigh stubborn inflation against a softening job market, calling it “a challenging situation” and reiterating comments from last week. However, the CME FedWatch tool suggests that money markets are currently pricing in nearly a 92% possibility of a Fed rate cut in October, up from 87% a week earlier.\nSan Francisco Fed President Mary Daly said on Wednesday that further rate reductions are likely to be needed, as the central bank works to restore price stability and provide necessary support to the labor market. Chicago Fed President Austan Goolsbee broke away from the overarching narrative of consecutive Fed rate cuts heading through the end of the year, widening the narrative gap between Fed incumbents and Donald Trump's newly minted Fed pick, Stephen Miran.\nBank of Canada (BoC) Governor Tiff Macklem said Monday that Canada must pursue a “more independent course” from the US, citing the Dollar’s weakness and warning of systemic risks from shifting global trade and financial flows.\nCanadian Dollar FAQs\nThe key factors driving the Canadian Dollar (CAD) are the level of interest rates set by the Bank of Canada (BoC), the price of Oil, Canada’s largest export, the health of its economy, inflation and the Trade Balance, which is the difference between the value of Canada’s exports versus its imports. Other factors include market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – with risk-on being CAD-positive. As its largest trading partner, the health of the US economy is also a key factor influencing the Canadian Dollar.\nThe Bank of Canada (BoC) has a significant influence on the Canadian Dollar by setting the level of interest rates that banks can lend to one another. This influences the level of interest rates for everyone. The main goal of the BoC is to maintain inflation at 1-3% by adjusting interest rates up or down. Relatively higher interest rates tend to be positive for the CAD. The Bank of Canada can also use quantitative easing and tightening to influence credit conditions, with the former CAD-negative and the latter CAD-positive.\nThe price of Oil is a key factor impacting the value of the Canadian Dollar. Petroleum is Canada’s biggest export, so Oil price tends to have an immediate impact on the CAD value. Generally, if Oil price rises CAD also goes up, as aggregate demand for the currency increases. The opposite is the case if the price of Oil falls. Higher Oil prices also tend to result in a greater likelihood of a positive Trade Balance, which is also supportive of the CAD.\nWhile inflation had always traditionally been thought of as a negative factor for a currency since it lowers the value of money, the opposite has actually been the case in modern times with the relaxation of cross-border capital controls. Higher inflation tends to lead central banks to put up interest rates which attracts more capital inflows from global investors seeking a lucrative place to keep their money. This increases demand for the local currency, which in Canada’s case is the Canadian Dol"
            },
            {
                "title": "Canadian Dollar Drops to 4-Month Low - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/te_news:487702:0-canadian-dollar-drops-to-4-month-low/",
                "body": "Canadian Dollar Drops to 4-Month Low\nThe Canadian dollar weakened past 1.39 per US dollar in late September to a four-month low amid softer domestic data and a firmer US dollar removed the carry case for the loonie.\nMarkets repriced a more aggressive BoC easing path after the Bank cut its policy rate and signalled scope for more easing, which reduced the appeal of CAD fixed income.\nAt the same time August headline CPI stood at 1.9% and core measures broadly held steady, giving the BoC room to ease and lowering the incentive for foreign capital to stay.\nA preliminary retail estimate pointing to roughly a 1.0% rebound in August provided some support but was not enough to reverse expectations of further rate relief.\nGovernor Macklem’s recent comments that tariff shocks and weak productivity weigh on growth reinforced the view that policy must balance slowing momentum with inflation dynamics.\nFinally the US dollar strengthened after Fed commentary that highlighted two sided risks to inflation and the labour market."
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "0.8920",
            "open": "199.5010",
            "close": "200.2020",
            "high": "200.2280",
            "low": "199.3360"
        },
        "market_summary": "The GBP/JPY pair is consolidating near the key 200.00 level amid conflicting fundamental pressures. The Yen is finding support from hawkish BoJ minutes signaling confidence in future policy tightening, while the Pound is being capped by dovish commentary from BoE officials, including Governor Bailey, who sees scope for further rate cuts. Upcoming Tokyo CPI data is a critical near-term catalyst that could drive Yen strength if it shows accelerating inflation.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "GBP/JPY ticks down to near 200.00, investor await Tokyo CPI data - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-ticks-down-to-near-20000-investor-await-tokyo-cpi-data-202509250531",
                "body": "- GBP/JPY falls marginally to near 200.00 after the release of BOJ policy minutes of the July meeting.\n- BoJ minutes showed that officials are confident about tightening the monetary policy further in the near term.\n- BoE’s Greene warns of upside inflation risks and urges caution on interest rate cuts.\nThe GBP/JPY pair edges lower to near 200.00 during the late Asian trading session on Thursday. The pair ticks down as the Japanese Yen (JPY) trades higher, following the release of the Bank of Japan (BoJ) Monetary Policy minutes of the July meeting released earlier in the day.\nJapanese Yen Price Today\nThe table below shows the percentage change of Japanese Yen (JPY) against listed major currencies today. Japanese Yen was the strongest against the New Zealand Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Japanese Yen from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent JPY (base)/USD (quote).\nLast week, the BoJ held interest rates steady at 0.5% and kept the door open for further monetary policy tightening.\nGoing forward, investors will focus on the Tokyo Consumer Price Index (CPI) data for September, which will be published on Friday. Tokyo CPI ex. Fresh Food is expected to have grown at an annual pace of 2.8%, faster than 2.5% in August.\nSigns of price pressures accelerating would prompt speculation for an interest rate hike by the BoJ in the near term.\nMeanwhile, the Pound Sterling (GBP) trades broadly calm as investors look for fresh cues about whether the Bank of England (BoE) will cut interest rates further this year. According to Reuters, the BoE will hold borrowing rates steady in the remainder of the year.\nOn Wednesday, BoE Monetary Policy Committee (MPC) member Megan Greene stated that the central bank needs to exercise caution on interest rate cuts as “risks to our inflation outlook have shifted to the upside”, Reuters reported.\nJapanese Yen FAQs\nThe Japanese Yen (JPY) is one of the world’s most traded currencies. Its value is broadly determined by the performance of the Japanese economy, but more specifically by the Bank of Japan’s policy, the differential between Japanese and US bond yields, or risk sentiment among traders, among other factors.\nOne of the Bank of Japan’s mandates is currency control, so its moves are key for the Yen. The BoJ has directly intervened in currency markets sometimes, generally to lower the value of the Yen, although it refrains from doing it often due to political concerns of its main trading partners. The BoJ ultra-loose monetary policy between 2013 and 2024 caused the Yen to depreciate against its main currency peers due to an increasing policy divergence between the Bank of Japan and other main central banks. More recently, the gradually unwinding of this ultra-loose policy has given some support to the Yen.\nOver the last decade, the BoJ’s stance of sticking to ultra-loose monetary policy has led to a widening policy divergence with other central banks, particularly with the US Federal Reserve. This supported a widening of the differential between the 10-year US and Japanese bonds, which favored the US Dollar against the Japanese Yen. The BoJ decision in 2024 to gradually abandon the ultra-loose policy, coupled with interest-rate cuts in other major central banks, is narrowing this differential.\nThe Japanese Yen is often seen as a safe-haven investment. This means that in times of market stress, investors are more likely to put their money in the Japanese currency due to its supposed reliability and stability. Turbulent times are likely to strengthen the Yen’s value against other currencies seen as more risky to invest in.\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instr"
            },
            {
                "title": "GBP/JPY Price Forecast: Surpasses 200.00 as soft Japan PMIs weigh on Yen - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/amp/news/gbp-jpy-price-forecast-surpasses-20000-as-soft-japan-pmis-weigh-on-yen-202509242310",
                "body": "GBP/JPY Price Forecast: Surpasses 200.00 as soft Japan PMIs weigh on Yen\n|- GBP/JPY clears 20-day SMA at 199.67, setting up bullish continuation above the 200.00 mark.\n- RSI turns positive, suggesting buyers may push toward 200.50, 201.00, and yearly high at 201.27.\n- Downside risks emerge on a drop below 200.00, with key support at 199.67 and 50-day SMA near 198.97.\nThe GBP/JPY advances over 0.22% on Wednesday after the Japanese Yen weakened on softer Flash PMIs reported. At the time of writing, the cross-pair trades at 200.16 after hitting a daily low of 199.46.\nGBP/JPY Price Forecast: Technical outlook\nTechnically, the GBP/JPY is poised to test higher prices. After clearing the 20-day Simple Moving Average (SMA) at 199.67, the cross is set to end the day above 200.00, which paves the way for further upside.\nThe Relative Strength Index (RSI) is bullish, an indication that buyers are gathering steam.\nTherefore, if GBP/JPY rises above 200.50, the next area of interest would be 201.00, ahead of the yearly high of 201.27. On further strength, the next ceiling level would be 202.00. Conversely, if the cross-pair retreats below 200.00, the first support would be the 20-day SMA at 199.67. A breach of the latter will expose the 50-day SMA at 198.97, ahead of the 100-day SMA at 197.49.\nGBP/JPY Price Chart – Daily\nPound Sterling FAQs\nThe Pound Sterling (GBP) is the oldest currency in the world (886 AD) and the official currency of the United Kingdom. It is the fourth most traded unit for foreign exchange (FX) in the world, accounting for 12% of all transactions, averaging $630 billion a day, according to 2022 data. Its key trading pairs are GBP/USD, also known as ‘Cable’, which accounts for 11% of FX, GBP/JPY, or the ‘Dragon’ as it is known by traders (3%), and EUR/GBP (2%). The Pound Sterling is issued by the Bank of England (BoE).\nThe single most important factor influencing the value of the Pound Sterling is monetary policy decided by the Bank of England. The BoE bases its decisions on whether it has achieved its primary goal of “price stability” – a steady inflation rate of around 2%. Its primary tool for achieving this is the adjustment of interest rates. When inflation is too high, the BoE will try to rein it in by raising interest rates, making it more expensive for people and businesses to access credit. This is generally positive for GBP, as higher interest rates make the UK a more attractive place for global investors to park their money. When inflation falls too low it is a sign economic growth is slowing. In this scenario, the BoE will consider lowering interest rates to cheapen credit so businesses will borrow more to invest in growth-generating projects.\nData releases gauge the health of the economy and can impact the value of the Pound Sterling. Indicators such as GDP, Manufacturing and Services PMIs, and employment can all influence the direction of the GBP. A strong economy is good for Sterling. Not only does it attract more foreign investment but it may encourage the BoE to put up interest rates, which will directly strengthen GBP. Otherwise, if economic data is weak, the Pound Sterling is likely to fall.\nAnother significant data release for the Pound Sterling is the Trade Balance. This indicator measures the difference between what a country earns from its exports and what it spends on imports over a given period. If a country produces highly sought-after exports, its currency will benefit purely from the extra demand created from foreign buyers seeking to purchase these goods. Therefore, a positive net Trade Balance strengthens a currency and vice versa for a negative balance.\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment d"
            },
            {
                "title": "GBP/JPY trades sideways as BoE Bailey sees scope for lower rates - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-trades-sideways-as-boe-bailey-sees-scope-for-lower-rates-202509241448",
                "body": "- GBP/JPY trades sideways, consolidating recent gains after Tuesday’s dip to its weakest level since September 9.\n- Japan’s flash PMI showed manufacturing contracting further, while services activity held firm.\n- BoE Governor Bailey struck a dovish tone, signaling further rate cuts ahead and citing softer labor market conditions.\nThe British Pound (GBP) trades sideways against the Japanese Yen (JPY) on Wednesday, with GBP/JPY modestly higher, rebounding after briefly slipping to its lowest level since September 9 on Tuesday. At the time of writing, the cross is hovering around 200.00, holding onto recent gains but struggling to extend the advance.\nBank of England (BoE) Governor Andrew Bailey struck a dovish note on Tuesday, limiting Sterling’s recovery. Speaking in the West Midlands, Bailey said that interest rates still have “some further journey downward,” but the pace of easing will depend on the trajectory of inflation, which the central bank expects to fall further next year. He acknowledged signs of softening in the labor market and noted that monetary policy remains restrictive at present.\nOn the Japanese side, the latest Jibun Bank flash Purchasing Managers Index (PMI) data offered mixed signals. The Manufacturing PMI slipped deeper into contraction at 48.4 in September, down from 49.7 in August and below the 50.2 forecast, highlighting persistent weakness in factory activity and export demand. However, the Services PMI held firm at 53, only slightly lower than 53.1 in August, keeping the composite index in expansion territory at 51.1.\nAccording to Jingyi Pan, Economics Associate Director at S&P Global Market Intelligence, “Japan’s private sector business activity expanded at the slowest pace in four months in September, according to the flash PMI. Selling price inflation increased at a more pronounced pace, pointing to higher consumer price inflation in the coming months.” Pan added that the survey highlights a dilemma for the Bank of Japan (BoJ), with weakening growth momentum on one hand and rising price pressures on the other.\nLooking ahead, attention will turn to upcoming central bank cues and key data releases. BoE policymaker Megan Greene is scheduled to speak later on Wednesday. In Japan, the BoJ’s Monetary Policy Meeting Minutes are due on Thursday, followed by Tokyo Consumer Price Index (CPI) figures on Friday.\nEconomic Indicator\nBoJ Monetary Policy Meeting Minutes\nThe Bank of Japan publishes a study of economic movements in Japan after the actual meeting. These meetings are held to review economic developments inside and outside of Japan and indicate a sign of new fiscal policy. Any changes in this report tend to affect the JPY volatility. Generally speaking, if the BoJ minutes show a hawkish outlook, that is seen as positive (or bullish) for the JPY, while a dovish outlook is seen as negative (or bearish).\nRead more.Next release: Wed Sep 24, 2025 23:50\nFrequency: Irregular\nConsensus: -\nPrevious: -\nSource: Bank of Japan\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held re"
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "3,020.0000",
            "open": "111,992.5000",
            "close": "113,556.5000",
            "high": "114,013.5000",
            "low": "110,993.5000"
        },
        "market_summary": "The market is experiencing significant institutional evolution with the SEC's approval of new, diversified crypto ETFs like Hashdex's, streamlining the listing process and paving the way for a wave of new products. This expansion is met with innovative financial instruments, such as Tuttle Capital's 0DTE options ETF on IBIT, which caters to sophisticated trading strategies. However, this growth is juxtaposed with recent volatility in Bitcoin ETF flows, where a $246M inflow was quickly reversed by a $363M outflow, indicating active institutional rebalancing and a potential shift of focus towards other assets like Ethereum ETFs, which saw substantial inflows.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "SEC approves Hashdex Nasdaq ETF to hold BTC, ETH, XRP, SOL, and XLM - Mitrade",
                "source": "Mitrade",
                "url": "https://www.mitrade.com/insights/news/live-news/article-3-1148005-20250925",
                "body": "The SEC has officially approved the Hashdex Nasdaq Crypto Index US ETF to operate under new generic listing standards, giving it the greenlight to add XRP, SOL, and XLM to its existing portfolio of BTC and ETH.\nThe ETF, listed as NASDAQ:NCIQ, made the change last Thursday after updating its trust structure to meet the new criteria. The revised setup, filed under Form 8-K on Wednesday, includes a “Third Amended and Restated Trust Agreement” signed by Hashdex Asset Management Ltd. and CSC Delaware Trust Company, replacing the previous second agreement.\nThe ETF, built in Delaware, is tagged as an “emerging growth company.” The filing didn’t show any changes to its fiscal year or include any new financial documents. The updated trust agreement was attached as an exhibit to the filing, confirming compliance with Nasdaq’s current listing demands.\nFollowing the SEC’s vote to adopt the updated listing standards last week, several asset managers have kicked into gear. These new rules let qualified crypto ETFs skip the case-by-case review process, something that used to drag on for months. Under the old rules, approval could take as long as 270 days. Now, with the new setup, products can be cleared in as little as 75 days.\n“We’ve got about a dozen filings with the SEC now, and more coming,” said Steven McClurg, founder of Canary Capital Group. He confirmed that asset managers are already lining up, ready to take advantage of the rule change. “We’re all getting ready for a wave of launches,” he said. That wave is expected to hit hard in Q4 2025, according to Jonathan Groth at DGIM Law, who called this period a likely “boom time” for crypto ETFs.\nThe rush began in July, when the SEC first proposed the changes. Since then, firms have scrambled to rewrite filings, address SEC feedback, and meet the updated standards. Sources familiar with the process say the final updates could be submitted by the end of the week.\n“These are the rules we had been anticipating,” said Teddy Fusaro, president of Bitwise. Fusaro says most filings are nearing the end of the review phase and could hit the market shortly. Analysts expect ETFs tracking SOL and XRP to debut in early October.\nTo qualify for the new approval process, ETFs must meet at least one of three main requirements. One, the coin involved must trade on a regulated exchange, or have CFTC-regulated futures contracts that’ve been active for at least six months. Two, another ETF must already hold that coin with 40% of its assets directly invested in it, not via swaps or options. If any of those conditions are met, the ETF skips the red tape.\nBut not every firm is ready to roll. “Not all of our existing filings qualify,” said Kyle DaCruz, head of digital assets at VanEck. “The next step is to talk to our lawyers to see which products can move forward and how rapidly will they get onto the market.”\nThat said, Grayscale Investments didn’t wait around. Less than 48 hours after the SEC’s announcement, it converted its private fund into a public product: the Grayscale CoinDesk Crypto 5 ETF (GDLC.P). This new ETF holds BTC, ETH, XRP, SOL, and cardano. According to Peter Mintzberg, CEO of Grayscale, their quick launch reflects their push for “public market access, regulatory clarity and product innovation.”\nThe bigger question now is whether investors will actually care about ETFs tied to lesser-known coins. “There will be a flood of tokens that many folks have never heard of,” DaCruz warned. Unlike BTC, which took years to build trust, some of these coins may get only weeks or months of investor education before hitting the market.\nIf you're reading this, you’re already ahead. Stay there with our newsletter."
            },
            {
                "title": "Tuttle Capital launches zero day options strategy on BlackRock Bitcoin ETF - Crypto Briefing",
                "source": "Crypto Briefing",
                "url": "https://cryptobriefing.com/ibit-0dte-covered-call-etf-launch/",
                "body": "Tuttle Capital launches zero day options strategy on BlackRock Bitcoin ETF\nNew fund lets investors seek daily income on Bitcoin while sidestepping overnight price swings and rising volatility risks.\nKey Takeaways\n- IBIT 0DTE Covered Call ETF (BITK) launched today by Tuttle Capital.\n- BITK is the first zero-days-to-expiration covered call strategy ETF on BlackRock’s Bitcoin Trust (IBIT).\nShare this article\nBITK, Tuttle Capital’s IBIT 0DTE Covered Call ETF, began trading today as the first zero-days-to-expiration covered call strategy on BlackRock’s Bitcoin Trust. The daily-reset options product is designed to capture premiums on IBIT while avoiding overnight volatility.\nThe launch follows IBIT’s options trading debut in late 2024, where volumes reached $1.9 billion on the first day.\nThe ETF enables traders to generate daily income from Bitcoin options premiums, reflecting growing integration of Bitcoin derivatives into traditional ETF strategies.\nShare this article"
            },
            {
                "title": "Bitcoin ETF Inflows Swing: $246M Surge Followed by $363M Outflows as BTC Holds $113,600 - tradingnews.com",
                "source": "tradingnews.com",
                "url": "https://www.tradingnews.com/news/bitcoin-etf-inflows-btc-usd-at-113k-usd-as-246m-usd-inflows-reserve-to-363m-usd-outflows",
                "body": "Bitcoin ETF Inflows - BTC-USD at $113,600 as $246M Inflows Reverse to $363M Outflows\nInstitutional volatility dominates as Fidelity’s FBTC swings, BlackRock’s IBIT anchors, Ethereum ETFs capture $534M in a day, and XRP enters the ETF race—reshaping crypto’s $3.3T wealth landscape | That's TradingNEWS\nBitcoin ETF Inflows Surge and Reverse: Institutional Pressure Shapes BTC-USD Outlook\nRead More\n-\nAVUV ETF Forecast: Small-Cap Value ETF Holds $100.18 as Historic Spreads, Fed Policy, and Earnings Momentum Converge\n24.09.2025 · TradingNEWS ArchiveStocks\n-\nSolana Price Forecast: SOL-USD Holds $212 as $167M Institutional Buy and $12B Stablecoin Surge Offset Sell-Off\n24.09.2025 · TradingNEWS ArchiveCrypto\n-\nNatural Gas Price Forecast: Futures Steady at $2.858 as LNG Growth, EU Storage, and Winter Outlook Collide\n24.09.2025 · TradingNEWS ArchiveCommodities\n-\nUSD/JPY Price Forecast: Dollar-Yen at 148.78 as Fed Holds Cautious Tone and BoJ Faces Policy Divide\n24.09.2025 · TradingNEWS ArchiveForex\nEthereum ETFs Steal the Spotlight With $534M Inflows\nWhile Bitcoin funds saw redemptions, Ethereum ETFs quietly recorded $534 million in daily inflows, their third-best performance since launch. BlackRock’s ETHA ETF drew $363 million in one day, and Fidelity’s FETH has amassed $2.86 billion since debut. Ethereum ETF assets now total $30.54 billion, roughly 5.5% of ETH’s market cap, compared to Bitcoin ETFs’ ~$60.6 billion. This is shifting institutional preference: Ethereum now commands 15% of spot trading volume via ETFs, up from just 3% at launch in November 2024.\nXRP Joins the Regulated Arena With XRPR ETF Launch\nThe ETF wave is not confined to BTC and ETH. XRP (XRP-USD) gained momentum after the Osprey XRPR ETF debuted on Sept. 18, drawing $37.7 million in first-day volume—the strongest U.S. crypto ETF launch of 2025. Within 90 minutes, XRPR crossed $24 million traded, five times more than XRP futures ETFs ever managed. This institutional embrace positions XRP alongside BTC and ETH in the regulated ETF market, boosting its price back near $2.96 with speculative targets of $9.90–$20 flagged by analysts.\nCrypto Wealth Explosion: $3.3 Trillion Market Cap and 145,000 Bitcoin Millionaires\nETF flows are directly tied to the broader crypto wealth boom. According to Henley’s September 2025 report, global crypto millionaires rose 40% year-over-year to 241,700, with Bitcoin alone minting 145,100 millionaires, up 70%. Crypto centimillionaires now number 450 (+38% YoY) and billionaires hit 36 (+29% YoY). These figures correspond with ETF inflows: U.S. Bitcoin ETFs surged from $37.3B to $60.6B in assets year-to-date, while Ether ETFs quadrupled to $13.4B.\nFederal Reserve Policy Adds Fuel to ETF Dynamics\nThe Federal Reserve’s recent rate cuts amplified volatility across crypto ETFs. While some investors rotated out of Bitcoin ETFs in short-term de-risking, others see looser liquidity as a reason to expand digital asset allocations. Analysts note that returning positive flows within days could drive BTC back above $113,500 resistance toward $120,000, while sustained outflows may retest support at $108,000. Institutional buyers are using ETFs as the primary vehicle for these macro-driven reallocations."
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "134.5200",
            "open": "4,174.7300",
            "close": "4,165.3700",
            "high": "4,208.0300",
            "low": "4,073.5100"
        },
        "market_summary": "The SEC's approval of new generic listing standards is accelerating the launch of crypto ETFs, including those holding Ethereum, streamlining a process that previously took months. This regulatory shift, combined with significant institutional inflows into Ethereum ETFs and bullish price predictions from analysts, points to growing institutional confidence. The sentiment is further bolstered by views that Ethereum is becoming the blockchain of choice for Wall Street and the White House, which is expected to benefit the entire DeFi ecosystem.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "SEC approves Hashdex Nasdaq ETF to hold BTC, ETH, XRP, SOL, and XLM - Cryptopolitan",
                "source": "Cryptopolitan",
                "url": "https://www.cryptopolitan.com/sec-approves-hashdex-nasdaq-etf/",
                "body": "The SEC has officially approved the Hashdex Nasdaq Crypto Index US ETF to operate under new generic listing standards, giving it the greenlight to add XRP, SOL, and XLM to its existing portfolio of BTC and ETH.\nThe ETF, listed as NASDAQ:NCIQ, made the change last Thursday after updating its trust structure to meet the new criteria. The revised setup, filed under Form 8-K on Wednesday, includes a “Third Amended and Restated Trust Agreement” signed by Hashdex Asset Management Ltd. and CSC Delaware Trust Company, replacing the previous second agreement.\nThe ETF, built in Delaware, is tagged as an “emerging growth company.” The filing didn’t show any changes to its fiscal year or include any new financial documents. The updated trust agreement was attached as an exhibit to the filing, confirming compliance with Nasdaq’s current listing demands.\nETF issuers prepare for October launch\nFollowing the SEC’s vote to adopt the updated listing standards last week, several asset managers have kicked into gear. These new rules let qualified crypto ETFs skip the case-by-case review process, something that used to drag on for months. Under the old rules, approval could take as long as 270 days. Now, with the new setup, products can be cleared in as little as 75 days.\n“We’ve got about a dozen filings with the SEC now, and more coming,” said Steven McClurg, founder of Canary Capital Group. He confirmed that asset managers are already lining up, ready to take advantage of the rule change. “We’re all getting ready for a wave of launches,” he said. That wave is expected to hit hard in Q4 2025, according to Jonathan Groth at DGIM Law, who called this period a likely “boom time” for crypto ETFs.\nThe rush began in July, when the SEC first proposed the changes. Since then, firms have scrambled to rewrite filings, address SEC feedback, and meet the updated standards. Sources familiar with the process say the final updates could be submitted by the end of the week.\n“These are the rules we had been anticipating,” said Teddy Fusaro, president of Bitwise. Fusaro says most filings are nearing the end of the review phase and could hit the market shortly. Analysts expect ETFs tracking SOL and XRP to debut in early October.\nNew SEC rules speed up crypto ETF approvals\nTo qualify for the new approval process, ETFs must meet at least one of three main requirements. One, the coin involved must trade on a regulated exchange, or have CFTC-regulated futures contracts that’ve been active for at least six months. Two, another ETF must already hold that coin with 40% of its assets directly invested in it, not via swaps or options. If any of those conditions are met, the ETF skips the red tape.\nBut not every firm is ready to roll. “Not all of our existing filings qualify,” said Kyle DaCruz, head of digital assets at VanEck. “The next step is to talk to our lawyers to see which products can move forward and how rapidly will they get onto the market.”\nThat said, Grayscale Investments didn’t wait around. Less than 48 hours after the SEC’s announcement, it converted its private fund into a public product: the Grayscale CoinDesk Crypto 5 ETF (GDLC.P). This new ETF holds BTC, ETH, XRP, SOL, and cardano. According to Peter Mintzberg, CEO of Grayscale, their quick launch reflects their push for “public market access, regulatory clarity and product innovation.”\nThe bigger question now is whether investors will actually care about ETFs tied to lesser-known coins. “There will be a flood of tokens that many folks have never heard of,” DaCruz warned. Unlike BTC, which took years to build trust, some of these coins may get only weeks or months of investor education before hitting the market.\nKEY Difference Wire helps crypto brands break through and dominate headlines fast"
            },
            {
                "title": "The Daily: Tom Lee says Ethereum is Wall St. and White House's blockchain of choice, Flare launches a wrapped XRP for DeFi, and more - theblock.co",
                "source": "theblock.co",
                "url": "https://www.theblock.co/post/372198/the-daily-tom-lee-says-ethereum-is-wall-st-and-white-houses-blockchain-of-choice-flare-launches-a-wrapped-xrp-for-defi-and-more",
                "body": "The Daily: Tom Lee says Ethereum is Wall St. and White House's blockchain of choice, Flare launches a wrapped XRP for DeFi, and more\nQuick Take\n- Fundstrat co-founder and BitMine Chairman Tom Lee called Ethereum a “truly neutral chain” and said Wall Street and the White House are coalescing around it as their blockchain of choice.\n- Flare Network has launched FXRP, a non-custodial, overcollateralized wrapped version of XRP that can be minted and used across DeFi protocols.\nThe following article is adapted from The Block’s newsletter, The Daily, which comes out on weekday afternoons.\nHappy Wednesday! Wondering what's next after one of the largest long liquidation events of the year this week? We've got you covered.\nIn today's newsletter, Tom Lee says Wall Street's blockchain of choice is Ethereum, Flare launches a wrapped version of XRP for DeFi, Tether seeks to raise at a $500 billion valuation, and more.\nMeanwhile, Hyperliquid's home-grown stablecoin USDH goes live after Native Markets' winning bid.\nLet's get started!\nP.S. Don't forget to check out The Funding, a biweekly rundown of crypto VC trends. It's a great read — and just like The Daily, it's free to subscribe!\nBitMine's Tom Lee says Ethereum is Wall Street's blockchain of choice\nFundstrat co-founder and BitMine Chairman Tom Lee called Ethereum a \"truly neutral chain\" and said Wall Street and the White House are coalescing around it as their blockchain of choice.\n- During Korea Blockchain Week 2025's Impact conference on Wednesday, Lee tied Ethereum's neutrality to institutional trust, arguing that Wall Street only wants to operate on chains without perceived insider advantage.\n- Lee further explained that he observed the White House and Congress, which had become more pro-crypto under the Trump administration, are primarily turning to Ethereum.\n- \"So when I look at that, combined with agentic AI and robots that are really going to create the need for a token economy for robots, a lot of that will happen on Ethereum,\" he said.\n- BitMine has grown from a Bitcoin miner into the world's largest Ethereum treasury company, holding over 2.4 million ETH worth around $10 billion, second only to Strategy among crypto treasuries.\n- Still bullish on BTC, Lee forecasts bitcoin will reach $200,000–$250,000 by year-end, with ETH hitting a $10,000–$12,000 range extending up to $15,000.\nFlare Network launches FXRP to let XRP be used in DeFi apps\nFlare Network has launched FXRP, a non-custodial, overcollateralized wrapped version of XRP that can be minted and used across DeFi protocols.\n- The rollout starts with a 5 million FXRP cap, with minting supported by wallets like Luminite and Oxen Flow and trading available on SparkDEX, BlazeSwap, and Enosys.\n- Liquidity pools for FXRP are offering up to 50% APR in rFLR incentives, while collateralized borrowing options expand its DeFi utility.\n- Earlier this week, Midas and Axelar introduced mXRP, a tokenized XRP product currently targeting yields of up to 10%.\nTether seeks to raise at a $500 billion valuation\nTether is reportedly in talks with investors to raise as much as $20 billion at a $500 billion valuation — which would place it among the world's most valuable private companies, ranking alongside Sam Altman's OpenAI and Elon Musk's SpaceX.\n- Cantor Fitzgerald, a Tether shareholder with ties to President Trump's Commerce Secretary Howard Lutnick, is advising the potential deal, Bloomberg reported, citing two anonymous sources.\n- A $500 billion valuation would lift Cantor Fitzgerald's reported 5% stake in Tether to around $25 billion, underscoring the scale of the potential raise.\n- Tether, the world's largest stablecoin issuer with $172 billion in USDT supply, posted $4.9 billion in Q2 profit and is pushing deeper into the U.S. market with a new dollar-pegged token, USAT.\nFTX Trust sues Genesis Digital, seeks $1.15 billion over 'reckless' SBF investment\nThe FTX Recovery Trust sued Genesis Digital Assets, calling Sam Bankman-Fried's inve"
            },
            {
                "title": "Ethereum Price Eyes 20% Jump as This Metric Soars, Why This is Good for DeFi Tokens - CoinCentral",
                "source": "CoinCentral",
                "url": "https://coincentral.com/ethereum-price-eyes-20-jump-as-this-metric-soars-why-this-is-good-for-defi-tokens/",
                "body": "The cryptocurrency market is abuzz with a new wave of institutional interest, and all eyes are on the Ethereum price movements. Analysis shows that a surge in Ethereum ETF inflows has reached a staggering $556 million, a clear signal of growing confidence from major players. Experts forecast this momentum to propel the ETH price by 20%, potentially pushing it past the $5,000 mark.\nBut this isn’t just a positive sign for Ethereum holders; it’s a critical vote of confidence in the underlying technology and, by extension, the entire decentralized finance (DeFi) ecosystem. The bullish sentiment surrounding ETH is now drawing attention to projects with real-world utility and a clear vision for the future of finance.\nOne that’s particularly eye-catching is PayDax Protocol (PDP), a project that’s depowering centralized banks and empowering the people with a novel model for lending, borrowing, and insuring loans.\nEventual Ethereum Price Rebound and Why It Matters\nThe anticipated rebound of the Ethereum price to $5,000 is not just a price milestone but also signifies a maturing market. Ethereum’s status as a secure, decentralized settlement layer makes it the foundation upon which DeFi protocols are built.\nThis heightened trust encourages a greater flow of capital and users into the DeFi space, unlocking new levels of liquidity and innovation. For Ethereum, this represents a potential 20% rise for ETH as inflows jump by $556M. But more interestingly, new DeFi tokens like PDP are attracting short-term projections greater than 1,000% amid institutional interest.\nPayDax Protocol (PDP) is a novel project that’s tackling one of modern finance’s biggest challenges: lending. Unsurprisingly, its unique solutions have left investors flocking to the PDP presale, and for tangible reasons.\nPayDax Protocol (PDP): 2025’s Most Promising DeFi Project\nPayDax Protocol’s vision is to dismantle the old, credit-score-based system and replace it with one that recognizes a person’s true financial value. It’s a decentralized alternative to traditional banks, built on the principle of giving people access to liquidity using their own wealth as collateral, not on an institution’s arbitrary judgment. For instance, a collector with a high-value piece of art or a rare watch can now have it authenticated by Sotheby’s, tokenized on the blockchain as a Real-World Asset (RWA), and used as collateral for an instant stablecoin loan.\nThis revolutionary approach transforms static, illiquid wealth into dynamic, working capital. And this system is built for the mutual benefit of every participant. A lender can provide liquidity directly to a borrower and earn a significant return on their stablecoins, receiving as much as 15.2% APY. For example, a peer with $100,000 in idle stablecoins can lend it out and, instead of a traditional bank’s meager return, earn over $15,000 in a year.\nFurthermore, PayDax is redefining insurance with its Redemption Pool, which allows users to act as decentralized underwriters for loans. By contributing to this pool, these P2P insurers earn a premium, with some receiving up to 20% APY for securing the network (a role once reserved for large, centralized corporations).\nCredibility Backed By Infrastructure\nPaydax Protocol (PDP) is backed by a robust technical and physical infrastructure that ensures security, compliance, and trust for all users. The platform’s smart contracts are already audited by Assure DeFi to guarantee integrity. Furthermore, PayDax relies on the following network of institutional-grade service providers to bridge the gap between traditional and decentralized finance.\n- Sotheby’s & Christie’s: Used for the professional authentication of high-value collectibles like luxury watches and art before they are tokenized on the platform.\n- Brinks: Provides secure, physical custody for valuable Real-World Assets like gold and precious metals that are collateralized on-chain.\n- Jumio: Handles professional KYC and identity checks to ensur"
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "11.4926",
            "open": "215.1551",
            "close": "212.0300",
            "high": "216.5700",
            "low": "205.0774"
        },
        "market_summary": "A major Solana-focused firm, DeFi Development Corp., has significantly increased its stock buyback program to $100 million, signaling strong internal confidence. This move is strategically tied to its substantial holdings of over 2 million SOL tokens, aiming to increase its Solana-per-share metric. Despite this corporate bullishness, the SOL price itself is facing short-term downward pressure, underperforming other major cryptocurrencies this week.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Solana DAT DeFi Development boosts share buyback to as much as $100 million - theblock.co",
                "source": "theblock.co",
                "url": "https://www.theblock.co/post/372162/solana-dat-defi-development-boosts-share-buyback-to-as-much-as-100-million",
                "body": "Solana DAT DeFi Development boosts share buyback to as much as $100 million\nQuick Take\n- DeFi Development’s board of directors approved an increase to the company’s stock repurchase program, bumping it up from $1 million.\n- The company is one of the largest Solana-based digital asset treasuries with over 2 million SOL tokens as of last week.\nDeFi Development (ticker DFDV) said on Wednesday its board of directors had approved an increase to the company's stock repurchase program, bumping it up from $1 million to \"up to $100 million.\"\n\"The repurchase program authorizes the Company to buy back shares of its common stock from time to time on the open market,\" DeFi Development said in a statement. \"The repurchase authorization provides flexibility to repurchase up to $100 million of common stock, with an initial $10 million threshold requiring management to update the board prior to executing additional purchases.\"\nThe company is one of the largest Solana-based digital asset treasuries (DATs) with over 2 million SOL tokens as of last week. With Solana down about 3% to $212.12 as of 9:36 a.m. ET, DeFi Development's SOL holdings are worth about $430 million, according to The Block Price Page.\nOther large Solana DATs include Upexi, Sharps Technology, and Forward Industries, which recently launched with the backing of Galaxy Digital, Jump Crypto, and Multicoin Capital. The total Solana held by publicly-listed DATs is worth nearly $2.9 billion, according to The Block Data Dashboard.\nDeFi Development was founded earlier this year by a team of former Kraken employees. The Nasdaq-listed firm's strategy involves buying and staking SOL and Solana-related tokens, like the Dogwifhat memecoin.\nDisclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.\n© 2025 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."
            },
            {
                "title": "News Explorer — Solana Treasury Firm DeFi Development Corp Plans to Buy Back More Stock - Decrypt",
                "source": "Decrypt",
                "url": "https://decrypt.co/news-explorer?pinned=1172596&title=solana-treasury-firm-defi-development-corp-plans-to-buy-back-more-stock",
                "body": "Coin Prices\nBTC\n$111,818.00\n-0.63%ETH\n$4,029.46\n-3.17%XRP\n$2.86\n0.28%BNB\n$995.00\n-1.62%SOL\n$205.41\n-1.81%USDC\n$0.999708\n0.00%DOGE\n$0.235034\n-1.41%STETH\n$4,024.98\n-3.18%TRX\n$0.334898\n-0.67%ADA\n$0.796323\n-2.00%WSTETH\n$4,890.07\n-3.03%LINK\n$21.22\n-1.73%USDE\n$0.999315\n-0.18%WBTC\n$111,675.00\n-0.53%WBETH\n$4,345.81\n-3.12%AVAX\n$31.38\n-7.67%FIGR_HELOC\n$0.999857\n0.30%SUI\n$3.28\n-2.05%HYPE\n$43.15\n-2.25%XLM\n$0.364378\n-0.29%BCH\n$551.40\n-1.43%WEETH\n$4,338.33\n-3.17%WETH\n$4,029.22\n-3.04%HBAR\n$0.214919\n-3.04%LEO\n$9.51\n-0.07%USDS\n$0.999664\n-0.03%LTC\n$104.56\n-2.19%BSC-USD\n$1.00\n0.07%TON\n$2.79\n-1.22%SHIB\n$0.00001198\n-1.39%CBBTC\n$111,880.00\n-0.49%CRO\n$0.191853\n-7.38%SUSDE\n$1.20\n-0.04%DOT\n$3.94\n-1.93%WBT\n$41.57\n-0.86%XMR\n$293.17\n-1.79%MNT\n$1.64\n-7.53%WLFI\n$0.195264\n-0.63%USDT0\n$1.00\n-0.00%UNI\n$7.76\n-3.91%ENA\n$0.602018\n0.03%AAVE\n$268.73\n-1.60%PEPE\n$0.00000956\n-0.50%M\n$2.33\n-1.29%OKB\n$179.56\n0.18%BGB\n$5.20\n-0.91%NEAR\n$2.90\n-2.66%ASTER\n$2.08\n0.60%IP\n$10.93\n-4.23%JITOSOL\n$252.92\n-1.69%APT\n$4.17\n-2.90%TAO\n$303.46\n-2.62%ONDO\n$0.906495\n-2.47%ETC\n$18.45\n-2.30%WLD\n$1.29\n-1.67%USD1\n$0.999784\n-0.01%BNSOL\n$220.56\n-1.89%WETH\n$4,029.04\n-3.11%POL\n$0.220914\n-2.05%SUSDS\n$1.069\n0.02%ARB\n$0.422364\n-3.08%ICP\n$4.23\n-2.56%PI\n$0.273298\n-4.55%JLP\n$5.51\n-0.74%BUIDL\n$1.00\n0.00%KAS\n$0.076745\n-2.29%USDF\n$0.995053\n-0.40%FLR\n$0.02660731\n8.64%HASH\n$0.03947042\n-0.42%KCS\n$15.24\n-1.90%FTN\n$4.49\n0.12%ATOM\n$4.11\n-1.42%GT\n$16.17\n-0.36%VET\n$0.0222917\n-1.63%ALGO\n$0.209144\n-2.32%USDTB\n$0.9994\n-0.07%PUMP\n$0.00517468\n-7.64%RSETH\n$4,246.74\n-3.16%RENDER\n$3.51\n-2.93%PYUSD\n$0.999814\n-0.01%PENGU\n$0.02893343\n-2.38%RETH\n$4,606.73\n-3.15%MYX\n$9.34\n-0.02%SEI\n$0.284489\n-2.06%KHYPE\n$42.95\n-0.12%BFUSD\n$0.998938\n-0.03%BONK\n$0.00001996\n-1.82%LBTC\n$111,801.00\n-0.58%SKY\n$0.065537\n-6.86%OSETH\n$4,244.18\n-3.18%TRUMP\n$7.60\n-0.81%FIL\n$2.20\n-2.19%FET\n$0.583781\n-1.26%IMX\n$0.759972\n5.40%LSETH\n$4,350.53\n-3.16%JUP\n$0.460773\n-0.88%USDT\n$0.999914\n-0.01%XAUT\n$3,729.49\n-1.02%QNT\n$93.52\n-2.81%XDC\n$0.075218\n-0.46%WBNB\n$995.02\n-1.53%EZETH\n$4,268.21\n-3.13%NEXO\n$1.23\n-0.21%OP\n$0.674775\n-3.49%INJ\n$12.09\n-1.45%SYRUPUSDC\n$1.13\n0.03%JUPSOL\n$233.88\n-1.90%TIA\n$1.43\n-2.03%FDUSD\n$0.997496\n-0.03%SOLVBTC\n$111,664.00\n-0.36%PAXG\n$3,746.86\n-1.07%SAROS\n$0.402292\n-0.27%STX\n$0.586389\n-2.20%USDC\n$0.999761\n0.02%METH\n$4,336.74\n-3.09%LDO\n$1.095\n-2.35%SPX\n$1.031\n-1.65%ZEC\n$58.75\n7.06%CRV\n$0.677777\n0.05%MSOL\n$272.21\n-1.89%AERO\n$1.04\n-5.40%CAKE\n$2.70\n-4.03%S\n$0.244876\n-2.96%KAIA\n$0.157902\n5.04%0G\n$4.31\n-21.29%WBTC\n$111,706.00\n-0.39%SUPEROETH\n$4,027.22\n-3.16%CLBTC\n$112,105.00\n-0.43%GRT\n$0.082451\n-2.49%ETHFI\n$1.66\n10.10%PYTH\n$0.147944\n-1.82%FLOKI\n$0.00008352\n-2.35%USTB\n$10.83\n0.01%PENDLE\n$4.65\n-1.21%CGETH.HASHKEY\n$3,886.81\n-2.63%WIF\n$0.770172\n-2.52%USDG\n$0.999515\n-0.03%WETH\n$4,030.97\n-3.17%ATH\n$0.061198\n5.55%RLUSD\n$0.99974\n0.01%CFX\n$0.142439\n-3.07%RAY\n$2.71\n-1.12%OUSG\n$112.69\n0.01%THETA\n$0.72487\n-2.30%XTZ\n$0.678036\n-4.50%GALA\n$0.01495726\n-2.45%VIRTUAL\n$1.048\n-3.77%USDX\n$0.997933\n0.05%ENS\n$20.42\n-2.32%IOTA\n$0.167004\n-2.01%USDY\n$1.08\n0.36%TBTC\n$111,546.00\n-0.53%BDX\n$0.089979\n3.19%WETH\n$4,028.89\n-3.22%AB\n$0.00831752\n0.20%A\n$0.412292\n-2.60%SAND\n$0.267779\n-1.92%GTETH\n$4,029.46\n-2.93%ETHX\n$4,310.41\n-3.17%JTO\n$1.62\n-1.13%FARTCOIN\n$0.603328\n2.94%DOGE\n$0.234957\n-1.44%JASMY\n$0.01240398\n-2.93%EETH\n$4,021.74\n-3.17%EIGEN\n$1.74\n2.76%BTT\n$0.00000059\n-1.81%FLOW\n$0.349917\n-2.63%USD0\n$0.998023\n-0.02%MORPHO\n$1.70\n-3.55%CMETH\n$4,336.66\n-3.17%MANA\n$0.288236\n-1.60%SAVAX\n$38.36\n-7.60%DEXE\n$9.58\n-3.00%WAL\n$0.376853\n-1.61%CBETH\n$4,433.38\n-3.16%SWETH\n$4,393.19\n-3.18%SUN\n$0.0272124\n-6.47%AVNT\n$2.03\n3.94%BTC.B\n$111,737.00\n-0.60%USDD\n$0.999318\n-0.07%WEETH\n$4,325.75\n-3.17%FLUID\n$6.55\n27.10%USDT\n$1.002\n-0.21%TUSD\n$0.999112\n-0.01%VSN\n$0.150354\n0.00%SENA\n$0.587723\n-1.73%TWT\n$1.18\n-4.64%STRK\n$0.119188\n-1.18%BSV\n$24.06\n-2.29%LION\n$0.01560038\n-5.03%VKHYPE\n$43.99\n2.66%W\n$0.100671\n0.13%DYDX\n$0.598268\n-1.65%WAVAX\n$31.37\n-7.74%BORG\n$0.464651\n16.98%DAI\n$0.999519\n-0.01%BBSOL\n$227.42\n-1.94%FRXETH\n$4,012.47\n-3.25%WETH\n$4,026.71\n-3.21%STEAKUSDC\n$1.10\n-0.01%SYRUP\n$0.397907\n-3.12%USDC.E\n$0.99971\n0"
            },
            {
                "title": "DeFi Development Corp. Stock Rises as Solana Firm Boosts Buyback Plan to $100 Million - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/defi-development-corp-stock-rises-161555134.html",
                "body": "Shares in Solana treasury firm DeFi Development Corp. (DFDV) jumped as high as 6% before retracing amid news the firm increased its share repurchase program from $1 million to $100 million.\nDFDV is now changing hands at $15.73, up nearly 4% on the day. It’s now up more than 2,100% year-to-date, but down 12% in the last week of trading.\n“Ultimately, buybacks are a tool to grow Solana-per-share (SPS) long-term, so we will be regularly evaluating the usage of buybacks against our other opportunities to grow SPS long-term,” DFDV COO and CIO Parker White told Decrypt.\n“Our goal is to maximize SPS growth, so depending on the mNAV, we may deploy additional cash into share buybacks or SOL purchases,” he added.\nOther publicly traded digital asset companies, like Ethereum treasury SharpLink Gaming, have signaled that use of their respective share repurchase programs will come when their net asset value—or crypto holdings—are more valuable than the firm’s trading market cap, as well.\nThat’s the current situation for DeFi Development Corp, which holds around $452 million worth of Solana in its treasury, but trades at just a $395 million market cap at its current trading price, giving it an mNAV—or a ratio of market cap to crypto holdings—below 1.\n“We wanted to have the flexibility to conduct buybacks if the mNAV falls deeply below 1 for a sustained period,” said White of the firm’s increased repurchase program.\nThe 5 Largest Publicly Traded Solana Treasury Firms\nThe AI-powered real estate software firm kicked off its Solana treasury plans in early April, shortly after changing its name from Janover to DeFi Development Corporation to reflect its commitment to a digital assets play.\nSince that time, the firm has been further entrenching itself within the Solana ecosystem. In May, it purchased a Solana validator business for $3.5 million worth of DFDV stock and cash. Since that time, it’s partnered with popular Solana meme coin BONK, launched its own liquid staking token, and established a $5 billion equity line of credit (ELOC) to help fuel its future Solana purchases.\nThe firm now holds 2,095,748 SOL on its balance sheet, making it the second-largest publicly traded Solana treasury firm in the world.\nWhy Is Solana Falling Harder Than Bitcoin, Ethereum and XRP This Week?\nSolana is down 1% in the last 24 hours and is now trading at $215.61. The asset has underperformed its major peers over the last week, falling about 9% with analysts telling Decrypt that priced-in corporate purchases and deleveraging pressures are playing a role.\nThat underperformance has led to a shift in Myriad’s Solana all-time high market, with predictors now split evenly at 50-50 about whether the token will create a new all-time high above $293.31 by the end of this year. That’s a 12% decline from Monday’s mark, when predictors were feeling bullish and gave odds of 62% for the new Solana all-time high in 2025.\n(Disclosure: Myriad is a product of Decrypt's parent company, DASTAN.)"
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "373.000",
            "open": "46,342.700",
            "close": "46,178.830",
            "high": "46,481.800",
            "low": "46,108.800"
        },
        "market_summary": "The market is experiencing a pullback from recent highs as investors await key inflation data, with the Dow and other major indexes closing lower for two consecutive sessions. Futures are showing early gains on Thursday, supported by a weaker yen and risk-on sentiment, but overall direction remains highly sensitive to upcoming US labor market data and the PCE inflation report. Traders are weighing hawkish Bank of Japan minutes against Fed policy uncertainty, with sector performance mixed as energy outperforms while materials and some tech giants decline.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Stock Market Today: Dow Slides Ahead Of Inflation Data; Oracle, OpenAI Step Up Stargate Plan (Live Coverage) - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-sp500-nasdaq-new-home-sales-micron-stock-mu/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #5142156e-99d3-11f0-85c5-2e9a526dd591"
            },
            {
                "title": "Dow Jones & Nasdaq 100 Futures Up on Weaker Yen, US Data and the Fed in Focus - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/dow-jones-nasdaq-100-futures-up-on-weaker-yen-us-data-and-the-fed-in-focus-1550656",
                "body": "Asian markets found support on Thursday after a weaker yen fueled risk appetite, with USD/JPY edging back from the 150 handle. The move lifted US stock futures and Asian equities as traders weighed US-Japan interest rate differentials.\nThe Nikkei gained 0.13% in morning trading, while USD/JPY eased 0.16% to 148.653, partially reversing the previous session’s 0.85% surge.\nThe Bank of Japan’s minutes from the July monetary policy meeting initially lifted demand for the yen. But, subsequent Japanese data challenged bets on an October rate hike, limiting their influence.\nA hawkish BoJ policy stance, combined with expectations of further Fed policy easing, could narrow the US-Japan rate differential in favor of the yen. A sharp drop in USD/JPY toward 140 may fuel a yen carry trade unwind, potentially triggering a sharp drop in US stock futures.\nUpcoming Japanese and US data could change the narrative, with the BoJ and the Fed sensitive to labor market and inflation data.\nUS stock futures advanced in morning trading on Thursday, September 25. The Dow Jones E-mini climbed 88 points, the Nasdaq 100 E-mini gained 47 points, and the S&P 500 E-mini rose 12 points.\nUS stock futures fell for the second consecutive session on Wednesday, September 24, after Fed Chair Powell highlighted uncertainty about the inflation outlook.\nLater Thursday, the US labor market and finalized GDP numbers will face scrutiny. According to preliminary data, the US economy expanded 3.3% quarter-on-quarter in the second quarter.\nA sharp downward revision may revive stagflation fears and weigh on risk assets as the Fed grapples with elevated inflation. On the other hand, an upward revision could offer market relief, potentially lifting sentiment.\nHowever, labor market data could have a greater impact on risk appetite. Economists expect initial jobless claims to rise from 231k (week ending September 13) to 235k (week ending September 20).\nA modest increase or drop in claims could temper bets on an October Fed rate cut, dampening sentiment. Conversely, a jump in claims toward 250k may boost expectations of a further policy adjustment in October and demand for risk assets.\nThe Kobeissi Letter recently commented on US labor market indicators, stating:\n“US aggregate weekly hours worked has fallen -0.2% over the last 3 months, the largest decline since the 2020 pandemic. This indicator measures the total hours employees work in a week, reflecting overall labor market activity. A drop in hours often signals that companies are reducing work before cutting jobs, indicating that more layoffs may be coming. In previous cycles, such declines have frequently coincided with recessions.”\nThe GDP and labor market data precede Friday’s highly anticipated Personal Income and Outlays report. Economists forecast the Core PCE Price Index to rise 2.9% year-on-year in August, mirroring July’s increase. A higher reading could delay the timing of a Fed rate cut and raise concerns about stagflation as economic momentum slows.\nDespite the second day of losses on Wednesday, September 24, US stock futures trade above the 50-day and 200-day Exponential Moving Averages (EMAs), reaffirming a short-term bullish bias.\nHowever, the near-term outlook hinges on FOMC member commentary, US economic data, and the BoJ’s rate path. For traders, here are the key levels driving market trends.\nDow Jones\nNasdaq 100\nS&P 500\nTraders should continue to track Bank of Japan policy signals along with USD/JPY and Nikkei trends. Later in the session, US economic data and Fed chatter could also affect sentiment.\nMeanwhile, Friday’s inflation data will be pivotal for US stock futures. A higher Core PCE Price Index could weigh on risk assets and reverse September’s market gains. On the other hand, cooling inflation could extend the market rally. The Dow Jones E-mini is up 2.02% month-to-date, with the Nasdaq 100 E-mini and the S&P 500 E-mini posting gains of 5.59% and 3.55%, respectively.\nThese key drivers could extend o"
            },
            {
                "title": "Markets News, Sep. 24, 2025: Stock Indexes End Lower for Second Straight Session; Tech Giants Fall Again, Energy Sector Outperforms - Investopedia",
                "source": "Investopedia",
                "url": "https://www.investopedia.com/dow-jones-today-09242025-11816024",
                "body": "Major stock indexes ended lower for a second straight day Wednesday following a three-session streak of record closing highs. The blue-chip Dow Jones Industrial Average finished down 0.4%, and the benchmark S&P 500 and tech-heavy Nasdaq closed 0.3% lower.\nOn Tuesday, the Dow and S&P 500 had set fresh intraday records soon after the opening bell before retreating, with equities investors possibly unnerved that Federal Reserve Chair Jerome Powell said stocks were \"fairly highly valued\" in his first comments since the central bank last week cut interest rates for the first time this year.\nA day later, indexes were little changed until turning lower around midday, with the S&P 500 Materials sector the worst performer of the 11 industries tracked by the benchmark index, ending down 1.6%. Technology shares also underperformed the market overall, with the sector 0.5% lower.\nShares of tech giants Oracle (ORCL) and Nvidia (NVDA) ended lower for second consecutive session, falling 1.7% and 0.8%, respectively. Amazon (AMZN), the worst performer in the Dow yesterday, closed down 0.2% for its third straight decline. Micron Technology (MU), which had risen in after-hours trading Tuesday when the memory-chip maker posted record quarterly sales, closed down 2.8%.\nHowever, others in the tech sector performed far better. U.S.-listed shares of Chinese firm Alibaba (BABA) soared 8% after it raised its budget for AI infrastructure and models, while Marvell Technology (MRVL) ended up more than 7% to lead the Nasdaq. Intel (INTC) advanced more than 6% as Bloomberg reported that the chipmaker had discussed Apple (AAPL) buying a stake.\nA bright spot was the S&P 500 Energy Sector, which rose 1.3%. Among the top gainers were Xcel Energy (XEL), EQT (EQT), and Phillips 66 (PSX), up more than 6%, 4%, and 3%, respectively. West Texas Intermediate futures, the U.S. crude oil benchmark, advanced 2.2% to roughly $64.80 per barrel.\nLithium Americas (LAC) shares nearly doubled on a report the Trump administration is looking to take a stake in the company, which is partnering with General Motors (GM) on a Nevada lithium mine. GM shares advanced 2.3%.\nGold futures, which set another record high early Wednesday, pulled back almost 1.5% to trade at $3,765 an ounce as of 4 p.m. ET. The 10-year Treasury yield, which affects borrowing costs on a variety of consumer and commercial loans, ticked up to 4.15% from 4.11% at Tuesday's close. Bitcoin was up 1.6% to around $113,500. The U.S. dollar index, which tracks the value of the greenback against a basket of foreign currencies and hit its lowest level since early 2022 one week ago, rose 0.6% to 97.87.\nBiggest S&P 500 Movers on Wednesday\nDecliners\n- Freeport-McMoRan (FCX) shares tumbled 17%, more than any other stock in the S&P 500 on, after the mining giant lowered its forecasts for quarterly copper and gold sales. Issues at Freeport's Indonesia unit weighed on its outlook; .the company declared force majeure at its Grasberg mine after a mud flow partially blocked access to the underground facility, resulting in fatal injuries to two workers.\n- Shares of Axon Enterprise (AXON) fell 10% after the provider of less-lethal weapons and other law enforcement technology announced the acquisition of Prepared, an emergency communications platform powered by artificial intelligence. Needham analysts reiterated their \"buy\" rating on Axon stock but noted the complexities involved in a potential return to the computer-aided dispatch market. Piper Sandler initiated coverage of Axon stock with a bullish \"overweight\" rating.\nAdvancers\n- Xcel Energy (XEL) said it agreed to settle litigation related to the devastating 2021 Marshall Fire in Colorado. Although the electric utility reaffirmed its belief that its equipment did not cause the fire, it will pay roughly $640 million to settle lawsuits involving more than 4,000 plaintiffs who sued for damages. Xcel Energy shares rose 6.7%, logging the benchmark index's top performance in the midwe"
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "94.250",
            "open": "9,206.180",
            "close": "9,242.130",
            "high": "9,274.130",
            "low": "9,179.880"
        },
        "market_summary": "The FTSE 100 is experiencing a period of uncertainty and downward pressure, with early trading sessions showing losses. This is driven by cautious corporate earnings, mixed economic signals like steady but gentler wage growth, and global market influences. While some positive developments exist, such as major foreign investments and gains in specific stocks like JD Sports, the overall mood is one of caution.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "FTSE 100 Outperforms as Copper Shares Climb - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/live-blog/2025-09-24/ftse-100-pound-gbp-stocks-trump-tariffs-latest-what-s-moving-uk-markets-right-now-markets-today",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            },
            {
                "title": "FTSE 100 Set To Open Lower As Market Uncertainty Grows - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/ftse-100-set-to-open-lower-as-market-uncertainty-grows",
                "body": "Join the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nThe FTSE 100 is lagging at the open, with futures dropping 0.24% as cautious corporate earnings and renewed economic concerns weigh on the UK market.\nWhat does this mean?\nA cloud of uncertainty hangs over British stocks, with the FTSE 100 slipping again amid mixed company results and new signs of slower business activity. Miners like Glencore and BHP are upping their zinc output at Peru’s Antamina mine by 67% to help offset a 12% fall in copper, extending the mine’s lifespan to hedge against commodity swings. In the energy sector, Malaysia’s Petronas pledged to maintain stable supplies after a court win over Shell MDS, signaling ongoing strength in Asia’s energy markets. UK regulator Ofgem’s new rules will force energy suppliers to lower fixed charges by 2026, but the move may not substantially ease consumer bills. Meanwhile, British wage growth holds steady at 3%, but signals point to gentler pay hikes as firms keep an eye on costs. In commodities, oil is rising for a second day, gold remains near record highs, and copper is holding its ground, suggesting a cautious undertone across markets. Investors are also eyeing results from names like JD Sports, EnQuest, Saga, and Pinewood Technologies for further direction.\nWhy should I care?\nFor markets: Steady nerves tested as growth stalls.\nUK stocks are feeling the pinch, with mixed earnings and sluggish economic signals making investors wary. The FTSE 100’s recent slip mirrors a cautious mood across Europe, as markets digest tepid wage growth and muted commodity movements. With oil’s rebound and gold’s stability reflecting a tilt toward safer assets, the coming round of earnings will be pivotal for momentum.\nThe bigger picture: Sector shakeups reveal shifting priorities.\nPolicy tweaks, output reshuffles, and ongoing legal battles highlight how sector moves can ripple across economies. Ofgem’s energy reforms and strategic shifts in mining hint at industries bracing for long-term change. Against a backdrop of flat wages and slow business activity, it’s clear companies and regulators are positioning defensively to manage future uncertainty.\nYou read that right: you can win two return flights to London, a three-night stay at a hotel in the capital, and in-person tickets to our Modern Investor Summit. Even better, your trip will be created in partnership with Echo Bravo – the experts in hassle-free business travel and round-the-clock human support.\nSo not only can you skip the bill, but you can leave the planning to the pros, too.\nAll you need to do is register for the Summit… and decide who you’d share that room with, of course.\nT&C's apply. Click here for details.\nMentioned in story\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nInsight\nTheodora Lee Joseph, CFA • about 15 hours ago\nQuick Take\nFinimize Newsroom • about 17 hours ago\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies.\nGet the two biggest stories in finance, and the reasons why you should care, delivered to "
            },
            {
                "title": "Business news live: FTSE 100 falls, US takes $1.3bn in tariffs from UK goods - The Independent",
                "source": "The Independent",
                "url": "https://www.independent.co.uk/news/business/latest-news-updates-money-ftse-100-stock-markets-b2832552.html",
                "body": "Business news live: Another pharma firm criticises UK, Spanish energy company to invest €20bn in Britain\nStock market news plus latest business and personal finance updates from Wednesday\nPharmaceutical firm Eli Lilly has become the latest huge company to take aim at the UK, following Merck, AstraZeneca and others criticising the investing landscape and pricing approach compared to other nations. The drugmakers appear to be trying to collectively fashion a more favourable environment to produce and sell in the country, following the government putting life sciences as one of their key pillars in this year’s business growth strategy.\nElsewhere retailer JD Sports have said they expect “limited” impact on profits from US tariffs, but also say there is “elevated unemployment risk” going forward. Amazon have announced plans to shut all of their Fresh grocery stores in the UK.\nThe FTSE 100 fell on Wednesday morning after US stocks dropped last night, while gold is pushing new all time highs once more and bitcoin’s price has dropped back to around $112,000.\nFollow The Independent’s live coverage of the latest stock markets and business news here:\nBusiness and money news - 24 September\nMorning all. Oodles of business news to get through this morning.\nComing up - Revolut, Eli Lilly, Iberdrola, Greggs, JD Sports and more.\nLet’s get into it.\nJD Sports bucks the trend as FTSE 100 falls\nThe FTSE 100 is down 0.34 per cent in early morning trading, after a low-key - and mixed - overnight session in the US and Asia.\nDonald Trump wading back into the Ukraine war has some on edge, given energy and oil factors in the region, with the US president suggesting Russia are in “big economic trouble”, complete with a few misplaced capital letters.\nHowever, not every UK firm is in the red today - around 30 are in the green.\nChief among them is JD Sports, with the footwear retailer up 3.1 per cent after its morning financial report.\nGreggs to open first pub with its own beers on draft\nFancy a pint with your steak bake? Well, from this weekend, that dream is set to become a reality as Greggs prepares to open its first ever pub this weekend.\nMore known for sausage rolls than serving pints, the British firm have revamped one area of a prominent department store to serve up exclusive beers and a Greggs-inspired menu.\nIf you want a slice of the action though, you will need to head to Newcastle – The Golden Flake Tavern is located at the Fenwick shop in Eldon Square.\nFull details...\nGreggs to open first pub with its own beers on draft\nBeauty Tech Group set to join LSE at around £300m valuation\nA bit of a boost for the London Stock Exchange today, with the business group behind beauty gadgets reportedly used by a bunch of celebrities set to IPO in October.\nThe listing should see the Beauty Tech Group set to be valued at up to £320 million, with shares for the IPO priced at 251p to 291p each.\nNot a massive addition in market cap terms but still a notable business joining the ranks.\nThe Beauty Tech Group owns brands CurrentBody, ZIIP Beauty and Tria Laser.\nIt plans to launch the IPO in October to “position the group for the next stage of its development”.\nReeves says UK ‘open for business’ as Revolut pledges £3bn new investment\nRachel Reeves has said the UK is getting “ahead in the global race for investment” as Revolut unveiled plans to plug £3 billion into its expansion in the country.\nThe Chancellor welcomed the pledge at the opening of the financial firm’s new head office in London’s Canary Wharf.\nIt follows major US financial firms last week announcing billions of pounds worth of investment into jobs and growth in the UK.\nMs Reeves said: “The UK is well and truly open for business under this Government.”\nReeves says UK ‘open for business’ as Revolut pledges £3bn new investment\nSpanish energy firm Iberdrola promises €20bn UK investment\nOne of the world’s biggest energy businesses, Iberdrola, plans to invest €20bn in the UK across the next three years.\nExecuti"
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "242.000",
            "open": "23,536.320",
            "close": "23,696.320",
            "high": "23,743.570",
            "low": "23,501.570"
        },
        "market_summary": "The German DAX extended gains despite a disappointing German Ifo business climate survey that came in lower than expected, highlighting a divergence between positive market performance and underlying economic data. While European markets were mixed overall, with France's CAC and Italy's FTSE MIB declining, the DAX's resilience was supported by positive eurozone PMI data showing business activity at a 16-month high. The market is also contending with uncertainty from the Fed's cautious stance on interest rates and high equity valuations.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "DAX Index Shrugs Off Gloomy German Business Climate to Extends Gains - MarketScreener",
                "source": "MarketScreener",
                "url": "https://www.marketscreener.com/news/dax-index-shrugs-off-gloomy-german-business-climate-to-extends-gains-ce7d58d2d88df12c",
                "body": "Access Denied\nYou don't have permission to access \"http://www.marketscreener.com/news/dax-index-shrugs-off-gloomy-german-business-climate-to-extends-gains-ce7d58d2d88df12c\" on this server.\nReference #18.56adc17.1758779420.5e251810\nhttps://errors.edgesuite.net/18.56adc17.1758779420.5e251810"
            },
            {
                "title": "European stocks mixed; German Ifo survey data released - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/news/stock-market-news/european-stocks-fall-slightly-german-ifo-survey-due-4252448",
                "body": "White House tells agencies to prepare mass firings in case of shutdown - Politico\nInvesting.com - European stocks were mixed on Wednesday, following overnight losses on Wall Street amid growing uncertainty over valuation levels as well as the future path of U.S. interest rates.\nThe DAX index in Germany gained 0.3%, the CAC 40 in France slipped 0.6% and the FTSE 100 in the U.K. rose 0.3%.\nSentiment wanes after Powell speech\nSentiment received a hit overnight with losses on Wall Street after U.S. Federal Reserve Chair Jerome Powell flagged increasing economic risks and uncertainty over interest rates.\nPowell said, in a speech at Rhode Island’s Greater Providence Chamber of Commerce on Tuesday, said the central bank is in a \"challenging situation\" with an ongoing risk of faster-than-expected inflation at the same time that weak job growth has raised concern about the health of the labor market.\nThe Fed cut interest rates earlier this month for the first time this year, but Powell offered little indication of when he thinks the U.S. central bank might next ease monetary policy.\nThe Fed chair also said that “equity prices are fairly highly valued”, with the benchmark indices on Wall Street all hitting all-time highs recently.\nWhile the benchmark S&P 500 index is up over 13% year-to-date in the U.S., the German DAX index is over 18% higher, suggesting the potential for a hefty selloff.\nGerman Ifo survey due\nBack in Europe, the flash PMIs for the eurozone, released on Tuesday, offered some good news, as business activity grew at its fastest pace in 16 months in September.\nHowever, the survey also highlighted a stark difference between the bloc’s two biggest economies of Germany and France with the former - Europe’s largest - accelerating, while political woes kept the latter on the backfoot.\nThe German Ifo business climate data was reported on Wednesday, coming in unexpectedly lower at 87.7, below the previous reading of 88.9 and the consensus estimate of 89.3.\nJD Sports signals ongoing caution\nIn the corporate sector, JD Sports Fashion (LON:JD) posted a 13.5% drop in first-half profit, as weakness in its U.S. operations weighed on results. The U.K.-based retailer maintained its full-year outlook but signaled ongoing caution about the trading backdrop.\nFerrari (NYSE:RACE) lifted its EBITDA margin to 26.6% in the first half of 2025, up 20 basis points from a year earlier, as productivity gains offset higher costs from investments in staff and digital capabilities.\nCrude helped by drop in U.S. inventories\nOil prices are higher on Wednesday as a fall in U.S. crude inventories diluted worries about a fall in demand in the world’s largest economy.\nAt 11:50 ET, Brent futures rallied 2.1% to $69.05 a barrel, and U.S. West Texas Intermediate crude futures rose 2.2% to $64.80 a barrel.\nBoth benchmarks climbed by more than $1 a barrel on Tuesday as a deal to resume exports from Iraq’s Kurdistan stalled, dampening worries about additional supply onto the global market.\nHelping the tone was the news that crude stocks declined by 3.82 million barrels in the week ended September 19, while gasoline inventories fell by 1.05 million barrels, according to data from the American Petroleum Institute figures.\nShould you invest $2,000 in JD right now?\nMost investors will find it hard to answer that question with total confidence. Short of a guarantee, which no one can give you, the most successful traders stick to proven best practices without letting hype or hyper-vigilance take over their better judgment.\nBut that doesn't mean you can't use smart shortcuts. If you're considering JD, try chatting with WarrenAI, our powerful AI financial assistant.\nIt's just like ChatGPT for investors, but with access to 10 years of company data, a built-in screener, Wall Street analysts' reports, and earnings call transcripts for real-time, vetted insights.\nEven if you end up going with your gut feeling, at least you'll know why."
            },
            {
                "title": "European indices close mixed with France's CAC and Italy's FTSE MIB lower - investingLive",
                "source": "investingLive",
                "url": "https://investinglive.com/news/european-indices-close-mixed-with-frances-cac-and-italys-ftse-mib-lower-20250924/",
                "body": "The major European indices are ending the session with mixed results. Both the France's CAC and Italy's FTSE MIB fell while the German DAX, UK FTSE 100 and Spain's Ibex rose by 0.25% to 0.30%.\nA snapshot of the closing levels shows:\n- German DAX +0.30%\n- France's CAC, -0.57%\n- UK's FTSE 100 +0.29%\n- Spain's Ibex +0.24%\n- Italy's FTSE MIB -0.13%\nAs London/European traders toward the exits, US stocks are trading modestly lower for the 2nd consecutive day:\n- Dow industrial average -0.09%\n- S&P index -0.13%\n- NASDAQ index -0.16%.\n- Russell 2000-0.21%\nLooking at the US debt market, US yields are higher ahead of the 5 year note auction at 1 PM. Yesterday's 2 year note auction was met with average demand:\n- 2-year yield 3.598%, +2 point basis points.\n- 5 year yield 3.703%, +2.6 basis points\n- 10 year yield 4.140%, +2.3 basis points\n- 30 year yield 4.747%, +1.1 point basis points\nThe US 10-year yield is up 5 of last 6 trading days which took the price up from a low on September 17 at 3.992%. Recall September 17 was the day that the Federal Reserve cut rates by 25 basis points. The 10 year yield is up 15 basis points since that cut.\nLooking at other markets:\n- Crude oil is trading up $1.30 and $64.70. That takes price just above its 100 day moving average at $64.68. The high price has reached $64.75.\n- Gold is trading down $19.35 or -0.52% at $3745.86.\n- Bitcoin is up by $1735 at $113,760."
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "284.000",
            "open": "24,616.140",
            "close": "24,520.930",
            "high": "24,686.010",
            "low": "24,402.010"
        },
        "market_summary": "The Nasdaq 100 and broader market are experiencing a pullback as investors digest mixed signals from the Federal Reserve and await key inflation data. Fed Chair Powell's comments on high asset valuations have introduced caution, causing a stall in momentum despite strong performances from individual tech names like Tesla and positive AI-driven news from Alibaba and Micron's earnings. The market's direction is currently hinging on the upcoming PCE report to provide clarity on the inflation and interest rate outlook.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Stock market today: Dow, S&P 500, Nasdaq slip for 2nd day in a row as Fed sends mixed signals, Alibaba plans AI push - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-slip-for-2nd-day-in-a-row-as-fed-sends-mixed-signals-alibaba-plans-ai-push-200103891.html",
                "body": "US stocks fell on Wednesday as Wall Street digested mixed messaging from Fed officials on interest rates.\nThe S&P 500 (^GSPC) slid 0.3% while the Dow Jones Industrial Average (^DJI) declined by about 0.4%, The tech-heavy Nasdaq Composite (^IXIC) dropped 0.3%. The declines marked a reversal from the indexes' earlier gains.\nDebate over the prospects for US interest rate cuts — the big focus for markets right now — appeared to pressure stocks. Comments from Federal Reserve officials this week have hinted at growing disagreement on what the path of policy should be, given cracks showing in the labor market.\nFed Chair Jerome Powell reiterated in a speech on Tuesday that the central bank would proceed cautiously on further rate cuts, even as he left the door open to more easing. He also described stocks as \"fairly highly valued.\"\nWall Street is now counting down to the release of the Fed's preferred inflation gauge, the Personal Consumption Expenditures index, on Friday. Markets are watching for reassurance that inflation isn't posing a threat to high expectations for two more rate cuts this year.\nOn Wednesday, fresh data from the Commerce Department's Census Bureau showed new home sales unexpectedly surged in August as mortgage rates began to ease, bringing homebuyers off the sidelines and releasing pent-up demand. Still, affordability concerns persist.\nMeanwhile, some tech stocks are showing gains despite a broader drop across the Nasdaq, which snapped a winning streak on Tuesday amid losses for the \"Magnificent Seven\" Big Tech stocks.\nAlibaba stock (BABA) jumped 8% as investors welcomed the Chinese tech giant's pledge to hike its AI spending beyond its original $50 billion target. The boost is needed for Alibaba to keep pace as global investment in AI surges to $4 trillion, its CEO said.\nTesla (TSLA) shares climbed 4% and were on track to close at their highest level in 2025 as analysts at investing firm Mizuho Securities lifted their price outlook on the stock to $450. The analysts noted the EV maker is seeing only a \"muted\" impact from tariffs and boosted optimism for the company's robotaxi ambitions.\nAt the same time, Micron's (MU) stronger-than-expected quarterly earnings delivered a positive signal for the AI trade, though shares in the memory chipmaker — which supplies semiconductors for Nvidia's (NVDA) AI systems — fell on Wednesday.\nLIVE COVERAGE IS OVER25 updates\nInes Ferré\nStocks retreat for second day in a row despite Tesla rally, Alibaba's big AI spend pledge\nStocks fell for a second day in a row on Wednesday. Major AI spending plans from e-commerce giant Alibaba (BABA) and a rally in Tesla (TSLA) shares were not enough to keep the market momentum going.\nThe S&P 500 (^GSPC) slipped 0.3%. The Dow Jones Industrial Average (^DJI) declined by about 0.4%. The tech-heavy Nasdaq Composite (^IXIC) dropped 0.3%.\nThe declines came as investors parsed recent Fed member commentary about the central bank's path forward.\nAlibaba stock jumped as much as 10% as the Chinese tech giant pledged to hike its AI spending beyond its original $50 billion target.\nTesla shares climbed as much as 4% after analysts at investing firm Mizuho Securities lifted their price outlook on the stock to $450.\nGold rally 'bodes well for bitcoin', says Fundstrat strategist\nGold (GC=F) has outpaced both stocks and crypto this year, and its run could be a bullish signal for bitcoin’s next move.\nThe precious metal is up more than 40% year-to-date, compared to a more than 12% gain in the S&P 500 (^GSPC) and a 20% increase in bitcoin (BTC-USD).\nSeptember is typically a volatile month for the world’s largest cryptocurrency, though the final quarter of the year often brings seasonal tailwinds for digital assets.\nSean Farrell, head of digital asset strategy at Fundstrat, noted that gold tends to front-run bitcoin.\n\"Gold generally has at least over the past few years, has led bitcoin rallies,\" Farrell said during a client video on Tuesday evening.\n\"I think that that "
            },
            {
                "title": "Nasdaq 100: Powell’s Fed Signals Hold Risk for US Stocks as PCE Report Looms - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/nasdaq-100-powells-fed-signals-hold-risk-for-us-stocks-as-pce-report-looms-1550571",
                "body": "U.S. stocks are edging lower mid-session Wednesday, paring recent gains after Federal Reserve Chair Jerome Powell warned that asset valuations appear “fairly high.” Traders are now reassessing the likelihood of further rate cuts ahead of key inflation data later this week.\nThe S&P 500 and Nasdaq, both coming off three straight record closes, have lost steam as caution resurfaces. Powell’s remarks introduced new concern that the Fed may hold off on further easing unless there is clearer evidence of slowing inflation or a softening labor market.\nLast week’s rate cut helped fuel the September rally, but momentum is stalling. Powell’s focus on asset pricing suggests the central bank is watching more than just employment and inflation prints. For traders, that raises the stakes heading into Friday’s core PCE report—one of the Fed’s preferred inflation gauges.\nPowell’s acknowledgment of inflated asset prices raised concerns that the central bank may hesitate to ease policy further without clear economic justification. The market is now increasingly sensitive to incoming data, with many investors looking toward the Fed’s preferred inflation gauge—core PCE—due later this week.\nDespite policy uncertainty, some sectors outperformed. Energy stocks surged, with the S&P 500 energy sector gaining 2% as crude prices climbed. Consumer discretionary also saw modest gains, up 0.5%. However, tech weighed on the broader market. The S&P 500 tech sector dropped 0.7%, led by more than 1% losses in Apple and Nvidia.\nSurprisingly strong housing data added another twist. Sales of new single-family homes jumped 20.5% in August, raising questions about the urgency of further rate cuts. Analysts warned that signs of resilience in the housing market could complicate the Fed’s calculus, limiting policy flexibility.\nAlibaba led Chinese ADRs higher with an 8.9% rally after announcing a partnership with Nvidia. Lithium Americas nearly doubled after news surfaced that the U.S. government was eyeing a stake and a $2.26 billion loan for its Thacker Pass lithium project. General Motors gained 1.4% following an upgrade from UBS and ties to the lithium project.\nIn contrast, Micron fell 4% after reporting quarterly results. Oracle dropped 3.5% amid reports of a $15 billion bond sale plan. Freeport-McMoRan plunged 11.7% after issuing weak Q3 sales guidance for copper and gold.\nTraders are closely tracking core PCE data, which will play a crucial role in shaping expectations for the Fed’s next move. With Powell signaling caution on valuations and data delivering mixed signals, equities may see more choppiness ahead. Sector rotation and stock-specific moves will likely dominate until there’s clarity on inflation and interest rate outlooks.\nMore Information in our Economic Calendar.\nJames Hyerczyk is a U.S. based seasoned technical analyst and educator with over 40 years of experience in market analysis and trading, specializing in chart patterns and price movement. He is the author of two books on technical analysis and has a background in both futures and stock markets."
            },
            {
                "title": "Rivian Automotive (NASDAQ: RIVN) Stock Price Prediction for 2025: Where Will It Be in 1 Year (Sept 24) - 24/7 Wall St.",
                "source": "24/7 Wall St.",
                "url": "https://247wallst.com/investing/2025/09/24/rivian-automotive-nasdaq-rivn-stock-price-prediction-for-2025-where-will-it-be-in-1-year/",
                "body": "Investing\nRivian Automotive (NASDAQ: RIVN) Stock Price Prediction for 2025: Where Will It Be in 1 Year (Sept 24)\nBy Joel South\nSep 24, 2025 | Updated 8:20 AM ET\nThis post may contain links from our sponsors and affiliates, and Flywheel Publishing may receive compensation for actions taken through them.\nShares of Rivian Automotive Inc. (NASDAQ: RIVN) are changing hands for 10.0% more than a week ago, outperforming the Nasdaq. The electric vehicle (EV) maker just broke ground on its new $5 billion manufacturing plant in Georgia and has begun upgrading its plant in Illinois. And there has been speculation that it may unveil an electric bike in the near future. The share price is 30.4% higher than a year ago.\nShares of EV manufacturer Rivian have been on a rollercoaster this year, surging and then falling after its first-quarter report. They have recovered somewhat since the second-quarter report. In the latest results, revenue was up slightly year over year and sequentially to $1.3 billion. However, the company also posted a wider-than-expected loss and widened its full-year loss projection due to tariffs and the loss of EV tax credits. This reflected a 90% decline from its November 2021 IPO high. Some Wall Street analysts decreased their price targets after the report.\n24/7 Wall St. Key Points:\n- The EV market is expected to grow at a compound annual growth rate (CAGR) of 32% through 2030, but Rivian Automotive Inc. (NASDAQ: RIVN) forecasts lower deliveries for 2025 than in 2024.\n- After reporting second-quarter earnings, the company has now posted consecutive quarters of positive gross profit, and its cash position remains solid.\n- Are you ahead, or behind on retirement? SmartAsset’s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted, and must act in your best interests. Don’t waste another minute; learn more here.(Sponsor)\nStill, the stock is 49.9% higher since its year-to-date low in April, despite facing challenges from reduced delivery targets and tariff pressures. However, it is countering those headwinds with cost efficiencies, strategic partnerships, and the anticipated R2 launch next year. 24/7 Wall St. conducted some analysis to give investors a better idea of where they can expect the stock to be in a year. Let’s take a look at whether Rivian can overcome its hurdles and return to growth.\nWhy Invest in Rivian?\nRivian is grappling with significant obstacles. Second-quarter deliveries totaled 10,661 vehicles, down 22.7% year over year. This decline in deliveries comes as Rivian prepares for the launch of its 2026 model year vehicles. The company reaffirmed its 2025 delivery guidance of 40,000 to 46,000 vehicles. It cited softening demand due to economic uncertainties and shifting consumer sentiment, as well as tariffs that are increasing manufacturing costs.\nRivian is still losing a lot of money on every car it builds, even though it was able to reduce the per-share vehicle losses from $43,000 in Q4 to $38,798 in Q1. Moreover, car buyers likely accelerated their purchases into the first quarter to avoid potential tariffs. As a result, sales for the current quarter could be weak as well.\nStill, a $5.8 billion joint venture with Volkswagen, with $1 billion turned over in June 2025, bolsters Rivian’s $7.2 billion in cash, equivalents, and short-term investments. The R2, a $45,000 midsize SUV set for 2026 production in Illinois, targets broader appeal, while plant upgrades—including a planned month-long shutdown in the second half of 2025—aim to boost efficiency by 30%.\nFurther, the EV market is expected to grow at a 32% CAGR through 2030, though Rivian projects full-year 2025 revenue of $4.7 billion to $4.9 billion, which at the midpoint is down from $4.97 billion last year. The hope is that the new R2 release and fleet sales could boost revenue further.\nFor its part, Rivian has now seen consecutive quarters of positive gross profit. The EV make"
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "50.240",
            "open": "6,664.200",
            "close": "6,643.230",
            "high": "6,674.980",
            "low": "6,624.740"
        },
        "market_summary": "The provided articles contain no relevant financial or market data pertaining to the SPX500 (S&P 500 index). The content consists of an obituary, a feature on a Los Angeles winemaker, and a Panasonic camera lens product announcement. Therefore, a holistic market summary for the SPX500 cannot be derived from this information.\nSENTIMENT: Neutral\n\n**Overall Market Sentiment:** Neutral",
        "source_articles": [
            {
                "title": "Douglas S. Gravett Obituary September 24, 2025 - Beam Funeral Service & Crematory",
                "source": "Beam Funeral Service & Crematory",
                "url": "https://www.beamfuneralservice.com/obituaries/douglas-gravett",
                "body": "Douglas S. Gravett, 79, of Marion, passed away at home on the morning of Wednesday, September 24, 2025.\nHe was born in Spruce Pine on October 3, 1945 to the late Douglas and Mittie Hensley Gravett.\nAn avid outdoorsman, Doug loved turkey hunting and walleye fishing. He was employed for many years at Air Preheater as a welder. Doug, who was a devoted family man, truly loved his wife, children, and grandchildren. He will be remembered for his infectious sense of humor and the joy he brought to others.\nHe is survived by his wife, Brenda Pendergrass Gravett; two daughters, Lesa Walker (Todd) and Angie Gilland (Robbie); three grandchildren, Justin Lawing, Angel Nicole Waldrop (Ryan), and April Renee Gilland (William Gillis); two great-grandchildren, Malachai and Rowan; and one sister, Shelda Gravett.\nNo services are planned at this time.\nVisits: 549\nThis site is protected by reCAPTCHA and the\nGoogle Privacy Policy and Terms of Service apply.\nService map data © OpenStreetMap contributors"
            },
            {
                "title": "L.A.’s king of super chuggers keeps making wild wines — and serious ones too - Los Angeles Times",
                "source": "Los Angeles Times",
                "url": "https://www.latimes.com/food/story/2025-09-24/la-winemaker-scott-sampler-scotty-boy-wines",
                "body": "- Share via\n- Scott Sampler’s sometimes polarizing natural wines have become fixtures at top L.A. restaurants.\n- The former film industry worker uses some convention-defying methods.\n- His artistic bent and boundary-pushing approach have driven his success in a city embracing experimentation.\nWith his nimbus of graying hair and penchant for tracksuit casual, Scott Sampler looks more like an aging deejay than what he is: a winemaker. His wines have landed on the lists of top-end restaurants like Hatchet Hall, Vespertine, Meteora, Anajak Thai and Manuela, where they’re often singled out with sidebars, subsections and narrative intros, declaring, in so many words, “Check this guy out!”\nEven in a town like Los Angeles, where the rules for what is and what isn’t cool to drink can be relentlessly, er, fluid, Sampler’s wines have managed to channel L.A.’s boundless culinary enthusiasms for the past decade. Pungent, savory, defiantly unfruity, his wines can be polarizing even in the era of natural wine, when wine’s very range of flavors is in flux.\nAnd yet by their sheer force of personality, idiosyncrasy and restless energy, Sampler’s wines are among the most popular and successful in L.A. right now and feel distinctly of and for this city. An Angeleno by birth, he’s taken a highly developed artistic temperament and a penchant for philosophy and directed these into the medium of winemaking.\n“He goes deep,” says Anajak Thai’s wine director Ian Krupp, who’s worked with Sampler’s wines and has collaborated on restaurant-only exclusives. “He doesn’t really have any boundaries for himself.”\nSampler has three distinct wine brands. There’s Scotty-Boy! (exclamation his), perhaps his most visible and accessible, with arcane names like “Big Tang” and “El Sandweech!!!” They’re often blends of grape varieties that really have no business being in the same bottle, like Chardonnay and Riesling, with varying levels of skin contact, co-fermentation, carbonic ferments or pétillance.\nWines from the other two brands, CCGP (Central Coast Group Project) and L’Arge d’Oor (see what he did there?) might be construed as more serious, with long periods — as much as 12 years — in barrel and bottle before release.\nHave a family recipe for your favorite holiday cookie? The L.A. Times is accepting recipe submissions for its 2025 Holiday Cookie Bake-Off until Monday, Oct. 13.\nHis latest endeavor, Cahiers du Oenologique (“winegrowing notebooks”), is a joint project with his high school friend, filmmaker Babak Shokrian. They’ll release an estate wine in the fall from Shokrian’s vineyard in Los Alamos, supplemented with art materials, short films, photos and a quarterly journal documenting the process as it went from harvest to bottle. “We’re going to be exploring the auteur theory of winemaking,” says Sampler.\nTaken together, his wines flirt with the flavors associated with natural wines — sour, slightly grubby, jangly and volatile, flavors sometimes more common in kombucha than wine, ranging from serious to “chuggy.”\nThat range, and that vibe, attracts people to him, especially sommeliers, like Nathaniel Muñoz, former wine director at the Rose Café in Venice. “Scott chooses to approach winemaking,” he says, “in a way that challenges most people’s thinking about what you can do to grapes that will become wine.”\n‘I dove right in’\nOn a recent Thursday, Sampler was ensconced in a booth across from the bar at Musso & Frank’s in Hollywood. He likes to say that his first meal at Musso & Frank’s was in utero. “My parents used to come here before I was born,” he tells me. “By the time I was seven I was a regular.”\nOver his Musso & Frank favorites — lightly grilled prime rib, sand dabs, creamed spinach, mashed potatoes, apple pie à la mode — he discussed how it all started.\n“I had absolutely no thought of making wine until it started to happen,” he says. “These abstract ideas I kept having around winemaking started to coalesce, they started to become a tangible thing. The pa"
            },
            {
                "title": "Panasonic Introduces the First*1 Ultra-Telephoto Zoom Lens in the LUMIX S Series - Panasonic",
                "source": "Panasonic",
                "url": "https://na.panasonic.com/news/panasonic-introduces-the-first1-ultra-telephoto-zoom-lens-in-the-lumix-s-series",
                "body": "Panasonic Introduces the First*1 Ultra-Telephoto Zoom Lens in the LUMIX S Series\nLUMIX S 100-500mm F5-7.1 O.I.S. (S-R100500)\nNewark, N.J. (September 24, 2025) – Panasonic is proud to introduce the new LUMIX S 100-500mm F5-7.1 O.I.S. (S-R100500) interchangeable lens based on the L-Mount system standard.\nAs the first*1 ultra-telephoto zoom lens in the LUMIX S Series lineup to cover a focal length of up to 500mm, this lens supports lens teleconverters*2 (sold separately), enabling ultra-telephoto shooting with a combined focal length of up to 1000mm. It delivers high resolution and beautiful bokeh across the entire zoom range, enabling photographers and videographers to capture stunning images and footage in a wide variety of shooting scenarios, including wildlife, motorsports, and landscapes.\nWith an optimized lens element arrangement and Dual Phase Linear Motor, the lens achieves a remarkably compact design with an overall length of just 196.1mm, while delivering impressive ultra-telephoto performance. High-speed, high-precision, and silent autofocus, combined with Dual I.S. 2 image stabilization supporting up to 7.0 stops*3, ensures exceptional portability and handheld shooting support, expanding creative possibilities in the field.\nThe lens is also designed for intuitive operation, featuring a customizable focus ring and a focus button. The focus ring can be used as a control ring, by assigning preferred settings such as aperture or other customizable parameters*4, while the focus button allows users to assign their preferred functions, enabling a highly personalized and responsive shooting experience. To meet the growing demand for video production, the lens also incorporates features such as focus breathing suppression and micro-step aperture control for smooth exposure transitions, supporting high-quality video performance.\nWith this product, Panasonic aims to expand the creative scope by providing a compact yet powerful ultra-telephoto shooting experience for both enthusiasts and professionals.\nMain Features\n- The First*1 Ultra-Telephoto Zoom Lens in the LUMIX S Series Covering Up to 500mm\n- Maintains high resolution across the entire zoom range, delivering sharp detail and beautiful bokeh even at maximum aperture\n- Covers focal lengths from 100mm to 500mm; compatible with lens teleconverters*2 (sold separately) for ultra-telephoto shooting up to 1000mm\n- Powerful 7.0-stop Dual I.S. 2 for Unshakable Stability and Enhanced Mobility\n- Achieves highly effective image stabilization with 7.0-stop*³ Dual I.S. 2\n- Ultra-telephoto zoom reaches in a remarkably compact 196.1mm design\n- High-speed, high-precision AF powered by a Dual Phase Linear Motor\n- Intuitive Operability for Focused Shooting\n- Focus ring can be assigned to control shooting settings such as aperture (Control Ring function) *4\n- Focus button can be assigned to support intuitive operations such as Hybrid Zoom*5\nPrice and availability\nThe new LUMIX S 100-500mm lens will be available for pre-order on September 25th for $2099.99 at valued channel partners.\n*1 As of September 24, 2025. Among interchangeable lenses for AF compatible full-frame mirrorless cameras.\n*2 With optional teleconverter DMW-STC20 attached. The maximum aperture becomes two stops slower.\nWhen a teleconverter is attached, the focal length of this lens is limited to 150–500mm.\n*3 Based on the CIPA standard [Yaw/Pitch direction: focusing distance f=500mm. When LUMIX S1RII is used.]\n*4 Compatible cameras: DC-S1M2, DC-S1M2ES, DC-S1RM2 (Firmware version 1.2)\n*5 This function combines optical zoom and crop zoom, allowing you to extend the telephoto range using only the zoom ring without changing the focal length at the wide end.\n• L-Mount is a trademark or registered trademark of Leica Camera AG.\n• Design and specifications are subject to change without notice.\nFollow Press Updates for Panasonic LUMIX:\n- Online: http://us.panasonic.com/news\n- Instagram: http://www.instagram.com/lumixusa\n- TikTok: https:/"
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "630.000",
            "open": "45,563.870",
            "close": "45,653.160",
            "high": "45,833.870",
            "low": "45,203.870"
        },
        "market_summary": "Japan's Nikkei 225 edged higher, supported by gains in major constituents like SoftBank Group and Tokyo Electron. The market's advance was modest, pausing after a strong quarterly rally, as investors globally awaited key U.S. economic data and further comments from the Federal Reserve. A weaker yen provided a tailwind, supporting exporter stocks.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Stock market today: S&P 500 futures, Japan's Nikkei climb as market awaits more Fed comments - Economy Middle East",
                "source": "Economy Middle East",
                "url": "https://economymiddleeast.com/news/stock-market-today-sp-500-futures-japans-nikkei-climb-as-market-awaits-more-fed-comments/",
                "body": "The Asian stock market paused its recent rally on Thursday as the Japanese yen slipped to new lows against the euro and the rapidly strengthening Swiss franc.\nMeanwhile, S&P 500 and Nasdaq futures gained 0.07 percent and 0.05 percent, respectively, as investors awaited comments from Federal Reserve officials for clues on the direction of interest rates. San Francisco Fed President Mary Daly indicated that additional rate cuts are likely, though the timing remains uncertain.\nMeanwhile, Federal Reserve Chair Jerome Powell adopted a cautious stance on additional rate cuts, following the central bank’s first easing move of the year just last week.\nU.S. economic data in focus\nIn the Asian stock market, MSCI’s broadest index of Asia-Pacific shares outside Japan fell 0.11 percent, following gains of 5.5 percent for the month and 9 percent for the quarter. Japan’s Nikkei edged up 0.1 percent after rising 7 percent for the month and 13 percent for the quarter.\nMeanwhile, China’s CSI 300 Index gained 0.70 percent and Hong Kong’s Hang Seng dipped a marginal 0.018 percent.\nWall Street ended lower for a second consecutive session overnight as investors took profits from record-high stocks. Futures still suggest a 92 percent probability of a Federal Reserve rate cut in October, though total expected easing has declined to 100 basis points from 125 basis points just weeks ago.\nAttention now turns to U.S. economic data, including Thursday’s final estimate for second-quarter GDP and Friday’s Personal Consumption Expenditures report, the Fed’s preferred inflation gauge, as concerns over a potential government shutdown continue to weigh. In addition, weekly U.S. jobless claims data, due later on Thursday, may provide further insights into labor market conditions.\nRead: Dubai 24-carat gold prices rise AED0.75 as global rates gain on weaker dollar\nU.S. dollar index dips as yen marks steep losses\nIn forex markets, the dollar dipped 0.1 percent to 148.77 yen after a 0.9 percent gain overnight. The U.S. dollar index declined 0.13 percent to 97.75.\nThe yen was the biggest loser, hitting a one-year low of 174.78 against the euro, just shy of the record low 175.9, and an all-time low of 187.30 versus the Swiss franc. The Swiss National Bank is expected to keep its policy rate at zero later today, marking its first pause since late 2023.\nIn commodities, spot gold gained 0.09 percent to $3,738.40 per ounce after a 0.7 percent overnight drop amid a stronger dollar. Brent crude futures dipped 26 cents or 0.38 percent to $69.05 a barrel, while U.S. West Texas Intermediate crude futures fell 27 cents or 0.42 percent to $64.72. Both benchmarks gained 2.5 percent on Wednesday, reaching their highest levels since August 1."
            },
            {
                "title": "The Nikkei Average is up approximately 80 yen, with positive contributions primarily from SoftBank Group, Tokyo Electron, and Recruit Holdings. - 富途牛牛",
                "source": "富途牛牛",
                "url": "https://news.futunn.com/en/post/62575669/the-nikkei-average-is-up-approximately-80-yen-with-positive",
                "body": "As of 12:47 PM on the 25th, the Nikkei Stock Average was trading around 45,710 yen, approximately 80 yen higher than the previous day. The afternoon session began with a predominance of selling pressure, followed by a period of range-bound trading. The foreign exchange rate is hovering at around 148.60 yen to the dollar.\nIn terms of contribution to the Nikkei Average's constituent stocks, SoftBank Group <9984.T>, Tokyo Electron <8035.T>, and Recruit Holdings <6098.T> ranked among the top gainers. Conversely, Advantest <6857.T>, Fast Retailing <9983.T>, and Terumo <4543.T> were among the top decliners.\nAs of 12:45 PM, trading volume on the Prime Market amounted to 923.53 million shares, with a total trading value of 2.9033 trillion yen.\nProvided by: Wealth Advisor Co."
            },
            {
                "title": "Japan’s Topix Rises as Weaker Yen Supports Buying of Exporters - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/articles/2025-09-25/japan-s-topix-rises-as-weaker-yen-supports-buying-of-exporters",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            }
        ]
    }
]