[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "51.660",
            "open": "4,630.450",
            "close": "4,615.320",
            "high": "4,632.880",
            "low": "4,581.220"
        },
        "market_summary": "### Gold (XAU/USD) Market Briefing\n\n* **Key Drivers:** A stronger **U.S. dollar**, fueled by weaker-than-expected U.S. weekly jobless claims, and a softer stance by President Trump towards Iran, reducing **safe-haven demand** for precious metals.\n* **Price Action:** Gold prices slipped to **$4,601.8** per ounce, down **$21.9** or **0.47%**, after hitting an all-time high of **$4,650.50** per ounce, showing **bearish** momentum.\n* **Technical Outlook:** Immediate support is near the recent low of **$4,601.8**, with resistance at the all-time high of **$4,650.50**.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "Gold Price Forecast 2026: Central Bank Demand Drives Bullish Outlook - Discovery Alert",
                "source": "Discovery Alert",
                "url": "https://discoveryalert.com.au/gold-price-forecast-2026-federal-reserve-influence/",
                "body": "The global monetary landscape has fundamentally shifted as central banks worldwide embrace unprecedented accommodation strategies. This transformation extends far beyond traditional interest rate adjustments, encompassing comprehensive policy frameworks that systematically reduce opportunity costs for non-yielding assets while simultaneously generating persistent currency devaluation pressures. Financial markets increasingly recognise these developments as structural rather than cyclical, fundamentally altering how institutional investors approach gold price forecast modelling and portfolio allocation decisions.\nFederal Reserve policies specifically create cascading effects throughout precious metals markets through multiple transmission mechanisms. Real interest rates—calculated as nominal rates minus inflation expectations—have entered negative territory across multiple time horizons, effectively providing direct subsidies for alternative monetary stores. This mathematical relationship between policy rates and gold valuations extends beyond simple correlation, reflecting deeper structural changes in how global capital flows respond to monetary accommodation.\nHow Federal Reserve Rate Dynamics Shape 2026 Gold Trajectories\nInterest rate policy architecture fundamentally determines gold's investment attractiveness through opportunity cost calculations and currency strength implications. Current Fed positioning suggests continued accommodation through 2026, with market participants anticipating additional rate reductions totalling 75-100 basis points across multiple meetings. Furthermore, these expectations create immediate upward pressure on gold valuations while establishing longer-term structural support.\nHistorical analysis reveals that 25 basis point rate reductions typically correlate with 3-5% gold price appreciation within 30 trading days, though this relationship varies significantly based on market expectations and concurrent economic conditions. The mechanism operates through multiple channels simultaneously: reduced opportunity costs make non-yielding assets more attractive, currency devaluation expectations increase, and portfolio rebalancing toward gold as inflation hedge accelerates.\nCurrent Rate Environment Analysis:\n- Fed funds rate positioning at 4.25-4.50% supports continued precious metals demand\n- Market-implied probabilities suggest 67% likelihood of July 2026 rate reduction\n- Real interest rates remain negative 0.75% when adjusted for core inflation expectations\n- Forward guidance indicates policy accommodation through Q4 2026\nCurrency dynamics amplify these rate effects as dollar weakness creates dual benefits for gold investors. The Trade-Weighted U.S. Dollar Index has declined 8.3% since early 2025, reflecting both relative monetary policy positioning and structural fiscal concerns. Consequently, this currency weakness translates directly into gold price appreciation for dollar-denominated investors while simultaneously reducing gold costs for international purchasers.\nCentral Bank Reserve Accumulation Patterns Transform Market Structure\nGlobal central banks continue implementing strategic reserve diversification programmes that systematically increase gold allocations regardless of price levels. Current institutional demand exceeds 850 tonnes quarterly, representing a fundamental shift from episodic purchasing toward sustained, strategic accumulation. This transformation reflects broader concerns about currency concentration risks and geopolitical asset freezing precedents.\nInstitutional Demand Breakdown:\nReserve diversification strategies extend beyond simple portfolio optimisation, incorporating strategic considerations about monetary system evolution and geopolitical risk management. Central banks increasingly view gold purchases as essential infrastructure for maintaining monetary policy independence, particularly as international sanctions risks expand and currency weaponisation concerns intensify."
            },
            {
                "title": "Silver, gold retreat from record highs on strong U.S. dollar, weak global cues - The Hindu",
                "source": "The Hindu",
                "url": "https://www.thehindu.com/business/markets/silver-gold-retreat-from-record-highs-on-strong-us-dollar-weak-global-cues/article70513593.ece",
                "body": "Silver futures ended their five-day record-breaking rally and declined by ₹4,027 to ₹2,87,550 per kg on Friday (January 16, 2026), while gold prices slipped to ₹1,42,601 per 10 grams as investors booked profits tracking weak global trends and a stronger U.S. dollar.\nOn the Multi Commodity Exchange (MCX), silver futures for March delivery declined by ₹4,027, or 1.38%, to ₹2,87,550 per kilogram in a business turnover of 9,890 lots. The white metal had touched an all-time high of ₹2,92,960 per kilogram on Thursday (January 15, 2026).\nCommodities trading on the MCX remained shut during the morning session on Thursday (January 15) due to civic elections in Maharashtra and later resumed trading in the evening session.\nGold futures also witnessed profit-taking by the traders on the domestic bourse. The yellow precious metal for the February contract fell ₹520, or 0.36%, to ₹1,42,601 per 10 grams in 14,194 lots.\n\"Gold and silver witnessed sharp volatility on Friday (January 16). Weaker-than-expected U.S. weekly jobless claims strengthened the U.S. dollar, while President Donald Trump's softer stance on Iran reduced safe-haven demand for precious metals,\" Rahul Kalantri, Vice-President of Commodities, Mehta Equities Ltd, said.\nIn the international market, both silver and gold corrected during Asian trading hours. On the Comex, silver for the March contract slipped $1.93, or 2.10%, to $90.41 per ounce. It had touched a record of $93.56 per ounce on Wednesday (January 14).\nGold futures for February delivery also dropped by $21.9, or 0.47%, to $4,601.8 per ounce. The yellow metal had hit an all-time high of $4,650.50 per ounce on January 14.\n\"Recent U.S. macroeconomic data has kept expectations of Federal Reserve rate cuts on hold for the first half of the year, pushing the dollar index to multi-week highs and creating near-term headwinds for bullion prices,\" Mr. Kalantri added.\nPublished - January 16, 2026 12:14 pm IST"
            },
            {
                "title": "Rising US dollar index and easing Trump threats against Iran drive gold and silver prices down - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/asia/amp/news/detail/12560605156220",
                "body": "PANews, January 16 – On Friday, both gold and silver prices fell due to a stronger US dollar, following the release of US initial jobless claims data that was weaker than expected. In addition, US President Trump’s softer stance towards Iran also reduced the safe-haven demand for precious metals. Analysts stated that this round of decline is related to the US Dollar Index rising to the 99.49 level, the highest since early December last year. Market observers noted that although gold and silver have recently retreated, safe-haven demand for precious metals continues to be supported by domestic turmoil in Iran and geopolitical risks related to Venezuela and Greenland. These uncertainties keep investors focused on precious metals as risk-hedging assets. Analysts expect that gold and silver prices will remain volatile this week, mainly influenced by fluctuations in the US Dollar Index. Meanwhile, the market is also awaiting a major ruling by the US Supreme Court on a tariff case, which could further impact the price trends of precious metals."
            }
        ]
    },
    {
        "asset_name": "Silver",
        "symbol": "EIGHTCAP:XAGUSD",
        "status": "Success",
        "data": {
            "day_range": "7.755",
            "open": "92.970",
            "close": "92.306",
            "high": "93.651",
            "low": "85.896"
        },
        "market_summary": "### Silver (XAG/USD) Market Briefing\n* **Key Drivers:** industrial demand is shrinking amid **high prices**, and the **dual nature** of silver as both a precious metal and a key industrial raw material makes it vulnerable to supply shocks and **contraction in industrial demand**.\n* **Price Action:** Spot silver prices hit a record high above **$93** per ounce, with gains nearing **26%** since the start of 2026, but have retreated over the past few days due to **slowing corporate procurement** and **consumption of existing inventories**.\n* **Technical Outlook:** Immediate support is near the **50-day moving average**, with resistance at **$93** per ounce, and hedge funds and other large speculative institutions have cut their net long positions in silver by **15%** to **15,045 contracts** in the week ending January 13.\n--- \n**Overall Sentiment:** Neutral ⚖️",
        "source_articles": [
            {
                "title": "Silver: My 2017 Thesis On Industrial Demand, Illustrates Why This Is Not A Silver Market Bubble - Seeking Alpha",
                "source": "Seeking Alpha",
                "url": "https://seekingalpha.com/article/4860577-silver-my-2017-thesis-on-industrial-demand-illustrates-why-this-is-not-a-silver-market-bubble",
                "body": "Investment Thesis\nIt is easy to correlate the meteoric rise in silver prices with the dramatic rally in gold prices we saw in the past few years. There is a strong argument to be made, given that\nIt is easy to correlate the meteoric rise in silver prices with the dramatic rally in gold prices we saw in the past few years. There is a strong argument to be made, given that\nAnalyst’s Disclosure:I/we have a beneficial long position in the shares of SLV, GLD either through stock ownership, options, or other derivatives. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.\nI own physical gold & silver.\nSeeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body."
            },
            {
                "title": "Gold retreats as Fed chair uncertainty weighs on markets; silver tumbles on China trading curbs - KITCO",
                "source": "KITCO",
                "url": "https://www.kitco.com/opinion/2026-01-16/gold-retreats-fed-chair-uncertainty-weighs-markets-silver-tumbles-china-trading",
                "body": "Gary Wagner\nGary S. Wagner has been a technical market analyst for 25 years. A frequent contributor to STOCKS & COMMODITIES Magazine, he has also written for Futures Magazine as well as Barrons. He is the executive producer of \"The Gold Forecast,\" a daily video newsletter.\nHe has been a speaker for financial seminars including Futures West and the Dow Jones Financial Symposium which travels throughout the world.. Coauthor of \"Trading Applications Of Japanese Candlestick Charting\" a John Wiley publication.\nJoseph Wagner\nJoseph Wagner is a technical analyst with a background in Fibonacci and Japanese Candlesticks. He has primarily focused on Bitcoin for the past 8 years, and authored a publication on trading BTC called “the Bitcoin Minute” since 2020. A member of The Gold Forecast team since 2015 and has been at the head of their silver division since the start of 2025.\nDisclaimer: The views expressed in this article are those of the author and may not reflect those of Kitco Metals Inc. The author has made every effort to ensure accuracy of information provided; however, neither Kitco Metals Inc. nor the author can guarantee such accuracy. This article is strictly for informational purposes only. It is not a solicitation to make any exchange in commodities, securities or other financial instruments. Kitco Metals Inc. and the author of this article do not accept culpability for losses and/ or damages arising from the use of this publication."
            },
            {
                "title": "Is the silver bull market changing? Analysts warn: industrial demand is shrinking amid high prices. - 富途牛牛",
                "source": "富途牛牛",
                "url": "https://news.futunn.com/en/post/67536946/is-the-silver-bull-market-changing-analysts-warn-industrial-demand",
                "body": "①In the recent sharp rally of precious metals, silver has significantly outperformed gold. However, this rally is facing a practical constraint: industries that use this white metal may have started to reduce purchases; ②Saxo Bank strategists noted that every rally eventually reaches its limit, and for silver, the most likely factor to halt its rise is the contraction of industrial demand.\nCailian Press, January 17 (edited by Bian Chun) — In the recent sharp rally of precious metals, silver has significantly outperformed gold. However, this rally is facing a practical constraint: industries that use this white metal may have started to reduce purchases.\nOle Hansen, head of Saxo Bank's commodity strategy, recently wrote: “When the price of silver rises to a certain level, manufacturers and end users simply cannot bear the higher costs.”\nSilver’s industrial applications include solar panels, electronics, and chips that are crucial to artificial intelligence development.\n“These companies either attempt to pass on the costs but fail, reduce their procurement volumes, or switch to alternative materials,” Hansen added.\nThis week, spot silver prices hit a record high above $93 per ounce, with gains nearing 26% since the start of 2026. The price of this precious metal surged by about 170% in 2025 alone, far exceeding gold’s increase of 73% during the same period.\nCompared to gold, silver plays a more complex role as it is both a precious metal and a key industrial raw material. This means it benefits from safe-haven demand while also being closely tied to long-term trends such as electrification, solar energy, and electronics.\nThis dual nature makes silver particularly vulnerable to supply shocks. Last year, due to tariff concerns, a large amount of silver flowed into the United States, causing abnormally low inventories in the London market. Subsequent physical silver short squeezes further amplified the price surge.\nWith the current price of silver at approximately $91 per ounce, some industrial users have already begun reacting by either reducing usage or seeking alternatives.\nRecently, China’s leading photovoltaic companies, LONGi Green Energy and JinkoSolar, both announced they would begin using cheaper base metals to partially replace silver.\nNevertheless, Hansen pointed out that the impact of slowing corporate procurement and the consumption of existing inventories may take some time to fully materialize, thereby altering the market's overall view on the silver boom.\n\"Every rally eventually comes to an end, and for silver, the most likely braking factor is the contraction in industrial demand,\" said Hansen.\nSilver prices have retreated over the past few days after President Trump announced earlier this week that he would temporarily not impose tariffs on critical minerals and instructed negotiations with trading partners regarding key mineral issues.\nData released by the U.S. government on Friday showed that hedge funds and other large speculative institutions cut their net long positions in silver by 15% to 15,045 contracts in the week ending January 13, marking the lowest level in more than 22 months."
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.925",
            "open": "65.199",
            "close": "63.947",
            "high": "65.339",
            "low": "63.414"
        },
        "market_summary": "### Spot Brent Crude Oil Market Briefing\n\n* **Key Drivers:** Geopolitical tensions in **Iran** and the **Strait of Hormuz** are raising concerns over potential supply disruptions, while **OPEC+** production decisions and global demand trends also influence prices.\n* **Price Action:** Prices are experiencing **bullish momentum** due to lingering **Iran risk**, with support from **$70** levels, as unrest in Iran and potential US military presence in the Middle East impact market sentiment.\n* **Technical Outlook:** Immediate support is near the **$65** level, with resistance at **$75**, as the market reacts to **geopolitical risk** and **supply and demand fundamentals**.\n\n---\n**Overall Sentiment:** Cautiously **bullish** ️",
        "source_articles": [
            {
                "title": "‘Utensils for olive oil’: Inside the West Bank’s deepening economic collapse - Middle East Eye",
                "source": "Middle East Eye",
                "url": "https://www.middleeasteye.net/news/utensils-olive-oil-inside-west-banks-deepening-economic-collapse",
                "body": "‘Utensils for olive oil’: Inside the West Bank’s deepening economic collapse\n\"Utensils in exchange for a bottle of olive oil and a kilo of za’atar so my children can take some to school.”\nThe post, shared by a Palestinian woman in Bethlehem in a private Facebook group for mothers, is no longer unusual.\nSince the war on Gaza began - and Israeli restrictions across the occupied West Bank intensified - women have increasingly offered furniture, toys, kitchenware and even their children’s clothes in return for basic food.\nLong the barest staples of Palestinian life, olive oil and za’atar (a herb blend) have become shorthand for poverty itself, captured in the saying: “He lives on oil and za’atar.”\nBefore the war, these Facebook groups dealt in surplus. They offered goodwill exchanges of outgrown clothes and spare toys.\nNew MEE newsletter: Jerusalem Dispatch\nSign up to get the latest insights and analysis on Israel-Palestine, alongside Turkey Unpacked and other MEE newsletters\nBut with time, they have turned into urgent pleas for milk, cooking oil, medicine and other essentials.\nToday, they map the depth of a cost-of-living crisis tightening its grip across the West Bank.\nThe territory is sliding into a hunger crisis, says economy researcher Dr Haitham Oweida.\nHunger, by international definitions, does not mean total deprivation. It means the inability to secure enough nutritious food consistently - a condition now visibly taking hold across the West Bank, according to Oweida.\nThe crisis, though less stark than in Gaza, is felt daily, as economic conditions across the West Bank rapidly deteriorate.\nEconomic collapse\nSince October 2023, Israeli restrictions on livelihoods and resources across the West Bank have pushed an already fragile economy towards collapse, turning everyday survival into a struggle.\nPoverty rates have risen to around 28 percent of the population. There has been an unprecedented decline in the ability of social protection programmes to meet growing needs.\nBefore the war, the Palestinian economy rested on three main pillars.\nThe first was Palestinian labour in Israel. Between 250,000 and 300,000 workers, with and without permits, injected around $460m a month - more than $5.5bn a year - into the economy.\nMost workers have been banned from entering Israel since the war broke out in October 2023.\nThe second was domestic tourism by Palestinian citizens of Israel, which sustained trade and services across the West Bank and generated a similar $460m per month.\nThe third was clearance revenues - taxes collected by Israel on behalf of the Palestinian Authority (PA) - which brought in between $260m and $310m monthly.\nAfter the war began, most of these flows dried up. International aid to the PA also declined and became increasingly unstable, falling in 2025 to an estimated $710m-$770m a year.\nThe affect has been immediate. The PA has struggled to pay full salaries to public-sector employees, even as security conditions deteriorated.\nMeanwhile, Israeli closures have intensified. Military checkpoints have increased to around 898, alongside some 300 military gates, according to the UN Office for the Coordination of Humanitarian Affairs (OCHA). This has left trade and internal movement largely paralysed.\nUnlike previous economic crises, the fallout has not been confined to the poorest. It has cut across all layers of society.\n“What is happening in the West Bank is voluntary economic displacement,” Dr Oweida told Middle East Eye.\n'We have reached a stage where Palestinians - whether traders, public employees or labourers - can no longer continue'\n- Dr Haitham Oweida, economy researcher\n“We have reached a stage where Palestinians - whether traders, public employees or labourers - can no longer continue.”\nAccording to the 2025 report by the Palestinian Central Bureau of Statistics and the Palestinian Monetary Authority, unemployment in the West Bank has reached around 28 percent.\nGDP has fallen by 13 percent compared with 2023."
            },
            {
                "title": "Market Outlook: Iran unrest raises oil supply fears tied to Strait of Hormuz - BNN Bloomberg",
                "source": "BNN Bloomberg",
                "url": "https://www.bnnbloomberg.ca/investing/market-outlook/2026/01/16/market-outlook-iran-unrest-raises-oil-supply-fears-tied-to-strait-of-hormuz/",
                "body": "Oil prices have traded modestly higher over the past week, but renewed unrest in Iran has drawn attention back to geopolitical risks that could quickly disrupt global energy flows. Investors are closely watching the Strait of Hormuz, a critical chokepoint for oil and natural gas shipments, as tensions escalate.\nBNN Bloomberg spoke with Rob Thummel, senior portfolio manager and managing director at Tortoise Capital, about why geopolitical risk remains largely absent from oil prices, how supply disruptions could change that quickly, and where crude prices may head over the longer term.\nKey Takeaways\n- Geopolitical risk remains largely unpriced in oil despite rising tensions in Iran and other producing regions.\n- Any disruption to the Strait of Hormuz could have an outsized impact, as roughly 20 per cent of global oil and LNG flows pass through the waterway.\n- A full and prolonged closure of the Strait is considered unlikely due to Iran’s reliance on oil exports and international security presence.\n- Short-term supply disruptions or rising geopolitical anxiety could still push oil prices several dollars higher.\n- Over the longer term, reduced U.S. production and stronger demand could gradually lift oil prices toward the low US$70 range.\nRead the full transcript below:\nANDREW: Let’s take a look at a one-week chart for oil and see how crude in North America has fared. As of today, it’s up about one per cent — not a massive move, but you can see that modest gain over the past week. There was a spike earlier amid fears, among other things, that the United States might launch an attack on Iran following the killing of protesters.\nLet’s get more from Rob Thummel, senior portfolio manager and managing director at Tortoise Capital. Thanks very much for joining us. It’s interesting that we have two geopolitical stories simmering right now — Venezuela and Iran.\nROB: You’re right, Andrew. There are two, but there’s probably close to zero geopolitical risk embedded in crude oil prices at the present time. From our perspective, that creates the potential for oil prices to rise simply because these geopolitical concerns seem to be increasing almost daily.\nANDREW: That’s interesting. We’ve heard for quite a while that the oil market seems remarkably calm about geopolitical risk. You don’t think even a modest risk premium is creeping into crude right now?\nROB: Maybe a very mild one, but not much. If you think about what could happen, it really comes down to geography — particularly with Iran and the Strait of Hormuz. As many viewers know, the Strait of Hormuz is critically important to global energy transportation, especially oil. Tens of millions of barrels per day move through the strait.\nIf Iran were somehow to temporarily block or disrupt that passage, it would wreak havoc on the global oil market by reducing supply, at least in the short term. Obviously, there are many interested parties — including the U.S., China and others — that want to ensure that doesn’t happen. But the reality is that the Strait of Hormuz is one of the most important transit points for energy commodities in the world.\nANDREW: I’ve heard it said this week that such a move would be a desperate one for the regime in Tehran — something it might only consider if it felt backed into a corner.\nROB: I agree. It would be a last-ditch effort, but it would cause oil prices to rise substantially. A more realistic scenario is the gradual addition of geopolitical risk to oil prices. I think you could see prices move up by a few dollars as tensions continue to rise.\nIf things were to calm down, fundamentals would still dominate. The global oil market remains oversupplied, which is why prices fell last year. Until there’s an adjustment in supply or stronger demand, oil prices will largely move with perceptions of geopolitical risk.\nANDREW: Where do you see oil heading over the next year? I know that’s almost impossible to answer given all the variables, but do you see crude edging h"
            },
            {
                "title": "Crude Oil Prices Supported by Lingering Iran Risk - TradingView — Track All Markets",
                "source": "TradingView — Track All Markets",
                "url": "https://www.tradingview.com/news/barchart:204da7239094b:0-crude-oil-prices-supported-by-lingering-iran-risk/",
                "body": "Crude Oil Prices Supported by Lingering Iran Risk\nFebruary WTI crude oil (CLG26) today is up +0.71 (+1.20%), and February RBOB gasoline (RBG26) is up +0.0136 (+0.76%).\nCrude oil and gasoline prices are moving higher today as they recover some of Thursday's sharp selloff. Geopolitical risks in Iran are supporting crude prices even as the chance of an immediate US response to violent protests in Iran has eased, as the US is boosting its military presence in the Middle East.\nDon’t Miss a Day: From crude oil to coffee, sign up free for Barchart’s best-in-class commodity analysis.Pre-weekend short covering in crude futures is supporting prices today amid heightened geopolitical risks in Iran. While the threat of an immediate intervention from the US against Iran has subsided, the US is moving an aircraft carrier strike group into the Middle East, and other military assets are expected to be shifted there in the coming days and weeks, according to Fox News.\nUnrest in Iran, OPEC's fourth-largest producer, is underpinning crude prices as thousands of protesters have taken to the streets in many cities of Iran to protest government policies that have triggered a currency crisis and economic collapse. Iranian security forces have killed thousands of protesters, and President Trump said he may attack Iran if the government continues to kill protesters. Reuters reported on Wednesday that some US personnel have been advised to leave the US Al Udeid Air base in Qatar. The facility was targeted by Iran in retaliatory airstrikes last year after the US attacked Iran's nuclear facilities. Iran, OPEC's fourth-largest producer, produces more than 3 million bpd, and its crude production could be disrupted if the protests against the government worsen and the US decides to strike government targets.\nCrude is also finding support after drone attacks on oil tankers near the Caspian Pipeline Consortium terminal on Russia's Black Sea Coast have reduced crude loadings at the terminal by almost half to around 900,000 bpd.\nVortexa reported Monday that crude oil stored on tankers that have been stationary for at least 7 days fell -0.3% w/w to 120.9 million bbl in the week ended January 9.\nStrength in Chinese crude demand is supportive for prices. According to Kpler data, China's crude imports in December are set to increase by 10% m/m to a record 12.2 million bpd as it rebuilds its crude inventories.\nCrude garnered support after OPEC+ on January 3 said it would stick to its plan to pause production increases in Q1 of 2026. OPEC+ at its November 2025 meeting announced that members would raise production by +137,000 bpd in December, but will then pause the production hikes in Q1-2026 due to the emerging global oil surplus. The IEA in mid-October forecasted a record global oil surplus of 4.0 million bpd for 2026. OPEC+ is trying to restore all of the 2.2 million bpd production cut it made in early 2024, but still has another 1.2 million bpd of production left to restore. OPEC's December crude production rose by +40,000 bpd to 29.03 million bpd.\nUkrainian drone and missile attacks have targeted at least 28 Russian refineries over the past four months, limiting Russia's crude oil export capabilities and reducing global oil supplies. Also, since the end of November, Ukraine has ramped up attacks on Russian tankers, with at least six tankers attacked by drones and missiles in the Baltic Sea. In addition, new US and EU sanctions on Russian oil companies, infrastructure, and tankers have curbed Russian oil exports.\nLast month, the IEA projected that the world crude surplus will widen to a record 3.815 million bpd in 2026 from a 4-year high of over 2.0 million bpd in 2025.\nOn Tuesday, the EIA raised its 2026 US crude production estimate to 13.59 million bpd from 13.53 million bpd last month, and cut its US 2026 energy consumption estimate to 95.37 (quadrillion btu) from 95.68 last month.\nWednesday's EIA report showed that (1) US crude oil inventories as of January 9"
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "2.230",
            "open": "61.057",
            "close": "59.292",
            "high": "61.112",
            "low": "58.882"
        },
        "market_summary": "### Spot WTI Crude Oil Market Briefing\n* **Key Drivers:** Reduced drilling activities due to low crude prices, OPEC's increased exports to India, and rising geopolitical tensions in Iran, particularly concerning the **Strait of Hormuz**.\n* **Price Action:** Recently showing a modest gain, with prices potentially poised to move higher due to **geopolitical risk** and reduced U.S. production, targeting the **low $70** range over the longer term.\n* **Technical Outlook:** Immediate focus is on potential **short-term supply disruptions** or increased **geopolitical anxiety** that could push oil prices **several dollars higher**, with support and resistance levels needing to be reevaluated based on emerging trends and **fundamental analysis**.\n\n--- \n**Overall Sentiment:** Neutral with potential for **bullish momentum** 📈",
        "source_articles": [
            {
                "title": "Hamm to Halt Drilling in Bakken Shale on Lower Crude Prices - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/articles/2026-01-16/harold-hamm-to-halt-drilling-in-bakken-shale-on-lower-oil-prices",
                "body": "Hamm to Halt Drilling in Bakken Shale on Lower Crude Prices\nHarold Hamm, the billionaire wildcatter who helped kick off the US shale oil revolution, said he’s about to shut down his company’s drilling in North Dakota’s Bakken for the first time in decades because of low crude prices.\n“This will be the first time in over 30 years that Harold Hamm has not had an operation with drilling rigs in North Dakota,” Hamm, the founder of shale driller Continental Resources Inc., said in a telephone interview Thursday. “There’s no need to drill it when margins are basically gone.”"
            },
            {
                "title": "OPEC Boosts Oil Exports to India as Russian Flows Slump - Crude Oil Prices Today | OilPrice.com",
                "source": "Crude Oil Prices Today | OilPrice.com",
                "url": "https://oilprice.com/Latest-Energy-News/World-News/OPEC-Boosts-Oil-Exports-to-India-as-Russian-Flows-Slump.html",
                "body": "The United States has cut…\n\"It's most important 8 minute read of my week…\"\nThe share of OPEC crude oil in India’s import mix surged to the highest in 11 months in December as Russian shipments dropped to the lowest in two years on the latest U.S. sanctions.\nReuters reported, citing trade data, that the share of OPEC crude in India’s imports went up to 53.25 of the total, while Russian oil flows dropped by 22% to 1.38 million barrels daily, to represent 27.4% of total Indian oil imports. A big chunk of the decline came from Reliance Industries’ suspension of purchases from sanctioned Rosneft, with which the Indian company has a long-term supply deal.\nEven so, on an individual basis, Russia remained the largest supplier of crude oil to India, followed by Iraq at number two and Saudi Arabia at number three in December, as Indian state-owned oil companies switched to buying crude from non-sanctioned Russian companies.\nRussian oil flows to India are likely to remain relatively strong, at between 1.2 million barrels daily and 1.4 million barrels daily, Kpler analyst Sumit Ritola said, as quoted by Reuters.\nOver 2025, per the data, the share of OPEC crude in Indian imports ticked up from 49% a year earlier to 50%, while Russia’s share declined from 36% in 2024 to 33%.\nEarlier this week, Finland-based Centre for Research on Energy and Clean Air reported that Russian oil flows to India had dropped by 29% on the month in December, while exports to China went up by 23% on November. Oil exports to China in December drove an 11% increase in total Russian exports, CREA noted in its report, even as shipments to India fell to the lowest since the G7 imposition of a price cap on Russian oil shipments insured at Western companies. The decline, however, was a lot more modest than a Bloomebrg prediction that Russian flows to India could slump to just 800,000 barrels daily in December because of the new sanctions.\nBy Irina Slav for Oilprice.com\nMore Top Reads From Oilprice.com\nADVERTISEMENT\nIrina is a writer for Oilprice.com with over a decade of experience writing on the oil and gas industry."
            },
            {
                "title": "Market Outlook: Iran unrest raises oil supply fears tied to Strait of Hormuz - BNN Bloomberg",
                "source": "BNN Bloomberg",
                "url": "https://www.bnnbloomberg.ca/investing/market-outlook/2026/01/16/market-outlook-iran-unrest-raises-oil-supply-fears-tied-to-strait-of-hormuz/",
                "body": "Oil prices have traded modestly higher over the past week, but renewed unrest in Iran has drawn attention back to geopolitical risks that could quickly disrupt global energy flows. Investors are closely watching the Strait of Hormuz, a critical chokepoint for oil and natural gas shipments, as tensions escalate.\nBNN Bloomberg spoke with Rob Thummel, senior portfolio manager and managing director at Tortoise Capital, about why geopolitical risk remains largely absent from oil prices, how supply disruptions could change that quickly, and where crude prices may head over the longer term.\nKey Takeaways\n- Geopolitical risk remains largely unpriced in oil despite rising tensions in Iran and other producing regions.\n- Any disruption to the Strait of Hormuz could have an outsized impact, as roughly 20 per cent of global oil and LNG flows pass through the waterway.\n- A full and prolonged closure of the Strait is considered unlikely due to Iran’s reliance on oil exports and international security presence.\n- Short-term supply disruptions or rising geopolitical anxiety could still push oil prices several dollars higher.\n- Over the longer term, reduced U.S. production and stronger demand could gradually lift oil prices toward the low US$70 range.\nRead the full transcript below:\nANDREW: Let’s take a look at a one-week chart for oil and see how crude in North America has fared. As of today, it’s up about one per cent — not a massive move, but you can see that modest gain over the past week. There was a spike earlier amid fears, among other things, that the United States might launch an attack on Iran following the killing of protesters.\nLet’s get more from Rob Thummel, senior portfolio manager and managing director at Tortoise Capital. Thanks very much for joining us. It’s interesting that we have two geopolitical stories simmering right now — Venezuela and Iran.\nROB: You’re right, Andrew. There are two, but there’s probably close to zero geopolitical risk embedded in crude oil prices at the present time. From our perspective, that creates the potential for oil prices to rise simply because these geopolitical concerns seem to be increasing almost daily.\nANDREW: That’s interesting. We’ve heard for quite a while that the oil market seems remarkably calm about geopolitical risk. You don’t think even a modest risk premium is creeping into crude right now?\nROB: Maybe a very mild one, but not much. If you think about what could happen, it really comes down to geography — particularly with Iran and the Strait of Hormuz. As many viewers know, the Strait of Hormuz is critically important to global energy transportation, especially oil. Tens of millions of barrels per day move through the strait.\nIf Iran were somehow to temporarily block or disrupt that passage, it would wreak havoc on the global oil market by reducing supply, at least in the short term. Obviously, there are many interested parties — including the U.S., China and others — that want to ensure that doesn’t happen. But the reality is that the Strait of Hormuz is one of the most important transit points for energy commodities in the world.\nANDREW: I’ve heard it said this week that such a move would be a desperate one for the regime in Tehran — something it might only consider if it felt backed into a corner.\nROB: I agree. It would be a last-ditch effort, but it would cause oil prices to rise substantially. A more realistic scenario is the gradual addition of geopolitical risk to oil prices. I think you could see prices move up by a few dollars as tensions continue to rise.\nIf things were to calm down, fundamentals would still dominate. The global oil market remains oversupplied, which is why prices fell last year. Until there’s an adjustment in supply or stronger demand, oil prices will largely move with perceptions of geopolitical risk.\nANDREW: Where do you see oil heading over the next year? I know that’s almost impossible to answer given all the variables, but do you see crude edging h"
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0054",
            "open": "1.1643",
            "close": "1.1608",
            "high": "1.1646",
            "low": "1.1593"
        },
        "market_summary": "### EUR/USD Market Briefing\n* **Key Drivers:** Firm US economic data, such as **solid jobless claims** and **factory inflation**, has dampened hopes for **Fed easing**, strengthening the **US Dollar**. The **European Central Bank's (ECB)** dovish bias and **weak eurozone growth momentum** also undermine the **Euro**.\n* **Price Action:** The EUR/USD pair has slipped to **1.1600**, showing **bearish momentum**. The pair has broken below key moving averages, with immediate support at **1.1585-1.1600** and resistance at **1.1660-1.1700**.\n* **Technical Outlook:** The **Moving Average Convergence Divergence (MACD)** is in **negative territory**, and the **Relative Strength Index (RSI)** is near **34**, indicating **bearish pressure**. Key technical levels include support at **1.1350-1.1300** and resistance at **1.1500-1.1530**.\n\n--- \n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "EUR/USD slips to 1.1600 as firm US data dampens Fed easing hopes - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/eur-usd-slips-to-11600-as-firm-us-data-dampens-fed-easing-hopes-202601162220",
                "body": "EUR/USD slips to 1.1600 as firm US data dampens Fed easing hopes\n- EUR/USD weakens as solid US jobless claims and factory inflation lift Treasury yields.\n- Markets scale back Fed easing bets amid political uncertainty over the next Fed Chair.\n- German inflation hits ECB’s 2% target, offering limited support to the shared currency.\nEUR/USD drops even though the Dollar pared some of its earlier gains on Friday sparked by solid US economic data releases in the week, which has improved the outlook for the labor market. This trimmed the chances for further easing by the Federal Reserve, a tailwind for the Greenback. The pair trades at 1.1599, down 0.08%.\nEuro edges lower as strong US labor and production data underpin the Dollar despite fading momentum\nThe shared currency is poised to end the week negatively, following solid jobless claims revealed on Thursday. This, a spike on factory inflation and US President Trump reluctancy to nominate Kevin Hassett as Fed Chair, pushed US Treasury yields higher and expectations for further Fed easing lower.\nConsequently, the Dollar recovered ground. US Treasury Secretary Scott Bessent said that the Fed Chair decision would be known before Davos and that Governor Stephen Miran can continue at the central bank past January 31st.\nOn Friday, several Federal Reserve officials crossed the wires, led by the Vice-Chair Philip Jefferson, Governor Michelle Bowman and Boston Fed Susan Collins. Except for Bowman supporting further rate cuts, Jefferson and Collins consider policy to be in a good place.\nData-wise, US Industrial Production rose 0.4% in December, exceeding estimates for a dip to 0.1%, revealed the Federal Reserve.\nIn Europe, the docket remained light with the release of German inflation, which hit the European Central Bank’s target of 2% YoY in December.\nEuro Price This week\nThe table below shows the percentage change of Euro (EUR) against listed major currencies this week. Euro was the strongest against the Swiss Franc.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Euro from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent EUR (base)/USD (quote).\nDaily digest market movers: Euro dives as inflation recedes\n- The US Dollar Index (DXY) which tracks the American currency performance versus six peers, is up 0.03% at 99.38. US Treasury yields are soaring following the Hassett headline, with the 10-year T-note yield up nearly five basis points at 4.219%.\n- US economic data showed a mixed inflation picture, with consumer prices stabilizing while inflation on the producer-side turned hot. On an annual basis, headline CPI held at 2.7%, virtually unchanged from November, whereas PPI accelerated to 3.0%, up from 2.8% the prior month, highlighting lingering cost pressures upstream.\n- Also, the labor market signaled resilience. Last Friday’s Nonfarm Payrolls report was solid despite undershooting forecasts, while the Unemployment Rate edged down to 4.4%, below the Fed’s 4.5% projection. Reinforcing that strength, Initial Jobless Claims fell from 207K to 198K, pointing to fewer Americans filing for unemployment benefits.\n- Vice-Chair Jefferson said officials do not want to prejudge January’s decision, added that current policy stance leaves US well positioned to determine how much and when to adjust rates. Governor Bowman argued that the Federal Reserve should not pause its easing cycle, saying that additional rate cuts are warranted in light of rising risks of the jobs market.\n- Meanwhile, Boston Fed President Susan Collins underscored the importance of central bank independence, noting that an effective central bank must remain accountable yet free to make difficult and potentially unpopular decisions in pursuit of its mandate.\n- This week US economic data revealed "
            },
            {
                "title": "The Euro declines against the US Dollar, struggling as the latter gains strength, hovering around 1.1600 - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/the-euro-declines-against-the-us-dollar-struggling-as-the-latter-gains-strength-hovering-around-1-1600/",
                "body": "The Euro weakens against the US Dollar as positive US data supports the Dollar’s strength. Markets expect the Federal Reserve to maintain current interest rates, bolstering the Dollar. EUR/USD trades flat near 1.1600 after hitting its lowest since November 28.\nTechnical indicators maintain bearish pressure on EUR/USD, with the pair trading below key moving averages clustered around 1.1660-1.1665. The Moving Average Convergence Divergence (MACD) is still in negative territory, while the Relative Strength Index (RSI) hovers near 34.\nImmediate Support and Resistance\nImmediate support lies in the 1.1585-1.1600 range, while a break below could push it towards 1.1550. Resistance for rebounds is near 1.1660-1.1700.\nThe Euro is the currency for 20 EU countries and is heavily traded. In 2022, it accounted for 31% of foreign exchange transactions. The ECB, located in Frankfurt, sets interest rates to manage monetary policy, with inflation often prompting rate changes.\nEconomic indicators such as GDP and trade balances influence the Euro’s value. A strong economy can boost the Euro by attracting foreign investment and potentially leading to higher interest rates. A positive net trade balance also strengthens the currency.\nWe are seeing a familiar pattern of US Dollar strength capping any attempts by the Euro to rally. The latest US jobs report, showing a robust 250,000 positions added in December 2025, reinforces the view that the Federal Reserve has little reason to cut rates soon. This situation is reminiscent of the pressure we observed throughout much of last year when strong US data kept the dollar elevated.\nTechnical Outlook and Trading Strategies\nThis policy divergence is becoming starker, as recent Eurozone inflation figures for January 2026 came in at 1.8%, below the ECB’s target. This soft reading increases the likelihood that the European Central Bank may have to consider easing its policy later this year, putting further downward pressure on the EUR/USD pair. Historically, when the Fed holds steady while the ECB hints at cuts, the dollar almost always outperforms the Euro.\nThe technical picture also supports a bearish outlook, with the pair struggling below the key simple moving averages clustered around 1.1660-1.1700. We saw this zone act as a major ceiling in 2025, and it now appears to be a formidable resistance level again. The momentum indicators, like the MACD and RSI, are pointing to persistent selling pressure, much as they did during previous downturns.\nFor derivative traders, this environment suggests positioning for further weakness in the coming weeks. Buying put options with strike prices below the 1.1600 support level could be a straightforward way to profit from a continued slide toward the 1.1500 psychological mark. A bear put spread could also be used to lower the upfront cost of the position while defining the risk.\nAny unexpected rallies should be viewed with skepticism and potentially as opportunities to enter bearish positions at better prices. We should watch for the pair becoming oversold, as an RSI near 34 has previously signaled temporary bounces, but the dominant trend remains downward. The strong resistance near 1.1700 makes selling call options or implementing bear call spreads a viable strategy to generate income on the belief that the upside is limited."
            },
            {
                "title": "EUR/USD Under Pressure as Momentum Breaks and ECB–Fed Gap Widens - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/analysis/eurusd-under-pressure-as-momentum-breaks-and-ecbfed-gap-widens-200673336",
                "body": "Stock market today: S&P 500 ends week lower as tariff, Fed concerns weigh\nEUR/USD has slipped back into clear bearish territory, with price rolling over from recent highs and momentum deteriorating sharply. The technical breakdown is increasingly aligned with a fundamental backdrop that continues to favour the US dollar, leaving the euro vulnerable to further downside unless key support levels hold.\nTechnical Picture: Breakdown from Range Signals Bearish Shift\nOn the daily chart, EUR/USD has lost upside momentum decisively, breaking below short-term support and key moving averages.\n- Price is trading below the 15-day and 20-day moving averages, both of which have turned lower\n- The recent failure near the 1.18 area marked a lower high within the broader range\n- Selling pressure has accelerated as the pair slipped back toward the 1.13–1.14 zone\nThis price action suggests a transition from consolidation into a bearish continuation phase rather than a temporary pullback.\nKey Technical Levels\nSupport\n- 1.1350–1.1300: Immediate support zone\n- A daily close below 1.1300 would expose 1.1200, followed by 1.1100\nResistance\n- 1.1500–1.1530: Initial resistance and former support\n- 1.1700–1.1750: Major resistance and prior range highs\n- Only a sustained move back above 1.1750 would neutralize the bearish structure\nMomentum Indicators\n- RSI (14) near 35, approaching oversold territory\n- Momentum has broken decisively below the 50 level, confirming bearish control\n- No clear bullish divergence is visible yet, leaving room for further downside before stabilization\nFundamental Drivers: Euro Undermined by Policy and Growth Divergence\nEuropean Central Bank: Dovish Bias Remains a Headwind\nThe euro continues to struggle as markets price in:\n- Earlier and deeper ECB rate cuts relative to the Federal Reserve\n- Weak eurozone growth momentum\n- Cooling inflation pressures that give policymakers room to ease\nThis keeps rate differentials structurally unfavourable for the euro.\nFederal Reserve: Relative Support for the Dollar\nOn the U.S. side:\n- Growth remains more resilient than in the eurozone\n- The Fed continues to emphasize data dependence and patience\n- U.S. yields, while volatile, remain supportive relative to Europe\nThis dynamic reinforces the dollar’s advantage, particularly during periods of global uncertainty.\nBroader Macro Backdrop: Risk Sensitivity Still Matters\nEUR/USD remains sensitive to:\n- Shifts in global risk sentiment\n- Equity market volatility\n- Relative growth expectations\nIn the absence of a strong risk-on impulse, the euro tends to underperform.\nForward Scenarios\nBearish Continuation (Base Case)\n- Sustained trade below 1.1350\n- Opens downside toward 1.1200, then 1.1100\n- Likely driven by firm U.S. data or confirmation of ECB easing\nStabilization / Corrective Bounce\n- Oversold conditions could trigger a rebound toward 1.1500\n- Such moves are likely to face selling pressure unless fundamentals shift materially\nEUR/USD has shifted decisively to a bearish posture, with weakening momentum now aligned with a clear policy and growth divergence favouring the U.S. dollar. While short-term oversold conditions may slow the decline, the broader setup continues to favour selling rallies rather than positioning for a sustained recovery.\nMedium-term bias: Bearish\nShort-term outlook: Weak, oversold risks emerging\nKey risk: Sharp deterioration in U.S. data or an unexpected ECB hawkish turn\nWhich stock should you buy in your very next trade?\nAI computing powers are changing the stock market. Investing.com's ProPicks AI includes dozens of winning stock portfolios chosen by our advanced AI.\nYear to date, 2 out of 3 global portfolios are beating their benchmark indexes, with 88% in the green. Our flagship Tech Titans strategy doubled the S&P 500 within 18 months, including notable winners like Super Micro Computer (+185%) and AppLovin (+157%).\nWhich stock will be the next to soar?"
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0083",
            "open": "1.3431",
            "close": "1.3380",
            "high": "1.3445",
            "low": "1.3362"
        },
        "market_summary": "### GBP/USD Market Briefing\n\n* **Key Drivers:** The **US Dollar** is strengthening due to expectations that the **Federal Reserve** will maintain current interest rates, driven by **persistent inflation** and a **stable labor market**.\n* **Price Action:** The **GBP/USD** pair is trading near **1.3380**, having broken below the key psychological level of **1.3400**, indicating significant **bearish** momentum.\n* **Technical Outlook:** Immediate support is near the **20-day Exponential Moving Average (EMA)** at **1.3428**, with resistance at the **50% Fibonacci retracement level** at **1.3401** and the **61.8% retracement** at **1.3494**.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "During the Asian hours, GBP/USD trades near 1.3380 after previous modest losses, with downward expectations - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/during-the-asian-hours-gbp-usd-trades-near-1-3380-after-previous-modest-losses-with-downward-expectations/",
                "body": "GBP/USD Decline\nGBP/USD remains under 1.3400 as the US dollar strengthens based on expectations that the Federal Reserve will maintain current interest rates. The pair traded around 1.3380 during Asian hours on Friday, slightly recovering after previous losses, yet may further decline as the USD gains momentum.\nUS Department of Labor data revealed Initial Jobless Claims fell to 198K for the week ending January 10, surpassing expectations of 215K. This drop indicates the labour market is stable despite prolonged high borrowing rates, contributing to the US dollar’s rise.\nGBP/USD approaches 1.3370 as robust US data supports a dollar rally, overshadowing positive GDP figures from the UK. The pair is currently at 1.3367, marking a 0.53% decrease, driven by solid US economic indicators overpowering UK economic news.\nThursday’s upbeat mood was bolstered by the Jobless Claims report showing a drop to 198K, and improvements in manufacturing indexes. The New York Empire State Manufacturing Index climbed from -3.7 to 7.7, while the Philadelphia Fed Manufacturing Survey jumped by 12.6, surpassing forecasts.\nThe article’s author maintains no positions in stocks mentioned and is solely compensated by FXStreet, without offering financial advice or personalized recommendations. The information provided should not be considered investment advice.\nMarket Reaction in 2025\nLooking back to this time in 2025, we saw the market react to strong US labor data that kept the Federal Reserve on hold. Initial jobless claims coming in at 198K, well below expectations, signaled a resilient economy. This strength was a key reason the dollar began to outperform the pound.\nThat trend has largely continued, as the Fed maintained its cautious stance throughout 2025, supporting the dollar. We see this resilience even now, with the latest jobless claims for the week ending January 9, 2026, holding steady at 210,000. This confirms the labor market remains tight, giving the Fed little reason to rush into cutting interest rates from their current 5.25% level.\nAs a result, the GBP/USD pair has drifted lower over the past year and is currently trading near 1.3150, well below the 1.3380 level seen in January 2025. The interest rate differential between the US and the UK remains a primary driver for currency traders. The narrative of a stronger US economy continues to weigh on the pound.\nUK Economic Pressures\nThe focus is now shifting to the Bank of England, which is facing a different set of economic pressures. With UK inflation having cooled more definitively to 2.5% in the latest report, markets are pricing in a higher probability that the BoE will begin cutting rates before the Fed. This expectation of policy divergence is likely to add further downward pressure on the GBP/USD pair in the coming weeks.\nGiven this outlook, buying put options on GBP/USD offers a straightforward way to position for potential further weakness in the pound. This strategy allows traders to profit if the exchange rate falls below a specific level, while limiting the initial risk to the premium paid for the option. It is a direct play on the theme of a strong dollar and a potentially softer pound.\nConsidering that implied volatility often increases around central bank meetings, a bear put spread could also be an effective strategy. By selling a lower-strike put against the purchased put, traders can reduce the upfront cost of the position. This approach caps potential profits but offers a more capital-efficient way to bet on a moderate decline in GBP/USD."
            },
            {
                "title": "GBP/USD Forecast: Pound Sterling under pressure, hit 4-week lows against US Dollar - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/analysis/gbp-usd-weekly-forecast-pound-sterling-remains-under-pressure-against-us-dollar-202601161420",
                "body": "GBP/USD Weekly Forecast: Pound Sterling remains under pressure against US Dollar\n- Pound Sterling declined to a four-week low around 1.3360 against the US Dollar during the week.\n- Criminal charges against Fed’s Powell remained a key event for the US Dollar’s price action.\n- Investors brace for high volatility in the Pound Sterling ahead of a UK data-packed week.\nThe Pound Sterling (GBP) started off the week on a firm footing against the US Dollar (USD) and jumped to 1.3486 on Monday, following criminal charges against Federal Reserve’s (Fed) Chair Jerome Powell over cost overrun in the reconstruction of Washington’s headquarters.\nHowever, the GBP/USD pair turned down steadily as the week passed after Bank of England (BoE) policymaker Alan Taylor delivered dovish comments on the monetary policy outlook, and investors shifted their focus to the Fed’s monetary policy decision scheduled later this month.\nPound Sterling turned upside down\nThe Pound Sterling gained sharply against the US Dollar on Monday after United States (US) federal prosecutors opened a criminal investigation into Fed Chair Powell over mismanaging funds in the reconstruction of Washington’s headquarters.\nIn response, Powell said that the “new threat is not about the renovation project but a pretext”. He also added that the threat of criminal charges is a “consequence of the Fed setting interest rates based on its assessment of the public interest rather than the president's preferences”.\nMarket experts viewed the accusation of cost overruns against Powell as an attack on the central bank’s independence, which could undermine US assets and impact the US sovereign rating in the long run.\nIt remained clear from US President Donald Trump’s comments over the past several months that he was unhappy with the Fed not reducing interest rates aggressively, criticizing Chairman Powell several times for the same.\nOn Tuesday, US President Trump criticized Fed’s Powell again after the release of the Consumer Price Index (CPI) data for December, which showed price pressures rising steadily, demonstrating his dislike for him for not prioritizing his economic agenda. “We have very low inflation. That would give ’too late Powell’ the chance to give us a nice beautiful big rate cut,\" Trump said.\nChiefs from global central banks came in support of Powell, stating that “Independence of central banks is a cornerstone of price, financial and economic stability in the interest of the citizens that we serve”, and “we stand in full solidarity with the Fed System and its Chair Jerome H. Powell.”\nHowever, the steady US CPI report on Tuesday provided relief for the US Dollar against the British currency, as it intensified speculation that the Fed will announce a pause in its ongoing monetary-easing campaign at its policy meeting later this month.\nOn Wednesday, dovish commentary from BoE’s Taylor on the monetary policy outlook dragged the Pound Sterling further against the US Dollar.\nTaylor said in a speech on Wednesday that inflation could return to the central bank’s 2% target in mid-2026 more quickly than having to wait until 2027, and projected that interest rates could “normalise to neutral sooner rather than later”. In the December policy meeting, the BoE guided that the monetary policy will remain on a “gradual downward path”.\nThe impact of expectations for the Fed holding interest rates steady and BoE Taylor’s dovish commentary was significant for GBP/USD, restraining the pair from regaining ground despite strong United Kingdom (UK) monthly Gross Domestic Product (GDP) data for November on Thursday.\nThe Office for National Statistics (ONS) reported that the economy returned to growth after contracting 0.1% in both September and October. The GDP growth came in at 0.3%, stronger than estimates of 0.1%. Month-on-month (MoM) Industrial and Manufacturing Production also grew at a robust pace of 1.1% and 2.1%, respectively.\nGBP/USD revisited a four-week low around 1.3360 on late Thursday "
            },
            {
                "title": "Pound Sterling continues to show weakness compared to the US Dollar - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605155704",
                "body": "The British Pound (GBP) is treading carefully, hovering close to its lowest point in four weeks around 1.3360 against the US Dollar (USD) during Friday's European session. The GBP/USD currency pair faces downward pressure as the US Dollar maintains its strength, supported by growing expectations that the Federal Reserve will refrain from further monetary easing at its upcoming policy meeting this month.\nCurrently, the US Dollar Index (DXY)—which measures the Dollar’s performance against a basket of six major currencies—remains elevated, holding near Thursday’s six-week peak of 99.50.\nMarket participants have largely factored in the likelihood that the Fed will keep interest rates unchanged within the 3.50%-3.75% range at the January meeting, according to data from the CME FedWatch tool.\nPersistent inflationary pressures in the United States are fueling these expectations. On Thursday, Kansas City Fed Bank President Jeffrey Schmid remarked that monetary policy should remain “modestly restrictive” as inflation continues to run high.\nMeanwhile, the Pound is expected to remain rangebound as investors await key economic indicators from the United Kingdom, including employment figures and Consumer Price Index (CPI) data, both due next week. These reports will be closely watched for insights into the Bank of England’s (BoE) future policy direction.\nOn the daily chart, GBP/USD is trading at 1.3384, positioned below the 20-day Exponential Moving Average (EMA) of 1.3428, which has started to slope downward and is limiting any recovery attempts.\nThe 14-day Relative Strength Index (RSI) stands at 46, indicating neutral momentum and remaining below the midpoint. The 50% Fibonacci retracement level, calculated from the 1.3793 high to the 1.3009 low, sits at 1.3401 and serves as immediate resistance. A daily close above this level could alleviate some of the bearish sentiment.\nAs long as the pair stays beneath the 20-EMA, the short-term outlook remains negative, with rallies likely to be capped by overhead resistance. Should buyers manage to push the price above the average on a daily closing basis, the next target would be the 61.8% retracement at 1.3494. However, failure to surpass these resistance levels would likely keep the pair in a consolidation phase below key barriers.\n(This technical analysis was generated with assistance from an AI tool.)"
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0043",
            "open": "0.6677",
            "close": "0.6697",
            "high": "0.6709",
            "low": "0.6667"
        },
        "market_summary": "### AUD/USD Market Briefing\n\n* **Key Drivers:** The **AUD/USD** pair is influenced by the **divergence in monetary policy** between the Reserve Bank of Australia (RBA) and the US Federal Reserve, with the RBA likely to **hike rates** and the Fed expected to **cut rates** in the future.\n* **Price Action:** The pair is trading around **0.6700**, with a **0.3% weekly appreciation** and nearly **4% above December lows**, driven by **strong US economic data** and **hawkish Fedspeak**.\n* **Technical Outlook:** Immediate support is near **0.6665**, with resistance at **0.6700**, and the pair is expected to grind higher in the first half of 2026 due to the **fundamental divergence** between the RBA and the Fed.\n\n---\n**Overall Sentiment:** **Bullish**",
        "source_articles": [
            {
                "title": "AUD/USD slips as resilient US data dim hopes for early Fed cuts - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/aud-usd-slips-as-resilient-us-data-dim-hopes-for-early-fed-cuts-202601161846",
                "body": "AUD/USD slips as resilient US data dim hopes for early Fed cuts\n- AUD/USD trades lower as firm US data and cautious Fed rhetoric support the Dollar.\n- Markets push back near-term Fed cut expectations.\n- Focus shifts to China's GDP, the PBoC decision and key US releases next week.\nThe Australian Dollar (AUD) trades on the back foot against the US Dollar (USD) on Friday, as resilient US economic data and hawkish-leaning Federal Reserve (Fed) rhetoric keep the Greenback firmly supported. At the time of writing, AUD/USD trades around 0.6684, down about 0.20% on the day and poised to end the week with marginal losses.\nThe pair is struggling to attract buying interest after a run of upbeat US releases reinforced expectations that the Fed is likely to stick to a cautious, gradual easing path, diminishing hopes for near-term rate cuts.\nData released this week showed that US labour-market conditions remain firm. Weekly Initial Jobless Claims fell to 198,000, beating expectations of 215,000, while regional manufacturing surveys also improved, with both the Empire State and Philadelphia Fed indices returning to positive territory.\nInflation data earlier in the week delivered a mixed but still relatively firm signal. Headline Consumer Price Index (CPI) rose 0.3% MoM in December, matching expectations and keeping the annual rate steady at 2.7%. While core CPI increased 0.2% MoM, coming in below the 0.3% forecast. On a yearly basis, core inflation eased to 2.6%, undershooting expectations of 2.7%.\nMarkets are fully pricing in no change at the upcoming January meeting and broadly expect the Fed to remain on hold through the first quarter. According to the CME FedWatch Tool, June is currently seen as the most likely timing for the first rate cut this year, with probabilities around 46%.\nIn contrast, the Reserve Bank of Australia (RBA) is widely seen as done with its easing cycle, as inflation is still running above target. Expectations are building that the central bank will keep rates on hold throughout much of the year, with some market participants even seeing the next move more likely to be a rate hike.\nLooking ahead, traders will turn their attention to a busy economic calendar next week. In Australia, the TD-MI Inflation Gauge and employment data will be in focus. At the same time, China’s Q4 GDP, December activity data, and the People’s Bank of China’s interest-rate decision are due, which could be key drivers for the Aussie given Australia’s close trade ties with China.\nIn the United States, traders will also be watching the Gross Domestic Product (GDP) (annualized) release and the Personal Consumption Expenditures (PCE) inflation report for fresh clues on the monetary policy outlook.\nAustralian Dollar FAQs\nOne of the most significant factors for the Australian Dollar (AUD) is the level of interest rates set by the Reserve Bank of Australia (RBA). Because Australia is a resource-rich country another key driver is the price of its biggest export, Iron Ore. The health of the Chinese economy, its largest trading partner, is a factor, as well as inflation in Australia, its growth rate and Trade Balance. Market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – is also a factor, with risk-on positive for AUD.\nThe Reserve Bank of Australia (RBA) influences the Australian Dollar (AUD) by setting the level of interest rates that Australian banks can lend to each other. This influences the level of interest rates in the economy as a whole. The main goal of the RBA is to maintain a stable inflation rate of 2-3% by adjusting interest rates up or down. Relatively high interest rates compared to other major central banks support the AUD, and the opposite for relatively low. The RBA can also use quantitative easing and tightening to influence credit conditions, with the former AUD-negative and the latter AUD-positive.\nChina is Australia’s largest trading partner so the health of the Chinese e"
            },
            {
                "title": "Amid cautious RBA sentiment, the Australian Dollar stabilises around 0.6700 following two days of gains - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/amid-cautious-rba-sentiment-the-australian-dollar-stabilises-around-0-6700-following-two-days-of-gains/",
                "body": "US Dollar Dynamics\nThe AUD/USD pair holds its ground as the US Dollar sees strength following the Jobless Claims report. US Federal Reserve expectations suggest interest rates will remain on hold, with potential for rate cuts delayed to June. Improved labour market conditions and inflation concerns persist.\nThe Australian Dollar’s value is influenced by RBA interest rates, iron ore prices, and the Chinese economy’s health. Decisions by the RBA, such as interest rate adjustments, influence domestic economic rates. China’s economic condition impacts AUD, as it is Australia’s largest trading partner. The price of iron ore and Australia’s Trade Balance also significantly affect the AUD’s strength.\nGiven the AUD/USD is holding near 0.6700, we see a clear divergence forming between the central banks that traders should watch. The market is pricing in a 76% chance of a Reserve Bank of Australia rate hike by May, signaling a hawkish tilt. This presents an opportunity for strategies that benefit from a stronger Australian dollar in the medium term.\nThe case for a stronger Aussie is reinforced by Australia’s recent economic data from late 2025. The Q4 2025 Consumer Price Index from the Australian Bureau of Statistics came in at 4.1%, which was higher than anticipated and well above the RBA’s target. This persistent inflation makes a rate hike from the current 4.35% seem more like a necessity than a choice.\nMarket Opportunities For AUD USD\nOn the other side of the pair, the US dollar’s strength is based on a robust labor market delaying Federal Reserve rate cuts. We saw this in the recent US jobs report from December 2025, which showed a solid 216,000 jobs were added, keeping the Fed on hold for now. However, the Federal Reserve’s next move is still widely expected to be a cut, while the RBA’s is a hike.\nThis fundamental divergence, where one central bank is set to tighten policy and the other is poised to ease, historically creates a strong directional trend. We believe this provides a clear tailwind for the AUD/USD pair through the first half of 2026. Traders should be positioned for a potential grind higher, away from the current 0.6700 level.\nSupporting this view are Australia’s key commodity prices and trade relationships. Iron ore prices have remained robust, trading above $130 per tonne, bolstered by stable demand from China, which reported a steady 5.2% GDP growth for Q4 2025. These external factors provide an additional layer of support for the Australian dollar’s value.\nFor derivative traders, this environment suggests that buying AUD call options with expirations in the second quarter could be a prudent way to capture the expected upward move. This strategy allows for defined risk while offering significant upside potential if the RBA follows through with a rate hike as the market anticipates. Alternatively, selling out-of-the-money AUD puts could be a way to collect premium based on the view that downside is limited."
            },
            {
                "title": "AUD/USD steadies around 0.6700 with the US Dollar trimming gains - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/aud-usd-steadies-around-06700-with-the-us-dollar-trimming-gains-202601160935",
                "body": "AUD/USD steadies around 0.6700 with the US Dollar trimming gains\n- AUD/USD appreciates for the second consecutive day to reach levels above 0.6700.\n- Strong US economic data and hawkish Fedspeak buoyed the Greenback on Thursday.\n- RBA-Fed monetary policy divergence is supporting the Aussie.\nThe Aussie Dollar appreciates against its US counterpart for the second consecutive day on Friday, returning to levels above 0.6700 at the time of writing, after bouncing from the 0.6665 area. The pair is on track to a 0.3% weekly appreciation and nearly 4% aboove December lows amid hopes that the next move by the Reserve Bank of Australia will be a rate hike.\nAustralia’s Consumer Inflation Expectations report, released on Thursday, showed price pressures easing to 4.6% in January, from 4.7% in December. Inflation, however, remains above the RBA’s 2% to 3% target for price stability, adding pressure on the RBA to tighten its monetary policy.\nIn the US, recent data supported the view that the US Federal Reserve /Fed) will keep interest rates unchanged, at least in the first quarter of the year.\nThe US Labour Department revealed that Jobless claims declined to their lowest levels since November last week, while manufacturing figures from the New York and Philadelphia regions hinted at a significant improvement in the sector’s business conditions in January.\nSome Fed officials have warned against further rate cuts amid the sticky inflation levels, but the US Central bank is still expected to ease its monetary policy at least once in 2026. The RBA, on the contrary, has left interest rates unchanged at its last meetings, and the market is starting to price in a rate hike. This is likely to keep the Aussie Dollar supported, at least until February’s meeting.\nAustralian Dollar FAQs\nOne of the most significant factors for the Australian Dollar (AUD) is the level of interest rates set by the Reserve Bank of Australia (RBA). Because Australia is a resource-rich country another key driver is the price of its biggest export, Iron Ore. The health of the Chinese economy, its largest trading partner, is a factor, as well as inflation in Australia, its growth rate and Trade Balance. Market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – is also a factor, with risk-on positive for AUD.\nThe Reserve Bank of Australia (RBA) influences the Australian Dollar (AUD) by setting the level of interest rates that Australian banks can lend to each other. This influences the level of interest rates in the economy as a whole. The main goal of the RBA is to maintain a stable inflation rate of 2-3% by adjusting interest rates up or down. Relatively high interest rates compared to other major central banks support the AUD, and the opposite for relatively low. The RBA can also use quantitative easing and tightening to influence credit conditions, with the former AUD-negative and the latter AUD-positive.\nChina is Australia’s largest trading partner so the health of the Chinese economy is a major influence on the value of the Australian Dollar (AUD). When the Chinese economy is doing well it purchases more raw materials, goods and services from Australia, lifting demand for the AUD, and pushing up its value. The opposite is the case when the Chinese economy is not growing as fast as expected. Positive or negative surprises in Chinese growth data, therefore, often have a direct impact on the Australian Dollar and its pairs.\nIron Ore is Australia’s largest export, accounting for $118 billion a year according to data from 2021, with China as its primary destination. The price of Iron Ore, therefore, can be a driver of the Australian Dollar. Generally, if the price of Iron Ore rises, AUD also goes up, as aggregate demand for the currency increases. The opposite is the case if the price of Iron Ore falls. Higher Iron Ore prices also tend to result in a greater likelihood of a positive Trade Balance for Australia, which is "
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "0.6840",
            "open": "158.3910",
            "close": "158.5990",
            "high": "158.8740",
            "low": "158.1900"
        },
        "market_summary": "### USD/JPY Market Briefing\n\n* **Key Drivers:** Japan's 2s10s curve and speculation over stronger growth and inflation in Japan are driving **USD/JPY** higher, with a correlation coefficient of **0.81** and **0.87** over the past fortnight and quarter, respectively.\n* **Price Action:** The pair is approaching the lows of **August 2024**, with the yen having depreciated by about **35%** over the last five years, and technicals hinting at a possible short-term peak.\n* **Technical Outlook:** Immediate support is near the **150** area, with resistance at **160**, a level that could trigger **Bank of Japan intervention** to strengthen the yen, and the **145** area being a potential target to the downside for **2026**.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "Japanese Yen Forecast: BOJ Intervention, Election and Fed Speculation to Drive USD/JPY - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/japanese-yen-forecast-boj-intervention-election-and-fed-speculation-to-drive-usd-jpy/",
                "body": "- Japan’s 2s10s curve remains dominant USD/JPY driver\n- Fed cut expectations continue to unwind\n- Event calendars light, politics heavy\n- Technicals hint at a short‑term top\nSummary\nUSD/JPY is being driven mainly by Japan’s reflation push and a steepening yield curve, with U.S. data taking a back seat. With the calendar quiet, political developments, BOJ intervention risk and speculation over who may lead the Federal Reserve are likely to determine direction, while technicals warn of a possible short‑term peak.\nJapan Takes the Wheel\nHaving long been driven by interest rate differentials between the United States and Japan along with risk appetite, USD/JPY has undergone something of a changing of the guard when it comes to directional drivers, with domestic‑driven factors now playing a far more significant role than in the past. That can be seen in the graphic below tracking the relationship between USD/JPY with a variety of different market variables over the past fortnight (middle pane) and quarter (right‑hand pane).\nSource: TradingView\nWith correlation coefficients of 0.81 and 0.87 respectively across both timeframes, USD/JPY has demonstrated a significant relationship with Japan’s 2s10s curve (the differential between 10‑year government bond yields and two‑year yields), suggesting speculation over stronger growth and inflation in Japan driven by newly appointed Prime Minister Sanae Takaichi’s reflationary policies, and the debt required to finance them, has played a major role in pushing USD/JPY higher. If inflation is expected to erode the purchasing power of the yen as government bond issuance increases, it makes fundamental sense, especially with Japan’s already world‑leading debt levels.\nBut Fed Pricing Still Matters\nFor anyone trading USD/JPY, it is arguably more important to follow Japanese developments rather than those in the United States. However, while the once strong link between longer‑dated yield differentials shows little sign of re‑establishing itself based on the analysis, the 0.8 correlation with moves in U.S. two‑year yields over the past fortnight suggests a continued unwind in market pricing for Fed rate cuts in 2026 may also be contributing to the move higher in USD/JPY this year.\nAs the graphic below reveals, futures are now pricing just 45 basis points of cuts from the Fed, or less than two full 25bp moves. That is substantially less than levels seen in late November, indicating a sizeable hawkish recalibration has taken place.\nSource: TradingView\nHeavy Calendar, Light Impact\nHaving outlined what has been influencing USD/JPY direction, this information can then be used to assess what matters most for USD/JPY in the week ahead. Despite the stacked calendar below, the most important drivers may prove to be political than economic.\nSource: TradingView\nI may be accused of being blunt or complacent, but the known risk events do not screen as being overly risky. In the United States, there will be plenty of data released, but almost all of it is heavily dated due to the impact of the government shutdown last year. It may create some volatility, but the PCE report on Thursday covers November. We are now midway through January. Even when released promptly, markets treat CPI and PPI figures published earlier in the month as far more influential for Fed pricing, even though core PCE is the Fed’s preferred underlying measure. The income and consumption figures may also garner some interest, but do not expect this report to be a game‑changer for USD/JPY.\nElsewhere, the final print of Q3 GDP looks like a non‑event, as does the run of second‑tier releases throughout the week. As more up‑to‑date measures, jobless claims data on Thursday and the flash PMI report on Friday are worthy of more attention, although they would require a significant surprise relative to consensus to meaningfully impact the dollar.\nIn Japan, the calendar also lacks major risks. That includes the inflation figures for December and the BOJ ra"
            },
            {
                "title": "USD/JPY: A Weak Yen, the BoJ, and the Carry Trade - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/analysis/usdjpy-a-weak-yen-the-boj-and-the-carry-trade-200673364",
                "body": "Stock market today: S&P 500 ends week lower as tariff, Fed concerns weigh\nBank of Japan (BOJ) officials are increasingly discussing the weak yen as a source of inflation. Their concern is that prolonged yen weakness raises import costs and encourages businesses to pass those costs on to consumers. Bear in mind that Japan imports almost 100% of its energy needs and a large portion of other essential materials and goods.\nThe graph below shows that the yen has depreciated by about 35% over the last five years. Moreover, as we will discuss shortly, the yen is now approaching the lows of August 2024.\nThe BOJ is widely expected to hold its policy rate at 0.75% at next week’s meeting, but we expect it to hear more from the bank about the weak yen and its influence on inflation. If currency-driven inflation intensifies and the public continues to pressure politicians over inflation concerns, the yen could force the BOJ to pursue additional rate hikes to strengthen the currency.\nWhy do we care? In August 2024, the S&P 500 fell by slightly over 10% in a matter of days. This was the result of a rapidly strengthening yen. As the yen appreciated, many traders were forced to reverse yen carry trades. Simply put, these traders borrowed cheap money in Japan and invested the money in U.S. stocks and bonds.\nThe economics of the yen carry trade depend on a weak yen. Thus, when we hear the BOJ express concern about a weak yen, we must remember that the yen carry trade can be powerful. This is not a call to action, but we advise monitoring the BOJ and the yen.\nOil Prices Buck The Reflation Narrative\nThere is a growing chorus calling for an economic acceleration and a resulting surge in corporate earnings. They base their forecast on easing financial conditions, including lower rates and QE, fiscal stimulus, and the promise of productivity gains from AI. Equity markets appear to embrace this narrative, as many stock factors and sectors that lagged mega-cap stocks are outperforming the market.\nThis optimism from economists and investors clashes with oil prices. As shown below, crude oil has been in decline for the better part of four years and shows no signs of reversing. Historically, sustained economic acceleration has been accompanied by rising energy demand and higher oil prices as transportation, manufacturing, and industrial activity intensify. The absence of that positive price response suggests that the growth narrative may be more financial than fundamental.\nIn short, weak oil prices are not confirming economic reacceleration; they are quietly warning that headline optimism is running ahead of underlying, energy-intensive activity. A reversal in higher oil prices would improve the prospects of an economic acceleration.\nTweet of the Day\nWhich stock should you buy in your very next trade?\nAI computing powers are changing the stock market. Investing.com's ProPicks AI includes dozens of winning stock portfolios chosen by our advanced AI.\nYear to date, 2 out of 3 global portfolios are beating their benchmark indexes, with 88% in the green. Our flagship Tech Titans strategy doubled the S&P 500 within 18 months, including notable winners like Super Micro Computer (+185%) and AppLovin (+157%).\nWhich stock will be the next to soar?"
            },
            {
                "title": "Japan and South Korea: Big moves, big opportunity - ING THINK economic and financial analysis | ING Think",
                "source": "ING THINK economic and financial analysis | ING Think",
                "url": "https://think.ing.com/opinions/japan-and-south-korea-big-moves-big-opportunity/",
                "body": "Japan and South Korea: Big moves, big opportunity\nHere we arbitrage the recent and projected movements for Japanese and South Korean rates relative to US rates in a cross-currency framework. We find that prior convergence of rates, together with divergence in the respective Asian currencies versus their forwards against the US dollar, presents an opportunity\nWe see Japan and Korea as the inverse to China on rates arbitrage\nLast week, we published an analysis comparing Chinese and US rates, noting that current interest‑rate differentials tend to favour China relative to the US. It’s here. When we look at Japan and South Korea, however, the rate environment and currency backdrop are quite different, leading to a contrast with the China-US comparison.\nMin Joo, our Seoul-based economist, sets the scene for both. It's here for Japan, and here for South Korea. On South Korea, the key inputs are an on-hold Bank of Korea (BoK) and KRW weakness (perhaps to 1500 vs USD), ultimately giving way to KRW strength (to 1450 vs USD). And for Japan, key inputs include the Bank of Japan (BoJ) on hold for the first half of 2026 before resuming hikes in the second half, ongoing upward pressure on Japanese market rates, and on USD/JPY, where the 150 area is the next big target to the downside for 2026 (and 145 by the end of 2027). See more on that here; our FX strategist's hot-off-the-press FX Talking publication.\nWe strategise these views, together with an overlay of some notable moves in both markets over the past few weeks. Bottom line: there is a case for short tenor negative carry plays, or taking profit on existing positive carry holdings. Let's take them one at a time.\nNote that \"positive carry\" is where we receive the higher rate and pay the lower rate, and negative carry is the opposite.\nFor Japan, dominating factors remain JPY weakness and rates convergence\nA glance at the chart below shows two big moves. First, a convergence process for spreads. Spreads are still wide, e.g. the 5yr spread is at 194bp, but that's practically half what it was (upper charts). Second, there has been quite a dramatic weakness in the Japanese yen (lower charts). In addition, the cross-currency basis discount on the JPY (which acts to stretch the all-in spread) is well below prior extremes.\nAll of these generate a positive mark-to-market for existing positive carry positions; certainly the ones set nine months ago, but generally in the past two or three years, especially if set with USD/JPY FX rate at below 150. Why? Because the positive carry play is long the all-in spread (benefits if it tightens), and long USD/JPY (benefits if JPY weakens).\nRate spreads from JPY into SOFR\nCharts below show the USD/JPY FX profile\nGiven all of that, there is logic to setting an offsetting negative carry play. That could either knock out an existing positive carry play. Or it could be set outright with a view to benefiting from a very cheap entry point for the JPY, as the negative carry play benefits from JPY appreciation. We think USD/JPY can get back to 150 (and very likely lower). That's a greater JPY appreciation than discounted in the forwards out to 2yrs.\nIf not quite convinced, look at a weakening to 160 for USD/JPY as a trigger point, a level that our FX strategists identify as a likely entry point for Bank of Japan intervention (to strengthen JPY).\nFor players preferring to look to set a positive carry play, then we'd suggest a bias towards longer tenors. In the 10yr, for example, the all-in spread is 226bp. And the breakeven FX rate is 126.\nSo, provided USD/JPY does not appreciate to this level, the spread lock-in dominates, and the play generates all-in positive alpha. We'd view that as a positive reward versus risk. The trade also benefits as Japanese longer-tenor market rates rise (as it tightens the spread to SOFR rates).\nMoreover, should USD/JPY just hold at about here in the long term (say over 5-10 years), then the positive carry is picked up without any FX move"
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0044",
            "open": "1.3876",
            "close": "1.3891",
            "high": "1.3919",
            "low": "1.3875"
        },
        "market_summary": "### USD/CAD Market Briefing\n\n* **Key Drivers:** The **Canadian Dollar** is bolstered by a rebound in **oil prices** due to geopolitical tensions, while the **US Dollar** remains resilient thanks to **robust US economic data**.\n* **Price Action:** USD/CAD trades near **1.3900**, largely unchanged, as the **Canadian Dollar** finds support from **rising oil prices** and the **US Dollar** holds firm due to **strong US data**.\n* **Technical Outlook:** Immediate support is near **1.3860-1.3880**, with resistance at **1.3930** and **1.3980**. The pair's short-term **bullish momentum** is weakening, with the price approaching the **10-day moving average**.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "The CAD holds steady due to rising Oil prices, while the USD remains resilient from robust US data - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/the-cad-holds-steady-due-to-rising-oil-prices-while-the-usd-remains-resilient-from-robust-us-data/",
                "body": "The Canadian Dollar is bolstered by a rebound in oil prices amidst geopolitical tensions. Meanwhile, strong US economic indicators lend support to the US Dollar. US December Industrial Production data and insights from US policymakers are anticipated.\nUSD/CAD trades near 1.3900, largely unchanged due to a stronger Canadian Dollar, buoyed by rising oil prices, while the US Dollar holds firm due to robust US data. The Canadian Dollar benefits from increased geopolitical tensions, with Ukraine’s attacks on Russian oil tankers raising concerns about global crude oil supply, boosting prices.\nUs Dollar Resilience\nThe US Dollar maintains its strength from solid fundamentals. Resilience in the US labour market and earlier robust retail sales data suggest the Federal Reserve might keep rates steady for some months. Several Federal Reserve officials, including Chicago Fed President Austan Goolsbee and San Francisco Fed President Mary Daly, advocate for cautious monetary policy.\nRecent US data reinforce these views, with weekly initial jobless claims dipping to 198,000 and manufacturing indices improving. The future direction of USD/CAD will hinge on oil-driven support for the Canadian Dollar versus sustained US economic strength. Percentage changes of the Canadian Dollar against major currencies show it is the strongest against the Australian Dollar.\nAs of January 16, 2026, we see a familiar setup in USD/CAD, echoing the situation from early 2025. The pair is caught between a strong Canadian dollar supported by oil and a resilient US dollar. This tug-of-war suggests the current stability around 1.3650 might not last.\nGeopolitical tensions in the Middle East have once again pushed WTI crude prices above $85 a barrel, a significant jump from the fourth quarter of 2025. This provides strong underlying support for the loonie, just as we saw last year with the attacks in the Baltic Sea. As long as supply concerns persist, the Canadian dollar will likely have a floor.\nTrading Anticipation\nOn the other side, the US economy continues to show surprising strength, with the last CPI report showing inflation remains sticky at 3.4%. Weekly jobless claims are also holding firm near 210,000, reinforcing the narrative that the Federal Reserve will delay any rate cuts. This robust data is keeping the US dollar well-supported.\nFor traders, this creates a scenario where the pair could break out sharply in either direction. This environment is ideal for volatility-based derivative strategies rather than directional bets. We believe purchasing options, like straddles or strangles, could be effective to capitalize on a significant move regardless of its direction.\nAll eyes should now be on the upcoming Bank of Canada interest rate decision on January 24th. Any signal that they are more concerned about economic slowing than the Fed could cause a significant reaction. Traders should be positioned for increased price swings around that announcement.\nCurrently, the options market is reflecting this uncertainty, with one-month implied volatility for USD/CAD trading around 8.5%. This is elevated compared to periods of clear market direction. It indicates that traders are pricing in a greater than usual potential for movement in the coming weeks."
            },
            {
                "title": "USD/CAD steady as Oil rebound lifts CAD, US data supports USD - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-cad-steady-as-oil-rebound-supports-cad-us-data-underpins-usd-202601161405",
                "body": "USD/CAD steady as Oil rebound supports CAD, US data underpins USD\n- The Canadian Dollar benefits from the rebound in Oil prices amid heightened geopolitical tensions.\n- Solid US economic indicators continue to provide underlying support to the US Dollar.\n- Markets await the US December Industrial Production data and further comments from US policymakers.\nUSD/CAD trades flat around 1.3900 on Friday at the time of writing, virtually unchanged on the day. The pair’s hesitation is mainly driven by a stronger Canadian Dollar (CAD), supported by the rebound in Oil prices, while the US Dollar (USD) remains firm in the wake of strong US data sets.\nThe Canadian Dollar finds support from rising geopolitical tensions. According to Reuters, Ukraine has stepped up attacks on Russian oil tankers, with at least six vessels targeted by drones and missiles in the Baltic Sea. This development has increased concerns over global Crude Oil supply and lifted prices, which generally tends to support the Canadian Dollar. The positive correlation between energy prices and the Canadian currency therefore remains a key driver for the Loonie in the near term.\nMeanwhile, the US Dollar continues to draw support from solid fundamentals. Recent signs of resilience in the US labor market, combined with robust Retail Sales data released earlier this week, reinforce the view that the Federal Reserve (Fed) could keep interest rates unchanged for several more months.\nSeveral Fed officials have also adopted a cautious tone. Chicago Fed President Austan Goolsbee noted that, despite clear evidence of stability in the labor market, the central bank should remain focused on bringing inflation down. At the same time, San Francisco Fed President Mary Daly said that monetary policy is currently “in a good place” to respond to changes in economic conditions.\nRecent US data support this narrative. Weekly Initial Jobless Claims released by the US Department of Labor declined to 198,000 for the week ending January 10, from 207,000 previously, marking the lowest level since November and easing some concerns about labor market deterioration. In the manufacturing sector, the New York Empire State Manufacturing Index rebounded to 7.7 in January after contracting in December, while the Philadelphia Fed Manufacturing Survey jumped sharply to 12.6, well above expectations, highlighting a strong start to the year for industrial activity.\nGoing forward, the direction of USD/CAD will likely depend on the balance between Oil-driven support for the Canadian Dollar and the continued strength of US fundamentals, as investors await fresh macroeconomic releases and further guidance from Fed officials.\nCanadian Dollar Price Today\nThe table below shows the percentage change of Canadian Dollar (CAD) against listed major currencies today. Canadian Dollar was the strongest against the Australian Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Canadian Dollar from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent CAD (base)/USD (quote).\nAuthor\nGhiles Guezout\nFXStreet\nGhiles Guezout is a Market Analyst with a strong background in stock market investments, trading, and cryptocurrencies. He combines fundamental and technical analysis skills to identify market opportunities."
            },
            {
                "title": "The recovery in oil prices supported the strengthening of the Canadian dollar, with USD/CAD retreating to 1.3890 awaiting directional clarity. - 富途牛牛",
                "source": "富途牛牛",
                "url": "https://news.futunn.com/en/post/67494191/the-recovery-in-oil-prices-supported-the-strengthening-of-the",
                "body": "During the Asian trading session on Friday, the US dollar edged lower against the Canadian dollar, trading near 1.3890, as the Canadian dollar was supported by a rebound in oil prices. As one of the world's major energy exporters, Canada benefits significantly from rising oil prices.\nRecently, crude oil prices have been supported by geopolitical risks in the Middle East, benefiting the Canadian dollar and outperforming the US dollar. In terms of geopolitical risks, Ukraine has intensified attacks on Russian tankers in the Baltic Sea, with at least six tankers hit by drones and missiles.\nExpectations of energy supply disruptions have pushed up crude oil prices, while also supporting the performance of the commodity-based Canadian dollar. However, robust US economic data continues to provide resistance to downward momentum for the US dollar. A strong labor market and this week’s retail sales data further reinforce market expectations that the Federal Reserve will maintain interest rates unchanged in the short term.\nMorgan Stanley analysts have postponed the potential Federal Reserve rate cut window from January and April to June and September, reflecting a robust job market and lingering inflationary pressures.\nChicago Fed President Austan Goolsbee stated, \"With clear evidence of a stable job market, the central bank should focus on reducing inflation.\" San Francisco Fed President Mary Daly said, \"Monetary policy is in a good position and can be appropriately adjusted according to economic changes.\"\nInvestors are awaiting US December industrial production data and comments from Federal Reserve officials to determine the short-term direction of the US dollar.\nFrom a daily chart perspective, the US dollar against the Canadian dollar has retreated from a high of 1.3980 to around 1.3890 recently, with short-term bullish momentum weakening. The price is approaching the support level of the 10-day moving average, while the downward slope of the 5-day moving average indicates short-term correction pressure.\nThe MACD fast and slow lines remain above the zero axis, but the red histogram is gradually shortening, indicating weakening upward momentum; the RSI has declined to near 50, reflecting a neutral consolidation state in the market.\nBollinger Bands show that the price has pulled back from the upper band to near the middle band, with short-term volatility declining. The key short-term support range is between 1.3860 and 1.3880, while resistance levels are located at 1.3930 and 1.3980. A decisive breakout could allow the US dollar to regain upward momentum; if support is broken, downside potential may extend to around 1.3820. The overall structure suggests a high-level consolidation and correction pattern.\nEditorial View:\nThe short-term movement of the US dollar against the Canadian dollar is being influenced by both oil prices and expectations of Federal Reserve policy. Rising oil prices are providing support for the Canadian dollar, while solid US employment and retail data are maintaining the fundamental advantage of the US dollar, resulting in a volatile trading environment.\nThe technical outlook indicates a weakening of short-term bullish momentum, but no clear trend reversal signal has emerged. The exchange rate is expected to fluctuate within the range of 1.3860–1.3930. Attention should be paid to the short-term impact on the US dollar from US industrial production data and remarks by Federal Reserve officials.\nIf oil prices continue to rise, the Canadian dollar may receive additional support; if US economic data proves strong, the US dollar could experience a short-term rebound."
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "1.3160",
            "open": "212.7400",
            "close": "212.2220",
            "high": "213.3030",
            "low": "211.9870"
        },
        "market_summary": "### GBP/JPY Market Briefing\n\n* **Key Drivers:** Japanese officials' warnings of possible currency intervention and rising political uncertainty due to a potential snap general election are supporting the **Yen**, weakening **GBP/JPY**.\n* **Price Action:** The pair has slipped for a third straight session, trading around **211.60**, near one-week lows, as intervention talk and **hawkish** comments from Japanese Finance Minister Satsuki Katayama weigh on the cross.\n* **Technical Outlook:** Immediate support is near the **50-day moving average** at **210.00**, with resistance at **215.00**, as markets await the Bank of Japan's interest-rate decision and key data releases from both Japan and the UK.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "GBP/JPY weakens toward one-week lows as intervention talk supports the Yen - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-weakens-toward-one-week-lows-as-intervention-talk-supports-the-yen-202601161514",
                "body": "GBP/JPY weakens toward one-week lows as intervention talk supports the Yen\n- GBP/JPY slips for a third day as Japan’s intervention warnings weigh on the cross.\n- Japanese officials reiterate readiness to act against excessive currency moves.\n- Markets look ahead to the BoJ meeting and Japan CPI, with UK labour, inflation and Retail Sales also due.\nThe British Pound (GBP) remains under pressure against the Japanese Yen (JPY) on Friday, with GBP/JPY extending losses for a third straight session as repeated warnings from Japanese officials revive speculation over possible currency intervention. At the time of writing, the cross trades around 211.60, hovering near one-week lows.\nJapanese officials remain increasingly concerned about what they describe as one-sided and speculative currency moves, reiterating that recent Yen weakness does not reflect underlying economic fundamentals. Japanese Finance Minister Satsuki Katayama said recently that authorities “will take appropriate action against excessive currency moves without excluding any options,” including the possibility of coordinated action with the United States.\nThe latest bout of Yen underperformance has been largely driven by rising political uncertainty, after reports that Prime Minister Sanae Takaichi plans to dissolve parliament next week and call a snap general election as early as February.\nMeanwhile, attention is also turning to the Bank of Japan’s (BoJ) interest-rate decision on January 23. The central bank is widely expected to keep its policy rate unchanged at 0.75%, underscoring a gradual pace of normalization. BoJ Governor Kazuo Ueda said earlier this month that the central bank remains prepared to raise interest rates further if economic conditions evolve in line with its projections.\nAccording to a recent Reuters poll, economists expect the BoJ to keep interest rates unchanged at its upcoming January and March meetings, but see further tightening later in 2026. Most respondents said the central bank will likely raise its key rate from the current 0.75% to 1.0% or higher by the end of September, with July cited as the most likely timing for the next hike.\nIn the UK, the policy outlook remains tilted toward gradual easing, though officials have signaled that the decision is becoming a closer call. Bank of England (BoE) policymaker Alan Taylor said this week that interest rates “should continue on a downward path, if my outlook continues to match up with the data, as it has done over the past year.”\nLooking ahead, next week’s calendar features several key data releases. In the UK, traders will focus on labour-market figures, inflation data, and Retail Sales. In Japan, the national Consumer Price Index (CPI) is due just hours ahead of the BoJ’s policy decision.\nJapanese Yen FAQs\nThe Japanese Yen (JPY) is one of the world’s most traded currencies. Its value is broadly determined by the performance of the Japanese economy, but more specifically by the Bank of Japan’s policy, the differential between Japanese and US bond yields, or risk sentiment among traders, among other factors.\nOne of the Bank of Japan’s mandates is currency control, so its moves are key for the Yen. The BoJ has directly intervened in currency markets sometimes, generally to lower the value of the Yen, although it refrains from doing it often due to political concerns of its main trading partners. The BoJ ultra-loose monetary policy between 2013 and 2024 caused the Yen to depreciate against its main currency peers due to an increasing policy divergence between the Bank of Japan and other main central banks. More recently, the gradually unwinding of this ultra-loose policy has given some support to the Yen.\nOver the last decade, the BoJ’s stance of sticking to ultra-loose monetary policy has led to a widening policy divergence with other central banks, particularly with the US Federal Reserve. This supported a widening of the differential between the 10-year US and Japanese bonds, which favored th"
            },
            {
                "title": "Japanese Yen Takes Heed of Intervention Talk - Pound Sterling LIVE",
                "source": "Pound Sterling LIVE",
                "url": "https://www.poundsterlinglive.com/yen/22818-japanese-yen-takes-heed-of-intervention-talk",
                "body": "Japanese Yen Takes Heed of Intervention Talk\n- Written by: Gary Howes\nFile image of Satsuki Katayam. Copyright by World Economic Forum / Jakob Polacsek.\nAuthorities ready to intervene in FX markets to defend the yen.\nThe yen rallied after Japan's Finance Minister Satsuki Katayama told currency traders to expect market interventions:\n\"Decisive action, including all available options,\" was being considered by the Ministry of Finance, he said.\nThe MoF is expected to buy yen, in conjunction with the Bank of Japan, to raise its value following chronic selling pressure.\n\"The yen jumped sharply in earlier trading today following comments from Finance Minister Katayama,\" says Derek Halpenny, Head of Research for Global Markets EMEA at MUFG Bank Ltd.\nSpeaking at a regular news conference, Katayama alluded to any intervention potentially including U.S. counterparts. She said a joint statement signed with the U.S. last September \"was extremely significant and included language on intervention.\"\nThe talk comes following another impulse of yen selling in the wake of fevered speculation Prime Minister Sanae Takaichi is eyeing a snap early election, judging that her popularity would bolster the fortunes of her Liberal Democratic Party and return its majority in the Diet.\nTakaichi advocates a policy of government stimulus and low interest rates, which are a significant headwind to the value of the yen.\nAbove: GBP/JPY pulls back from the highs as the yen recovers.\nThe latest losses in the currency promptly triggered increased speculation that Japan would have to intervene in the markets to halt its decline, allowing the yen to stabilise through the latter part of the week.\n\"The Takaichi administration is starting to move to defend the JPY,\" says a new analysis by Citi.\nHowever, the effectiveness of intervention will be questioned by investors owing to the fundamental headwinds facing the yen: the government will be loose on fiscal policy while the Bank of Japan will be cautious when raising interest rates.\n\"BoJ caution, election risks that have emerged and communication from Fed officials in the US all point to risks of intervention failure,\" says Halpenny.\nHowever, Kit Juckes, FX strategist at Société Générale, explains that recent losses make positioning a great deal more attractive to potential buyers of the yen:\n\"The latest move has unwound the long yen position built up in the first few months of 2025.\"\nIn addition, Soc Gen analysts Reo Sakida in Tokyo and Stephen Spratt in Hong Kong say that markets could be over-egging the 'Takaichi trade':\n\"Even with a majority in the House, the administration is unlikely to pursue aggressive fiscal expansion immediately,\" they say in a note."
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "1,611.0000",
            "open": "95,533.3100",
            "close": "95,468.5000",
            "high": "95,833.5000",
            "low": "94,222.5000"
        },
        "market_summary": "### BTC/USD Market Briefing\n\n* **Key Drivers:** Increasing demand from **spot Bitcoin ETFs**, **institutional accumulation**, and a **favorable macro environment** are driving **bullish momentum**.\n* **Price Action:** Current price is testing resistance near the **$98,000** level, with a potential rally to **$100,000** if demand continues.\n* **Technical Outlook:** Immediate support is near the **$95,000** level, with resistance at **$100,000**. A break above this level could lead to a **strong run-up** to **$113,000**.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "1 Top Bitcoin ETF I Plan to Load Up On in 2026 - AOL.com",
                "source": "AOL.com",
                "url": "https://www.aol.com/finance/1-top-bitcoin-etf-plan-102900964.html",
                "body": "1 Top Bitcoin ETF I Plan to Load Up On in 2026\nKey Points\nBitcoin ETFs have made crypto investing easy and efficient for investors.\nMore than a dozen bitcoin ETFs exist. Since they invest in the same thing, you almost need to split hairs to find a differentiator.\nWith Bitcoin ETFs, it all comes down to cost.\nIt's been a tumultuous year for Bitcoin (CRYPTO: BTC), which ultimately produced a lot of volatility but nothing in the way of returns. After such a strong multiyear rally, a year \"off\" to digest gains and stabilize a bit is probably a good thing. But as we move forward into 2026, it's time to revisit the investment case again.\nBitcoin has, in my opinion, gone from alternative asset class to necessary portfolio allocation. In the same way we talk about stocks, bonds, gold, and real estate in a diversified portfolio, we should be adding Bitcoin to the discussion. Based on how the crypto market has evolved and the tailwinds of decentralization and AI development behind it, now's the time to look at building up Bitcoin positions again.\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\nImage source: Getty Images.\nWith nearly a dozen different Bitcoin ETFs to choose from all essentially doing the same thing, the differentiator is cost. All invest in spot Bitcoin, so it makes sense to choose the one that lets you do it the cheapest.\nThe most popular Bitcoin ETF by a wide margin is the iShares Bitcoin Trust (NASDAQ: IBIT) with more than $70 billion in assets under management. With an expense ratio of 0.25%, it's certainly a defensible choice. For my money, the one I'd load up on is the Grayscale Bitcoin Mini Trust (NYSEMKT: BTC). It's got the lowest expense ratio in the group at just 0.15%. Plus, it's more than liquid enough that you don't get dinged on spreads when trading it.\nIt may not necessarily be the most popular Bitcoin ETF, but it will probably be the one producing the best returns over the long term.\nAdvertisement\nShould you buy stock in Grayscale Bitcoin Mini Trust right now?\nBefore you buy stock in Grayscale Bitcoin Mini Trust, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Grayscale Bitcoin Mini Trust wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $482,209!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,133,548!*\nNow, it’s worth noting Stock Advisor’s total average return is 968% — a market-crushing outperformance compared to 197% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n*Stock Advisor returns as of January 14, 2026.\nDavid Dierking has positions in Grayscale Bitcoin Mini Trust. The Motley Fool has positions in and recommends Bitcoin and iShares Bitcoin Trust. The Motley Fool has a disclosure policy."
            },
            {
                "title": "Tom Lee's $250K Bitcoin Target Requires Breaking the Four-Year Cycle—Here's Why He Thinks It's Possible - 24/7 Wall St.",
                "source": "24/7 Wall St.",
                "url": "https://247wallst.com/investing/2026/01/16/tom-lees-250k-bitcoin-target-requires-breaking-the-four-year-cycle-heres-why-he-thinks-its-possible/",
                "body": "Tom Lee thinks Bitcoin (CRYPTO: BTC) could hit $250,000 by the end of 2026—and he’s not relying on the usual halving playbook to get there. The Fundstrat co-founder argues the traditional four-year cycle is breaking down, replaced by forces that didn’t exist in previous runs: ETF-driven demand, institutional accumulation, and a macro environment turning favorable for risk assets.\nIf Lee is right, Bitcoin isn’t following the old pattern anymore. It’s becoming a long-term macro asset, and the halving schedule matters less than who’s buying and why they’re holding.\nTom Lee Revives His $200K-$250K Bitcoin Target for 2026\nIn a series of high-profile appearances in early January, Tom Lee reiterated the aggressive Bitcoin forecast he had briefly softened during the October 2025 drawdown. Appearing on CNBC’s Squawk Box on January 6, Lee stated that he doesn’t think Bitcoin has peaked yet, reviving his $200K-$250K Bitcoin prediction for the end of 2026.\nHis immediate roadmap anticipates a 35% rally within the first 30 days of the year, pushing Bitcoin past its all-time high of $126,000. Lee’s conviction stems from the belief that the market is currently in a digestion phase following multiple years of outsized gains.\nWhile he acknowledged that Fundstrat was overly optimistic about reaching $200,000 by December 2025, he views the current Bitcoin price action as healthy rebalancing rather than structural reversal. Lee’s $250K Bitcoin prediction rests on three pillars: spot Bitcoin ETFs continuing to absorb supply, a maturing institutional investor base, and macroeconomic tailwinds that could push Bitcoin into unprecedented territory.\nBreaking the Four-Year Cycle: Why Traditional Halving Patterns May Not Apply\nBitcoin’s price history has followed a predictable rhythm for over a decade. Every four years, the block reward for miners gets cut in half, reducing new supply entering circulation. These halvings have historically triggered major bull runs, followed by brutal corrections and multi-year consolidations.\nLee believes that pattern is losing its grip. He explained that the halving cycle worked when Bitcoin was primarily driven by retail speculation. Now, with institutional capital flowing through ETFs and corporate treasuries accumulating, the dynamics have fundamentally changed.\nThe Bitcoin halving cycle breakdown may already be underway. If Bitcoin is increasingly treated like digital gold—a long-term portfolio hedge rather than a speculative trade—its price could decouple from the rigid four-year rhythm. Instead of halving-driven boom-bust cycles, Lee envisions a more secular, demand-driven path where institutional allocation matters more than miner economics. This structural shift forms the foundation of Lee’s 2026 Bitcoin outlook.\nLee’s “Tailwinds Building” Argument: Leverage Reset, Government Support, Gold Correlation\nLee identifies several emerging tailwinds supporting a Bitcoin surge toward $250,000. He frames these as “tailwinds building” rather than already priced in—suggesting the rally hasn’t fully begun.\nLeverage Reset: The October 2025 crash that liquidated $19 billion in leveraged positions may have “reset” the market for fresh gains. Lee views this flush as the bottoming out necessary for the next decade-long focus on tokenization and institutional adoption. Similar leverage resets preceded Bitcoin’s major rallies in 2020 and 2023. With excessive speculation cleared out, the market has room to build sustainably.\nGovernment Support: The Trump administration’s pro-crypto stance, combined with anticipated CLARITY Act passage, could provide regulatory clarity that unlocks institutional capital currently sitting on the sidelines. Lee expects this government support to materially impact flows in H1 2026.\nGold Correlation: Stablecoin issuers such as Tether have become among the largest non-central-bank buyers of gold globally, holding approximately 116 tonnes as of Q3 2025. This positions Bitcoin alongside gold, which rose app"
            },
            {
                "title": "Bitcoin ETF inflows cross $1.8B: Will BTC respond with a rally to $100K? - TradingView — Track All Markets",
                "source": "TradingView — Track All Markets",
                "url": "https://www.tradingview.com/news/cointelegraph:20f873972094b:0-bitcoin-etf-inflows-cross-1-8b-will-btc-respond-with-a-rally-to-100k/",
                "body": "Bitcoin ETF inflows cross $1.8B: Will BTC respond with a rally to $100K?\nBitcoin’s (BTC) rally above $97,000 was supported by surging inflows to the spot Bitcoin ETFs, and one analyst says the demand must continue for BTC to break through the $100,000 barrier.\nKey takeaways:\nUS spot Bitcoin ETFs recorded $1.8 billion in weekly net inflows, the strongest since early October 2025.\nTotal net assets under spot ETFs remain 24% below their Q4 2025 peak.\nLong-term supply-demand dynamics continue to favor ETFs, as institutional investor access is expected to expand in 2026.\nBitcoin ETF are only one part of the picture\nUS spot Bitcoin ETFs logged $1.8 billion in net inflows this week, marking the largest weekly intake since the first week of October 2025. The move comes as BTC again tests resistance near the $98,000 level, signaling renewed institutional interest.\nDespite the rebound, ETF positioning remains well below previous highs. The total net assets under management (AUM) across US spot Bitcoin ETFs peaked at $164.5 billion in Q4 2025 but currently stands near $125 billion. This represents a drawdown of roughly 24%, underscoring that recent inflows have only partially offset earlier outflows.\nAccording to the Bitcoin macro intelligence newsletter Ecoinometrics, short bursts of ETF inflows have repeatedly led to brief price bounces followed by fading momentum.\n“Bitcoin doesn’t need a few good days. It needs a few good weeks,” the newsletter said, noting that cumulative ETF flows remain in a deep drawdown. A handful of positive sessions barely registers against prolonged periods of selling. Until inflows cluster over multiple weeks, rallies are more likely to stabilize the price than restart a durable uptrend.\nRelated: Bitcoin whale balances see 21% bounce after fastest sell-off since 2023 ends\nBTC supply-demand imbalance favors ETFs in the long-run\nFrom a structural standpoint, spot ETF demand continues to outpace new Bitcoin supply. According to Bitwise, since US Bitcoin ETFs launched in January 2024, they have purchased about 710,777 BTC, while the network has produced just 363,047 BTC over the same period. Bitcoin’s price has risen about 94% since then, reflecting that imbalance.\nLooking ahead, new supply is relatively predictable, while demand could expand further as institutional investor access to Bitcoin broadens. Notably, 2026 could be the year most institutional allocators continue to broadly access crypto ETFs, as Bitwise predicted,\nIn 2025, Bitwise forecast that Bitcoin inflows into publicly listed companies building BTC treasuries, sovereign wealth funds, ETFs and nation-states could reach $300 billion in 2026.\nThe company highlighted that US spot Bitcoin ETFs attracted $36.2 billion in net inflows in their inception year, reaching $125 billion in AUM far faster than SPDR Gold Shares did in its early growth phase.\nRelated: Bitcoin traders predict ‘strong run-up’ as classic chart targets $113K"
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "75.7000",
            "open": "3,296.5600",
            "close": "3,292.4500",
            "high": "3,325.4000",
            "low": "3,249.7000"
        },
        "market_summary": "### ETH/USD Market Briefing\n\n* **Key Drivers:** Ethereum founder Vitalik Buterin's statement that the network is delivering on its original 2014 vision, coupled with technical upgrades, has renewed market confidence, potentially leading to **bullish momentum**.\n* **Price Action:** ETH/USD is trading at **$3,294.52**, showing a flat performance over the last 24 hours, with a recent high above **$3,300**.\n* **Technical Outlook:** Immediate support is near the recent low of **$3,200**, with resistance at **$3,300**, and the overall trend may be influenced by the **proof-of-stake** transition and advancements in **zero-knowledge scaling**.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "Stay Updated on Crypto: Latest Insights on Bitcoin, Ethereum, and Altcoins! - Investing News Network",
                "source": "Investing News Network",
                "url": "https://investingnews.com/cryptocurrency-market-recap/",
                "body": "Crypto Market Update: Trump Pushes Emergency Power Auction to Shift AI Energy Costs to Big Tech\nTrump is pushing to run an emergency power auction to fund up to US$15 billion in new electricity generation to meet rising AI-driven demand.\nHere's a quick recap of the crypto landscape for Friday (January 16) as of 9:00 p.m. UTC.\nGet the latest insights on Bitcoin, Ether and altcoins, along with a round-up of key cryptocurrency market news.\nBitcoin and Ether price update\nBitcoin (BTC) was priced at US$95,485.17, up by 0.2 percent over 24 hours.\nBitcoin price performance, January 16, 2025.\nChart via TradingView.\nEther (ETH) was priced at US$3,294.52, trading flat over the last 24 hours.\nAltcoin price update\n- XRP (XRP) was priced at US$2.08, up by 0.6 percent over 24 hours.\n- Solana (SOL) was trading at US$144.78, up by 2.3 percent over 24 hours.\nToday's crypto news to know\nTrump pushes emergency power auction\nAccording to the Financial Times, US President Donald Trump and several state governors are pressing the operator of the largest US power grid to hold an emergency auction that would force major data center operators to finance new electricity generation needed for artificial intelligence (AI) growth.\nThe proposal would require tech companies to bid for long-term power contracts, potentially underwriting roughly US$15 billion in new power plants whether or not the electricity is ultimately used.\nThe push targets PJM Interconnection, which supplies power across the US northeast and midwest and sits at the center of the country’s fastest-growing data center corridor.\nThe Trump administration is framing the move as a response to rising household electricity bills, which have climbed 13 percent since early 2025 amid surging demand from AI infrastructure.\nRiot signs US$311 million AI data center lease with AMD\nRiot Platforms (NASDAQ:RIOT) announced the fee simple acquisition of 200 acres at its Rockdale site in Texas for US$96 million. It funded the purchase by selling 1,080 BTC, securing long-term ownership of a 700 megawatt power site.\nUnder the terms of the deal, Riot has achieved full ownership of the Rockdale site, eliminating the prior ground lease. The site features a 700 megawatt grid interconnection, dedicated water supply and fiber connectivity. It expands the company's portfolio to 1.7 gigawatts of power capacity across its Texas facilities.\nThe company also signed a 10 year data center lease with Advanced Micro Devices (AMD) (NASDAQ:AMD) for an initial 25 megawatts of critical IT load, expandable to 200 megawatts.\nIt projects US$311 million in revenue initially, and up to US$1 billion with extensions.\nThe AMD lease requires retrofit CAPEX of US$89.8 million and is expected to generate US$25 million in annual net operating income, with phased delivery starting in January 2026 and completing in May 2026.\nRiot CEO Jason Les described the AMD deal as validation of the company's infrastructure for AI and high-performance computing tenants, marking a pivot from Bitcoin mining to data centers within 12 months.\nEthereum founder says blockchain nearing 2014 vision\nEthereum founder Vitalik Buterin said the network is finally delivering on the original 2014 vision as a series of technical upgrades push the blockchain closer to scalable, decentralized application infrastructure.\n\"Ethereum is now scaling, it is now cheap, and it is on track to get more scalable and cheaper thanks to the power of ZK-EVMs,\" Buterin posted on X on Tuesday (January 13).\nHis comments came as Ether climbed above US$3,300, reflecting renewed market confidence in the network’s long-term roadmap. Buterin also pointed to Ethereum’s shift to proof-of-stake, lower transaction fees and advances in zero-knowledge scaling and sharding as foundational progress.\nHe acknowledged that competing narratives over the past several years have distracted from the core mission, but argued that the underlying technology has continued to strengthen. Improvements in decentrali"
            },
            {
                "title": "Weekly Top Stories: Crypto Market Structure Bill Stalls After Coinbase Yanks Support - galaxy.com",
                "source": "galaxy.com",
                "url": "https://www.galaxy.com/insights/research/weekly-top-stories-01-16-26",
                "body": "Weekly Top Stories - 01/16/26\nIn this week’s newsletter, Alex Thorn unpacks the market structure bill’s stalled progress in the Senate Banking Committee; Zack Pokorny considers the implications of the long-awaited launch of a lending product from the Trump family’s World Liberty Financial; and Lucas Tcheyan explains why an Ethereum DAT investing in Mr. Beast isn’t as absurd as it sounds.\n📄 Market Structure Bill Falters at Last Minute After Coinbase Yanks Support\nSenate Banking Committee Chairman Tim Scott (R-S.C.) on Wednesday night announced the postponement of a critical hearing previously scheduled for Thursday. The delay came about five hours after Coinbase CEO Brian Armstrong publicly withdrew support for the bill. Armstrong cited objections to language on several issues, including tokenized securities, DeFi prohibitions, and stablecoin yield.\nThe Wednesday night postponement capped a whirlwind 48 hours that started with draft language being publicly released after 11 p.m. on Monday. More than 100 amendments to the bill were filed by 5 p.m. on Tuesday, and stakeholders were still identifying new issues with the bill as late as Wednesday morning.\nWhile Sen. Scott has not announced a future date for the hearing, the Senate is in recess next week, making the week of Jan. 26 – Jan. 30 the soonest possible time for a new Senate Banking markup hearing. The Senate Agriculture Committee, which has jurisdiction over the Commodity and Futures Trading Commission and will need to sign off on the commodities-related issues in the bill, already previously delayed its own markup hearing until Jan. 27.\nSenators, their staffs, and industry stakeholders mostly took Thursday off, the first break from what has been a hectic week and a half. No significant action is expected through the weekend, though negotiations are expected to restart in earnest next week.\nOn Thursday, liquid crypto markets traded moderately lower on news of the postponement, with bitcoin and ether down about 2% on the day. Crypto-relevant equities traded lower, with Coinbase (COIN) -6.5%, Robinhood (HOOD) -7.8%, and Circle (CRCL) -9.7%.\nOUR TAKE:\nThe path forward for the bill is narrower but not closed. The sheer litany of issues at stake and the complexity of the stakeholder environment bedeviled efforts to reach political agreement throughout the week. As I wrote last week, the “market structure” items were mostly agreed upon, but a range of additional issues (themselves still related but not core to the regulatory jurisdiction items that formed the foundation of the bill) created fault lines that could not be traversed in time to hold a successful markup on Thursday. There’s no doubt that progress was made on some issues, and on several, the sides are not too far apart, but distance remains on some key dealbreakers in which progress was stubbornly slow or non-existent. Overall, the gap is narrow, but the chasm is deep.\nThe stablecoin yield issue is particularly instructive. Quick refresher: the issue is whether stablecoin issuers may share portions of the yield they generate on collateral with either B2B partners or tokenholders. Consensus on GENIUS Act language has been that issuers are prohibited from directly paying token holders, but that issuers could pass on rewards in other ways, such as through partner platforms. The bank lobby has become extremely active – much more so than during last year's GENIUS Act negotiations – and has been a driving force behind the effort to restrict stablecoin rewards, promoting a fear that interest-bearing stablecoins could siphon bank deposits. Essentially, the argument is that yield-bearing stablecoins can destabilize the banking system. Regardless of whether that fear is valid (a Cornell study found such fears to be overblown), a number of key Democrats and even some Republican holdouts made clear that they could not support the bill without explicit restrictions on stablecoin rewards. Negotiations to secure Democrats and holdou"
            },
            {
                "title": "Thailand’s digital asset market softens in December: value down 7.29%, trading off nearly 30% - Nation Thailand",
                "source": "Nation Thailand",
                "url": "https://www.nationthailand.com/business/digital-assets/40061333",
                "body": "Thailand’s Securities and Exchange Commission (SEC) reported that the global digital asset market remained under pressure in December 2025, with total market capitalisation falling to US$3.18 trillion (THB 103.35 trillion), a 3.37% decline from the previous month.\nThe slowdown was matched by a sharp drop in trading activity. Average daily trading value fell to US$21.99 billion (THB 714.67 billion), down 33.33%, reflecting subdued year-end sentiment as many investors reduced transactions and adopted a more cautious stance amid global market volatility.\nMarket structure remained concentrated in the leading assets, with Bitcoin holding the largest share at 55.02%, followed by Ethereum at 11.27% and USDT at 5.89%.\nOver the past month, prices for the five largest digital assets all declined. Bitcoin fell 4.66%, Ethereum slipped 2.34%, and XRP dropped sharply by 16.14%.\nLooking at one-year returns compared with other asset classes, the SEC said digital assets continued to underperform traditional assets. Gold posted a return of 64.58%, while global equities and emerging markets remained in positive territory. By contrast, Bitcoin and Ethereum recorded negative one-year returns of -6.47% and -11.02%, respectively.\nIn Thailand, the digital asset market via digital asset exchanges (DA Exchanges) also slowed in line with global trends. The value of client assets fell to THB 79.56 billion, down 7.29% month on month. Average daily trading value stood at THB 1.70 billion, down nearly 30%.\nThe number of active trading accounts declined to 151,000, a contraction of more than 27%, even as the total number of investor accounts rose to 3.09 million—suggesting long-term investor participation is expanding despite weaker short-term trading activity.\nInvestor composition in the Thai market continued to be led by domestic retail investors, accounting for 41% of the total. Juristic persons, both domestic and foreign combined, accounted for more than 45%, reflecting the steadily growing role of institutional investors.\nBy trading value, USDT remained the most actively traded coin, making up 55% of total turnover, followed by Bitcoin and Ethereum. The SEC said this points to a preference for assets seen as less volatile during periods of uncertainty.\nOverall, the SEC said the digital asset market in December 2025 remained in a consolidation phase across prices, trading volumes and investor activity, while traditional assets such as gold and global equities delivered stronger returns over the past year."
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "5.2800",
            "open": "141.9332",
            "close": "144.9900",
            "high": "145.4400",
            "low": "140.1600"
        },
        "market_summary": "### SOL/USD Market Briefing\n\n* **Key Drivers:** Solana's **DeFi sector growth** and its stablecoin market cap reaching an **all-time high of $15 billion** are driving interest, with the network handling **$1.6 trillion in trading volume** in 2025.\n* **Price Action:** SOL/USD faces resistance at **$146**, with initial support at **$141** and major support at **$140**. The current price is **$144.62**, showing a **1.59% uptick** in the last 24 hours.\n* **Technical Outlook:** Immediate resistance is near **$146**, with support at **$141** and **$140**. The **bullish momentum** may continue if the price breaks above **$146**.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Key facts: Solana faces resistance at $146; $1.6T trading volume in 2025; DeFi sector growth - TradingView — Track All Markets",
                "source": "TradingView — Track All Markets",
                "url": "https://www.tradingview.com/news/tradingview:4ef173360c990:0-key-facts-solana-faces-resistance-at-146-1-6t-trading-volume-in-2025-defi-sector-growth/",
                "body": "Key facts: Solana faces resistance at $146; $1.6T trading volume in 2025; DeFi sector growth\nLess than 1 min read\n- Solana (SOLUSD) faces resistance at $146, with initial support at $141 and major support at $140. A drop below $140 may lead to a decline towards $132.1\n- In 2025, Solana's network handled $1.6 trillion in trading volume, capturing 12% of the crypto market, while its real-world asset ecosystem reached a valuation of $1.15 billion.2\n- Solana is emerging as a significant player in the decentralized finance (DeFi) sector, where DeFi applications are increasingly capturing more fees than the underlying blockchains.3"
            },
            {
                "title": "Solana Stablecoin Market Cap Hits All-Time High of $15 Billion - InteractiveCrypto",
                "source": "InteractiveCrypto",
                "url": "https://www.interactivecrypto.com/solana-stablecoin-market-cap-hits-all-time-high-of-15-billion-1768615465166",
                "body": "Create a FREE account and...\nManage your own Watchlist\nAccess all education lessons\nConverse with other crypto enthusiasts\nBe a part of the Interactive Crypto Community\nOR\nPlease fill out the required fields Please fill out the required fields Please fill out the required fields\nGet Into Cryptocurrency Trading Today\nAs of January 17, 2026, the cryptocurrency world is abuzz with a staggering development: Solana’s stablecoin market cap has skyrocketed to an unprecedented $15 billion. This milestone isn’t just a number—it signals a potential turning point for decentralized finance (DeFi) and could redefine Solana’s role in the ever-evolving crypto landscape. With Solana trading at $144.62 today, reflecting a 1.59% uptick in the last 24 hours, the question on everyone’s mind is whether this surge marks the dawn of a new era or the inflation of a dangerous bubble. For investors, developers, and enthusiasts alike, this moment offers both opportunity and uncertainty. What does this mean for your portfolio, and how might it shape the future of blockchain technology? Let’s dive deep into the data, the trends, and the implications to uncover what’s really at stake.\nThe cryptocurrency market is a dynamic beast, and Solana’s recent performance has turned heads across the financial world. As of today, the total crypto market cap stands at a hefty $3.32 trillion, according to CoinGecko data, with sentiment hovering at a neutral 50 on the Fear & Greed Index from Alternative.me. Amid this backdrop, Solana has outshone giants like Bitcoin and Ethereum, posting a 1.59% price increase in just 24 hours while Bitcoin dipped by 0.27% to $95,354 and Ethereum fell 0.72% to $3,288.77.\nBut the real headline is the $15 billion stablecoin market cap on Solana’s network—a figure that underscores explosive growth in its DeFi ecosystem. Stablecoins, pegged to assets like the U.S. dollar, are the lifeblood of DeFi, enabling seamless transactions and lending without the volatility of other cryptocurrencies. This surge suggests that users and developers are flocking to Solana, drawn by its lightning-fast transactions and low fees. Could this be the moment Solana cements itself as a true rival to Ethereum?\nFor investors, Solana’s stablecoin boom is a double-edged sword. On one hand, a $15 billion market cap for stablecoins signals robust network activity and growing trust in Solana’s infrastructure. This could translate to increased demand for SOL, the native token, potentially driving prices higher. If you’re holding SOL or considering an entry point, now might be the time to get AI analysis for Solana to assess whether this momentum is sustainable.\nOn the flip side, such rapid growth often comes with heightened risk. A sudden influx of stablecoin activity could overheat the ecosystem, inviting speculative bubbles or exposing vulnerabilities in Solana’s still-maturing network. Investors should weigh these factors carefully, balancing optimism with caution. Are you positioned to capitalize on this trend, or are you exposed to potential downturns?\nTo grasp the significance of Solana’s $15 billion stablecoin milestone, we need to rewind a bit. Solana, launched in 2020, was designed to address the scalability issues plaguing older blockchains like Ethereum. Its unique Proof-of-History (PoH) consensus mechanism enables thousands of transactions per second at a fraction of the cost—think pennies compared to Ethereum’s often exorbitant gas fees. This technological edge has made Solana a darling of DeFi developers, who are building everything from decentralized exchanges to lending platforms on its network.\nStablecoins are the backbone of DeFi, acting as a stable medium of exchange in a volatile market. Their $15 billion market cap on Solana, as reported by recent CoinGecko data, reflects a massive influx of liquidity into the ecosystem. This liquidity fuels trading, lending, and yield farming—key activities that drive DeFi growth. But it also raises questions about w"
            },
            {
                "title": "MetaMask Adds Tron Support After Expanding to BTC and Solana - Coinspot.io",
                "source": "Coinspot.io",
                "url": "https://coinspot.io/en/analysis/metamask-adds-tron-support-after-expanding-to-btc-and-solana/",
                "body": "MetaMask continues to expand beyond the Ethereum ecosystem. On Thursday, the wallet announced the addition of native support for the Tron blockchain. Previously, the team had already expanded functionality by integrating BTC and Solana networks.\nSupport for Tron is now available in both the mobile version of MetaMask and the browser extension. Users can now manage assets on the Tron network and interact directly with applications without leaving the wallet interface.\nThe integration allows swaps between Tron, Ethereum Virtual Machine (EVM), Solana, and BTC networks. Users can send USDT, stake TRX, and perform transactions across several supported blockchains through a single wallet.\n“The native integration of Tron is another important milestone in our multichain expansion strategy. Now, along with Solana and Bitcoin, this non-EVM network is available through a single interface,” said MetaMask product manager Rizvi Haider.\nAccording to on-chain analytics from Dune, the Tron network has about 3 million active wallets per day. DeFi protocols on the blockchain have roughly $4.7 billion in locked assets.\n“We are going where the users already are, and step by step, we are moving closer to creating a truly universal gateway to the decentralized economy,” he added.\nTron is especially popular among stablecoin users. The network has issued more than $81 billion USDT from Tether. This is just slightly less than Ethereum, where the USDT volume exceeds $85 billion.\nSee Also: Starknet and NEAR Join Forces to Bring STRK to the Solana Ecosystem\nMetaMask has long been associated with the Ethereum network. Parent company Consensys is considered one of the key software developers for this ecosystem.\nHowever, over the past year, the wallet has been expanding more actively beyond Ethereum. The reason is simple. Traders and investors are increasingly using multiple blockchains at once. Support for BTC appeared in December, after it was first hinted at in early 2025.\n“Obviously, MetaMask is the original Ethereum wallet, and it was initially created specifically for that network. But we have been exploring for quite some time how we can go beyond a single ecosystem,” said MetaMask head of multichain products Cristian Montoya in January 2025."
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "536.600",
            "open": "49,087.130",
            "close": "49,440.260",
            "high": "49,585.230",
            "low": "49,048.630"
        },
        "market_summary": "### US30 Market Briefing\n\n* **Key Drivers:** Mixed earnings reports from major banks and a slight decline in the **Dow Jones Industrial Average** are influencing market sentiment, with **interest rates** and **regulatory concerns** playing a significant role.\n* **Price Action:** The **US30** is trading near **49,359**, showing a decline of **0.2%** on the day, with **bearish** momentum as the index fell below the **49,400** level.\n* **Technical Outlook:** Immediate support is near the **50-day moving average** at **49,200**, with resistance at **49,500**, as the index navigates a period of **increased volatility**.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "Dow Jones Futures: Google Leads 7 Stocks In Buy Zones, 3 With Earnings Due - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-google-stocks-buy-zones-ge-earnings/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #068fcee5-f369-11f0-862d-6de01fcd7222"
            },
            {
                "title": "Stock market shows mixed results as earnings season begins - ABC7 WWSB",
                "source": "ABC7 WWSB",
                "url": "https://www.mysuncoast.com/2026/01/16/stock-market-shows-mixed-results-earnings-season-begins/",
                "body": "Stock market shows mixed results as earnings season begins\nSARASOTA, Fla. (WWSB) - The stock market showed mixed performance this week as earnings season kicked off, with the Dow Jones Industrial Average leading gains while the NASDAQ turned slightly negative.\nThe Dow posted gains of about a quarter percent for the week, while the S&P 500 remained relatively flat and the NASDAQ declined slightly. The 10-year Treasury yield rose to 4.19%, while mortgage rates dropped to a three-year low.\nOil prices traded around $60 per barrel, down from a weekly high of $62.\nSeveral companies reported earnings this week, including Tijuana Semiconductors, which beat profit expectations by 35%. The stock gained 20 points following the announcement.\nCurrent market levels showed the Dow trading down nearly 15 points at 49,427, the S&P 500 up almost 8 points at 6,952, and the NASDAQ up 17 points at 23,546.\nVerizon stock drops as company offers $20 credit after nationwide outage\nMajor banks led earnings reports with generally solid numbers driven by higher fees and strong trading activities. Loan growth increased across the sector, though profit margins faced pressure from declining interest rates.\nJ.P. Morgan reported strong revenue and loan growth but fell short of high profit expectations. The stock declined slightly after the earnings announcement.\nCitigroup posted strong numbers in banking growth and mergers and acquisitions activity, though profits came in slightly below expectations.\nBank of America and Wells Fargo reported strong profit and revenue growth, with fees performing well.\nDespite beating earnings expectations, bank stocks sold off due to high investor expectations and potential regulatory concerns. President Trump mentioned a possible credit card rate cap, which could impact financial institutions’ profitability while benefiting consumers.\nAnalysts maintain positive outlooks for banks and financials over the next couple of years, though they expect increased volatility in the sector.\nCopyright 2026 WWSB. All rights reserved."
            },
            {
                "title": "How major US stock indexes fared Friday, 1/16/2026 - Bozeman Daily Chronicle",
                "source": "Bozeman Daily Chronicle",
                "url": "https://www.bozemandailychronicle.com/ap_news/business/how-major-us-stock-indexes-fared-friday-1-16-2026/article_b440176b-0318-5fd5-ae5b-f53dec2070f0.html",
                "body": "Stocks edged a bit lower on Wall Street as the first week of corporate earnings season closes out with markets trading near record levels.\nThe S&P 500 slipped 0.1% Friday after a day of wavering between gains and losses. The Dow Jones Industrial Average fell 0.2%, and the Nasdaq composite fell 0.1%.\nGains for several big tech companies helped offset weakness elsewhere.\nA handful of regional U.S. banks reported their earnings following mixed reports from their larger peers. Pittsburgh’s PNC jumped after it beat Wall Street’s fourth-quarter targets, but Regions Financial fell after reporting results that missed forecasts.\nOn Friday:\nThe S&P 500 fell 4.46 points, or 0.1%, to 6,940.01.\nThe Dow Jones Industrial Average fell 83.11 points, or 0.2%, to 49,359.33.\nThe Nasdaq composite fell 14.63 points, or 0.1%, to 23,515.39.\nThe Russell 2000 index of smaller companies rose 3.18 points, or 0.1%, to 2,677.74.\nFor the week:\nThe S&P 500 is down 26.27 points, or 0.4%.\nThe Dow is down 144.74 points, or 0.3%.\nThe Nasdaq is down 155.96 points, or 0.7%.\nThe Russell 2000 is up 53.51 points, or 2%.\nFor the year:\nThe S&P 500 is up 94.51 points, or 1.4%.\nThe Dow is up 1,296.04 points, or 2.7%.\nThe Nasdaq is up 273.40 points, or 1.2%.\nThe Russell 2000 is up 195.83 points, or 7.9%.\nLet the news come to you\nGet any of our free daily email newsletters — news headlines, opinion, e-edition, obituaries and more.\nCopyright 2026 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission."
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "80.250",
            "open": "10,211.460",
            "close": "10,224.510",
            "high": "10,251.710",
            "low": "10,171.460"
        },
        "market_summary": "### UK100 Market Briefing\n\n* **Key Drivers:** The **FTSE 100** reverses an earlier decline, driven by **AI momentum** and the need for **trade openness** as emphasized by the BOE governor, despite **commodity** losses weighing on the index.\n* **Price Action:** The index pulled back from record levels, falling about **0.2%** in early trade, with **miners and oil stocks** providing the main drag due to losses in **copper** after China tightened rules on high-frequency trading.\n* **Technical Outlook:** Immediate support is near the previous record highs, with resistance at the current **all-time peaks**. The **pound's strength**, reflecting relative economic resilience, and the **US dollar's softness** could influence the index's movement.\n\n---\n**Overall Sentiment:** Cautiously **bullish** ↑",
        "source_articles": [
            {
                "title": "FTSE 100 Reverses Fall to Put Another Record in Sight - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/live-blog/2026-01-16/ftse-100-live-pound-bonds-tech-rally-dollar-oil-gold-silver-prices-what-s-moving-uk-markets-right-now-markets-today",
                "body": "marketsClosed Jan 16, 2026\nFTSE 100 Reverses Fall to Put Another Record in Sight\n- FTSE 100 reverses an earlier decline to put another record close in sight, as AI momentum drives gains for the US\n- Join the Markets Today team for news and analysis vital to UK markets. Email us at marketstoday@bloomberg.net and you can find us here every day\nThat’s all from us today. You can find us here again next week for the data bonanza in the UK.\nThe FTSE 100 has been wavering all day and looks set for a fall, though it is still going to notch its best weekly run since August. The FTSE 250, which has seen its gains fade, is also having a good time of it. All this positivity is making some sceptical but fact is, the year has been chock full of records.\nThe AI trade has come roaring back to the front of minds, the BOE governor spoke about the need for trade openness, and there may be another delay to the UK’s jobs data revamp.\nEmail us with any questions at marketstoday@bloomberg.net, and have great weekends."
            },
            {
                "title": "3 top growth-focused stocks to buy in January 2026, according to experts - Yahoo Finance UK",
                "source": "Yahoo Finance UK",
                "url": "https://uk.finance.yahoo.com/news/strategy-inc-mstr-continues-add-191035842.html",
                "body": "Your privacy is important to us\nYahoo is part of the Yahoo family of brands.\nWhen you use our sites and apps, we use cookies to:\n- provide our sites and apps to you\n- authenticate users, apply security measures, and prevent spam and abuse, and\n- measure your use of our sites and apps\nYour privacy choices\nIf you click '\nAccept all', we and\nour partners, including 245 who are part of the IAB Transparency & Consent Framework, will also store and / or access information on a device (in other words, use cookies) and use precise geolocation data and other personal data such as\ntechnical identifiers and browsing and search data, for analytics, personalised advertising and content, advertising and content measurement, and audience research and services development.\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\nIf you would like to customise your choices, click 'Manage privacy settings'.\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy and Cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our Privacy Policy and Cookie Policy."
            },
            {
                "title": "FTSE eases from record highs as commodities weigh - ig.com",
                "source": "ig.com",
                "url": "https://www.ig.com/uk/news-and-trade-ideas/ftse-eases-from-record-highs-as-commodities-weigh-260116",
                "body": "FTSE eases from record highs as commodities weigh\nThe FTSE 100 retreated from all-time peaks in early trade as miners and oil stocks declined, while global markets digested mixed signals.\nFTSE pulls back from records\nThe FTSE 100 fell about 0.2% in early trade, pulling back from record levels reached earlier this week. The retreat was hardly dramatic, but it does highlight the challenge facing the index at these elevated levels.\nLosses in miners and oil stocks provided the main drag. When commodity-heavy sectors stumble, the FTSE tends to follow given its significant weighting towards these areas. The index has enjoyed a strong run but needs fresh catalysts to push higher.\nUnited Kingdom (UK) government bonds edged lower in early trade, while sterling firmed towards $1.34 as the United States (US) dollar softened across the board. The pound's strength reflects relative economic resilience, though concerns over data quality continue to simmer beneath the surface.\nChina rules hit commodity stocks\nCopper fell more than 2% after China tightened rules on high-frequency trading, dragging lower miners including Rio Tinto, Glencore and Antofagasta. The move caught markets off guard, sending ripples through the mining sector that few had anticipated.\nThe Chinese authorities' decision to clamp down on algorithmic trading reflects growing concerns about market stability. For commodity traders, it represents another regulatory hurdle in an already complex trading environment. These interventions rarely help sentiment in the short term.\nGenus defies market weakness\nGenus shares rose as much as 15% after the company said first-half and full-year profits would beat expectations. The animal genetics specialist benefited from strong demand in its pig breeding business, demonstrating that not all UK stocks are struggling.\nThe profit upgrade provided a welcome boost to a market otherwise dominated by commodity-driven losses. Genus's performance shows that company-specific factors can still drive significant moves, even when broader market conditions prove challenging.\nElsewhere, Bodycote agreed a US defence-focused acquisition, Ninety One reported higher assets under management, and Greencore completed its takeover of Bakkavor. These deals suggest corporate activity remains robust despite economic uncertainty.\nUK data concerns persist\nThe Office for National Statistics is considering delaying the launch of its new labour market survey again. This adds to mounting concerns over the quality and timeliness of UK economic data, creating headaches for policymakers and market participants alike.\nPoor data quality makes it harder for the Bank of England (BoE) to assess economic conditions accurately. When you can't trust the numbers, policy decisions become more fraught. This uncertainty tends to weigh on sterling and UK assets more broadly.\nThe data problems aren't new, but they're becoming increasingly difficult to ignore. Markets need reliable information to price assets effectively. Without it, mispricing becomes more likely and confidence suffers.\nYen firms on intervention talk\nThe Japanese yen firmed modestly after Japan's finance minister said Tokyo would not rule out intervention, including coordination with Washington. The currency remains close to 160 per US dollar after falling to an 18-month low, but intervention talk has at least paused the decline.\nReuters reported that some Bank of Japan (BoJ) policymakers see scope to raise rates sooner than expected, possibly as early as April. This shift in expectations helped lift the yen, though political uncertainty around a potential snap election continues to create headwinds.\nAI trade lifts Asian markets\nAsian equities advanced as the artificial intelligence (AI) theme regained momentum following strong results from Taiwan Semiconductor Manufacturing Co (TSMC). The chip manufacturer's performance pushed MSCI Asia ex-Japan to a record and lifted tech-heavy indices in Taiwan and South Korea to all"
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "155.750",
            "open": "25,325.520",
            "close": "25,264.020",
            "high": "25,401.020",
            "low": "25,245.270"
        },
        "market_summary": "### GER40 Market Briefing\n\n* **Key Drivers:** Geopolitical tensions, including US-Europe frictions over Greenland, and **inflation rate** at **1.8%** in Germany, below the ECB's **2%** target.\n* **Price Action:** Closed **0.2%** down at **25,276**, reversing previous gains, indicating **bearish** sentiment.\n* **Technical Outlook:** Immediate support is needed to prevent further decline, with **25,200** as a potential level, and resistance at **25,500**.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "DAX Closes in the Red - TradingView — Track All Markets",
                "source": "TradingView — Track All Markets",
                "url": "https://www.tradingview.com/news/te_news:517791:0-dax-closes-in-the-red/",
                "body": "DAX Closes in the Red\nThe DAX 40 closed about 0.2% down at 25,276 on Friday, reversing yesterday's mild gains, as caution prevailed ahead of the weekend.\nThe geopolitical landscape remained in focus, with ongoing tensions in Iran and rising frictions between the US and Europe over Greenland.\nMeanwhile, President Trump today floated the idea of levying tariffs on nations opposing the US acquisition of the territory.\nThe attention was also on economic data and corporate updates.\nGermany’s annual inflation rate was confirmed at 1.8% in December 2025, down from 2.3% in November and falling below the ECB' 2% target midpoint for the first time since September 2024.\nAmong stocks, Brenntag dropped roughly 4%, weighing on the chemical sector, after Barclays cut its price target from €46 to €42 while maintaining an “Equal Weight” rating.\nDeutsche Telekom (-2.9%) and Continental (-2.2%) also saw pressure.\nIn contrast, shares linked to the energy transition and AI were in demand, with Siemens Energy climbing 6.4%."
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "389.000",
            "open": "25,429.570",
            "close": "25,542.490",
            "high": "25,787.200",
            "low": "25,398.200"
        },
        "market_summary": "ERROR: Could not connect to the AI service: 503 Server Error: Service Unavailable for url: https://openrouter.ai/api/v1/chat/completions",
        "source_articles": [
            {
                "title": "Stock market today: Dow, S&P 500, Nasdaq slip, chip stocks rise as Wall Street ends volatile week lower - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-slip-chip-stocks-rise-as-wall-street-ends-volatile-week-lower-210151640.html?guccounter=1&guce_referrer=aHR0cHM6Ly9uZXdzLmdvb2dsZS5jb20v&guce_referrer_sig=AQAAAKg3c6dAXE4DeXnPRtlhGr9w0Efmt_ITdgwy4Uw5x01c6bduLnMAe6BLFfeaCm6Kis3FiR5WQUHCGurMdcfaYNURmGQbDMxjXO-sLfkQZokO7-pbH3afu11uRcu5tXDvYIegqsfzfdGAzUeN3HoZ836bWxn5hh8R-9HCYIfpvUCN",
                "body": "Stock market today: Dow, S&P 500, Nasdaq slip, chip stocks rise as Wall Street ends volatile week lower\nUS stocks were little changed on Friday despite growing uncertainty over the next Fed chair, while strong bank earnings and ongoing geopolitical tensions capped a volatile week.\nThe tech-heavy Nasdaq Composite (^IXIC) fell below the flat line, while the S&P 500 (^GSPC) was little changed. The Dow Jones Industrial Average (^DJI) declined slightly, with all three major averages losing less than 1% for the week.\nThe Russell 2000 (^RUT) closed at a record high as the small-cap index extended year-to-date gains to 8%.\nStocks gave up earlier gains on Friday after President Trump expressed fresh reluctance to name Kevin Hassett as the next Fed chair, fueling speculation that the central bank may not be as dovish as the market expected once Jerome Powell steps down in May.\n\"I actually want to keep you where you are, if you want to know the truth,\" he told Hassett at a White House event.\nWall Street is regrouping after a switchback week, marked by escalating Iran tensions, a dispute over Greenland, and a criminal probe risking the Federal Reserve’s independence — all with Trump behind them. Investors have a long weekend to digest those events, as stock and bond markets are closed on Monday for Martin Luther King Jr. Day.\nTSMC (TSM) and Nvidia (NVDA) rose, thanks in part to a US-Taiwan trade deal that promises a $250 billion boost to American chip and tech manufacturing. On Thursday, shares in TSMC popped following a strong quarterly report that revived AI enthusiasm to buoy related stocks more widely.\nShares of regional banks such as PNC (PNC) and Regions Financial (RF) rose on the heels of quarterly results following strong performance from Wall Street majors. Goldman Sachs (GS) and Morgan Stanley (MS) shares rose Thursday after posting profit gains, giving a lift to financial stocks.\nMeanwhile, silver (SI=F) fell as the threat of US tariffs eased, but prices were still up more than 15% for the week after a long-lived blistering rally for precious metals.\nLIVE COVERAGE IS OVER 23 updates- Ines Ferré\nStocks post weekly loss as Trump wavers on Kevin Hassett as next Fed Chair\nStocks ended the slight losses as the tech-heavy Nasdaq Composite (^IXIC), the S&P 500 (^GSPC) also the Dow Jones Industrial Average (^DJI) all shed less than 1% for the week.\nThe major averages opened with gains but dipped into red territory mid-morning after President Trump expressed reluctance about naming Kevin Hassett as the next Fed chair, putting into question how dovish the Fed will be once Fed Chair Jerome Powell's term ends in May.\nSemiconductor stocks ended the week with gains, but software names were hit over the threat of AI on their businesses.\nMeanwhile, the Russell 2000 small-cap index (^RUT) Russell 2000 closed at a record high as the small-cap index is up 8% year-to-date.\nThe New York Stock Exchange, Nasdaq, and bond markets will be closed on Monday, Jan. 19, in observance of Dr. Martin Luther King Jr. Day.\n- Grace O'Donnell\nAre US markets closed on MLK Day?\nThe New York Stock Exchange, Nasdaq, and bond markets will be closed on Monday, Jan. 19, in observance of Dr. Martin Luther King Jr. Day.\nYou can still place orders to buy and sell stocks and exchange-traded funds (ETFs) during extended trading hours, though there is added risk. And unlike the stock and bond markets, investors can trade crypto around the clock.\nWhen there's a major holiday, chances are that stock markets will close. Here's a look at the remaining stock market holidays for 2026:\n- Ines Ferré\n'Structure trend of AI' will power stocks: UBS\nThe AI tech trade is intact, and expected to power stocks this year, say UBS strategists.\n“We maintain our conviction that the structural trend of AI will continue to power equity performance in the years ahead, and believe exposure to AI-related stocks is essential for long-term wealth preservation and appreciation,\" wrote Ulrike Hoffmann-Bur"
            },
            {
                "title": "Tech Weekly: Chip Stocks Soar on Taiwan Semiconductor Earnings - Investing News Network",
                "source": "Investing News Network",
                "url": "https://investingnews.com/top-tech-news/",
                "body": "Tech Weekly: Chip Stocks Soar on Taiwan Semiconductor Earnings\nExplore this week’s top tech news and market movers, plus key catalysts to watch next week.\nWelcome to the Investing News Network's weekly brief on tech news and tech stocks driving the market.\nWe also break down next week's catalysts to watch to help you prepare for the week ahead.\nIn this article:\nThis week's tech sector performance\nTech stocks experienced sharp swings this week, starting on relatively firm footing before a broad selloff midway through the period gave way to a late rebound in semiconductor companies.\nA Sunday (January 11) statement from US Federal Reserve Chair Jerome Powell put pressure on US stocks ahead of Monday's (January 12) open, with \"sell America\" sentiment prevalent among investors. Powell's comments centered on a Department of Justice criminal probe into his testimony about Fed building renovations.\nFinancial and payment companies, including major credit card issuers, also sold off at that time following political pressure for a cap on credit card interest rates. However, the overall reaction was muted during Monday's trading session, with some early dips recovering fully, and indexes closing at record highs.\nRotation continued to be a major theme this week, with money moving out of some mega-cap tech names and into chip stocks, small-cap companies and resource plays. Intel (NASDAQ:INTC) and Advanced Micro Devices (AMD) (NASDAQ:AMD) rallied early on after being upgraded to “overweight” by KeyBanc Capital Markets on Tuesday (January 13). Citigroup (NYSE:C) also lifted its Intel rating to “neutral” from “sell.”\nWednesday (January 14) brought heavy selling in tech stocks, with high-flying growth names seeing losses; however, Google's (NASDAQ:GOOGL) and Apple's (NASDAQ:AAPL) losses were comparatively mild.\nChipmakers were the bright spot, with the real catalyst coming on Thursday (January 15) after Taiwan Semiconductor Manufacturing Company's (NYSE:TSM) blowout quarterly results triggered a rally across chipmakers and chip equipment stocks, including Micron Technology (NASDAQ:MU), Broadcom (NASDAQ:AVGO), Qualcomm (NASDAQ:QCOM), AMD and ASML Holding (NASDAQ:ASML), which hit a US$500 billion market cap on Thursday.\nThis performance helped stabilize the broader tech space, although caution lingered.\n3 tech stocks moving markets this week\n1. Taiwan Semiconductor Manufacturing Company (NYSE:TSM)\nAs mentioned, Taiwan Semiconductor reported blowout Q4 results and upbeat guidance on Thursday, fueled by relentless artificial intelligence (AI) demand. Revenue jumped 36 percent year-on-year, with management projecting 20 to 25 percent growth in 2026. Shares climbed 5.8 percent on the week.\n2. Applied Materials (NASDAQ:AMAT)\nApplied Materials gained 8.56 percent amid the broader semiconductor equipment surge.\nThe company's high-bandwidth memory revenues hit US$1.5 billion in its 2025 fiscal year. This new growth engine is tied directly to NVIDIA's (NASDAQ:NVDA) GPU roadmap.\n3. KLA (NASDAQ:KLAC)\nKLA, a key supplier of process control equipment to chip fabricators, rode the Taiwan Semiconductor tailwind, rising 11.99 percent for the week as investors bet on sustained CAPEX from foundries.\nTaiwan Semiconductor, Applied Materials and KLA performance, January 12 to 16, 2025.\nChart via Google Finance.\nTop tech news of the week\n- OpenAI announced on Monday that it bought healthcare startup Torch, which unifies lab results, medications and visit recordings into a single platform.\n- Apple has teamed up with Google to integrate Gemini tech for Siri upgrades and other AI features rolling out later this year. The news contributed to another rally for Google, sending its market cap to US$4 trillion to surpass Apple as the second most valuable company behind NVIDIA.\n- Governor Kathy Hochul announced Tuesday in her State of the State address that New York is targeting 5 gigawatts in new nuclear capacity, boosting the total to 8.4 gigawatts.\n- OpenAI said it is commi"
            },
            {
                "title": "Stock market today: Dow, S&P 500, Nasdaq steady as Trump wavers on Kevin Hassett as next Fed chair - Yahoo Finance UK",
                "source": "Yahoo Finance UK",
                "url": "https://uk.finance.yahoo.com/news/stock-market-today-dow-sp-500-nasdaq-slip-chip-stocks-rise-as-wall-street-ends-volatile-week-lower-210151640.html",
                "body": "Stock market today: Dow, S&P 500, Nasdaq slip, chip stocks rise as Wall Street ends volatile week lower\nUS stocks were little changed on Friday despite growing uncertainty over the next Fed chair, while strong bank earnings and ongoing geopolitical tensions capped a volatile week.\nThe tech-heavy Nasdaq Composite (^IXIC) fell below the flat line, while the S&P 500 (^GSPC) was little changed. The Dow Jones Industrial Average (^DJI) declined slightly, with all three major averages losing less than 1% for the week.\nThe Russell 2000 (^RUT) closed at a record high as the small-cap index extended year-to-date gains to 8%.\nStocks gave up earlier gains on Friday after President Trump expressed fresh reluctance to name Kevin Hassett as the next Fed chair, fueling speculation that the central bank may not be as dovish as the market expected once Jerome Powell steps down in May.\n\"I actually want to keep you where you are, if you want to know the truth,\" he told Hassett at a White House event.\nWall Street is regrouping after a switchback week, marked by escalating Iran tensions, a dispute over Greenland, and a criminal probe risking the Federal Reserve’s independence — all with Trump behind them. Investors have a long weekend to digest those events, as stock and bond markets are closed on Monday for Martin Luther King Jr. Day.\nTSMC (TSM) and Nvidia (NVDA) rose, thanks in part to a US-Taiwan trade deal that promises a $250 billion boost to American chip and tech manufacturing. On Thursday, shares in TSMC popped following a strong quarterly report that revived AI enthusiasm to buoy related stocks more widely.\nShares of regional banks such as PNC (PNC) and Regions Financial (RF) rose on the heels of quarterly results following strong performance from Wall Street majors. Goldman Sachs (GS) and Morgan Stanley (MS) shares rose Thursday after posting profit gains, giving a lift to financial stocks.\nMeanwhile, silver (SI=F) fell as the threat of US tariffs eased, but prices were still up more than 15% for the week after a long-lived blistering rally for precious metals.\nLIVE COVERAGE IS OVER 23 updates- Ines Ferré\nStocks post weekly loss as Trump wavers on Kevin Hassett as next Fed Chair\nStocks ended the slight losses as the tech-heavy Nasdaq Composite (^IXIC), the S&P 500 (^GSPC) also the Dow Jones Industrial Average (^DJI) all shed less than 1% for the week.\nThe major averages opened with gains but dipped into red territory mid-morning after President Trump expressed reluctance about naming Kevin Hassett as the next Fed chair, putting into question how dovish the Fed will be once Fed Chair Jerome Powell's term ends in May.\nSemiconductor stocks ended the week with gains, but software names were hit over the threat of AI on their businesses.\nMeanwhile, the Russell 2000 small-cap index (^RUT) Russell 2000 closed at a record high as the small-cap index is up 8% year-to-date.\nThe New York Stock Exchange, Nasdaq, and bond markets will be closed on Monday, Jan. 19, in observance of Dr. Martin Luther King Jr. Day.\n- Grace O'Donnell\nAre US markets closed on MLK Day?\nThe New York Stock Exchange, Nasdaq, and bond markets will be closed on Monday, Jan. 19, in observance of Dr. Martin Luther King Jr. Day.\nYou can still place orders to buy and sell stocks and exchange-traded funds (ETFs) during extended trading hours, though there is added risk. And unlike the stock and bond markets, investors can trade crypto around the clock.\nWhen there's a major holiday, chances are that stock markets will close. Here's a look at the remaining stock market holidays for 2026:\n- Ines Ferré\n'Structure trend of AI' will power stocks: UBS\nThe AI tech trade is intact, and expected to power stocks this year, say UBS strategists.\n“We maintain our conviction that the structural trend of AI will continue to power equity performance in the years ahead, and believe exposure to AI-related stocks is essential for long-term wealth preservation and appreciation,\" wrote Ulrike Hoffmann-Bur"
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "68.040",
            "open": "6,919.070",
            "close": "6,945.730",
            "high": "6,979.740",
            "low": "6,911.700"
        },
        "market_summary": "### SPX500 Market Briefing\n\n* **Key Drivers:** Global economic uncertainty and geopolitical tensions are influencing market sentiment, with **trade policies** and **interest rates** being key factors.\n* **Price Action:** The SPX500 is currently trading near the **$4,200** level, showing **cautious** momentum after a recent pullback from the **$4,300** resistance.\n* **Technical Outlook:** Immediate support is near the 200-day moving average at **$4,100**, with resistance at **$4,300**.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "Trump Wants Homebuyers to Tap 401(k)s for Down Payments. Should They? - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/articles/2026-01-16/trump-wants-homebuyers-to-tap-401-k-s-for-down-payments-should-they",
                "body": "Debt & Savings\nTrump Wants Homebuyers to Tap 401(k)s for Down Payments. Should They?\nPresident Donald Trump is slated to unveil a plan for letting retirement savers use the money to buy homes.\nPresident Donald Trump’s new plan to boost home ownership risks leaving some Americans unprepared for retirement.\nAs part of an ongoing push to improve housing affordability, Trump is seeking to allow savers in 401(k) retirement plans to use some of their money for down payments on a home purchase, according to National Economic Council Director Kevin Hassett. The plan will be unveiled next week at the annual World Economic Forum in Davos, Switzerland."
            },
            {
                "title": "S Korea's ex-president Yoon to be jailed for five years over martial law bid - BBC",
                "source": "BBC",
                "url": "https://www.bbc.com/news/articles/cy4qdpxp78po",
                "body": "S Korea's ex-president Yoon to be jailed for five years over martial law bid\nSouth Korea's impeached president Yoon Suk Yeol will be jailed for five years over abuse of power, obstructing justice and falsifying documents in relation to his failed martial law bid in 2024.\nThis is the first of the verdicts in four trials linked to his shock martial law decree. Although short-lived, the move triggered nationwide turmoil, sparking protests as MPs rushed to the national assembly to overturn Yoon's decision.\nYoon's actions \"plunged the country into political crisis\", a judge said on Friday, noting that Yoon had \"consistently shown no remorse\".\nFriday's ruling offers clues as to how the rest of Yoon's trials could go. His string of charges range from abuse of power to campaign law violations.\nThe most serious charge is insurrection, for which prosecutors have demanded the death penalty. The verdict in that trial is expected in February.\nAbout 100 supporters of Yoon had gathered outside the courthouse on Friday to watch the livestreamed proceedings projected on a large screen.\nSome of them held red banners that read: \"Yoon, again! Make Korea great again\". Several could be heard yelling at the judge as he delivered the guilty verdicts, while others looked solemn.\nOn Friday, Yoon was convicted of using presidential bodyguards to prevent his arrest; failing to consult his entire cabinet before declaring martial law; as well as drafting and then destroying a falsified document claiming the martial law bid had been endorsed by the prime minister and defence minister.\n\"The accused has the duty to safeguard the constitution and law but turned his back on them,\" the judge said.\nProsecutors had sought a 10-year jail term for the charges in Friday's ruling. Both sides have seven days to appeal.\nYoon denied the charges, arguing that the arrest warrant itself was invalid and that the letter of the law does not require him to consult every member of the cabinet before exercising emergency power.\nHe had claimed across his trials that investigators had no legal basis to probe and arrest him in the first place. Most of the accusations against him are invalid because there was no procedural lapse when he declared martial law, he argues.\nSouth Korea's courts often grant leniency when the accused accepts guilt or responsibility. But prosecutors argue that Yoon's lack of remorse is grounds for an even more severe penalty.\nPark Geun-hye, who was sentenced to 20 years in prison for abuse of power and bribery in 2021, was the last former president to be jailed for a criminal charge. But she was pardoned and released from prison shortly after.\nSix months after Yoon's martial law attempt, voters elected opposition leader Lee Jae Myung in a decisive victory .\nBut Yoon's trials bring the spotlight back to deep divisions in South Korea, where the former president retains strong supporters who see him as a martyr. According to a survey conducted last December, nearly 30% of South Koreans did not believe that Yoon's martial law declaration amounted to an insurrection.\nWhile his martial law attempt brought tens of thousands of protesters onto the streets, it also saw his supporters show up in counter protests, though in smaller numbers.\nAdditional reporting by Koh Ewe"
            },
            {
                "title": "RFK Jr.’s Eugenics-Coded Crusade - Vanity Fair",
                "source": "Vanity Fair",
                "url": "https://www.vanityfair.com/news/story/rfk-jr-vaccines-eugenics",
                "body": "It’s rare to get a bunch of scientists to agree on anything—but health experts are near unanimous in saying that there’s no scientific reason for the CDC’s recent changes to the recommended childhood vaccine schedule. The American Academy of Pediatrics called the Trump administration’s move “dangerous and unnecessary.” Omolara Thomas, MD, a pediatrician who specializes in public and global health, puts it bluntly: “I don’t think it’s extreme to say that children will potentially die.”\nRobert F. Kennedy Jr.’s ferocious weirdness—his alleged pregnancy fetish, his love of roadkill, his brain worm—can make it hard to decipher any coherent ideology. Yet Kennedy’s anti-vaccine project should be understood as part of the broader Trump agenda, part and parcel with ICE raids and cuts to health care subsidies and food stamps. It’s a program that seeks to completely overhaul the American population and redefine who gets to be an American, as well as who deserves health and safety. Under Donald Trump, fitness, inherent health, and morality are all associated with a specific type of person: able-bodied, white “heritage Americans.”\nIf this all sounds vaguely familiar in a terrible, old-timey way, it’s because this rhetoric echoes one of the darkest ideologies of the 19th and 20th centuries, one that has never really gone away: eugenics. Some eugenicists were obsessed with purity, and saw illness as nature’s way of eliminating the unfit. Historical comparisons are never exact, but the reawakening of this ideology is pervasive once you start to notice it. “It’s as if you were a musician and you kept hearing the same notes, and you said, ‘Wait a minute, I know that tune,” says Paul A. Lombardo, a legal historian of eugenics.\nKennedy has echoed these points in remarks like the ones he made last year, after a six-year-old Mennonite girl died from measles. “It’s very, very difficult for measles to kill a healthy person,” he said, adding that “we see a correlation between people who get hurt by measles and people who don’t have good nutrition or who don’t have a good exercise regimen.” Texas officials told The New York Times that the little girl had been healthy before she contracted the disease.\nLast month, a contractor working with the CDC’s Advisory Committee on Immunization Practices made similar comments, falsely claiming that hepatitis B is primarily a concern for babies of “foreign-born” mothers that occurs in some “high-risk immigrant families,” and that there is little risk to the “average American child.” Of course, in the real world, disease does not discriminate: Before rotavirus vaccination, for instance, the virus caused up to 70,000 hospitalizations and 60 deaths each year. Prominent pediatrician Paul Offit, MD, recently told The Atlantic about a nine-month-old girl he treated in the 1970s who had been totally healthy before she contracted rotavirus. She was so dehydrated that his team could not find a vein for an IV; he had to try to drill into her bone marrow to hydrate her. Despite her medical team’s efforts, the girl died.\nThrowing around the word eugenics has become a bit like crying Nazi, but increasingly, using either term seems apt. Broadly, eugenics is the belief that society can engineer a better, stronger, and smarter population primarily by controlling who has babies. It’s the notion that some people have bad genes, making them inherently weak—a concept Trump loves. If those people reproduce, it’s therefore a threat to the whole country.\nEugenics led to the forced—but entirely legal!—sterilization of disabled people and people of color in the US throughout the 20th century. Eugenics was never a fringe idea; it was seen as legitimate science, and promoted by many political and scientific leaders. In 1912, The New England Journal of Medicine, then known as the Boston Medical and Surgical Journal, published an editorial titled “Immigration as a Factor in the Increase of Insanity,” an article that warned of the malign influe"
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "746.070",
            "open": "53,975.800",
            "close": "54,017.900",
            "high": "54,451.840",
            "low": "53,705.770"
        },
        "market_summary": "### JPN225 Market Briefing\n\n* **Key Drivers:** The \"**Takaichi trade**\" has driven a **4%** surge in Japanese stocks, fueled by expectations of increased government spending under Prime Minister Sanae Takaichi's pro-stimulus policies, but faces risks from potential **inflation**, **yen slump**, and **yield jump**.\n* **Price Action:** The Topix index has seen its strongest rally since July, but the sustainability of this **bullish momentum** is uncertain due to possible negative impacts of overspending on **inflation** and government borrowing costs.\n* **Technical Outlook:** Immediate support for the JPN225 is near the **23,000** level, with resistance at **24,500**, and the index's movement will be closely watched as the Bank of Japan is expected to hold its policy rate steady at **0.75%** at its upcoming meeting.\n\n---\n**Overall Sentiment:** Cautiously Positive ️",
        "source_articles": [
            {
                "title": "'Takaichi trade' faces risks from inflation, yen slump and yield jump - The Japan Times",
                "source": "The Japan Times",
                "url": "https://www.japantimes.co.jp/business/2026/01/17/markets/takaichi-trade-risks/",
                "body": "The surge in Japanese stocks, triggered by Prime Minister Sanae Takaichi’s snap election plans, may fade if she gets what she wants, as overspending drives up inflation and government borrowing costs.\nThe Topix index rose more than 4% this week in its strongest rally since July after reigniting the \"Takaichi trade” in which investors buy stocks on expectations of more government spending. Takaichi is gambling her party will win more seats and consolidate her power, giving her a freer hand to pursue pro-stimulus policies.\nInvestors think that Takaichi may emulate her mentor Shinzo Abe — Japan’s longest-serving leader — whose stimulus-heavy Abenomics fueled asset prices. She has flagged areas such as artificial intelligence, semiconductors, defense, space and content industries as investment priorities."
            },
            {
                "title": "Takaichi Trade Faces Risks From Inflation, Yen Slump, Yield Jump - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/articles/2026-01-16/takaichi-trade-faces-risks-from-inflation-yen-slump-yield-jump",
                "body": "Takaichi Trade Faces Risks From Inflation, Yen Slump, Yield Jump\nThe surge in Japanese stocks, triggered by Prime Minister Sanae Takaichi’s snap election plans, may fade if she gets what she wants, as overspending drives up inflation and government borrowing costs.\nJapan’s Topix index rose more than 4% this week in its strongest rally since July after reigniting the “Takaichi trade” in which investors buy stocks on expectations of more government spending. Takaichi is gambling her party will win more seats so to consolidate her power, giving her a freer hand to pursue pro-stimulus policies."
            },
            {
                "title": "BOJ set to hold policy rate steady at January meeting - Nikkei Asia",
                "source": "Nikkei Asia",
                "url": "https://asia.nikkei.com/economy/bank-of-japan/boj-set-to-hold-policy-rate-steady-at-january-meeting",
                "body": "TOKYO -- The Bank of Japan is expected to keep its policy rate at 0.75% at its two-day monetary policy meeting starting Thursday of next week, following its rate increase of December 2025.\nGrowth upgrade likely as government measures bolster spending and capital investment\nBank of Japan Gov. Kazuo Ueda. Many within the BOJ see the strong U.S. economy and weak-yen-driven export gains as additional upside factors alongside the positive effects of the Japanese government's supplementary budget. (Photo by Rie Ishii)\nTOKYO -- The Bank of Japan is expected to keep its policy rate at 0.75% at its two-day monetary policy meeting starting Thursday of next week, following its rate increase of December 2025."
            }
        ]
    }
]