[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "90.340",
            "open": "4,937.940",
            "close": "4,983.100",
            "high": "4,990.160",
            "low": "4,899.820"
        },
        "market_summary": "### Gold (XAU/USD) Market Briefing\n\n* **Key Drivers:** Weaker **US dollar** and simmering **geopolitical tension** are driving investors to **gold** as a safe-haven asset, with the **US Federal Reserve** expected to cut interest rates again this year.\n* **Price Action:** Gold has surged past **$5,000** an ounce to a record high, extending a rally that drove up gold prices about **18%** this year, with analysts expecting further increases to around **$5,500** later in the year.\n* **Technical Outlook:** Immediate resistance is at **$5,072.62**, with the price projecting toward the target level of **$5,400**, and the **RSI** approaching overbought levels, indicating a potential short-term top before a correction.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Gold tops $5,000 for first time ever, adding to historic rally - BBC",
                "source": "BBC",
                "url": "https://www.bbc.com/news/articles/cvgd8kj2y2po",
                "body": "Gold tops $5,000 for first time ever, adding to historic rally\nThe price of gold has risen above $5,000 (£3,659) an ounce for the first time ever, extending a historic rally that saw the precious metal jump by more than 60% in 2025.\nIt comes as tensions between the US and NATO over Greenland have added to growing concerns about financial and geopolitical uncertainty.\nUS President Donald Trump's trade policies have also worried markets. On Saturday he threatened to impose a 100% tariff on Canada if it strikes a trade deal with China.\nGold and other precious metals are seen as so-called safe-haven assets that investors buy in times of uncertainty. On Friday, silver topped $100 an ounce for the first time, building on its almost 150% rise last year.\nDemand for precious metals has also been driven by a range of other factors including higher-than-usual inflation, the weak US dollar, buying by central banks around the world and as the US Federal Reserve is expected to cut interest rates again this year.\nWars in Ukraine and Gaza, as well as Washington seizing Venezuelan President Nicolás Maduro, have also helped push up the price of gold.\nOne of the biggest appeals of gold is its relative scarcity. Only around 216,265 tonnes of the metal have ever been mined, according to the World Gold Council trade association.\nThat's enough to fill between three to four Olympic-sized swimming pools. The majority of that was only extracted from the earth since 1950, as mining technology advanced and new deposits were discovered.\nThe US Geological Survey estimates that another 64,000 tonnes of gold can still be mined from underground reserves, although the supply of the metal is predicted to plateau in the coming years.\n\"When you own gold, it's not attached to the debt of somebody else like a bond is or an equity where the performance of a company will drive performance,\" said Nicholas Frappell, global head of institutional markets at ABC Refinery.\n\"It's a really good diversifier in a very uncertain world,\" he added.\n'People go to gold'\nGold saw a blockbuster year in 2025, with its biggest annual gain since 1979 as investors flocked to precious metals.\nWith financial markets spooked by concerns including Trump's tariffs and fears that artificial intelligence-related stocks are overpriced, gold repeatedly hit new record highs.\n\"I think a large part of that is the extreme uncertainty we have around US policy,\" said Nikos Kavlis from research consultancy Metals Focus.\nWhile economic concerns can help to push up the price of gold, it also tends to rise when investors expect interest rates to be cut.\nLower rates typically mean smaller returns for investments such as bonds, so investors look to assets like gold and silver.\nThe US Federal Reserve is widely expected to cut its main interest rate twice this year.\n\"It's inversely correlated because the opportunity cost of keeping the money in a [government bond] is really not worth it anymore, so people go to gold,\" said Ahmad Assiri, Research Strategist at Pepperstone.\nIt's not just investors who have been buying up gold.\nLast year, central banks added hundreds of tons of bullion to their reserves, according to the World Gold Council.\n\"There's a very clear shift away from the US dollar, which is benefiting gold immensely,\" said Kavalis.\nThe start of this year has seen gold continue to rally but Frappell warns the \"news-driven\" market could also result in a fall in its price.\n\"There's got to be scope for unexpected news that actually might be positive for the world and not necessarily positive for gold,\" he said.\nBut not everybody is buying gold for purely investment reasons.\nIn many cultures, the metal is purchased during festivals or given as gifts at celebrations such as weddings.\nIn India, the annual Diwali festival is believed to be an auspicious occasion to buy precious metals in order to bring on wealth and luck.\nAccording to the US investment bank Morgan Stanley, Indian households held $3.8tn of gold"
            },
            {
                "title": "Gold exceeds $5,000 amid weaker US dollar and geopolitical tension - thenationalnews.com",
                "source": "thenationalnews.com",
                "url": "https://www.thenationalnews.com/business/2026/01/26/gold-exceeds-5000-amid-weaker-us-dollar-and-geopolitical-tension/",
                "body": "Gold prices surged past $5,000 an ounce on Monday to a record high, reinforcing bullion's status as a safe haven amid a weaker US dollar and simmering geopolitical tension.\nGold, which is widely viewed as a hedge against inflation, rose 1.67 per cent to $5,072.62 an ounce, data from GoldPrice.org showed.\nThis has extended a rally that drove up gold prices about 18 per cent this year as investors seek a safe haven in precious metals.\nLast week, gold recorded its best week since the financial crisis in 2008.\n“This is an option for investors to diversify their exposure to monetary and fiscal policy uncertainty,” Samantha Dart, co-head of global commodities research at Goldman Sachs, said.\nBullion added 64 per cent to its value last year, its biggest annual rise since 1979, driven by a mix of safe-haven demand and bets on US rate cuts.\nThe surge in gold to record highs comes after a turbulent week where tension over Greenland and Iran unsettled investors, while markets remained alert after major spikes in the Japanese yen.\nAnalysts expect further increases in gold prices, with a high of about $5,500 later in the year.\n\"We expect further upside (for gold). Our current forecast suggests that prices will peak at around $5,500 later this year,\" Philip Newman, director at Metals Focus, said."
            },
            {
                "title": "Gold (XAUUSD) Breaks $5,000 as US Dollar Crashes – Silver Surges Above $100 - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/gold-xauusd-breaks-5000-as-us-dollar-crashes-silver-surges-above-100-1574932",
                "body": "Gold surged past $5,000 as the U.S. dollar weakened sharply, while silver broke above $100 with bullish patterns pointing to further gains amid rising volatility and strong technical momentum.\nGold (XAUUSD) price has spiked to a new record high of more than $5,000 on Monday. This surge was fueled by a sharp drop in US Dollar Index caused by rumours of potential action to strengthen Japanese yen. Despite the drop in the US dollar, US Treasury yields have stayed flat and consolidated above the 200-day SMA as shown in the chart below. The sharp drop of the US dollar drove the gold price above the $5,000 mark.\nOn the other hand, price of silver received strong gains as the gold to silver ratio broke the major level of 60. Consumer confidence improved in January. The chart below shows that the University of Michigan Consumer Confidence Index jumped to 56.4. This is the highest reading in five months.\nMoreover, inflation expectations dropped to 4% in January 2026 from 4.2% in December 2025 as shown in the chart below.\nMeanwhile, business activity improved somewhat, but growth in new orders remained feeble. The chart below shows that S&P Global US Flash Composite PMI has risen slightly to 52.8. Chris Williamson at S&P said first-quarter growth may come up short. President Trump also claimed to have chosen the next Fed Chair, with a formal announcement imminent.\nThe daily chart for spot gold shows that the price is trading within an ascending broadening wedge pattern after breaking from the previous ascending broadening wedge pattern. The emergence of multiple ascending broadening wedge patterns indicates expanding volatility, which suggests continued upside in the short term.\nThe primary target of $5,000 has been reached, and the price is now projecting toward the target level of $5,400. The RSI is also approaching overbought level, which indicates that the price may form a short-term top before a correction. However, any correction will be considered a buying opportunity for short term traders.\nThe 4‑hour chart for spot gold also shows a strong bullish formation of an ascending triangle pattern. This pattern is formed by the breakout of $4,260, which has initiated strong surge. However, the RSI is now reaching extremely overbought levels. Despite these overbought conditions, the price is still looking to move higher.\nThe spot silver market is now breaking the psychological $100 level and entering the next stage of its surge. The strong exponential move during the last few weeks indicates that silver is entering an explosive phase. The next move in the silver market might be even stronger, and the price may continue to accelerate much higher.\nThe emergence of a cup and handle pattern, followed by a breakout from the blue-shaded area, indicates expanding volatility. As long as the price remains above $50, the silver market will likely trade toward long-term target of $300.\nThe breakout from the $100 level is also observed on the 4-hour chart, where the ascending broadening wedge pattern was forming. This breakout indicates that the price is entering a new trend at much higher levels.\nThe daily chart for the US Dollar Index shows that the index dropped sharply toward the 97 level. The strong consolidation below 100.50 since July 2025 increases the likelihood of a downside breakout below 96. A break below the 96 level in the US Dollar Index will indicate a strong drop toward the 90 level.\nThe 4-hour chart for USD Index shows strong consolidation between the 96.50 and 100.50 levels. The formation of double top pattern at 100.50 and then the retracement back toward the neckline of the double top pattern at the 99 level indicates strong bearish price action. This bearish outlook increases the likelihood of a downside breakout toward the 90 level.\nGold and silver show strong bullish momentum as U.S. dollar weakens and market volatility expands. Gold has cleared $5,000 with strong chart formations and technical signals pointing to $5,400 ahe"
            }
        ]
    },
    {
        "asset_name": "Silver",
        "symbol": "EIGHTCAP:XAGUSD",
        "status": "Success",
        "data": {
            "day_range": "7.274",
            "open": "96.263",
            "close": "103.065",
            "high": "103.357",
            "low": "96.083"
        },
        "market_summary": "### Silver (XAG/USD) Market Briefing\n\n* **Key Drivers:** Persistent geopolitical uncertainty, **bullish momentum**, and **industrial demand** are driving the price of silver, with forecasts suggesting it could reach **$110** per ounce.\n* **Price Action:** Silver broke above **$100** and reached a fresh high of **$109.46**, showing significant **upward momentum**.\n* **Technical Outlook:** Immediate support is near the **nine-day EMA at $96.32**, with resistance at the **upper ascending channel boundary around $110.00**.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Gold tops $5,000 for first time ever, adding to historic rally - BBC",
                "source": "BBC",
                "url": "https://www.bbc.com/news/articles/cvgd8kj2y2po",
                "body": "Gold tops $5,000 for first time ever, adding to historic rally\nThe price of gold has risen above $5,000 (£3,659) an ounce for the first time ever, extending a historic rally that saw the precious metal jump by more than 60% in 2025.\nIt comes as tensions between the US and NATO over Greenland have added to growing concerns about financial and geopolitical uncertainty.\nUS President Donald Trump's trade policies have also worried markets. On Saturday he threatened to impose a 100% tariff on Canada if it strikes a trade deal with China.\nGold and other precious metals are seen as so-called safe-haven assets that investors buy in times of uncertainty. On Friday, silver topped $100 an ounce for the first time, building on its almost 150% rise last year.\nDemand for precious metals has also been driven by a range of other factors including higher-than-usual inflation, the weak US dollar, buying by central banks around the world and as the US Federal Reserve is expected to cut interest rates again this year.\nWars in Ukraine and Gaza, as well as Washington seizing Venezuelan President Nicolás Maduro, have also helped push up the price of gold.\nOne of the biggest appeals of gold is its relative scarcity. Only around 216,265 tonnes of the metal have ever been mined, according to the World Gold Council trade association.\nThat's enough to fill between three to four Olympic-sized swimming pools. The majority of that was only extracted from the earth since 1950, as mining technology advanced and new deposits were discovered.\nThe US Geological Survey estimates that another 64,000 tonnes of gold can still be mined from underground reserves, although the supply of the metal is predicted to plateau in the coming years.\n\"When you own gold, it's not attached to the debt of somebody else like a bond is or an equity where the performance of a company will drive performance,\" said Nicholas Frappell, global head of institutional markets at ABC Refinery.\n\"It's a really good diversifier in a very uncertain world,\" he added.\n'People go to gold'\nGold saw a blockbuster year in 2025, with its biggest annual gain since 1979 as investors flocked to precious metals.\nWith financial markets spooked by concerns including Trump's tariffs and fears that artificial intelligence-related stocks are overpriced, gold repeatedly hit new record highs.\n\"I think a large part of that is the extreme uncertainty we have around US policy,\" said Nikos Kavlis from research consultancy Metals Focus.\nWhile economic concerns can help to push up the price of gold, it also tends to rise when investors expect interest rates to be cut.\nLower rates typically mean smaller returns for investments such as bonds, so investors look to assets like gold and silver.\nThe US Federal Reserve is widely expected to cut its main interest rate twice this year.\n\"It's inversely correlated because the opportunity cost of keeping the money in a [government bond] is really not worth it anymore, so people go to gold,\" said Ahmad Assiri, Research Strategist at Pepperstone.\nIt's not just investors who have been buying up gold.\nLast year, central banks added hundreds of tons of bullion to their reserves, according to the World Gold Council.\n\"There's a very clear shift away from the US dollar, which is benefiting gold immensely,\" said Kavalis.\nThe start of this year has seen gold continue to rally but Frappell warns the \"news-driven\" market could also result in a fall in its price.\n\"There's got to be scope for unexpected news that actually might be positive for the world and not necessarily positive for gold,\" he said.\nBut not everybody is buying gold for purely investment reasons.\nIn many cultures, the metal is purchased during festivals or given as gifts at celebrations such as weddings.\nIn India, the annual Diwali festival is believed to be an auspicious occasion to buy precious metals in order to bring on wealth and luck.\nAccording to the US investment bank Morgan Stanley, Indian households held $3.8tn of gold"
            },
            {
                "title": "Silver Price Prediction: XAG Breaks $105 as Citi Expects Bullish Rally to Continue - Coinpaper",
                "source": "Coinpaper",
                "url": "https://coinpaper.com/14021/silver-price-prediction-xag-breaks-105-as-citi-expects-bullish-rally-to-continue",
                "body": "Silver has climbed above $105 per ounce, breaking new ground for the precious metal as institutional forecasts turn increasingly bullish amid tight physical markets, rising industrial demand, and geopolitical uncertainties.\nThe rally above prior highs refocuses attention on silver’s dual role, both as an industrial metal critical to modern technologies and a safe‑haven asset in uncertain macroeconomic conditions.\nCiti Sees Silver Reaching $100+\nCitigroup’s commodities strategists have issued a bullish outlook for silver, lifting their near‑term price target to $110 per ounce, driven by “heightened geopolitical risks, ongoing physical market shortages, and renewed uncertainty on Federal Reserve independence.” Citi also reiterated its view that silver is poised to outperform gold in the current rally.\nAccording to the forecast, silver’s strong performance reflects deeply drawn inventories, accelerating industrial demand, and strong investor interest. Analysts emphasize that the metal’s recent gains, outpacing gold and broader markets are more than a short‑term spike and may signal a structural shift in precious metals demand.\nBullish Drivers Behind the Rally\nSupply Constraints & Tight Inventories\nSilver’s physical market remains unusually tight, with inventories at key exchanges drawn down significantly over recent quarters. This has heightened the risk of supply squeezes and supported upward pressure on prices.\nIndustrial Demand Surge\nSilver’s critical role in renewable energy (especially photovoltaics), electric vehicles, and electronics manufacturing has boosted long‑term demand expectations, adding a robust fundamental underpinning to the price rally.\nSafe‑Haven & Monetary Appeal\nAmid ongoing macroeconomic uncertainty, including debates around inflation, interest rate policy, and geopolitical tensions — investors continue shifting toward precious metals as portfolio hedges. Silver’s recent outperformance relative to gold underscores its appeal across both defensive and cyclical demand drivers.\nCiti’s Broader Precious Metals View\nWhile Citi’s gold and silver forecasts both reflect an ongoing bull market, the bank’s analysts have highlighted silver’s potential to outperform gold over the near term due to its combination of industrial growth and investor demand. Their revised targets reflect short‑term momentum and structural shifts in metal markets.\nCiti’s optimism is rooted in a convergence of factors: physical shortages, resilient industrial use, and macroeconomic risk, suggesting that silver could continue higher even after its strong gain past the $100 threshold."
            },
            {
                "title": "Silver Price Forecast: XAG/USD retreats after reaching fresh record highs near $109.50 - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/amp/news/silver-price-forecast-xag-usd-retreats-after-reaching-fresh-record-highs-near-10950-202601260315",
                "body": "Silver Price Forecast: XAG/USD retreats after reaching fresh record highs near $109.50\n|- Silver price hit a fresh high of $109.46 on Monday amid persistent bullish bias.\n- The trend structure remains intact, with the gap between the nine- and 50-day EMAs continuing to widen.\n- The 14-day Relative Strength Index stays above 70, signaling strong upside momentum while reflecting stretched momentum.\nSilver price (XAG/USD) extends its gains for the third successive session, trading around $108.80 per troy ounce during the Asian hours on Monday. The XAG/USD pair hit a fresh high of $109.46 amid persistent bullish bias, indicated by the technical analysis of the daily chart timeframe, as the price of the precious metal rises within the ascending channel pattern.\nSilver price remains firmly above the rising 50-day Exponential Moving Average (EMA), with price sustaining a clear premium over both. The short-term slope has steepened, underscoring trend acceleration. Trend structure stays intact as the spread between the nine- and 50-day EMAs widens, though a flattening of the former would flag fading impetus.\nThe 14-day Relative Strength Index (RSI) at 80.24 (overbought) reflects stretched momentum. RSI remains above 70, keeping upside momentum dominant but raising risk of a volatility pause to relieve extremes.\nWhile momentum is extended, the bullish bias would persist while holding above the near-term average and near the upper ascending channel boundary around $110.00.\nInitial support aligns with the nine-day EMA at $96.32, followed by the lower boundary of the ascending channel around the psychological level of $96.00. Pullbacks within this context would be treated as corrective as long as the longer average continues to rise, while the 50-day EMA at $74.67 offers a deeper cushion.\n(The technical analysis of this story was written with the help of an AI tool.)\nSilver FAQs\nSilver is a precious metal highly traded among investors. It has been historically used as a store of value and a medium of exchange. Although less popular than Gold, traders may turn to Silver to diversify their investment portfolio, for its intrinsic value or as a potential hedge during high-inflation periods. Investors can buy physical Silver, in coins or in bars, or trade it through vehicles such as Exchange Traded Funds, which track its price on international markets.\nSilver prices can move due to a wide range of factors. Geopolitical instability or fears of a deep recession can make Silver price escalate due to its safe-haven status, although to a lesser extent than Gold's. As a yieldless asset, Silver tends to rise with lower interest rates. Its moves also depend on how the US Dollar (USD) behaves as the asset is priced in dollars (XAG/USD). A strong Dollar tends to keep the price of Silver at bay, whereas a weaker Dollar is likely to propel prices up. Other factors such as investment demand, mining supply – Silver is much more abundant than Gold – and recycling rates can also affect prices.\nSilver is widely used in industry, particularly in sectors such as electronics or solar energy, as it has one of the highest electric conductivity of all metals – more than Copper and Gold. A surge in demand can increase prices, while a decline tends to lower them. Dynamics in the US, Chinese and Indian economies can also contribute to price swings: for the US and particularly China, their big industrial sectors use Silver in various processes; in India, consumers’ demand for the precious metal for jewellery also plays a key role in setting prices.\nSilver prices tend to follow Gold's moves. When Gold prices rise, Silver typically follows suit, as their status as safe-haven assets is similar. The Gold/Silver ratio, which shows the number of ounces of Silver needed to equal the value of one ounce of Gold, may help to determine the relative valuation between both metals. Some investors may consider a high ratio as an indicator that Silver is undervalued, or Gold is overvalu"
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "0.680",
            "open": "65.906",
            "close": "65.816",
            "high": "66.016",
            "low": "65.336"
        },
        "market_summary": "### Spot Brent Crude Oil Market Briefing\n\n* **Key Drivers:** Middle East tensions and **global uncertainty** are increasing the **risk premium** in oil prices, outweighing supply-side improvements.\n* **Price Action:** **Brent** held around **$66**, with a gain of **2.7%** last week, as **WTI** traded near **$61.21** after rising more than **2%** in the prior session.\n* **Technical Outlook:** Immediate support is near **$61.12**, with resistance at **$61.20–61.28**, and the short-term trend reflects a recent pullback after a strong **bullish rally**.\n\n---\n**Overall Sentiment:** **Cautiously bullish**",
        "source_articles": [
            {
                "title": "Iraqi production rises in 2025 as OPEC-plus eases quotas - Iraq Oil Report",
                "source": "Iraq Oil Report",
                "url": "https://www.iraqoilreport.com/news/iraqi-production-rises-in-2025-as-opec-plus-eases-quotas-47478/",
                "body": "Iraqi production rises in 2025 as OPEC-plus eases quotas\nNationwide output increased year-on-year as Iraq's domestic refineries continued providing an elastic and expanding source of demand.Iraqi Prime Minister Mohammed Shia al-Sudani speaks at an opening ceremony for the Karbala refinery on April 1, 2023. (Photo credit: Prime Minister's Office)\nIraq's nationwide oil production increased by about 120,000 barrels per day (bpd) in 2025 as the Oil Ministry took advantage of loosening OPEC-plus quotas, according to an Iraq Oil Report analysis based on monthly data gathered from each of the country's producing fields.\nFederal fields averaged 4.50 million bpd in 2025, up from 4.36 million bpd the prior year. KRG fields averaged 285,000 bpd for the year, down from 308,000 bpd in 2024.\nLogin to your account\nSubscribe for news access\nAnnual News subscribers receive access to the full archive of Iraq Oil Report articles."
            },
            {
                "title": "Oil Holds as Middle East Risk Lifts Premium - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/analysis/oil-holds-as-middle-east-risk-lifts-premium/",
                "body": "Key Points\n- WTI traded near $61.21 after rising more than 2% in the prior session\n- Brent held around $66, with both benchmarks up 2.7% last week\nOil prices extended gains on Monday following a strong prior session, as global tensions between the United States and Iran kept markets on edge.\nThe move came despite the resumption of full operations at Kazakhstan’s main export route, underscoring how security concerns continue to outweigh supply-side relief in the near term.\nBrent crude futures rose 12 cents, or 0.18%, to $66 a barrel in early Asian trade, while US West Texas Intermediate crude traded at $61.21 a barrel, up 14 cents, or 0.23%.\nBoth benchmarks closed last week with gains of 2.7%, marking their highest weekly settlement levels since January 14.\nThe price action reflects a market that remains sensitive to headline risk. Supply flows have improved on paper, yet traders continue to price in disruption risk amid escalating military rhetoric.\nA cautious forecast suggests oil may stay supported as long as global uncertainty persists, even if physical supply data improves.\nMiddle East Tensions Reignite Supply Fears\nThe latest leg higher in crude followed fresh signals of US military mobilisation.\nA US aircraft carrier strike group and other assets are expected to arrive in the Middle East in the coming days, reinforcing concerns around regional stability.\nOn Thursday, President Donald Trump said the United States had an “armada” heading toward Iran, while adding that he hoped force would not be required.\nHe also warned Tehran against killing protesters or restarting its nuclear programme. Iranian officials responded sharply, with a senior figure stating on Friday that Iran would treat any attack “as an all-out war against us.”\nThese exchanges have injected a fresh risk premium into oil prices.\nTraders remain wary that even without direct conflict, heightened tensions could disrupt shipping routes or trigger precautionary stockpiling.\nIf rhetoric continues to intensify, crude prices may remain elevated, even in the absence of immediate supply outages.\nSupply Recovery Fails to Cool the Market\nOn the supply side, Kazakhstan’s Caspian Pipeline Consortium said it returned to full loading capacity at its Black Sea terminal on Sunday, after completing maintenance at one of its three mooring points.\nThe restart eased concerns about reduced exports from the region, yet had little dampening effect on prices.\nThis muted response highlights how global risk currently dominates trading behaviour. Markets appear willing to look past incremental supply improvements when broader security risks remain unresolved.\nUnless there is a sustained easing in global tension, supply recoveries alone may struggle to push prices materially lower in the short term.\nUS Weather Disruptions Add Short-Term Support\nFurther support for crude came from the United States, where crude and natural gas production fell as a winter storm began sweeping across the country on Friday.\nThe weather event also triggered a spike in spot power prices, signalling short-term strain across parts of the energy system.\nWhile weather-related disruptions are typically temporary, they can tighten prompt supply conditions and add to near-term price support, particularly when inventories are already under scrutiny.\nIf cold conditions persist longer than expected, energy markets may remain sensitive to further production interruptions.\nTechnical Analysis\nThe Crude Oil (CL-OIL) 1-minute chart shows prices currently trading at $61.135, down 0.23% in the session.\nEarlier, the price hit a high of $61.280 before easing lower, although still well above the session low of $60.895.\nThe short-term trend reflects a recent pullback after a strong bullish rally, with price consolidating between the 5-, 10-, and 20-period moving averages.\nThe MA5 (yellow) remains slightly above the MA10, suggesting potential short-term support near $61.12. A breakout above $61.20–61.28 may restore bullish momentu"
            },
            {
                "title": "Low Costs, High Demand, and the Flaws in the Oil Surplus Narrative - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605167640",
                "body": "Nearly all oil market experts agree that the market remains oversupplied this year, much like it was last year. However, the extent of this surplus is crucial. Many analysts, including those at the International Energy Agency (IEA), initially projected a significant excess measured in millions of barrels. The IEA later had to adjust its estimates as oil demand proved to be more robust than anticipated.\nAccording to the IEA’s most recent Oil Market Report, published earlier this week, global oil demand is expected to rise by 930,000 barrels per day in 2026, an increase from the estimated 850,000 barrels per day growth in 2025. The agency attributes this uptick to a worldwide economic recovery following last year’s trade disruptions and to falling oil prices, which have been influenced by ongoing forecasts of weak demand and continued supply growth.\nDespite these predictions, the anticipated supply increase did not fully materialize. In December, the IEA reported a drop in global oil production by 350,000 barrels per day. This was not an isolated event; December’s output of 107.4 million barrels per day was 1.6 million barrels below the record set in September. This indicates that oil production declined throughout the last quarter of 2025. Even so, the IEA estimates that global oil supply grew by 3 million barrels per day last year, but expects this growth to slow as demand strengthens—a typical response to lower prices.\nCurrently, oil prices are about 16% lower than they were a year ago, reflecting a buildup in global crude inventories. Throughout 2025, stocks increased by approximately 1.3 million barrels per day, totaling a rise of 470 million barrels. Demand projections vary: the World Bank estimated in November that daily demand would average between 103.8 and 104.5 million barrels, while Statista data suggests last year’s demand could have reached 105.5 million barrels per day.\nAt present, there is a comfortable buffer in oil supply, though perhaps not as large as some believed. This surplus continues to put downward pressure on prices, supported by persistent forecasts of oversupply. However, as producers react to these lower prices, the surplus is expected to shrink. The pace of this reduction remains uncertain, but it is considered inevitable as producers adjust to market conditions.\nOPEC has long challenged the IEA’s narrative of a significant oil glut, arguing that any surplus is far smaller than the IEA suggests and that a shift toward a supply deficit is more likely than the agency’s forecasts indicate.\nThis week, Amin Nasser, CEO of Aramco, reiterated the need for vigilance regarding spare production capacity. “Spare capacity is at 2.5%, and we require at least 3%. If OPEC+ further relaxes production cuts, spare capacity will drop even more, and this must be closely monitored,” Nasser stated at the World Economic Forum in Davos.\nNasser and other OPEC+ officials maintain that the oil market will naturally rebalance as strong demand absorbs any excess supply. However, they caution that without increased production capacity, the market could quickly tip into a shortage if demand outpaces supply.\nWhile OPEC+ has a clear interest in minimizing the perception of a surplus, critics often overlook that the IEA also has incentives to emphasize oversupply, using it as evidence of weakening demand amid the energy transition. This stance has drawn criticism from Washington, leading to a warning from Energy Secretary Chris Wright that U.S. funding for the IEA could be suspended unless the agency’s forecasts become more grounded in reality. The IEA subsequently revised its outlook, stating in its World Energy Outlook 2025 that there is no imminent peak in oil or gas demand.\nThese developments highlight that even the most respected oil market forecasters are not infallible, and their predictions are subject to change. The recent surge in prices following production disruptions in Kazakhstan serves as a reminder that the so-calle"
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.830",
            "open": "59.769",
            "close": "61.419",
            "high": "61.459",
            "low": "59.629"
        },
        "market_summary": "### Spot WTI Crude Oil Market Briefing\n\n* **Key Drivers:** Concerns over **oversupply** due to increased production and weaker-than-expected demand, as indicated by a bigger-than-expected build in **US crude oil inventories**.\n* **Price Action:** Drifted lower to **$61.00** amid **supply glut concerns**, with the price influenced by **geopolitical risks** and **OPEC+ production quotas**.\n* **Technical Outlook:** Immediate support is near the recent lows, with resistance at higher price levels, such as **$65.00**, and the overall trend indicating **bearish momentum** due to the **oversupply narrative**.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "Iraqi production rises in 2025 as OPEC-plus eases quotas - Iraq Oil Report",
                "source": "Iraq Oil Report",
                "url": "https://www.iraqoilreport.com/news/iraqi-production-rises-in-2025-as-opec-plus-eases-quotas-47478/",
                "body": "Iraqi production rises in 2025 as OPEC-plus eases quotas\nNationwide output increased year-on-year as Iraq's domestic refineries continued providing an elastic and expanding source of demand.Iraqi Prime Minister Mohammed Shia al-Sudani speaks at an opening ceremony for the Karbala refinery on April 1, 2023. (Photo credit: Prime Minister's Office)\nIraq's nationwide oil production increased by about 120,000 barrels per day (bpd) in 2025 as the Oil Ministry took advantage of loosening OPEC-plus quotas, according to an Iraq Oil Report analysis based on monthly data gathered from each of the country's producing fields.\nFederal fields averaged 4.50 million bpd in 2025, up from 4.36 million bpd the prior year. KRG fields averaged 285,000 bpd for the year, down from 308,000 bpd in 2024.\nLogin to your account\nSubscribe for news access\nAnnual News subscribers receive access to the full archive of Iraq Oil Report articles."
            },
            {
                "title": "WTI drifts lower to $61.00 on oversupply concerns - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/wti-drifts-lower-to-6100-on-oversupply-concerns-202601260241",
                "body": "WTI drifts lower to $61.00 on oversupply concerns\n- WTI price loses traction to near $61.00 in Monday’s Asian session.\n- A bigger-than-expected build in US crude oil inventories signaled weaker-than-expected demand and weigh on the price.\n- Renewed geopolitical risks might cap the downside for the WTI price.\nWest Texas Intermediate (WTI), the US crude oil benchmark, is trading around $61.00 during the Asian trading hours on Monday. The WTI price edges lower amid supply glut concerns.\nUS crude oil inventories rose last week, which raise fears of oversupply and drag the WTI price lower. According to the US Energy Information Administration (EIA) weekly report, crude oil stockpiles in the US for the week ending January 16 climbed by 3.602 million barrels, compared to a rise of 3.391 million barrels in the previous week. The market consensus estimated that stocks would increase by 1.1 million barrels.\nOn the other hand, escalating tensions in Iran, a major OPEC oil producer, might boost the WTI price. US President Donald Trump ratcheted up pressure against Iran through more sanctions on vessels that transport its oil and announced. US official said that warships, aircraft carrier and guided-missile destroyers will arrive in the Middle East in the coming days, per Reuters.\nThe American Petroleum Institute (API) crude oil stockpiles report will be published on Tuesday. A larger-than-expected crude oil inventory draw indicates stronger demand and could boost the WTI price, while a bigger build than estimated signals weaker demand or excess supply, which might drag the WTI price lower.\nWTI Oil FAQs\nWTI Oil is a type of Crude Oil sold on international markets. The WTI stands for West Texas Intermediate, one of three major types including Brent and Dubai Crude. WTI is also referred to as “light” and “sweet” because of its relatively low gravity and sulfur content respectively. It is considered a high quality Oil that is easily refined. It is sourced in the United States and distributed via the Cushing hub, which is considered “The Pipeline Crossroads of the World”. It is a benchmark for the Oil market and WTI price is frequently quoted in the media.\nLike all assets, supply and demand are the key drivers of WTI Oil price. As such, global growth can be a driver of increased demand and vice versa for weak global growth. Political instability, wars, and sanctions can disrupt supply and impact prices. The decisions of OPEC, a group of major Oil-producing countries, is another key driver of price. The value of the US Dollar influences the price of WTI Crude Oil, since Oil is predominantly traded in US Dollars, thus a weaker US Dollar can make Oil more affordable and vice versa.\nThe weekly Oil inventory reports published by the American Petroleum Institute (API) and the Energy Information Agency (EIA) impact the price of WTI Oil. Changes in inventories reflect fluctuating supply and demand. If the data shows a drop in inventories it can indicate increased demand, pushing up Oil price. Higher inventories can reflect increased supply, pushing down prices. API’s report is published every Tuesday and EIA’s the day after. Their results are usually similar, falling within 1% of each other 75% of the time. The EIA data is considered more reliable, since it is a government agency.\nOPEC (Organization of the Petroleum Exporting Countries) is a group of 12 Oil-producing nations who collectively decide production quotas for member countries at twice-yearly meetings. Their decisions often impact WTI Oil prices. When OPEC decides to lower quotas, it can tighten supply, pushing up Oil prices. When OPEC increases production, it has the opposite effect. OPEC+ refers to an expanded group that includes ten extra non-OPEC members, the most notable of which is Russia.\nAuthor\nLallalit Srijandorn\nFXStreet\nLallalit Srijandorn is a Parisian at heart. She has lived in France since 2019 and now becomes a digital entrepreneur based in Paris and Bangkok."
            },
            {
                "title": "Low Costs, High Demand, and the Flaws in the Oil Surplus Narrative - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605167640",
                "body": "Nearly all oil market experts agree that the market remains oversupplied this year, much like it was last year. However, the extent of this surplus is crucial. Many analysts, including those at the International Energy Agency (IEA), initially projected a significant excess measured in millions of barrels. The IEA later had to adjust its estimates as oil demand proved to be more robust than anticipated.\nAccording to the IEA’s most recent Oil Market Report, published earlier this week, global oil demand is expected to rise by 930,000 barrels per day in 2026, an increase from the estimated 850,000 barrels per day growth in 2025. The agency attributes this uptick to a worldwide economic recovery following last year’s trade disruptions and to falling oil prices, which have been influenced by ongoing forecasts of weak demand and continued supply growth.\nDespite these predictions, the anticipated supply increase did not fully materialize. In December, the IEA reported a drop in global oil production by 350,000 barrels per day. This was not an isolated event; December’s output of 107.4 million barrels per day was 1.6 million barrels below the record set in September. This indicates that oil production declined throughout the last quarter of 2025. Even so, the IEA estimates that global oil supply grew by 3 million barrels per day last year, but expects this growth to slow as demand strengthens—a typical response to lower prices.\nCurrently, oil prices are about 16% lower than they were a year ago, reflecting a buildup in global crude inventories. Throughout 2025, stocks increased by approximately 1.3 million barrels per day, totaling a rise of 470 million barrels. Demand projections vary: the World Bank estimated in November that daily demand would average between 103.8 and 104.5 million barrels, while Statista data suggests last year’s demand could have reached 105.5 million barrels per day.\nAt present, there is a comfortable buffer in oil supply, though perhaps not as large as some believed. This surplus continues to put downward pressure on prices, supported by persistent forecasts of oversupply. However, as producers react to these lower prices, the surplus is expected to shrink. The pace of this reduction remains uncertain, but it is considered inevitable as producers adjust to market conditions.\nOPEC has long challenged the IEA’s narrative of a significant oil glut, arguing that any surplus is far smaller than the IEA suggests and that a shift toward a supply deficit is more likely than the agency’s forecasts indicate.\nThis week, Amin Nasser, CEO of Aramco, reiterated the need for vigilance regarding spare production capacity. “Spare capacity is at 2.5%, and we require at least 3%. If OPEC+ further relaxes production cuts, spare capacity will drop even more, and this must be closely monitored,” Nasser stated at the World Economic Forum in Davos.\nNasser and other OPEC+ officials maintain that the oil market will naturally rebalance as strong demand absorbs any excess supply. However, they caution that without increased production capacity, the market could quickly tip into a shortage if demand outpaces supply.\nWhile OPEC+ has a clear interest in minimizing the perception of a surplus, critics often overlook that the IEA also has incentives to emphasize oversupply, using it as evidence of weakening demand amid the energy transition. This stance has drawn criticism from Washington, leading to a warning from Energy Secretary Chris Wright that U.S. funding for the IEA could be suspended unless the agency’s forecasts become more grounded in reality. The IEA subsequently revised its outlook, stating in its World Energy Outlook 2025 that there is no imminent peak in oil or gas demand.\nThese developments highlight that even the most respected oil market forecasters are not infallible, and their predictions are subject to change. The recent surge in prices following production disruptions in Kazakhstan serves as a reminder that the so-calle"
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0105",
            "open": "1.1748",
            "close": "1.1827",
            "high": "1.1833",
            "low": "1.1728"
        },
        "market_summary": "### EUR/USD Market Briefing\n\n* **Key Drivers:** The **EUR/USD** remains under the influence of a weakened **US Dollar**, driven by concerns over US trade relations and the upcoming **FOMC rate decision**. Speculation over **Fed Chairmanship** and potential **interest rate cuts** also impacts the pair.\n* **Price Action:** The **EUR/USD** has broken above the **1.18000** level, reaching near a four-year high at **1.1920**, indicating significant **bullish momentum**. The pair is expected to revisit its over four-year high of **1.1919** soon.\n* **Technical Outlook:** Immediate resistance is at the **1.20** handle, a key psychologically important level. Support levels are at **1.1750-1.1770** and the **1.18** handle, with the **20-day EMA** at **1.1713** acting as a major support zone.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "EUR/USD weekly outlook | January 26, 2026 - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/eur-usd-weekly-outlook-january-26-2026/?amp=true",
                "body": "EUR/USD weekly outlook | January 26, 2026\nThe EUR/USD remains in focus after last week saw the US dollar sell-off sharply across the board as Trump’s tariff theatrics unnerved investors about US policy. Investors demanded foreign currencies after the US president made a quick U-tun after his surprise announcement of tariffs on European countries. Meanwhile speculation over the Fed Chairmanship continued, and investors wondered what that would mean for interest rates. Perhaps the biggest driver behind the dollar sell-off was reports of intervention from Japan, where the USD/JPY staged one of its biggest drops in recent years. The EUR/USD outlook remains positive in early parts of the week ahead, thanks to strong momentum and the removal of tariff threats. Trump was at it again during the weekend with fresh tariffs threats on Canada. From a macro point of view, the focus will turn to the FOMC rate decision on Wednesday, in what otherwise seems like a quieter week for traditional data. All told, the risks remain tilted to the upside for EUR/USD.\nFOMC rate decision: No change expected\nPerhaps the week’s biggest macro event is on Wednesday, January 28 at 19:00 GMT, namely the FOMC rate decision. The Fed cut rates in December and signalled more cuts are on the way this year, with the Fed Chair Powell under intense pressure from Washington to ease rates even faster. However, no change is expected at this meeting, thanks to slight improvement in data, and as the Fed tries to defend its credibility. Any hints of an imminent rate cuts from Powell or in the policy statement should be dollar negative. However, if the Fed acknowledges recent improvement in US data, then this could provide some much needed support for the dollar, potentially keeping the EUR/USD below 1.20 handle.\nWhat other macro releases will impact the EUR/USD outlook?\nHere is a full list of upcoming data releases for the week ahead from both the US and Eurozone, which should have some implication on the EUR/USD outlook.\nEUR/USD key levels to watch\nThe EUR/USD closed last week right near the highs, around 1.1833. So the first thing on Monday, I’d be expecting some follow-through technical buying that could potentially take us above 1.1850 and towards the 1.19 handle. With the September 2025 high coming in at 1.1918, that will be my near-term upside target.\nAbove that, we have the 1.20 handle, which is a key psychologically important level where EUR/USD may head in the coming days, should the US dollar remain under pressure.\nOn the downside, the key support to watch is now around the 1.1750 to 1.1770 area. This area was the breakout zone we saw at the end of last week, where a bearish trend line converged with prior resistance.\nAbove this zone, we have the 1.18 handle, which is the first initial support to watch. But if we go back below the broken trend line, namely below the 1.1750 area, that would be a bearish development, in which case we could well see some downward movement in EUR/USD as disappointed bulls rush for the exits.\nThat said, the path of least resistance is clearly to the upside for the time being, and as a result, we maintain a bullish EUR/USD outlook for the week ahead.\n-- Written by Fawad Razaqzada, Market Analyst\nFollow Fawad on Twitter @Trader_F_R\nThe information on this web site is not targeted at the general public of any particular country. It is not intended for distribution to residents in any country where such distribution or use would contravene any local law or regulatory requirement. The information and opinions in this report are for general information use only and are not intended as an offer or solicitation with respect to the purchase or sale of any currency or CFD contract. All opinions and information contained in this report are subject to change without notice. This report has been prepared without regard to the specific investment objectives, financial situation and needs of any particular recipient. Any references to historical pri"
            },
            {
                "title": "EUR/USD Price Forecast: Jumps to near four-year high at 1.1920 - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/eur-usd-price-forecast-jumps-to-near-four-year-high-at-11920-202601260446",
                "body": "EUR/USD Price Forecast: Jumps to near four-year high at 1.1920\n- EUR/USD gains sharply to near 1.1900 at the start of the week amid a weakened US Dollar.\n- Resolved US-EU disputes failed to uplift the US Dollar.\n- The Fed is almost certain to hold interest rates steady on Wednesday.\nThe EUR/USD pair is up 0.36% to near 1.1900 during the Asian trading session on Monday. The major currency pair strengthens as the US Dollar (USD) extends last week’s decline amid caution ahead of the Federal Reserve's (Fed) monetary policy announcement on Wednesday.\nAs of writing, the US Dollar Index (DXY), which tracks the Greenback’s value against six major currencies, trades 0.4% lower to near 97.00, the lowest level seen in four months.\nThe US Dollar faces severe selling pressure as concerns over the United States’ (US) long-term trade relations with its trading partners persists despite recent geopolitics and trade tensions between Washington and several European Union (EU) members being resolved.\nOn Wednesday, the Fed will leave interest rates unchanged in the range of 3.50%-3.75%, according to the CME FedWatch tool. This will be the Fed's first pause after three consecutive interest rate cuts. The Fed reduced borrowing rates by 75 basis points (bps) in late 2025 to support a weak job market.\nThis week, the major trigger for the Euro (EUR) will be the preliminary Q4 Eurozone Gross Domestic Product (GDP) and the German Harmonized Index of Consumer Prices (HICP) data for January.\nEUR/USD technical analysis\nEUR/USD trades higher at around 1.1866 as of writing. Price holds above the 20-day Exponential Moving Average (EMA) at 1.1713, maintaining a bullish short-term bias. The 20-day EMA slopes higher, confirming an improving trend structure.\nThe 14-day Relative Strength Index (RSI) at 69.49 sits near overbought, signaling firm momentum.\nGiven momentum running hot, the price is expected to revisit its over four-year high of 1.1919 soon. The asset could discover more upside if it manages to deliver a daily close above the same. On the downside, the 20-day EMA will remain a major support zone for the pair.\n(The technical analysis of this story was written with the help of an AI tool.)\nFed FAQs\nMonetary policy in the US is shaped by the Federal Reserve (Fed). The Fed has two mandates: to achieve price stability and foster full employment. Its primary tool to achieve these goals is by adjusting interest rates. When prices are rising too quickly and inflation is above the Fed’s 2% target, it raises interest rates, increasing borrowing costs throughout the economy. This results in a stronger US Dollar (USD) as it makes the US a more attractive place for international investors to park their money. When inflation falls below 2% or the Unemployment Rate is too high, the Fed may lower interest rates to encourage borrowing, which weighs on the Greenback.\nThe Federal Reserve (Fed) holds eight policy meetings a year, where the Federal Open Market Committee (FOMC) assesses economic conditions and makes monetary policy decisions. The FOMC is attended by twelve Fed officials – the seven members of the Board of Governors, the president of the Federal Reserve Bank of New York, and four of the remaining eleven regional Reserve Bank presidents, who serve one-year terms on a rotating basis.\nIn extreme situations, the Federal Reserve may resort to a policy named Quantitative Easing (QE). QE is the process by which the Fed substantially increases the flow of credit in a stuck financial system. It is a non-standard policy measure used during crises or when inflation is extremely low. It was the Fed’s weapon of choice during the Great Financial Crisis in 2008. It involves the Fed printing more Dollars and using them to buy high grade bonds from financial institutions. QE usually weakens the US Dollar.\nQuantitative tightening (QT) is the reverse process of QE, whereby the Federal Reserve stops buying bonds from financial institutions and does not reinvest the principal fr"
            },
            {
                "title": "EUR/USD Weekly Forecast 25/01: Upwards Value? (Chart) - DailyForex",
                "source": "DailyForex",
                "url": "https://www.dailyforex.com/forex-technical-analysis/2026/01/eurusd-weekly-forecast-25th-to-30th-january-2026/240201",
                "body": "Friday’s trading in the broad Forex market saw widespread volatility develop. The EUR/USD was part of this mixture. Day traders who have been seeking volatility in Forex and complaining that price action has largely disappeared from the speculative landscape the past year and a half suddenly found themselves in the midst of a storm.\nThe EUR/USD which had largely been challenging the resistance level of 1.17500 and finding pushback most of last week, suddenly found momentum sustained on Friday and higher ground to explore.\nSustained buying going into this weekend and a finish near the 1.18263 level has put the EUR/USD into a realm last seen in the middle of September 2025. The broad financial markets are not exactly showing a huge amount of risk appetite, but they are showing uncertainty and this is leading to a lot of explanations, but also perhaps wrong thinking regarding why the EUR/USD is cascading upwards along with other assets which are showing strong volatility.\nTop Regulated Brokers\nTrump, U.S GDP and the Federal Reserve\nWhile many analysts are suggesting the EUR/USD has climbed because of President Trump’s rhetoric in Davos in the middle of last week, suggesting the EUR is now being bought as some sort of protest, this is difficult to believe. U.S GDP numbers came in stronger than anticipated on Thursday and this may have been a reason why Forex suddenly started to shake. Considerations and debate about what the U.S Federal Reserve will do this coming week and over the mid-term are certainly legitimate concerns.\nThe Fed will deliver its FOMC Statement this coming Wednesday. Vocal debates are being heard about interest rate policy and leadership of the U.S central bank. The U.S is showing solid growth, and inflation remains tame, which are classical reasons for a dovish Federal Reserve, but that may not translate into reality this coming week. Fed Chairman Powell remains very cautious and his leadership may influence the Fed to keep interest rates in place this coming week. Trump is not a fan of Jerome Powell.\nWords and Actions Translated into Market Sentiment\nThe broad financial markets are showing nervousness in the U.S via equity indices, yet they remain within sight of highs. Gold is trading in record territory and Silver is too. Suddenly Forex, including the EUR/USD, is starting to show volatility.\n- What day traders need to understand is that behavioral sentiment appears to be fragile because of loud rhetoric coming from many global corners.\n- It is advised that day traders try to take deep breaths and use solid risk management to guard against sudden gyrations.\n- The ability of the EUR/USD to trade above the 1.18000 mark and sustain values on Friday, will create a lot of interested observers early this coming week in Forex.\nEUR/USD Weekly Outlook:\nSpeculative price range for EUR/USD is 1.17655 to 1.18980\nLike lightning out of the sky, the EUR/USD suddenly jumping above the 1.18000 mark on Friday and finishing near the 1.18263 ratio must be taken seriously. More volatility early on Monday and into this coming week is a near certainty. The Federal Reserve decision and rhetoric via its FOMC meeting will shake the markets. While it seems unlikely the Fed will cut interest rates this week because of the level of caution Fed Chairman Jerome Powell expressed last month, this doesn’t mean it would be the right decision.\nBased on the stronger than expected GDP on Thursday of last week and the rather tame inflation numbers the week before, the Fed, per dovish observers, certainly has reasons to cut interest rates again. So if Powell and the FOMC members do not cut interest rates this week, what they say about the coming months will be important. And here is where things get interesting, financial institutions seem to be buying the EUR/USD as if they believe the U.S Fed is going to become more dovish over the mid-term if inflation remains tranquil no matter what Jerome Powell says. The EUR/USD above 1.18000 was seen in Sep"
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0164",
            "open": "1.3483",
            "close": "1.3642",
            "high": "1.3645",
            "low": "1.3481"
        },
        "market_summary": "### GBP/USD Market Briefing\n\n* **Key Drivers:** Robust UK data, including **0.4%** month-over-month increase in retail sales and **53.9** UK S&P Global UK Composite PMI, supports the **Pound Sterling**. Expectations of a **hawkish** Bank of England (BoE) stance and a potential delay in further rate cuts also lift the **GBP**.\n* **Price Action:** The **GBP/USD** pair trades near a four-month high, above **1.3650**, driven by **bullish momentum** and a broadly weaker **US Dollar**. The pair faces resistance at the **1.3680** region and support at **1.3450**.\n* **Technical Outlook:** Immediate resistance is near the **1.3700-1.3800** zone, where heavier supply and profit-taking are expected. Support is clustered around **1.3450**, then **1.3350**, with a deeper structural support line sitting closer to **1.3250**.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Pound Sterling strengthens above 1.3650 on robust UK data - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-usd-strengthens-above-13650-on-robust-uk-data-202601260528",
                "body": "GBP/USD strengthens above 1.3650 on robust UK data\n- GBP/USD gathers strength to the highest since mid-September, around 1.3660 in Monday’s early European session.\n- The upbeat UK Retail Sales and business activity figures support the Pound Sterling.\n- Markets widely expect the Fed to hold rates steady at the upcoming meeting due to a stabilizing labor market.\nThe GBP/USD pair trades in positive territory near 1.3660, the highest since September 17, 2025, during the early European session on Monday. The Pound Sterling (GBP) edges higher against the Greenback on the stronger-than-expected UK Retail Sales and Purchasing Managers Index (PMI) data. Traders will keep an eye on the US November Durable Goods Orders report later on Monday.\nData released by the Office for National Statistics (ONS) on Friday showed that the UK Retail Sales rose 0.4% month-over-month (MoM) in December after falling 0.1% in November. This figure came in better than the forecast of a 0.1% decline in the reported month.\nMeanwhile, the core Retail Sales, stripping the auto motor fuel sales, increased 0.3% MoM in December, compared with the previous decline of 0.4% (revised from -0.2%), above the market consensus of a 0.2% drop. The UK S&P Global UK Composite PMI climbed to 53.9 in December, also above expectations, to a 21-month high.\nThese reports have led some analysts to predict a potential delay in further Bank of England (BoE) rate cuts, which would lift the GBP against the US Dollar (USD). The UK central bank is expected to hold rates steady when it next meets in February. Markets fully price in a quarter-point rate cut by June, according to Reuters.\nThe US Federal Reserve (Fed) will announce its latest interest rate decision on Wednesday, with expectations that rates will remain unchanged at the 3.50% to 3.75% target range. Traders will closely monitor Fed Chair Jerome Powell’s remarks following the policy meeting, as his insights could provide important clues for the months ahead. Any hawkish comments from Fed officials could provide some support to the USD and act as a headwind for the major pair in the near term.\nPound Sterling FAQs\nThe Pound Sterling (GBP) is the oldest currency in the world (886 AD) and the official currency of the United Kingdom. It is the fourth most traded unit for foreign exchange (FX) in the world, accounting for 12% of all transactions, averaging $630 billion a day, according to 2022 data. Its key trading pairs are GBP/USD, also known as ‘Cable’, which accounts for 11% of FX, GBP/JPY, or the ‘Dragon’ as it is known by traders (3%), and EUR/GBP (2%). The Pound Sterling is issued by the Bank of England (BoE).\nThe single most important factor influencing the value of the Pound Sterling is monetary policy decided by the Bank of England. The BoE bases its decisions on whether it has achieved its primary goal of “price stability” – a steady inflation rate of around 2%. Its primary tool for achieving this is the adjustment of interest rates. When inflation is too high, the BoE will try to rein it in by raising interest rates, making it more expensive for people and businesses to access credit. This is generally positive for GBP, as higher interest rates make the UK a more attractive place for global investors to park their money. When inflation falls too low it is a sign economic growth is slowing. In this scenario, the BoE will consider lowering interest rates to cheapen credit so businesses will borrow more to invest in growth-generating projects.\nData releases gauge the health of the economy and can impact the value of the Pound Sterling. Indicators such as GDP, Manufacturing and Services PMIs, and employment can all influence the direction of the GBP. A strong economy is good for Sterling. Not only does it attract more foreign investment but it may encourage the BoE to put up interest rates, which will directly strengthen GBP. Otherwise, if economic data is weak, the Pound Sterling is likely to fall.\nAnother significant data r"
            },
            {
                "title": "GBP/USD holds near four-month high amid sustained USD selling - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-usd-stays-elevated-near-four-month-top-above-mid-13600s-amid-a-broadly-weaker-usd-202601260106",
                "body": "GBP/USD stays elevated near four-month top, above mid-1.3600s amid a broadly weaker USD\n- GBP/USD bulls retain control as the so-called ‘Sell America’ trade continues to weigh on the USD.\n- A relatively hawkish BoE expectations act as a tailwind for the GBP and also support spot prices.\n- Investors now look to US Durable Goods Orders for some impetus ahead of the FOMC meeting.\nThe GBP/USD pair retreats a few pips from its highest level since September 2024, around the 1.3680 region touched during the Asian session, and fills a modest bullish gap opening at the start of a new week. Spot prices currently trade with modest intraday gains, above mid-1.3600s, and seem poised to appreciate further.\nUS President Donald Trump's stance to gain control of Greenland and a standoff with European allies raised doubts about the long-standing NATO alliances. This, along with the loss of trust in global leadership, revives the so-called 'Sell America' trade and weighs heavily on the US Dollar (USD). The USD Index (DXY), which tracks the Greenback against a basket of currencies, fell to a four-month low on Monday and offers some support to the GBP/USD pair.\nApart from this, bets that the US Federal Reserve (Fed) would lower borrowing costs two more times this year turned out to be another factor undermining the buck. The British Pound (GBP), on the other hand, draws support from stronger-than-expected UK economic data, which has tempered near-term rate cut expectations at the Bank of England (BoE). This might continue to act as a tailwind for the GBP/USD pair and validate the near-term positive outlook.\nThe USD, however, stages a modest intraday recovery as bears turn cautious and opt to lighten their bets ahead of the crucial FOMC policy decision, scheduled to be announced on Wednesday. Investors will look for cues about the Fed's rate-cut path, which will influence the near-term USD price dynamics and provide a fresh impetus to the GBP/USD pair. In the meantime, Monday's release of US Durable Goods Orders could produce short-term opportunities.\nUS Dollar Price Last 7 Days\nThe table below shows the percentage change of US Dollar (USD) against listed major currencies last 7 days. US Dollar was the strongest against the Canadian Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the US Dollar from the left column and move along the horizontal line to the Japanese Yen, the percentage change displayed in the box will represent USD (base)/JPY (quote).\nAuthor\nHaresh Menghani\nFXStreet\nHaresh Menghani is a detail-oriented professional with 10+ years of extensive experience in analysing the global financial markets."
            },
            {
                "title": "GBP/USD Price Forecast - Pound Near 1.35 as UK PMIs Jump and BoE Cut Bets Shrink While Fed Eyes June - TradingNEWS",
                "source": "TradingNEWS",
                "url": "https://www.tradingnews.com/news/gbp-usd-price-forecast-pound-tests-1-35-ceiling",
                "body": "GBP/USD Price Forecast - Pound Tests 1.35 Ceiling as UK Data Beat and Fed Cut Odds Undermine the Dollar\nSterling pushes toward the 1.3530–1.3570 resistance band after UK PMIs surge to 51.6 and 54.3, retail sales climb 0.4% and markets price just one BoE cut against two for the Fed, tilting GBP/USD risk toward 1.37 | That's TradingNEWS\nGBP/USD: Sterling Pressures 1.35 While Dollar Loses Policy Premium\nGBP/USD Trading Zone and Market Structure\nGBP/USD is trading in the upper band of its recent range, sitting around 1.3500–1.3530 after pushing to a two-week high near 1.3530. The market is clearly respecting the 1.3530–1.3570 band as a hard cap – that zone already rejected price in early January and now acts as the key decision point. Above spot, a clean daily close through 1.3570 opens room toward 1.3700–1.3800, where heavier supply and profit-taking would be expected. On the downside, first support is clustered around 1.3450, then 1.3350, with a deeper structural support line sitting closer to 1.3250. As long as GBP/USD holds above the mid-1.33s, the pair trades like a bullish trend in consolidation, not a top in distribution.\nUK Growth Pulse: PMIs Put the UK Back in Expansion\nThe latest UK survey data justify a stronger GBP. Manufacturing PMI rose to 51.6 in January from 50.6, a 17-month high, while services PMI jumped to 54.3 from 51.4, beating expectations of 51.7 and pushing the composite output index to a 21-month high. That is not marginal noise; it is synchronised strength across both manufacturing and services. Companies report better demand from domestic and export markets and the highest business optimism since before the Autumn 2024 budget. At the same time, employment continues to decline, which means firms are squeezing more output from leaner headcount – supportive for short-term margins and a clear signal that the economy is not in recession mode.\nInflation Pressures and the BoE’s Limited Cut Room\nInside those PMIs, the price details matter for GBP/USD. Output prices are rising at the fastest pace since August 2025, with firms explicitly pointing to high staffing costs as a major driver. That keeps services inflation sticky and makes it difficult for the Bank of England to lean into an aggressive rate-cut path. Markets have adjusted accordingly: where traders previously flirted with multiple cuts, current pricing has collapsed to roughly one BoE cut in 2026. With inflation still sitting above target and demand indicators firming, the BoE is trapped in a “higher for longer” stance. That leaves UK real rates relatively attractive versus the US once you factor in the Fed’s expected easing, and this differential is one of the main engines pushing GBP/USD up into the 1.35–1.36 zone rather than back toward 1.30.\nHousehold Demand: Retail Sales Confirm Underlying Support for GBP\nHard data back the survey strength. December UK retail sales increased 0.4% month-on-month after a 0.1% fall in November, beating market expectations of flat growth. Against a backdrop of elevated living costs and previous mortgage-rate stress, that positive print is a clear statement: the UK consumer is not collapsing. Combining 0.4% retail growth with PMIs at 51.6 and 54.3 shifts the narrative from “stagnant UK” toward “modest expansion with inflation risk”. That macro mix – growth stabilising, demand resilient, and price pressures re-emerging – is exactly what removes room for deep BoE cuts and underpins a stronger GBP/USD profile above 1.34.\nPolitics as a Valuation Brake on GBP/USD\nThe pound is not trading like an unrestrained high-beta currency because politics still caps enthusiasm. Local elections and leadership noise – including potential moves by high-profile regional figures into Westminster – are already flagged by institutions as possible volatility triggers. Investors who remember past episodes of UK political instability understand how fast gilts and GBP/USD can reprice even when the macro data look solid. That risk premium sits insi"
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0065",
            "open": "0.6836",
            "close": "0.6891",
            "high": "0.6898",
            "low": "0.6834"
        },
        "market_summary": "### AUD/USD Market Briefing\n\n* **Key Drivers:** The **AUD/USD** exchange rate has surged due to the potential divergence between the **Reserve Bank of Australia (RBA)** and the **Federal Reserve**, with the RBA expected to hike interest rates by **0.25%** in the next meeting.\n* **Price Action:** The pair reached a high of **0.6932**, its highest level in **15 months**, and has been in a strong **bullish** momentum, moving above all moving averages and forming an inverted head-and-shoulders pattern.\n* **Technical Outlook:** Immediate resistance is near the key level of **0.7000**, with support at **0.6680**. The **Relative Strength Index (RSI)** and the **MACD** indicators have all pointed upwards, suggesting more upside.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "AUD/USD forecast: here’s why the Australian dollar is soaring - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/invezz:803990162094b:0-aud-usd-forecast-here-s-why-the-australian-dollar-is-soaring/",
                "body": "AUD/USD forecast: here’s why the Australian dollar is soaring\nThe Australian dollar surged to the highest level in years, making it one of the best-performing currencies this year. The AUDUSD exchange rate rose for five consecutive days, reaching a high of 0.6895, much higher than the year-to-date low of 0.6662.\nAustralian dollar has surged amid potential RBA and Fed divergence\nThe main reason why the AUDUSD exchange rate has surged in the past few months is the rising optimism that the Federal Reserve will diverge with the Reserve Bank of Australia (RBA).\nMost analysts now believe that the RBA will decide to hike interest rates by 0.25% in the next meeting because of the ongoing performance of the economy.\nA report released last week showed that the Australian labor market continued growing in December. The economy added over 60,000 jobs, most of which were full-time.\nIt also showed that the unemployment rate improved, while the participation rate rose. Everything in this report was much better than what analysts were expecting.\nThe next key catalyst that will determine whether the bank will hike rates will be the upcoming Australian inflation report that comes out on Wednesday this week. Economists exect the report to show that the headline consumer inflation rose 0.9 per cent in December, leading to a 3.6% annual increase.\nThe closely-watched trimmed and weighted mean CPI number is expected to remain above 3%. Therefore, if these numbers are accurate, it means that the RBA will hike rates from the current 3.6% to 3.85% in the next meeting.\nThe rising odds of RBA rate hike explains why bond yields have surged in the past few months. Data shows that the ten-year yield rose to 4.85%, its highest point since December last year.\nOn the other hand, analysts believe that the Federal Reserve will deliver more rate cuts this year despite the strength of the American economy. The unemployment rate and the headline and core inflation rates are still contained, while the economic growth is strong.\nTherefore, the Fed and RBA divergence will create a carry trade opportunity where investors borrow the cheaper US dollar to invest in the higher-yielding Aussie.\nAUDUSD technical analysis\nAUDUSD pair chart | Source: TradingView\nThe weekly chart shows that the AUDUSD exchange rate has been in a strong bull run in the past few months. It jumped to a high of 0.6896, its highest level since September 2024.\nThe pair has moved above all moving averages and formed an inverted head-and-shoulders pattern. These patterns often lead to more upside. Also, the Relative Strength Index (RSI) and the MACD indicators have all pointed upwards.\nTherefore, the most likely scenario is where the pair continues rising, with the next key level to watch being at 0.7000. A drop below the support at 0.6680 will invalidate the bullish outlook."
            },
            {
                "title": "Australian Dollar slips on increased risk aversion - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/amp/news/australian-dollar-slips-on-increased-risk-aversion-202601260251",
                "body": "Australian Dollar edges lower after hitting 15-month highs in holiday-thinned trade\n|- Australian Dollar retreats after reaching a 15-month high of 0.6932 on Monday.\n- Australia’s strong PMI and employment data reinforced expectations of tighter RBA monetary policy.\n- The US Dollar weakened amid rumors of FX market intervention to support the Japanese Yen.\nThe Australian Dollar declines against the US Dollar (USD) after opening from a gap up on Monday. The AUD/USD pair depreciates as the Greenback gains on increased safe-haven demand, which could be attributed to the recent comments from US President Donald Trump over the weekend.\nHowever, the AUD/USD pair appreciated as the US Dollar came under pressure amid rumors of a possible intervention in FX markets to support the Japanese Yen (JPY). According to Bloomberg, traders said the Federal Reserve Bank of New York had carried out a so-called rate check with major banks, requesting indicative exchange rates, a step widely viewed as a signal that authorities may be preparing to facilitate another intervention.\nAustralia’s strong PMI data reinforced the likelihood of a tighter monetary policy from the Reserve Bank of Australia (RBA), supported by employment data. RBA policymakers acknowledged that inflation has eased significantly from its 2022 peak, though recent data suggests renewed upward momentum. Headline CPI slowed to 3.4% YoY in November but remains above the RBA’s 2–3% target band.\nUS Dollar edges higher on safe-haven demand\n- The US Dollar Index (DXY), which measures the value of the US Dollar against six major currencies, is recovering ground and trading near 97.10 at the time of writing.\n- Trump warned he would impose 100% tariffs on Canadian goods if Ottawa were to strike a trade deal with China, the BBC reported over the weekend. In response, Canada’s Prime Minister Mark Carney said on Sunday that Canada has no plans to pursue a free trade agreement with China, clarifying that his recent understanding with Beijing only reduced tariffs in a few sectors that had been hit recently.\n- The US Gross Domestic Product grew at an annualized rate of 4.4% in the third quarter of 2025, slightly more than expected and the previous reading of 4.3%. Additionally, the Initial Jobless Claims came in at 200K last week, below the market consensus of 212K.\n- US Personal Consumption Expenditures (PCE) Price Index rose to 2.8% year-over-year in November from 2.7% in October. On a monthly basis, the PCE Price Index rose by 0.2%. The annual core PCE Price Index, the Federal Reserve's (Fed) preferred gauge of inflation, rose by 2.8% in November, following the 2.7% increase recorded in October and matching the market expectation.\n- US President Donald Trump said he would step back from imposing tariffs on goods from European nations opposing his effort to take possession of Greenland. He said earlier there is “no going back” on his ambitions regarding Greenland, alongside earlier threats to impose new 10% tariffs on eight European Union (EU) countries.\n- President Trump also said that the United States and the North Atlantic Treaty Organization (NATO) had “formed the framework of a future deal regarding Greenland.” However, he did not outline the parameters of the so-called framework, and it remained unclear what the agreement would entail.\n- Fed officials have signaled little urgency to ease policy further until there is clearer evidence that inflation is sustainably moving toward the 2% target. Morgan Stanley analysts revised their 2026 outlook, now forecasting one rate cut in June followed by another in September, compared with their previous expectation of cuts in January and April.\n- Australia's S&P Global Manufacturing Purchasing Managers Index (PMI), which came in at 52.4 in January versus 51.6 prior. Services PMI climbed to 56.0 in January from the previous reading of 51.1, while the Composite PMI climbed to 55.5 in January versus 51.0 prior.\n- Employment Change, which arrived at 65.2"
            },
            {
                "title": "AUD/USD forecast: here’s why the Australian dollar is soaring - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/ru/news/feed/04d0a-aud-usd-forecast-heres-why-the-australian-dollar-is-soaring",
                "body": "AUD/USD forecast: here’s why the Australian dollar is soaring\nПоделиться:\nThe Australian dollar surged to the highest level in years, making it one of the best-performing currencies this year. The AUD/USD exchange rate rose for five consecutive days, reaching a high of 0.6895, much higher than the year-to-date low of 0.6662.\nAustralian dollar has surged amid potential RBA and Fed divergence\nThe main reason why the AUD/USD exchange rate has surged in the past few months is the rising optimism that the Federal Reserve will diverge with the Reserve Bank of Australia (RBA).\nMost analysts now believe that the RBA will decide to hike interest rates by 0.25% in the next meeting because of the ongoing performance of the economy.\nA report released last week showed that the Australian labor market continued growing in December. The economy added over 60,000 jobs, most of which were full-time.\nIt also showed that the unemployment rate improved, while the participation rate rose. Everything in this report was much better than what analysts were expecting.\nThe next key catalyst that will determine whether the bank will hike rates will be the upcoming Australian inflation report that comes out on Wednesday this week. Economists exect the report to show that the headline consumer inflation rose 0.9 per cent in December, leading to a 3.6% annual increase.\nThe closely-watched trimmed and weighted mean CPI number is expected to remain above 3%. Therefore, if these numbers are accurate, it means that the RBA will hike rates from the current 3.6% to 3.85% in the next meeting.\nThe rising odds of RBA rate hike explains why bond yields have surged in the past few months. Data shows that the ten-year yield rose to 4.85%, its highest point since December last year.\nOn the other hand, analysts believe that the Federal Reserve will deliver more rate cuts this year despite the strength of the American economy. The unemployment rate and the headline and core inflation rates are still contained, while the economic growth is strong.\nTherefore, the Fed and RBA divergence will create a carry trade opportunity where investors borrow the cheaper US dollar to invest in the higher-yielding Aussie.\nAUD/USD technical analysis\nAUD/USD pair chart | Source: TradingView\nThe weekly chart shows that the AUD/USD exchange rate has been in a strong bull run in the past few months. It jumped to a high of 0.6896, its highest level since September 2024.\nThe pair has moved above all moving averages and formed an inverted head-and-shoulders pattern. These patterns often lead to more upside. Also, the Relative Strength Index (RSI) and the MACD indicators have all pointed upwards.\nTherefore, the most likely scenario is where the pair continues rising, with the next key level to watch being at 0.7000. A drop below the support at 0.6680 will invalidate the bullish outlook.\nThe post AUD/USD forecast: here’s why the Australian dollar is soaring appeared first on Invezz\nAUD/USD forecast: here’s why the Australian dollar is soaring\nПоделиться:\nThe Australian dollar surged to the highest level in years, making it one of the best-performing currencies this year. The AUD/USD exchange rate rose for five consecutive days, reaching a high of 0.6895, much higher than the year-to-date low of 0.6662.\nAustralian dollar has surged amid potential RBA and Fed divergence\nThe main reason why the AUD/USD exchange rate has surged in the past few months is the rising optimism that the Federal Reserve will diverge with the Reserve Bank of Australia (RBA).\nMost analysts now believe that the RBA will decide to hike interest rates by 0.25% in the next meeting because of the ongoing performance of the economy.\nA report released last week showed that the Australian labor market continued growing in December. The economy added over 60,000 jobs, most of which were full-time.\nIt also showed that the unemployment rate improved, while the participation rate rose. Everything in this report was much better than what "
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "3.6060",
            "open": "158.3590",
            "close": "155.7010",
            "high": "159.2210",
            "low": "155.6150"
        },
        "market_summary": "### USD/JPY Market Briefing\n\n* **Key Drivers:** Rising intervention fears, a **hawkish** Bank of Japan, and a weaker US Dollar are driving the **bearish** momentum in USD/JPY.\n* **Price Action:** The pair has broken below the key psychological level of **154.00**, showing significant **bearish** momentum, with a drop of nearly **500 pips** from its recent high.\n* **Technical Outlook:** Immediate support is near the **100-day Simple Moving Average (SMA)** at **154.00**, with resistance at **155.00**. A sustained break below **154.00** could trigger further **bearish** movement.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "USD/JPY Outlook: Sellers Dominate on Intervention Risk, Hawkish BoJ - Forex Crunch",
                "source": "Forex Crunch",
                "url": "https://www.forexcrunch.com/blog/2026/01/26/usd-jpy-outlook-sellers-dominate-on-intervention-risk-hawkish-boj/",
                "body": "- The USD/JPY outlook remains strongly bearish as intervention risks, a hawkish BoJ, and a weaker dollar ignite a reversal.\n- The report of the NY Fed verifying USD/JPY levels with the dealers was considered a hint of intervention.\n- Markets await the FOMC rate decision and Japan’s key data releases for more trading opportunities.\nThe USD/JPY price remains affected by intervention risk, Fed uncertainty, Japan’s domestic politics, and fiscal policy. This blend has caused fast, two-way swings. It also makes rallies harder to sustain.\n–Are you interested in learning more about ETF brokers? Check our detailed guide-\nThe yen soared when investors interpreted government activity as a hint of intervention. News that the New York Fed verified USDJPY levels with dealers was important. Traders usually view that as a warning sign, not a call.\nThe speculation about positioning was forced to end quickly. With the yen 3% stronger than Friday’s lows, the short-covering squeeze appeared typical. The USD/JPY pair fell to the mid-153s in the process.\nJapanese officials reinforced the message instead of soothing it. The Prime Minister promised “necessary steps” to limit speculative moves. The top currency diplomat emphasized coordination with the US and called it “appropriate”. The Finance Minister avoided commenting on the “rate check” discussion.\nJapan’s domestic situation is also complicated. The Bank of Japan voted 8–1 to maintain its 0.75% policy and said it could tighten further. Political timing and budget uncertainties affect bond supply and risk premia concerns.\nOn the US side, the dollar was already weak. Before the Fed meeting, traders remain cautious as no rate change is predicted. Due to policy noise and uncertainties regarding future Fed leadership, long USD conviction is tougher to regain.\nMoving ahead, market participants will watch Japan’s data, like the Tokyo CPI, jobs, industrial production, retail sales, and any news that confirms intervention. Credibility is still the most important factor. If traders perceive the government defending a line near JPY 160, traders will be less likely to chase USDJPY higher.\nUSD/JPY Technical Outlook: Strong Bears Break Demand Zone\nThe USD/JPY 4-hour chart shows the market opening with a bearish gap and the trend breaking the key demand zone at the 154.50 area. The straight fall of around 600 pips has turned the pair oversold on the RSI, which could lead to potential consolidation around the current levels.\n–Are you interested in learning more about South African forex brokers? Check our detailed guide-\nThe pair could correct to the 154.50 area ahead of the 155.00 level. On the flip side, a continued bearish trend could push the prices lower to 153.00 ahead of 150.90. The key MAs suggest a higher probability of another down leg.\nLooking to trade forex now? Invest at eToro!\n68% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money."
            },
            {
                "title": "Monday morning in Tokyo: Indications are for USD/JPY much lower - investingLive",
                "source": "investingLive",
                "url": "https://investinglive.com/forex/monday-morning-in-tokyo-indications-are-for-usdjpy-much-lower-20260125/",
                "body": "The market is warming up for the week and we already have some big moves indicated. Australia is on holiday today but the big notable change is that USD/JPY contionues to sink. The pair rose as high as 159.23 on Friday in the aftermath of the BOJ but it's now down nearly 500 pips from that level, including 123 today.\nNet change:\nEuro: 1.1864 change since Friday's close +0.0038\nJapanese Yen: 154.48 change since Friday's close −1.23\nBritish Pound: 1.3650 change since Friday's close +0.0009\nSwiss Franc: 0.7753 change since Friday's close−0.0048\nCanadian Dollar: 1.3700 change since Friday's close 0.0000\nAustralian Dollar: 0.6913 change since Friday's close +0.0020\nNew Zealand Dollar: 0.5958 change since Friday's close +0.0009\nNote that liquidity is still extremely thin so be careful with these numbers.\nOn Friday, the Bank of Japan decision wasn't any big surprise but several reports/rumors suggest that the Federal Reserve did a rate check on USD/JPY on behalf of the BOJ/Japanese Ministry of Finance. That's a big warning about potential intervention.\nIn addition, on the weekend Japan PM Sanae Takaichi warned officials stand ready to act against “speculative and highly abnormal” market moves as the yen weakens and bond yields rise.\nOfficials appear to be escalating from verbal warnings to operational signalling, increasing intervention risk into thin-liquidity sessions and the market is taking heed. USD/JPY longs and yen shorts in general have been a popular and increasingly crowded trade over the past eight months and it looks like a race to the exits that's continuing in early trade.\nThe comments from Takaichi were made during the leaders' debates and an election is coming in February. There's no doubt she doesn't want markets (including the bond market) to get disorderly during the campaign so that heights the risk of intervention. At the same time, she's campaigned on more fiscal spending and you can't fool the bond market forever."
            },
            {
                "title": "Japanese Yen strengthens on intervention fears, hawkish BoJ stance - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/japanese-yen-rallies-to-over-two-month-high-vs-weaker-usd-on-intervention-fears-202601260258",
                "body": "Japanese Yen bulls retain control on intervention fears, hawkish BoJ and USD weakness\n- Japanese Yen kicks off the new week on a stronger note amid rising intervention fears.\n- Takaichi warned against speculative moves following a rate check from Japan’s MOF.\n- The divergent BoJ-Fed outlooks and sustained USD selling further weigh on USD/JPY.\nThe Japanese Yen (JPY) builds on its weekly bullish gap opening against a broadly weaker US Dollar (USD) and advances to a fresh high since November 14 during the Asian session on Monday. Japan's Prime Minister Sanae Takaichi warned against speculative moves on Sunday following rate checks from Japan’s Ministry of Finance and the New York Federal Reserve (Fed) on Friday. This heightens the chance of joint US-Japan intervention to stem any further JPY weakness and provides a strong boost on Monday.\nApart from this, the Bank of Japan's (BoJ) hawkish outlook and persistent geopolitical uncertainties turn out to be other factors underpinning the safe-haven JPY. The USD, on the other hand, dives to its lowest level since September 2025 on the back of the so-called 'Sell America' trade and bets that the US central bank would lower borrowing costs two more times this year. The divergent BoJ-Fed expectations contribute to the USD/JPY pair's intraday slump to sub-154.00 levels and back the case for a further depreciating move.\nJapanese Yen sticks to bullish bias amid intervention fears, hawkish BoJ and sustained safe-haven buying\n- Japanese Prime Minister Sanae Takaichi warned on Sunday that officials stand ready to take necessary steps against speculative and highly abnormal market moves. This comes on top of market chatter that the New York Federal Reserve conducted rate checks on the USD/JPY pair around midday on Friday, following a similar call from Japan’s Ministry of Finance. This suggests that authorities may be preparing to intervene in the currency market.\n- The Bank of Japan, as expected, maintained short-term interest rates at 0.75% by an 8-1 vote at the end of a two-day meeting on Friday. Moreover, the central bank raised its economic and inflation forecasts, and signaled its readiness to continue hiking still-low borrowing costs. This further contributes to the Japanese Yen's outperformance against its American counterpart and drags the USD/JPY pair to its lowest level since November 14.\n- US President Donald Trump's tariff threats to gain control of Greenland, along with a standoff with European allies, raised doubts about the long-standing NATO alliances and led to the loss of trust in global leadership. This, in turn, revives the so-called 'Sell America' trade and weighs heavily on the US Dollar amid expectations for more policy easing by the US central bank, which marks a significant divergence in comparison to the BoJ's hawkish tilt.\n- Traders now look forward to the release of the US Durable Goods Orders data for short-term opportunities later during the North American session on Monday. The focus, however, will remain glued to the highly anticipated FOMC policy meeting, starting on Tuesday. Investors will look for more cues about the Fed's rate-cut path, which will play a key role in influencing the USD price dynamics and determining the near-term trajectory for the USD/JPY pair.\nUSD/JPY bears have the upper hand as breakdown below 154.00 pivotal support comes into play\nFrom a technical perspective, a sustained break and acceptance below the 154.00 horizontal support, also nearing the 100-day Simple Moving Average (SMA), will be seen as a fresh trigger for the USD/JPY bears. Momentum has deteriorated as the Moving Average Convergence Divergence (MACD) slips below the zero line and extends lower, hinting at building bearish pressure.\nThe Relative Strength Index (RSI) sits at 32, near oversold, suggesting downside momentum is stretched, and a bounce could develop if buyers defend the 100-day SMA. A daily close below that support would risk a deeper pullback, while stabilization a"
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0106",
            "open": "1.3784",
            "close": "1.3695",
            "high": "1.3799",
            "low": "1.3693"
        },
        "market_summary": "### USD/CAD Market Briefing\n\n* **Key Drivers:** The **Canadian Dollar** strengthens due to better-than-expected **Canadian Retail Sales** and threats of **100% tariffs** by the US on Canadian goods, while the **US Dollar** posts broad-based declines.\n* **Price Action:** The **USD/CAD** pair declines below **1.3700**, touching its weakest level since December 30, with the pair currently trading around **1.3685**.\n* **Technical Outlook:** The pair has dropped below the **50-day** and **100-day Exponential Moving Averages (EMA)**, indicating **bearish** momentum, with immediate support near **1.3650** and resistance at **1.3720**.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "Canadian Dollar strengthens to near 1.3700 as Canadian Retail Sales beat forecasts - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-cad-declines-below-13700-as-canadian-retail-sales-beat-forecasts-trump-threatens-tariffs-202601260138",
                "body": "USD/CAD declines below 1.3700 as Canadian Retail Sales beat forecasts, Trump threatens tariffs\n- USD/CAD edges lower to near 1.3685 in Monday’s early Asian session.\n- Canadian Retail sales rose 1.3% MoM in November, better than expected.\n- Trump threatened Canada with 100% tariffs on a possible trade deal with China.\nThe USD/CAD pair loses ground to around 1.3685 during the early Asian session on Monday. The pair touches its weakest since December 30, 2025, as the US Dollar (USD) posts broad-based declines, and data showed that Canadian Retail Sales rose in November. Traders will keep an eye on the US November Durable Goods Orders report, which will be released later on Monday.\nData released by Statistics Canada showed on Friday that Retail Sales rose by 1.3% MoM in November, compared to a decline of 0.3% in October (revised from -0.2%). Meanwhile, the Retail Sales ex Auto data climbed 1.7% in November versus -0.6% prior. Both figures came in above the market consensus of 1.2%.\nThe BBC reported on Saturday that US President Donald Trump threatened to slap 100% tariffs on Canadian goods if the country strikes a trade deal with China. Canada’s Prime Minister Mark Carney said on Sunday that his country had no intention of pursuing a free trade deal with China, adding that his recent agreement with China merely cut tariffs on a few sectors that were recently hit with them.\n\"You have ongoing risk of tensions between Carney and Trump, the USMCA negotiations coming up this summer,” said Aaron Hurd, senior portfolio manager in the currency group at State Street Global. \"With that risk on the horizon, unless Canadian economic data really takes off, I think the Canadian dollar is stuck here. It will move with the broad dollar,” Hurd added.\nCanadian Dollar FAQs\nThe key factors driving the Canadian Dollar (CAD) are the level of interest rates set by the Bank of Canada (BoC), the price of Oil, Canada’s largest export, the health of its economy, inflation and the Trade Balance, which is the difference between the value of Canada’s exports versus its imports. Other factors include market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – with risk-on being CAD-positive. As its largest trading partner, the health of the US economy is also a key factor influencing the Canadian Dollar.\nThe Bank of Canada (BoC) has a significant influence on the Canadian Dollar by setting the level of interest rates that banks can lend to one another. This influences the level of interest rates for everyone. The main goal of the BoC is to maintain inflation at 1-3% by adjusting interest rates up or down. Relatively higher interest rates tend to be positive for the CAD. The Bank of Canada can also use quantitative easing and tightening to influence credit conditions, with the former CAD-negative and the latter CAD-positive.\nThe price of Oil is a key factor impacting the value of the Canadian Dollar. Petroleum is Canada’s biggest export, so Oil price tends to have an immediate impact on the CAD value. Generally, if Oil price rises CAD also goes up, as aggregate demand for the currency increases. The opposite is the case if the price of Oil falls. Higher Oil prices also tend to result in a greater likelihood of a positive Trade Balance, which is also supportive of the CAD.\nWhile inflation had always traditionally been thought of as a negative factor for a currency since it lowers the value of money, the opposite has actually been the case in modern times with the relaxation of cross-border capital controls. Higher inflation tends to lead central banks to put up interest rates which attracts more capital inflows from global investors seeking a lucrative place to keep their money. This increases demand for the local currency, which in Canada’s case is the Canadian Dollar.\nMacroeconomic data releases gauge the health of the economy and can have an impact on the Canadian Dollar. Indicators such as GDP, Manufactur"
            },
            {
                "title": "USD/CAD forecast ahead of BoC and Fed interest rate decisions - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/news/feed/ce70c-usd-cad-forecast-ahead-of-boc-and-fed-interest-rate-decisions",
                "body": "USD/CAD forecast ahead of BoC and Fed interest rate decisions\nShare:\nThe USD/CAD exchange rate fell to its lowest since January 5, influenced by Donald Trump's threat of a 100% tariff on Canadian exports and upcoming interest rate decisions from the Bank of Canada and the Federal Reserve. Key economic indicators showed mixed signals from Canada, while the US reported a 4.4% GDP growth in Q3, which may impact currency trends.\nThe USD/CAD exchange rate crashed to the lowest level since January 5 as the US dollar index retreated after the Greenland crisis eased. It plunged for five consecutive days in its longest losing streak since May 2025.\nDonald Trump threatens Canada tariff\nOne key catalyst for the USD/CAD exchange rate will be a threat by Donald Trump to punish Canada with a 100% tariff on all its exports to the US, including on goods covered by the USMCA deal he negotiated.\nTrump is angry that Canada reached a trade deal with China that lowers tariffs on Chinese electric vehicles to 6%. In exchange, China removed canola tariffs it had put in place a few years ago.\nMost importantly, he is disappointed with a speech Mark Carney delivered at the World Economic Forum (WEF) in Switzerland last week. Carney criticized the ongoing power games by the largest economies in the world and asked middle countries to team and respond to these measures.\nThe statement was mostly targeted towards Trump, who had threatened to take Greenland, a semi-autonomous island with ties to Denmark.\nA 100% tariff on goods from Canada would be a big deal because of the vast amount of goods that flow to the United States from Canada. Also, Canada is the biggest US trade partner, buying goods worth billions of dollars a year.\nStill, Trump is known for TACO, a phrase that means Trump Always Chickens Out, as he did on the Greenland issue last week. After threatening to take over the island, he reached a deal that brought no major changes to the existing agreement.\nBank of Canada interest rate decision\nThe next major catalyst for the USD/CAD exchange rate is the upcoming Bank of Canada interest rate decision that will come out on Thursday.\nEconomists believe that the bank will decide to leave interest rates unchanged at 2.25% to give policymakers a chance to digest more macro data.\nRecent numbers have sent mixed messages about the Canadian economy. For example, the country’s labor market slowed substantially in December after growing in the previous three consecutive months. At the same time, a report released last week showed that Canada’s inflation rose more than expected in December.\nMost analysts believe that the bank will then leave interest rates unchanged at the current level for the rest of the year. In a statement to Reuters, an analyst said:\n“At this point, the BoC is ready to take a fairly long wait-and-see stance. If there’s a risk of a move, it’s more likely to be a cut than a hike this year.”\nFederal Reserve interest rate decision\nThe other major catalyst for the pair will be the upcoming Federal Reserve interest rate decision, which will come out on Wednesday.\nLike the BoC, analysts believe that the Federal Reserve will leave interest rates unchanged between 3.50% and 3.75% in this meeting.\nThe US has released encouraging macro data recently. A report released last week showed that the US GDP expanded by 4.4% in the third quarter, better than the median estimate of 4.3%.\nAnother report showed that the labor market has started to improve in the past few months, while inflation has been a bit constrained.\nUSD/CAD Technical Analysis\nUSD/CAD chart | Source: TradingView\nThe daily timeframe chart shows that the USD/CAD exchange rate has been in a strong downward trend in the past few days, moving from a high 1.3925 on January 16 to the current 1.3700.\nThe pair has dropped below the 50-day and 100-day Exponential Moving Averages (EMA), a sign that bears are in control.\nAlso, the Relative Strength Index (RSI) and the Percentage Price Oscillator (PPO) h"
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "2.7650",
            "open": "213.5500",
            "close": "212.2470",
            "high": "214.8450",
            "low": "212.0800"
        },
        "market_summary": "### GBP/JPY Market Briefing\n\n* **Key Drivers:** Japan's warning of potential intervention to support the **Yen** against speculative moves, coupled with the Bank of Japan (**BoJ**) keeping interest rates unchanged at **0.75%**, has increased **bearish** pressure on GBP/JPY.\n* **Price Action:** The pair has plummeted to near **210.40**, showing significant **bearish** momentum, with the **Japanese Yen** outperforming its peers.\n* **Technical Outlook:** Immediate support is near the recent low of **210.40**, with resistance at the previous day's high of **212.00**.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "GBP/JPY plunges to near 210.40 as Japan’s Takaichi warns intervention - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-plunges-to-near-21040-as-japans-takaichi-warns-intervention-202601260535",
                "body": "GBP/JPY plunges to near 210.40 as Japan’s Takaichi warns intervention\n- GBP/JPY plummets to near 210.40 as Japan warns of intervention to support Yen against speculative moves.\n- The BoJ left interest rates unchanged at 0.75% on Friday, as expected.\n- Upbeat UK data strengthened the Pound Sterling last week.\nThe GBP/JPY pair slides almost 1% to near 210.40 at the start of the week. The pair faces intense selling pressure as the Japanese Yen (JPY) outperforms its peers, following comments from Japan’s Prime Minister (PM) Sanae Takaichi that the administration could intervene to address one-way excessive moves against the Yen.\nJapanese Yen Price Today\nThe table below shows the percentage change of Japanese Yen (JPY) against listed major currencies today. Japanese Yen was the strongest against the US Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Japanese Yen from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent JPY (base)/USD (quote).\n\"The government will take necessary steps against speculative or very abnormal market moves,\" Takaichi said over the weekend, but didn’t provide cues on specific levels, Reuters reported.\nOn the domestic front, the Bank of Japan (BoJ) kept interest rates steady at 0.75% in the policy meeting on Friday, as expected, and kept the hopes of further rate hikes on the table.\nGoing forward, investors will focus on comments from Japan’s officials regarding the fiscal budget announcement. Last week, PM Takaichi dissolved the parliament’s lower house, while calling an early snap election in hopes of getting more seats.\nMeanwhile, the Pound Sterling (GBP) demonstrates a mixed performance at the start of a light United Kingdom (UK) economic calendar week. Last week, the British currency traded firmly after the release of the upbeat UK Retail Sales data for December, and the preliminary S&P Global Purchasing Managers’ Index (PMI) data for January.\nThe Office for National Statistics (ONS) reported that Retail Sales returned to growth after contracting in the last two months. The Retail Sales rose by 0.4% month-on-month (MoM), while it was expected to decline steadily by 0.1%.\nJapanese Yen FAQs\nThe Japanese Yen (JPY) is one of the world’s most traded currencies. Its value is broadly determined by the performance of the Japanese economy, but more specifically by the Bank of Japan’s policy, the differential between Japanese and US bond yields, or risk sentiment among traders, among other factors.\nOne of the Bank of Japan’s mandates is currency control, so its moves are key for the Yen. The BoJ has directly intervened in currency markets sometimes, generally to lower the value of the Yen, although it refrains from doing it often due to political concerns of its main trading partners. The BoJ ultra-loose monetary policy between 2013 and 2024 caused the Yen to depreciate against its main currency peers due to an increasing policy divergence between the Bank of Japan and other main central banks. More recently, the gradually unwinding of this ultra-loose policy has given some support to the Yen.\nOver the last decade, the BoJ’s stance of sticking to ultra-loose monetary policy has led to a widening policy divergence with other central banks, particularly with the US Federal Reserve. This supported a widening of the differential between the 10-year US and Japanese bonds, which favored the US Dollar against the Japanese Yen. The BoJ decision in 2024 to gradually abandon the ultra-loose policy, coupled with interest-rate cuts in other major central banks, is narrowing this differential.\nThe Japanese Yen is often seen as a safe-haven investment. This means that in times of market stress, investors are more likely to put their money in the Japanese currency due to its supposed rel"
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "3,338.0000",
            "open": "89,280.2400",
            "close": "86,419.3800",
            "high": "89,359.5000",
            "low": "86,021.5000"
        },
        "market_summary": "ERROR: An unexpected error occurred during AI summary generation: 'choices'",
        "source_articles": [
            {
                "title": "Leverage Fatigue? ProShares Ultra Bitcoin ETF Sees Sharp Outflows as Traders Hit the Brakes - TipRanks",
                "source": "TipRanks",
                "url": "https://www.tipranks.com/news/cryptocurrencies/leverage-fatigue-proshares-ultra-bitcoin-etf-sees-sharp-outflows-as-traders-hit-the-brakes",
                "body": "Leverage Fatigue? ProShares Ultra Bitcoin ETF Sees Sharp Outflows as Traders Hit the Brakes\nClaim 50% Off TipRanks Premium\n- Unlock hedge fund-level data and powerful investing tools for smarter, sharper decisions\n- Stay ahead of the market with the latest news and analysis and maximize your portfolio's potential\nThe ProShares Ultra Bitcoin ETF, BITU, logged a sizable outflow of $35.1 million on January 22, 2026, as investors pulled back from leveraged Bitcoin exposure. The redemption represents roughly 5.79% of the fund’s latest assets under management, which stand at $607.1 million, underscoring a notable bout of risk-off positioning in one of the market’s more aggressive Bitcoin-linked products.\nThe related asset, BTC-USD, is currently trading at $89,457.73, having shed about 19.33% over the past three months. The short-term picture looks equally fraught, with the 1-day technical outlook flashing a Strong Sell signal, reflecting mounting downside momentum and reinforcing caution among leveraged ETF traders.\nThe combination of a deep three-month drawdown in Bitcoin and a bearish near-term technical profile appears to be pushing speculative capital to the sidelines, particularly in amplified vehicles like BITU that can magnify both gains and losses. While the ETF’s overall AUM base remains substantial, the latest flows highlight how quickly investor sentiment can turn when volatility spikes and trend signals skew decisively negative.\nFor a more detailed analysis and real-time sentiment trends, check the live cryptocurrency prices here."
            },
            {
                "title": "The Fed Is Suddenly Hurtling Toward A $34 Trillion BlackRock Gold And Bitcoin Price Game-Changer - Forbes",
                "source": "Forbes",
                "url": "https://www.forbes.com/sites/digital-assets/2026/01/25/bitcoin-will-take-the-place-of-gold-fed-suddenly-braced-for-a-34-trillion-blackrock-price-surprise/",
                "body": "01/25 update below. This post was originally published on January 23\nBitcoin has limped into 2026, flailing in the wake of a gold price boom that’s catapulted it to an eye-watering $34 trillion market capitalization (triggering predictions of even more gains to come).\nSign up now for CryptoCodex—A free crypto newsletter that will get you ahead of the market\nThe bitcoin price, which plummeted under $100,000 per bitcoin in November, has struggled to regain its early 2025 momentum as Bank Of America’s chief executive issues a serious $6 trillion warning.\nNow, with bitcoin and crypto primed for an imminent, “massive” shock, bitcoin-backing BlackRock fixed income chief Rick Rieder has become a surprise favorite to be named as U.S. president Donald Trump’s pick as Federal Reserve chair.\nSign up now for the free CryptoCodex—A daily five-minute newsletter for traders, investors and the crypto-curious that will get you up to date and keep you ahead of the bitcoin price and crypto market swings\n\"I think [bitcoin] will take the place of gold to a large extent? Yeah, I do, because it’s so much more functional than passing a bar of gold around,” Rieder, whose odds of being named as the next Fed chair have rocketed to almost 40% this week on the Polymarket prediction platform, told CNBC in 2020, adding, “I think bitcoin is here to stay.”\n“Rick Rieder’s odds of being next Fed chair have increased dramatically,” Geoff Kendrick, head of digital assets research at Standard Chartered Bank, said in emailed comments. \"He will run the economy hot which should help crypto.\"\n01/25 update: Rick Rieder has continued to climb the odds on the Polymarket and Kalsi prediction platforms to succeed Federal Reserve chair Jerome Powell, becoming the surprise favorite and topping former Fed governor Kevin Warsh.\nRieder’s odds topped 60% on Polymarket and Kalshi this weekend before dropping back slightly, while the previous front runner Warsh saw his odds fall sharply to around 30%.\n“Until an announcement is made by President Trump, any reporting about the Federal Reserve chairman nominations process is pointless speculation,” White House spokesperson Kush Desai said in a statement to the Financial Times.\nSpeculation over who will take over from Powell at the Fed has fueled bitcoin, crypto and stock market moves over the last year, with traders betting U.S. president Donald Trump’s eventual appointee will lock in lower interest rates.\n“Bitcoin got off to another weak start … having failed repeatedly to break back and hold above $90,000,” David Morrison, senior market analyst at Trade Nation, said in emailed comments, warning the market is “struggling to sustain upside without fresh catalysts,” and pointing to lower exchange-traded fund (ETF) interest as holding back the market.\n“This has been a disappointing two days for crypto bulls who could have reasonably expected bitcoin … to have regained upward strength given the rebound in global equities since Wednesday afternoon.”\nMeanwhile, the gold price has continued to outperform on the back of the so-called debasement trade that sees investors opt for scarce assets due to expectations the Fed will cut rates this year and government spending will spiral out of control.\n\"Expectations for at least two Fed cuts in 2026 continue to undermine the dollar, while concerns over U.S. public finances, political pressure on the Fed, and lingering global risks keep gold well bid on dips,\" Morrison said.\n“Despite short-term overbought signals, gold is on track for a strong weekly gain, and price action suggests pullbacks are being treated as opportunities rather than trend breaks. This is a high-risk trading environment.”\nThe gold price has soared to $5,000 per ounce, leaving bitcoin and everything else in the dust so far in 2026.\n“Gaining nearly 7% since Monday, gold is recording its strongest nominal growth in history and one of its most powerful weeks in terms of momentum,” Alex Kuptsikevich, the FxPro chief market analyst, s"
            },
            {
                "title": "Where Will Bitcoin Be in 3 Years? - AOL.com",
                "source": "AOL.com",
                "url": "https://www.aol.com/articles/where-bitcoin-3-years-113500062.html",
                "body": "Where Will Bitcoin Be in 3 Years?\nKey Points\nThe next Bitcoin halving is scheduled to take place in April 2028.\nThe ongoing push to make America the \"crypto capital of the world\" could lead to new purchases for the Strategic Bitcoin Reserve.\nThe Bitcoin halving, combined with strong political tailwinds, could send Bitcoin soaring in 2028.\nIf you're a Bitcoin (CRYPTO: BTC) investor, it's not too early to start thinking about 2028.\nThe reasons for this are twofold. First, 2028 marks the date of the next Bitcoin halving. Second, 2028 marks the final year of the Trump administration, which has pledged on numerous occasions to make the U.S. the \"crypto capital of the world.\"\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\nBoth events could have seismic implications for the future price of Bitcoin.\nBitcoin halving\nOne event central to the lore of Bitcoin investing is the halving. This event, which reduces the supply of new Bitcoin by half, acts to increase its perceived scarcity.\nBitcoin halving events take place roughly every four years. Thus far, Bitcoin halvings have taken place in 2012, 2016, 2020, and 2024. The next Bitcoin halving is projected for April 2028.\nThe halving is important because it has historically led to monster rallies in Bitcoin's price. You can think of it as the official kick-off of a period of rapid price appreciation that can last from 12 to 18 months. Even better, the halving typically leads to a new all-time high for Bitcoin.\nFor example, consider the last Bitcoin halving. It took place on April 19, 2024, when Bitcoin was trading for about $64,000. By the end of the year, Bitcoin had broken through the $100,000 price level. In 2025, Bitcoin soared even higher, eventually hitting a new all-time high of $126,000 in October.\nImage source: Getty Images.\nSo, if all goes according to plan, Bitcoin could be heading for another halving-induced rally in 2028. Bitcoin nearly doubled in price after the most recent halving, so is another doubling in price on the way in 2028?\nThe only question, of course, is what happens between now and then. Historically, Bitcoin follows a four-year cycle of boom and bust. The 12- to 18-month period of price appreciation ignited by the halving usually ends in a final blow-off top and then a spectacular collapse in Bitcoin's price.\nGiven that the current period of price appreciation started nearly 21 months ago, that means Bitcoin could be headed for a downturn this year. So I'm certainly not expecting the path of Bitcoin to be straight up in 2026 and 2027.\nBitcoin and politics\nIs it too early to be talking about 2028 presidential politics? Perhaps so. But a number of influential crypto insiders have already highlighted the political pressure building within the Trump administration to make sure all the crypto successes of the past year are not immediately rolled back by the next administration.\nAdvertisement\nFor example, consider the Strategic Bitcoin Reserve. Launched to much fanfare last March, the Strategic Bitcoin Reserve has languished ever since. Right now, it consists only of Bitcoin that has been seized or confiscated by the U.S. government, and does not include any new Bitcoin purchases.\nBut that could change as early as this year. According to Cathie Wood of Ark Invest, the Trump administration may be tempted to initiate Bitcoin purchases for the reserve ahead of the 2026 midterm elections.\nThe thinking here is simple: Higher Bitcoin prices will likely help pro-Trump (and pro-crypto) political candidates in the midterm elections. A higher Bitcoin price will also help to bring in new crypto industry donations for projects like the new White House ballroom.\nWhat will be the price of Bitcoin in 2028?\nIn the period from 2017 to 2025, Bitcoin posted a compound annual growth rate (CAGR) of 44%. That time period coincided with two halving-fueled rallies (2020 a"
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "176.8000",
            "open": "2,953.5800",
            "close": "2,811.9500",
            "high": "2,959.4000",
            "low": "2,782.6000"
        },
        "market_summary": "ERROR: An unexpected error occurred during AI summary generation: 'choices'",
        "source_articles": [
            {
                "title": "From Tesla shares to bitcoin: The new secret to getting a credit line without a bank - CoinDesk",
                "source": "CoinDesk",
                "url": "https://www.coindesk.com/business/2026/01/25/how-the-ultra-wealthy-are-using-bitcoin-to-fund-their-yacht-upgrades-and-cannes-trips",
                "body": "How the ultra-wealthy are using bitcoin to fund their yacht upgrades and Cannes trips\nCometh founder Jerome de Tychey is applying DeFi lending and borrowing on platforms like Aave, Morpho, and Uniswap to structures that help the ultra-wealthy secure loans against their massive crypto fortunes.\nWhat to know:\n- Wealthy investors who hold much of their fortune in crypto are increasingly turning to decentralized finance platforms to secure flexible credit lines without selling their digital assets.\n- Firms like Cometh help family offices and other rich clients navigate complex DeFi tools, using assets such as bitcoin, ether and stablecoins to replicate traditional Lombard-style collateralized loans.\n- DeFi loans can be faster and more anonymous than traditional bank credit but carry volatility and liquidation risks, and Cometh is also experimenting with applying DeFi strategies to traditional securities via ISIN-based tokenization.\nLet's say an investor has a house in Switzerland and a beach house in Miami. They're worth, perhaps, $10 million. But what they are really looking for right now is a line of credit for some time on the slopes at St. Moritz, a trip to the Cannes film festival and a few upgrades to the yacht.\nIn traditional finance, they might be able to approach their bank and use those assets to secure a flexible, short-term loan. However, if a substantial part of the investor's assets is in crypto, it's likely much harder.\nAnd it seems there are a large number of ultra-rich people who made their fortunes in crypto. In 2025 alone, a survey by Henley & Partners found that the global population of crypto millionaires had reached 241,700, up 40% from the previous year.\nSo how do these crypto-rich investors use their fortune to supplement their lavish lifestyle? Their traditional bank likely won't even touch crypto, and if selling those crypto assets is out of the question, where do they turn?\nThis is when a sophisticated decentralized finance (DeFi) lending strategies comes into play, said Jerome de Tychey, the founder of Cometh, a DeFi-for-businesses facilitator that recently became one of the few firms in France to gain a Markets in Crypto Assets (MiCA) license.\nFor someone who is crypto native, they could simply take their ether\n“This is still a bit too complicated and too sophisticated for the layman, and so it’s typically the kind of thing we do to help family offices, for example, who have a good amount of crypto and want a credit line,” he said in an interview at the CfC St Moritz crypto conference.\nOn a day-to-day basis, wealthy clients often use collateral loans, also known as Lombard loans or Lombard credit, to secure loans against their assets. These are flexible, short-term loans secured by the pledge of assets such as stocks, bonds, or investment portfolios. They allow borrowers to access cash quickly without selling their investments, thereby avoiding capital gains tax and retaining benefits such as dividends.\nTypically, these clients have wealth in the tens or hundreds of millions of dollars, and their objective is to keep their assets stable while funding their lifestyle and expenses at the lowest rate possible.\nDe Tychey, who is also the founder of the Ethereum Community Conference (EthCC), said his firm adds a DeFi component to the equation that could involve bitcoin\nDeFi vs TradFi loans\nBorrowing using crypto assets also offers perks, such as a faster lending process. For example, a loan backed by bitcoin could be processed in as little as 30 seconds on some platforms, whereas a Lombard loan, using traditional assets as collateral, at a private bank might take up to 7 days.\nAlso, traditional loans require credit checks and tax returns, while DeFi loans are permissionless (where code is the law and it doesn't care who the borrower is in some platforms), so anonymity is an additional perk for those who seek it.\nIt also has some drawbacks. For example, crypto loans depend on counterparty risk and could be m"
            },
            {
                "title": "BBX: Capital Frenzy and Sector Divergence—Strategy Leads the \"10 Billion Week,\" Block and Rumble Define a New Paradigm - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605167677",
                "body": "According to BBX, last week the global crypto treasury weekly trading volume exceeded $3 billion, with the market evolving from single reserve holdings to deeper capital games and business closed loops: —Whale Aggressive Absorption: Strategy (NASDAQ: $MSTR) swept up $2.13 billion worth of BTC in a single week, with holdings surpassing 430,000 coins; Marathon Digital (NASDAQ: $MARA) initiated $850 million in financing, marking the official transformation of leading mining companies into financial holding models. —Paradigm Shift in Models: Block (NYSE: $SQ) upgraded its \"profit auto-investment\" closed loop, while Rumble (NASDAQ: $RUM) established its first position anchored on \"anti-censorship\" value, setting a new benchmark for non-financial enterprises. —Multi-chain Outbreak: Meitu (HKSE: $1357) resumed large-scale ETH allocations, DeFi Technologies (CBOE CA: $DEFI) and Mogo (NASDAQ: $MOGO) jointly accumulated SOL, and CleanSpark (NASDAQ: $CLSK) announced a complete halt to selling, shifting to 100% HODL. Institutional allocation has officially been upgraded to a strategic \"arms race\" crucial to corporate survival. Source: bbx.com\nDisclaimer: The content of this article solely reflects the author's opinion and does not represent the platform in any capacity. This article is not intended to serve as a reference for making investment decisions."
            },
            {
                "title": "ETHUSD Today: EU Moves Against Polymarket Stoke DeFi Risk – January 25 - Meyka",
                "source": "Meyka",
                "url": "https://meyka.com/blog/ethusd-today-eu-moves-against-polymarket-stoke-defi-risk-january-25-2501/",
                "body": "ETHUSD Today: EU Moves Against Polymarket Stoke DeFi Risk – January 25\nPolymarket sits at the center of Europe’s latest crypto focus as leaders dispute claims and regulators probe election wagers. For Germany-based investors, this raises real questions about prediction markets regulation, misinformation risk, and DeFi spillovers on Ethereum. ETH, tracked via ETHUSD, underpins many apps tied to such activity. If access limits spread across the EU, liquidity and on-chain volumes could soften. We review the signals, the market setup, and practical steps for portfolios in Germany as headlines intensify on January 25.\nEU signals tighten on crypto prediction markets\nJeff Bezos disputed a Polymarket-related claim, underscoring how fast false narratives can spread on markets that look like news feeds. Portugal reportedly targeted suspicious Portugal election bets, highlighting compliance and market integrity concerns. Together, these moves raise the odds of an EU crypto crackdown if more authorities coordinate actions. See coverage: Jeff Bezos widerspricht Polymarket-Behauptung – Wie gefährlich sind Fake News auf Wettplattformen?.\nAccess risks can emerge quickly if more EU members pressure intermediaries or platforms. For users in Germany, a wider block on Polymarket would reduce choice and may push volumes to less transparent venues. That raises consumer risk and could cut activity on Ethereum apps. We expect exchanges, wallets, and media to tighten checks as prediction markets regulation gains attention.\nETH market snapshot and technical view\nETH shows a mixed picture: -0.13% over 1D, -10.98% over 5D, -0.59% over 1M, and -23.66% over 3M. RSI sits at 49.07, near neutral, while ADX at 24.43 points to a developing trend. Volume remains below average. Headline risk from Polymarket can skew short-term sentiment, so we prefer watching intraday breadth and funding before sizing positions.\nBollinger levels sit near 2771 (lower), 3009 (middle), and 3246 (upper). The 50-day average is around 3081, with the 200-day near 3667. A sustained close above the middle band and 50-day would improve tone. Slips toward the lower band suggest fragile demand. Polymarket-related shocks could test liquidity around these thresholds.\nScenarios for DeFi activity on Ethereum\nIf more EU states restrict Polymarket, activity may rotate off-chain or to smaller venues, reducing observable volumes. DeFi apps that rely on steady order flow could see thinner liquidity and wider spreads. In that case, ETH could face slower on-chain usage metrics, while risk premia rise until clarity on cross-border enforcement emerges.\nIf platforms introduce stronger KYC, content controls, and clear market definitions under prediction markets regulation, access could stabilize. That reduces misinformation risk and legal overhang, helping DeFi activity normalize. In such a path, integrations with Ethereum oracles and compliant venues may grow, limiting damage from the current scrutiny around Polymarket.\nPortfolio positioning for Germany-based traders\nKeep position sizes modest versus account equity, use stop-losses, and avoid leverage creep during headline-heavy sessions. Consider regulated vehicles available in Germany if direct custody is not essential. Track EUR funding costs across brokers. Hedging with options or futures can smooth volatility while the market digests Polymarket headlines.\nWatch official statements from EU and national bodies, exchange order books, L2 activity, gas fees, and stablecoin flow trends. Trusted media helps filter noise on Portugal election bets and potential blocks. See coverage: Portugal geht gegen Polymarket vor: Verdächtige Wetten zur Wahl im Visier. Expect quick repricing if an EU crypto crackdown expands or a compliance blueprint emerges.\nFinal Thoughts\nPolymarket has moved from niche to headline risk in Europe, with misinformation concerns and election-bet scrutiny pushing regulators to act. For Germany-based investors, the key is to separate access "
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "10.3732",
            "open": "126.8865",
            "close": "118.6428",
            "high": "127.4959",
            "low": "117.1227"
        },
        "market_summary": "### SOL/USD Market Briefing\n\n* **Key Drivers:** Solana's ecosystem shift towards **decentralized finance**, **trading**, and **payments** is gaining momentum, with institutional interest in **tokenization**, **stablecoins**, and **onchain settlement** increasing.\n* **Price Action:** SOL/USD price has **dipped to $140**, showing a **bearish** short-term outlook after being rejected at **$150**, with **$2.2M in net outflows** from Solana ETFs contributing to the downturn.\n* **Technical Outlook:** Immediate support is near the current price level of **$140**, with resistance at **$150**, and a potential **bullish** reversal if buyers defend the current support level, driven by **strong ecosystem metrics** including a **$1.12B TVL** in the RWA ecosystem.\n\n---\n**Overall Sentiment:** Cautiously **bullish**",
        "source_articles": [
            {
                "title": "Solana’s new phase is ‘much more about finance,’ says Backpack CEO Armani Ferrante - CoinDesk",
                "source": "CoinDesk",
                "url": "https://www.coindesk.com/tech/2026/01/25/solana-s-new-phase-is-much-more-about-finance-says-backpack-ceo-armani-ferrante",
                "body": "Solana’s new phase is ‘much more about finance,’ says Backpack CEO Armani Ferrante\nThe Solana ecosystem has spent the past year doubling down on a financial infrastructure, Backpack CEO Armani Ferrante told CoinDesk.\nWhat to know:\n- Solana’s latest phase looks a lot less flashy than its memecoin-fueled highs, and that may be the goal.\n- Armani Ferrante, CEO of crypto exchange Backpack, told CoinDesk in an interview the Solana ecosystem has spent the past year doubling down on a more sober focus: financial infrastructure. A\n- fter years of experimentation as the wider crypto industry focused on NFTs, games and social tokens, attention is now shifting back toward decentralized finance, trading and payments.\nSolana’s latest phase looks a lot less flashy than its memecoin-fueled highs, and that may be the goal.\nArmani Ferrante, CEO of crypto exchange Backpack, told CoinDesk in an interview the Solana ecosystem has spent the past year doubling down on a more sober focus: financial infrastructure. After years of experimentation as the wider crypto industry focused on NFTs, games and social tokens, attention is now shifting back toward decentralized finance, trading and payments.\n“People are really starting to think about blockchains as a new kind of financial infrastructure,” Ferrante, who will be speaking at CoinDesk's Consensus Hong Kong conference next month, said. “It’s less about NFTs, less about random moonshot-like games, and much more about finance.”\nThat shift has made Solana feel dull to some outside observers, but Ferrante framed it as a sign of maturity. The network is increasingly positioning itself around high-throughput onchain trading, market structure and settlement, what some have dubbed as “internet capital markets.”\nThe pivot comes amid a stark divide between crypto sentiment and traditional finance. While crypto prices remain subdued and crypto-native investors remain cautious, Ferrante said institutional interest has rarely been stronger.\n“If you ask anyone on Wall Street, they’ve never been more bullish,” he said, pointing to growing momentum around tokenization, stablecoins and onchain settlement.\nFerrante argued that the long-term case for Solana, and blockchains more broadly, rests on their role as neutral settlement layers. In that future, assets like stocks and derivatives move seamlessly across platforms as standardized tokens rather than sitting in siloed databases.\n“A token is just a canonical, agreed-upon ledger entry for who owns something,” Ferrante said. “That concept applies everywhere.”\nCrucially, Ferrante emphasized that real-world adoption will require deeper integration with regulatory frameworks, not an escape from them. As crypto moves from speculative experimentation toward embedded financial infrastructure, compliance and legal clarity become prerequisites rather than obstacles.\n“What maturity actually means is the real world,” he said. “And the real world isn’t a free-for-all.”\nIn Ferrante’s view, Solana’s bet is that building for that reality, even at the cost of hype, will pay off as more of global finance moves on-chain.\nRead more: Ethereum and Solana set the stage for 2026’s DeFi reboot\nMore For You\nKuCoin Hits Record Market Share as 2025 Volumes Outpace Crypto Market\nKuCoin captured a record share of centralised exchange volume in 2025, with more than $1.25tn traded as its volumes grew faster than the wider crypto market.\nWhat to know:\n- KuCoin recorded over $1.25 trillion in total trading volume in 2025, equivalent to an average of roughly $114 billion per month, marking its strongest year on record.\n- This performance translated into an all-time high share of centralised exchange volume, as KuCoin’s activity expanded faster than aggregate CEX volumes, which slowed during periods of lower market volatility.\n- Spot and derivatives volumes were evenly split, each exceeding $500 billion for the year, signalling broad-based usage rather than reliance on a single product line.\n- Altcoins"
            },
            {
                "title": "Terrifying Solana flaw just exposed how easily the \"always-on\" network could have been stalled by hackers - CryptoSlate",
                "source": "CryptoSlate",
                "url": "https://cryptoslate.com/terrifying-solana-flaw-just-exposed-how-easily-the-always-on-network-could-have-been-stalled-by-hackers/",
                "body": "Terrifying Solana flaw just exposed how easily the “always-on” network could have been stalled by hackers\nThe update mattered less for what it shipped than for how fast the network could actually adopt it.\nWhen Solana maintainers told validators to move quickly on Agave v3.0.14, the message arrived with more urgency than detail.\nThe Solana Status account called the release “urgent” and said it contained a “critical set of patches” for Mainnet Beta validators.\nWithin a day, the public conversation drifted toward a harder question: if a proof-of-stake network needs a fast coordinated upgrade, what happens when the operators do not move together?\nThat gap showed up in early adoption snapshots. On Jan. 11, one widely circulated account said only 18% of stake had migrated to v3.0.14 at the time, leaving much of the network’s economic weight on older versions during a period labeled urgent.\nFor a chain that has spent the past year selling reliability alongside speed, the story shifted from the code itself to whether the operator fleet could converge fast enough when it mattered.\nOver the next ten or so days, the picture became clearer and more useful than the first-wave headlines implied.\nAnza, the team behind Agave, published a security patch summary on Jan. 16 explaining why v3.0.14 mattered and why operators were told to upgrade quickly.\nAround the same time, Solana’s ecosystem signaled that coordination is not left to goodwill alone, because the Solana Foundation’s delegation criteria now explicitly references required software versions, including Agave 3.0.14 and Frankendancer 0.808.30014, as part of the standards validators must meet to receive delegated stake.\nTaken together, those developments turn v3.0.14 into a case study in what “always-on finance” demands in practice on Solana, not just from software, but from incentives and operator behavior under time pressure.\nA high-speed chain still runs on human operations\nSolana is a proof-of-stake blockchain designed to process large volumes of transactions quickly, with validators that vote on blocks and secure the ledger in proportion to staked SOL delegated to them.\nFor users who don't run validators, delegation routes stake to an operator, and that stake becomes both a security input and an economic signal that rewards validators who stay online and perform well.\nThat design has a consequence that's easy to miss if you only watch token price charts. A blockchain isn't one machine in one place. On Solana, “the network” is thousands of independent operators running compatible software, upgrading at different times, across different hosting setups, with different levels of automation and risk tolerance.\nWhen things go smoothly, this independence limits single points of control. When an upgrade is urgent, the same independence makes coordination harder.\nSolana’s validator-client landscape raises the stakes for coordination. The most common production lineage is the client maintained through Anza’s Agave fork, and the network is also progressing toward broader client diversity via Jump Crypto’s Firedancer effort, with Frankendancer as an earlier milestone on that path.\nClient diversity can reduce the risk that one bug takes a large share of stake offline at once, but it does not eliminate the need for coordinated security upgrades when a fix is time-sensitive.\nThat's the context in which v3.0.14 landed. The urgency was about closing potential paths to disruption before they could be exploited.\nWhat changed in the last 10 days: the why became public, and incentives became visible\nAnza’s disclosure filled in the missing center of the story. Two critical potential vulnerabilities were disclosed in December 2025 via GitHub security advisories, and Anza said the issues were patched in collaboration with Firedancer, Jito, and the Solana Foundation.\nOne issue involved Solana’s gossip system, the mechanism validators use to share certain network messages even when block production is disr"
            },
            {
                "title": "Solana Price Dips to $140 Support! Is This Your Last Chance Before ZKP’s Privacy AI Takes Over? - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605167372",
                "body": "Solana price momentum stalled after hitting a wall at $150, ending the week under $140 as the market turns fearful. This sudden pressure, fueled by tariff scares and minor ETF exits, has created a high-stakes setup you can’t afford to ignore. However, look deeper: on-chain data and ecosystem growth remain incredibly bullish, hinting that this drop is a classic “shakeout” rather than a total collapse.\nMeanwhile, the buzz around Zero Knowledge Proof (ZKP) is reaching a fever pitch. Savvy investors are moving past the hype to master how zero-knowledge proofs actually work and why cryptographic security is the backbone of ZKP’s mission. This massive shift is completely redefining what experts call the best crypto to buy now in 2026.\nSolana Price Falters as ETF Outflows Spark Urgent Market Fears\nSolana’s latest slide highlights a market gripped by macro chaos and changing capital flows. Here is the breakdown you need to know:\n- SOL got rejected at $150 and crashed below $140, flipping the short-term outlook to bearish\n- Solana ETFs saw roughly $2.2M in net outflows, the very first dip since they launched\n- A “risk-off” mood turned these small outflows into a major momentum killer\nWhile ETF moves often spark short-term panic, these outflows are tiny in the grand scheme. Smart money is watching closely as traders scramble to hedge their bets during this volatile window.\nBullish On-Chain Secrets: Why the Foundation is Stronger Than Ever\nDon’t let the price drop fool you; Solana’s ecosystem metrics are absolutely exploding behind the scenes. Recent data proves the strength:\n- RWA ecosystem TVL is holding at $1.12B, showing massive institutional commitment\n- Capital continues to flood into new application-level use cases daily\n- Network liquidity and user activity are staying high despite the price consolidation\nThis massive gap between scary price action and rock-solid fundamentals suggests we are seeing a temporary dip. If buyers defend this support, the next move could be legendary.\nWhat is Zero Knowledge Proof? The Future of Digital Privacy\nZero Knowledge Proof is built on the revolutionary idea of cryptographic verification. It’s a system designed to let marketplaces and computations run with 100% validity while keeping your sensitive data totally hidden. This isn’t just speculation; it’s a rigid structure where math and cryptography replace the need for untrustworthy middlemen.\nHow Zero-Knowledge Proofs Work: The Engine Behind the Next Big Thing\nZero-knowledge proofs are the ultimate “need to know” tech, proving a statement is true without sharing any secret data. Instead of leaking your info, the system creates a cryptographic proof that anyone can verify instantly. The magic happens in three steps:\n- Commitment: Your data is locked into a complex mathematical statement\n- Proof generation: A unique cryptographic proof is built to show the statement is 100% valid\n- Verification: The world confirms the truth without ever seeing the private details\nThis tech is mandatory as blockchains evolve from simple coins into massive, data-heavy AI environments where privacy is non-negotiable.\nWhy ZKP is Obsessed with Cryptographic Verification\nZKP’s entire world is built on using zero-knowledge proofs as the ultimate security layer. This isn’t about transparency; it’s about privacy-first power:\n- Total correctness driven by math, not “trust me” promises\n- Privacy-first logic where your sensitive inputs stay strictly confidential\n- Easy auditing because proofs are verified on-chain without exposing secrets\nBy choosing verification over disclosure, ZKP is solving the biggest flaws of older, transparent blockchains. As the world goes digital, the demand for this is skyrocketing.\nHeavyweight applications, from AI tools to regulated finance, need systems that prove results without leaking data. ZKP’s math-heavy foundation is a game-changer because it:\n- Eliminates execution risks with unbreakable, verifiable rules\n- Removes the massive hurdles for"
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "500.900",
            "open": "49,346.040",
            "close": "49,003.920",
            "high": "49,448.040",
            "low": "48,947.140"
        },
        "market_summary": "ERROR: An unexpected error occurred during AI summary generation: 'choices'",
        "source_articles": [
            {
                "title": "Dow Jones Futures Fall; Trump Tariffs, Government Shutdown, Big Earnings In Focus - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-trump-100-canada-tariff-tesla-microsoft-meta-apple-earnings/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #d2948045-fa7c-11f0-9a72-34838c1cafea"
            },
            {
                "title": "Stock futures fall as traders get set for a big week of trading: Live updates - CNBC",
                "source": "CNBC",
                "url": "https://www.cnbc.com/2026/01/25/stock-market-today-live-updates.html",
                "body": "Stock futures fell on Sunday night as traders braced for a big week, with key earnings reports and a U.S. monetary policy meeting.\nDow Jones Industrial Average futures lost 317 points, or 0.6%. S&P 500 and Nasdaq-100 futures shed 0.8% and 1.1%, respectively.\nMore than 90 S&P 500 companies are set to post quarterly reports this week, including Apple, Meta Platforms and Microsoft. So far, the earnings season has been strong, with 76% of the companies that have reported beating expectations, per FactSet.\nTo be sure, some stocks still fell despite companies topping expectations, such as Intel and Netflix.\n\"Based on what we've seen so far, the overall picture remains the same. We anticipate earnings growth accelerating to 14%, and thus we reiterate our recommendations from December: energy, basic materials, Magnificent Seven, Bitcoin, and Ethereum,\" wrote Tom Lee, head of research at Fundstrat.\nTraders this week will also turn their attention to the Federal Reserve. The central bank is set to announce its first policy decision of the year on Wednesday.\nWhile the Fed is widely expected to keep its overnight rate unchanged, Wall Street will look for clues on when Fed officials will cut rates.\nWall Street is coming off a losing week, after increasing geopolitical tensions unnerved investors. Concerns eased toward the end of the week, with President Donald Trump announcing that a \"framework\" for a deal regarding Greenland had been reached. Still, the S&P 500 lost about 0.4% last week for its second straight weekly decline."
            },
            {
                "title": "Dow Jones & Nasdaq 100: US Futures Slip as Yen Surge Hits Asia - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/dow-jones-nasdaq-100-us-futures-slip-as-yen-surge-hits-asia-1574954",
                "body": "US stock futures edged lower in early trading on Monday, January 26, as USD/JPY slides below key support levels amid increased warnings of intervention.\nLast week, Japanese Prime Minister Sanae Takaichi warned of yen interventions in the forex market, coinciding with hawkish Bank of Japan forecasts, leaving USD/JPY down 1.64% on Friday, January 23. The USD/JPY pair extended its losses on January 26, dropping below the crucial 155 support level to a low of 153.885, its lowest level since mid-November. The stronger yen left the Nikkei 225 down 1.7% in morning trading, weighing on risk sentiment.\nMeanwhile, fears of another US government shutdown and a potential US-Canada trade war added to the gloomy mood.\nDespite the morning losses, bets on a Fed rate cut in H1 2026, a resilient US economy, and optimism toward Q4 earnings continue to support a bullish medium-term outlook for US stock futures.\nBelow, I’ll outline the key market drivers, the medium-term outlook, and the technical levels traders should watch.\nSpeculation about yen interventions in the forex markets intensified on January 26, cooling yen carry trades into risk assets. Over the weekend, reports circulated of the US Federal Reserve considering yen intervention in the forex markets.\nThe Japanese government warned of a potential intervention on Friday, coinciding with hawkish BoJ GDP and inflation forecasts, sending USD/JPY to key support. Crucially, sharp USD/JPY movements increase the risk of an unwind in yen carry trades, weighing on demand for risk assets.\nIn 2024, the BoJ raised interest rates and cut Japanese Government Bond (JGB) purchases, leading to an unwind in yen carry trades. Notably, the Nasdaq 100 tumbled 11.7% during a three-day sell-off. USD/JPY dropped from 153.889 to 141.684 over the same period, underscoring market sensitivity to USD/JPY trends.\nA US Fed yen intervention may send USD/JPY sharply lower, given the rarity of US involvement in the markets.\nOver the weekend, US President Trump threatened Canada with a 100% tariff if Prime Minister Mark Carney signed a trade deal with China. The risk of a US-Canada trade war increased demand for safe-haven assets, leaving US stock futures in the red. Notably, gold broke above $5,000 for the first time.\nDespite concerns over a US-Canada trade war, Canadian Prime Minister Mark Carney downplayed speculation about a Canada-China trade deal. The Kobeissi Letter reported:\n“Canada’s Prime Minister Carney says he does NOT plan to sign a ‘free trade agreement’ with China after President Trump threatened 100% tariffs.”\nEasing risks of a US-Canada trade war cushioned the downside this morning, with US index futures rebounding from heavier losses.\nRising geopolitical tensions and increased risks of a US-Canada trade war collided with expectations of a lengthy US government shutdown. According to Polymarket, the chances of another US government shutdown increased to 78% over the weekend, up sharply from just 9% on January 23. Notably, US stock futures advanced during and beyond the 2025 shutdown.\nUS futures were under selling pressure in the Asian morning session on January 26. The Dow Jones E-mini and the Nasdaq 100 E-mini fell 119 points and 89 points, respectively, while the S&P 500 E-mini declined 16 points.\nLater Monday, US durable goods orders will influence speculation about a June Fed rate cut. Economists expected durable goods orders to increase 0.5% month-on-month in November after sliding 2.2% in October. A rebound in orders would align with the recent pickup in economic momentum, lifting demand for US stock futures.\nOther economic data on Monday includes the Dallas Fed Manufacturing Index and the Chicago Fed National Activity Index. However, durable goods orders will likely be the key driver.\nDespite the morning losses, the Dow Jones E-mini, the Nasdaq 100 E-mini, and the S&P 500 E-mini remained above their 50-day and 200-day EMAs. The EMAs indicated a bullish bias, aligning with favorable fundamentals.\nNe"
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "68.750",
            "open": "10,147.730",
            "close": "10,149.230",
            "high": "10,182.930",
            "low": "10,114.180"
        },
        "market_summary": "### UK100 Market Briefing\n\n* **Key Drivers:** Renewed **geopolitical uncertainty** and **tariff threats** from US President Donald Trump are weighing on investor sentiment, despite a **bullish** outlook for gold.\n* **Price Action:** The **FTSE 100** broke its three-week winning streak, closing down **0.07%** on Friday, while the **FTSE 250** retreated **0.2%** from a more than four-year high.\n* **Technical Outlook:** Immediate support for the **FTSE 100** is near the **10,100** level, with resistance at **10,200**, as the index ended the week at **10,152.51**.\n\n---\n**Overall Sentiment:** Cautious ️",
        "source_articles": [
            {
                "title": "Trump's proposed credit card rate cap: Sheila Bair weighs in - Yahoo Finance UK",
                "source": "Yahoo Finance UK",
                "url": "https://uk.finance.yahoo.com/video/trumps-proposed-credit-card-rate-130014681.html",
                "body": "Your privacy is important to us\nYahoo is part of the Yahoo family of brands.\nWhen you use our sites and apps, we use cookies to:\n- provide our sites and apps to you\n- authenticate users, apply security measures, and prevent spam and abuse, and\n- measure your use of our sites and apps\nYour privacy choices\nIf you click '\nAccept all', we and\nour partners, including 245 who are part of the IAB Transparency & Consent Framework, will also store and / or access information on a device (in other words, use cookies) and use precise geolocation data and other personal data such as\ntechnical identifiers and browsing and search data, for analytics, personalised advertising and content, advertising and content measurement, and audience research and services development.\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\nIf you would like to customise your choices, click 'Manage privacy settings'.\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy and Cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our Privacy Policy and Cookie Policy."
            },
            {
                "title": "FTSE 100 breaks three-week winning streak - Business Recorder",
                "source": "Business Recorder",
                "url": "https://www.brecorder.com/news/40403947",
                "body": "LONDON: The UK’s FTSE 100 rounded off the week with losses on Friday, as renewed geopolitical uncertainty weighed on investor sentiment though mining stocks closed the week with robust gains.\nThe blue-chip FTSE 100? closed down 0.07 percent, breaking its three-week winning streak in which it had gained about 3.5 percent, its longest run since August.\nThe domestically-focused FTSE 250? retreated 0.2 percent from a more than four-year high hit on Thursday. It ended flat for the week.\nUS President Donald Trump’s tariff threats over Greenland last weekend weighed on investor sentiment this week. And although he backed away from the threats and ruled out acquiring the territory by force, investors remained uneasy about renewed geopolitical uncertainty.\nMost sectors in the market ended lower on Friday, with banks the biggest weights.\nHowever, commodity-linked sectors saw gains, with energy firms up 0.8 percent tracking higher oil prices.\nThe index of precious metal miners gained 2 percent after gold inched closer to USD5,000/oz, and silver crossed the USD100/oz mark as investors piled into safe-haven assets amid geopolitical turmoil.\nThe sector outperformed peers with an 11.3 percent gain this week, its biggest weekly rise since November.\n“Gold ostensibly remains the preferred portfolio hedge amid ongoing geopolitical risk, keeping the bullish case intact,” said Laura Cooper, senior macro strategist at Nuveen.\n“While near-term consolidation is possible given recent market moves, the balance of risks still tilts to the upside.” Among other stocks, C&C group hit a more than 16-year low after the Irish drinks producer cut its fiscal 2026 profit forecast, blaming weak confidence following November’s UK budget that altered buying habits and saddled demand.\nSeparately, official data showed British retail sales unexpectedly rose in December, helped by stronger online spending, supporting signs of a pickup in the economy."
            },
            {
                "title": "FTSE 100 Live: Growth spurt for UK business, retail sales beat hopes - standard.co.uk",
                "source": "standard.co.uk",
                "url": "https://www.standard.co.uk/business/ftse-100-live-23-january-gold-price-record-uk-economy-retail-sales-consumer-confidence-stock-market-opening-london-share-prices-trading-updates-b1267795.html",
                "body": "FTSE 100 Live 23 January: Growth spurt for UK business, retail sales beat hopes\nOnline jewellery demand boosted December’s retail performance, while the services industry underpinned the best PMI reading since April 2024.\nFTSE 100 Live Friday\nLive updates\nMarket update: M&S leads FTSE 100, Babcock falls on CEO succession\nEncouraging signs from the UK economy today took centre stage in a session when the FTSE 100 index drifted and the gold price resisted $5000 an ounce.\nA 0.4% rise in December retail sales followed by figures showing the fastest expansion in business activity since April 2024 provided the UK cheer.\nThe pound traded above $1.35 after the latest purchasing managers’ index (PMI) reading jumped to 53.9 from December’s 51.4. An accelerated upturn in service sector activity to a 21 month high of 54.3 drove the improvement\nThe FTSE 100 index ended a volatile week in subdued mood at a broadly unchanged 10,152.51, with easyJet and British Airways and Aer Lingus owner IAG among the biggest fallers after declines of more than 2%.\nBurberry fell 4% or 52p to 1222.5p as the worst performing stock, leaving the luxury goods group where it was prior to Wednesday’s encouraging trading update.\nBabcock International fell 2% or 28p to 1436p as a strong third quarter update was overshadowed by the retirement plans of chief executive David Lockwood.\nHaving transformed the fortunes of the defence engineering group since September 2020, Lockwood will hand over to insider Harry Holt at the end of the year.\nCity bank Berenberg said it viewed Holt as a strong replacement, noting his impressive track record as CEO of the Nuclear division – the fastest-growing and highest-margin segment within Babcock since 2023.\nFellow defence firm BAE Systems moved 1% or 24p higher at 2009p near the top of the FTSE 100, which was led by Marks & Spencer after a rise of 7p to 368.2p.\nEndeavour Mining lifted 16p to 4290p but had been higher after the price of gold set a record $4966 an ounce. However, the precious metal later settled at $4925.\nBusiness activity upturn fastest since April 2024\nUK businesses have made a better-than-expected start to the year after the latest purchasing managers’ index (PMI) score jumped to 53.9 from December’s 51.4.\nThe highest reading since April 2024 is indicative of quarterly GDP growth approaching 0.4%. The PMI has been above the neutral 50 threshold for the past nine months.\nAn accelerated upturn in service sector activity to a 21 month high of 54.3 drove the improvement as some respondents said post-Budget clarity had helped to boost investment spending among clients.\nManufacturing production increased modestly, reaching a three-month high at 51.5.\nChris Williamson, chief business economist at S&P Global Market Intelligence, said UK businesses showed encouraging resilience in the face of recent geopolitical tensions.\nHe added: “Companies are reporting higher demand, both from home and export markets, which has driven output growth to the fastest since April 2024.\n“Firms are also reporting the greatest optimism about the business outlook since before the 2024 Autumn Budget.”\nAn upturn in order books failed to stem a steep loss of jobs, which companies commonly blamed on the need to reduce high costs.\nPoundland completes overhaul as quarterly sales fall\nPoundland has said its sweeping restructure that saw it shut nearly 150 shops and axe 2,200 jobs has finished, but that it still has “much to do” to get back on track.\nThe discount retailer, which secured High Court approval for its restructuring plan last August, confirmed it ended the year with 651 sites, down from around 800 before the reorganisation.\nChristmas trading figures today showed like-for-like underlying sales dropped 2.9% in the quarter to December 28 as it slashed prices to get back to its discount roots. Comparable store sales by volume lifted 2%.\nTikTok seals deal to remain in the US\nTikTok has finalised a deal to keep operating in the US, securing its futu"
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "139.000",
            "open": "24,811.310",
            "close": "24,888.410",
            "high": "24,935.160",
            "low": "24,796.160"
        },
        "market_summary": "No relevant news articles were found to generate a summary.",
        "source_articles": []
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "304.620",
            "open": "25,471.370",
            "close": "25,538.040",
            "high": "25,705.620",
            "low": "25,401.000"
        },
        "market_summary": "### NDX100 Market Briefing\n\n* **Key Drivers:** Upcoming earnings reports from major tech companies such as **Apple**, **Meta Platforms**, and **Microsoft**, along with the U.S. monetary policy meeting, are driving market sentiment.\n* **Price Action:** Nasdaq-100 futures shed **1.1%**, indicating **bearish** momentum, as traders brace for a significant week of trading and potential impacts from **Trump's tariff threats**.\n* **Technical Outlook:** Immediate support levels and resistance are not clearly defined in the provided articles, but the overall market anticipation is cautious, with **76%** of S&P 500 companies beating expectations so far in the earnings season.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "Stock futures fall as traders get set for a big week of trading: Live updates - CNBC",
                "source": "CNBC",
                "url": "https://www.cnbc.com/2026/01/25/stock-market-today-live-updates.html",
                "body": "Stock futures fell on Sunday night as traders braced for a big week, with key earnings reports and a U.S. monetary policy meeting.\nDow Jones Industrial Average futures lost 317 points, or 0.6%. S&P 500 and Nasdaq-100 futures shed 0.8% and 1.1%, respectively.\nMore than 90 S&P 500 companies are set to post quarterly reports this week, including Apple, Meta Platforms and Microsoft. So far, the earnings season has been strong, with 76% of the companies that have reported beating expectations, per FactSet.\nTo be sure, some stocks still fell despite companies topping expectations, such as Intel and Netflix.\n\"Based on what we've seen so far, the overall picture remains the same. We anticipate earnings growth accelerating to 14%, and thus we reiterate our recommendations from December: energy, basic materials, Magnificent Seven, Bitcoin, and Ethereum,\" wrote Tom Lee, head of research at Fundstrat.\nTraders this week will also turn their attention to the Federal Reserve. The central bank is set to announce its first policy decision of the year on Wednesday.\nWhile the Fed is widely expected to keep its overnight rate unchanged, Wall Street will look for clues on when Fed officials will cut rates.\nWall Street is coming off a losing week, after increasing geopolitical tensions unnerved investors. Concerns eased toward the end of the week, with President Donald Trump announcing that a \"framework\" for a deal regarding Greenland had been reached. Still, the S&P 500 lost about 0.4% last week for its second straight weekly decline."
            },
            {
                "title": "Dow Jones Futures Fall; Trump Tariffs, Government Shutdown, Big Earnings In Focus - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-trump-100-canada-tariff-tesla-microsoft-meta-apple-earnings/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #2da3dece-fa7d-11f0-ae56-7e087e45148f"
            },
            {
                "title": "Dow, S&P 500, Nasdaq Futures Slip: Trump’s New Canada Tariff Threats And Big Earnings Week Keep Investors On Edge - Stocktwits",
                "source": "Stocktwits",
                "url": "https://stocktwits.com/news-articles/markets/equity/dow-s-and-p-500-nasdaq-futures-slip-trump-s-new-canada-tariff-threats-and-big-earnings-week-keep-investors-on-edge/cmy79ldR4WZ",
                "body": "stocktwits.com\nVerifying you are human. This may take a few seconds.\nstocktwits.com needs to review the security of your connection before proceeding.\nVerification successful\nWaiting for stocktwits.com to respond...\nEnable JavaScript and cookies to continue"
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "38.760",
            "open": "6,907.360",
            "close": "6,901.140",
            "high": "6,931.150",
            "low": "6,892.390"
        },
        "market_summary": "### SPX500 Market Briefing\n\n* **Key Drivers:** None of the provided articles contain information relevant to the SPX500. However, in general, the **SPX500** is influenced by **macroeconomic trends**, **corporate earnings**, and **monetary policy decisions**.\n* **Price Action:** Without current data, we cannot determine the **SPX500**'s **price action**. Normally, it would be described in terms of its movement relative to **key psychological levels** or **technical indicators**.\n* **Technical Outlook:** The **technical outlook** for the **SPX500** depends on **chart patterns**, **trend lines**, and **indicators** such as the **50-day moving average** and the **200-day moving average**. \n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "Colorado investigators confirm Hunter S Thompson’s 2005 death was a suicide - The Guardian",
                "source": "The Guardian",
                "url": "https://www.theguardian.com/books/2026/jan/23/hunter-thompson-journalist-suicide-investigation",
                "body": "A review of the 2005 shooting death of the journalist Hunter S Thompson has confirmed authorities’ original finding that his death was a suicide, Colorado investigators said on Friday.\nThe review by the Colorado bureau of investigation (CBI) was announced in September after Thompson’s wife, Anita Thompson, contacted authorities with “new concerns and potential information regarding the investigation” into Thompson’s death, the agency said in a news release.\nIn a statement included in the announcement, she thanked the bureau for its “kind and thorough work”.\n“This allows all of us who loved Hunter to move forward with a clean conscience,” she said.\nThompson, who popularized a first-person form of gonzo journalism in articles and books such as Fear and Loathing in Las Vegas, died at his Aspen-area home in February 2005. He was 67.\nHis remains were cremated and fired from a cannon at his request during a private ceremony in Colorado. Among the celebrities who attended was the actor Johnny Depp, who played the lead role in the 1998 film adaptation of Fear and Loathing in Las Vegas.\nThe sheriff for the Aspen area, Michael Buglione, said he believed the original investigation into Thompson’s death was conducted properly but investigators recognized the importance of an independent review.\nThe “CBI’s conclusions reaffirm the original findings and, we hope, provide reassurance and clarity,” he said."
            },
            {
                "title": "2027 KTM 1390 Super Adventure S Evo First Ride - Cycle World",
                "source": "Cycle World",
                "url": "https://www.cycleworld.com/motorcycle-reviews/ktm-1390-super-adventure-s-evo-first-ride/",
                "body": "Much has changed at KTM over the last 18 months, with its financial woes now seemingly in the rearview. It’s reassuring to see that the Austrian factory’s publicity shots for this, the new planet-shrinking 1390 Super Adventure S Evo, feature not a rider dressed for a long-haul ride into the back of nowhere but one wearing full race leathers while pulling a crossed-up wheelie on a racetrack—so not everything has changed. The S Evo may be the first ADV to emerge from Mattighofen since the factory resumed production in July, but that Ready to Race spirit lives on.\nThis is borne out by the numbers; the brute makes a claimed 173 hp. More, by a whisker, than any other big-cube ADV on the market. Its Camshift LC8 V-twin jumps up in capacity from the 1290’s 1301cc to 1350cc. While it revs hard and free like a pure sportbike, it also churns out a gut-wrenching 107 lb.-ft. of torque at just 8000 rpm. It hits the scales at a claimed 503 pounds, so it is ultra-competitive on weight too. Climb aboard, find some space, and straighten your arms on a whiff of throttle. It is as quick as it is commanding.\nBut the V-twin‘s flexibility and outright pace are not the big story here. And that, as you may well have surmised, is because the S Evo is absolutely bristling with new tech.\nLove it or hate it, this is the frontline now. Manufacturers are battling to make not only the best motorcycles but also the smartest. For the Super Adventure S Evo, KTM has upped the game with an even more active and adjustable iteration of its WP SAT (Semi-Active Technology) suspension, which adjusts its damping rates in real time according to riding inputs and the terrain, and also features four selectable damping modes: Comfort, Street, Sport, and Rain.\nA full-color 8-inch portrait touchscreen, complete with an anti-smudge and anti-reflection coating, is one of the largest on the market and, in terms of size and functionality, is the closest we’ve yet come to having a laptop bolted into the cockpit. At the heart of everything, it features integrated sat-nav and allows the rider to change the spring preload and incremental damping rates to fine tune the ride. Fifth-generation Bosch front radar, coupled with Adaptive Cruise Control, now has a Group Ride mode to make it safer when riding with mates in close formation.\nAutomated Manual Transmission (AMT) comes as standard on the Evo, which is the only S model available in the US. It features a centrifugal clutch system to facilitate clutchless riding, similar to that of a twist-and-go scooter, and dispenses with a conventional clutch lever at the bar. The rider can choose between a fully automated setup with three shift modes (Comfort, Street, and Sport) or manually change gear via a paddle shift on the left bar or conventionally using the foot gear selector, which looks normal enough but is actually an electrical switch and not connected to anything mechanical like a shift shaft. Rapid downshifts can also be made by quickly closing the throttle.\nKTM has also installed a Park mode that mechanically locks the gearbox, similar to an automatic car, to stop the bike from rolling, while gear patterns now run a P-N-1-2-3-4-5-6 order with the traditional neutral between first and second gears removed.\nAs this is the top spec Evo model, multiple rider aids, including Motorcycle Traction Control (MTC), adjustable cornering ABS, a tire pressure monitoring system, and a smart keyless system come as standard. There’s also a good old fashioned centerstand.\nIn a bid to reassure those of us who may not be completely comfortable with all this techno wizardry (after all, what happens if one or more of these systems goes on the blink?) there is a new factory warranty of four years to fall back on. Pricing starts at $22,699 for the Evo, which puts it more on par with Triumph’s Tiger 1200 than its more expensive and most direct rivals, the BMW’s R1300 GS ASA and Ducati’s Multistrada V4 S. Cycle World’s test machine also had the Tech Pack w"
            },
            {
                "title": "Rams-Seahawks final score: Seattle ends L.A.’s terrific season - Turf Show Times",
                "source": "Turf Show Times",
                "url": "https://www.turfshowtimes.com/los-angeles-rams-scores-results/134035/rams-seahawks-final-score-seattle-ends-l-a-terrific-season",
                "body": "The Los Angeles Rams lost to the Seattle Seahawks by a final score of 31-27 in the NFC Championship. This was billed to be a battle between two titans of the NFL, and the game delivered. Look, the Rams had a great year and they should be proud to get this point, but it’s going to sting to fall short of getting to the Super Bowl.\nRams-Seahawks final score: Seattle ends L.A.’s terrific season\nThe Seattle Sehawks are going to the Super Bowl, and the Los Angeles Rams are going home.\nThere’s no way around that.\nNow, did the Rams show up today? Yes, they gave it their all, but Seattle did enough to win.\nMatthew Stafford and Sam Darnold looked the part of a franchise quarterback, while Jaxon Smith-Njigba and Puka Nacua both looked like Offensive Players of the Year, and both teams had defenses that were hitting hard and chasing the ball.\nIt was a slugfest between the two NFC West opponents, and a huge difference was that L.A. seemed to struggle throughout the day on third down, while Seattle’s offense converted on more than one third and long. That difference was key.\nAnother key to the game was a costly fumble on special teams by the Rams, it led to Seattle points and their eventual win.\nSeattle struck first with a rushing score by Kenneth Walker as the Rams struggled to do better than put up a couple field goals. As the Seahawks were leading 10-6, the Rams finally put together their best drive as Matthew Stafford hit Kyren Williams to take a 13-10 lead.\nThe Rams had a chance to score before halftime, but instead they punted back to Seattle as they took advantage and took a 17-13 lead at the half.\nOut of the half, L.A.’s defense went to work and forced a punt, only to then have Xavier Smith fumble the ball on the return to give Seattle an immediate short field. The Seahawks would go on to score another touchdown to take a 24-13 lead.\nThe Rams kept themselves alive as Stafford connected to Davantae Adams for a score to make the game 24-20, but Seattle was able to score again to reestablish control with a 31-20 lead.\nOn L.A.’s next offensive drive, Seattle had stopped the Rams and forced a fourth and long, but when Seattle was called for a taunting penalty, it gave some new life to the Rams who took advantage with a Puka Nacua touchdown to make the game 31-27.\nThese teams were putting on a show.\nThen, the Rams defense was able to force the ball back once again to the Rams, and L.A. drove down the field and almost notched a go-ahead touchdown, but Seattle’s defense held strong on a fourth down as Seattle had the ball back and a chance to run out the clock and win.\nSeattle did eventually punt the ball back to L.A., but with 20-seconds left, there wasn’t enough time for Stafford to work his comeback magic.\nL.A. fell short one game of the Super Bowl, making it further than last year, but losing hurts, and now they have a whole offseason to reflect on what almost was.\nSean McVay and everyone top to bottom should be proud of how far they got, but it’s alright to have wanted more too.\nWell, there’s always next year."
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "1,285.710",
            "open": "53,964.390",
            "close": "52,763.700",
            "high": "54,039.410",
            "low": "52,753.700"
        },
        "market_summary": "### JPN225 Market Briefing\n\n* **Key Drivers:** A stronger **yen** against the U.S. dollar, fueled by speculation of currency market intervention by Japanese and U.S. officials, is hurting Japanese exporters’ overseas earnings, leading to a **bearish** sentiment.\n* **Price Action:** The **JPN225** index slumped nearly **2%**, extending recent weakness, with the benchmark dropping to **52,812.45** as big exporters like Toyota Motor Corp. saw their shares fall **3.2%**.\n* **Technical Outlook:** Immediate support is near the recent low of **52,500**, with resistance at **54,000**, as the index faces **downward pressure** from a strengthening yen.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "BREAKING NEWS: Nikkei stock index slides over 2% as yen firms vs. dollar - english.kyodonews.net",
                "source": "english.kyodonews.net",
                "url": "https://english.kyodonews.net/articles/-/69230",
                "body": "Japan's Prime Minister Takaichi says to dissolve lower house on Friday for Feb. 8 election Jan 19, 2026 KYODO NEWS\nHe left Myanmar for Michigan. Trump's travel ban cut off his US college studies midway 26 minutes ago AP News\nNetflix and MAPPA Forge Strategic Partnership! Multiple New Anime Projects Now in Development 3 hours ago Animate Times"
            },
            {
                "title": "Asia stocks mixed ahead of Fed meeting; Nikkei slumps amid yen spike - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/news/stock-market-news/asia-stocks-mixed-ahead-of-fed-meeting-nikkei-slumps-amid-yen-spike-4464175",
                "body": "Asia stocks mixed ahead of Fed meeting; Nikkei slumps amid yen spike\nInvesting.com-- Asian stocks were mixed on Monday as markets braced for a crucial Federal Reserve policy meeting later this week and awaited key tech earnings, while Japan shares slumped amid a sharply stronger yen.\nU.S. stock indexes closed last week on a weaker footing, while futures tied to them fell during Asian hours on Monday.\nGet exclusive stock selection, key earnings preview with InvestingPro\nNikkei slumps amid yen spike\nNikkei 225 index slumped nearly 2%, extending recent weakness in exporters as the yen strengthened sharply against the U.S. dollar amid speculation of currency market intervention by Japanese and U.S. officials to support the beleaguered currency.\nA stronger yen typically hurts Japanese exporters’ overseas earnings, adding to risk-off trading in Tokyo. Gold surged to record highs as safe-haven demand intensified, highlighting investor caution ahead of key global policy events.\nElsewhere in the region, South Korea’s KOSPI also eased nearly 1% after record peaks of 5,023.76 points earlier in the day, while China’s Shanghai Composite held largely steady.\nAustralia’s S&P/ASX 200 index edged 0.1% higher, while Singapore’s Straits Times Index fell 0.4%.\nIndian stock markets were closed for a public holiday.\nFed meeting, heavy tech earnings calendar in focus\nTraders are focused squarely on this week’s Fed meeting, where policymakers are widely expected to hold interest rates steady, with markets watching closely for any shift in forward guidance on future rate moves amid ongoing inflation pressures.\nComments from Fed Chair Jerome Powell and others later in the week are expected to shape sentiment across global risk assets.\nInvestor attention is also concentrated on a busy earnings slate, including quarterly results from most of the so-called “Magnificent Seven” tech giants -- Microsoft Corporation (NASDAQ:MSFT), Meta Platforms Inc (NASDAQ:META), Tesla Inc (NASDAQ:TSLA), Apple Inc (NASDAQ:AAPL) -- whose performance often sets the tone for broader markets.\nIn Asia, Samsung Electronics (KS:005930) and SK Hynix Inc (KS:000660) are among the major technology names scheduled to report.\nInvestor caution around AI-linked stocks persists, with technology shares underperforming in some sessions as concerns grow about stretched valuations and rising costs.\nMarket participants remain cautious ahead of both policy and earnings catalysts, balancing optimism about artificial-intelligence-driven long-term growth with near-term macroeconomic and currency risks.\nWhich stock should you buy in your very next trade?\nAI computing powers are changing the stock market. Investing.com's ProPicks AI includes dozens of winning stock portfolios chosen by our advanced AI.\nYear to date, 2 out of 3 global portfolios are beating their benchmark indexes, with 88% in the green. Our flagship Tech Titans strategy doubled the S&P 500 within 18 months, including notable winners like Super Micro Computer (+185%) and AppLovin (+157%).\nWhich stock will be the next to soar?"
            },
            {
                "title": "Asian shares mostly dip as the yen rises against the U.S. dollar - mymotherlode.com",
                "source": "mymotherlode.com",
                "url": "https://mymotherlode.com/news/national/10448204/asian-shares-mostly-dip-as-the-yen-rises-against-the-u-s-dollar.html",
                "body": "TOKYO (AP) — Asian shares mostly declined Monday, as Japan’s benchmark took a tumble after the yen surged against the U.S. dollar.\nJapan’s benchmark Nikkei 225 dropped 1.9% to 52,812.45 on selling of big exporters like Toyota Motor Corp., whose shares fell 3.2%.\nA weak currency is generally favorable for Japanese exporters because it helps elevate the value of their overseas earnings. In recent months, the dollar has gained against the yen. It fell sharply in the past few days after officials in both Japan and the U.S. indicated they were prepared to intervene to support the yen.\nThe dollar slipped to 154.26 Japanese yen from 155.01 yen. It had been trading around 158 yen last week.\nThe euro rose to $1.1866 from $1.1858.\nElsewhere in Asia, South Korea’s Kospi dipped 0.6% to 4,961.58.\nHong Kong’s Hang Seng inched down 0.1% to 26,722.89, while the Shanghai Composite added 0.1% to 4,141.10.\nMarkets were closed in Australia, New Zealand, India and Indonesia.\nU.S. futures edged lower on persisting uncertainty over U.S. tariff policies, among other issues.\nThe futures for the S&P 500 and the Dow Jones Industrial Average were down 0.3%.\nA threat by U.S. President Donald Trump to impose a 100% tariff on goods from Canada was countered by Canadian Prime Minister Mark Carney. Trump had warned he might hike tariffs if Canada signed a free trade deal with China. Carney said Canada had no plans for such a deal.\nIn 2024, Canada mirrored the United States by putting a 100% tariff on electric vehicles from Beijing and a 25% tariff on steel and aluminum. China had responded by imposing 100% import taxes on Canadian canola oil and meal and 25% on pork and seafood.\nBreaking with the United States this month during a visit to China, Carney cut its 100% tariff on Chinese electric cars in return for lower tariffs on those Canadian products.\nOn Friday, the S&P 500 edged up less than 0.1% to 6,915.61. But it still notched a second straight week with a modest loss. The Dow Jones Industrial Average dipped 0.6% to 49,098.71. The Nasdaq composite rose 0.3% to 23,501.24.\nThe majority of stocks on Wall Street fell, and Intel weighed on the market after tumbling 17%.\nThe next chance for the U.S. Federal Reserve to move the short-term interest rate it controls will come on Wednesday. The market expectation is that it will hold steady.\nIn other dealings early Monday, benchmark U.S. crude rose 2 cents to $61.09 a barrel. Brent crude, the international standard, edged up 3 cents to $65.10 a barrel.\nGold gained 2% to nearly $5,100 an ounce, while silver jumped 6.4% to about $108 per ounce. The value of precious metals has surged in recent months as investors sought relatively safe places to invest.\nBy YURI KAGEYAMA\nAP Business Writer"
            }
        ]
    }
]