[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "168.070",
            "open": "4,833.990",
            "close": "4,936.370",
            "high": "4,940.730",
            "low": "4,772.660"
        },
        "market_summary": "### Gold (XAU/USD) Market Briefing\n* **Key Drivers:** A weaker **U.S. dollar** and rising **inflation expectations** are supporting **gold prices**, with the metal nearing **$5,000/oz**.\n* **Price Action:** Spot gold is trading at **$4,955/oz**, driven by a combination of factors including a falling **U.S. Dollar Index** and increased **safe-haven demand**.\n* **Technical Outlook:** With gold approaching **$5,000**, the next resistance level, support can be found near the recent lows, around **$4,800**, as the market continues to exhibit **bullish momentum**.\n--- \n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Understanding the relationship between gold prices and the U.S. dollar: What to know for 2026 - CBS News",
                "source": "CBS News",
                "url": "https://www.cbsnews.com/news/relationship-between-gold-prices-and-us-dollar-what-to-know-for-2026/",
                "body": "Understanding the relationship between gold prices and the U.S. dollar: What to know for 2026\nGold prices have been making headlines over the last year, and the last several months in particular, as the price has surged past recent highs and set fresh records nearly every week. At the same time, the U.S. Dollar Index has been hovering near multi-month lows, marking a significant retreat from its highs just a year ago. For investors watching their portfolios, these parallel movements aren't coincidental. They're part of a long-standing dynamic that continues to reshape the investment landscape.\nThe relationship between gold and the U.S. dollar has taken on renewed importance as a number of looming issues, like economic uncertainty, geopolitical tensions and shifting monetary policies, create an environment where understanding this connection could mean the difference between protecting and eroding wealth. After a year that saw gold climb substantially and the dollar fall in tandem, investors are now confronting a fundamentally different market than they faced early last year.\nWhat exactly should investors know about the relationship between gold prices and the U.S. dollar right now, though? That's what we'll examine below.\nFind out how to add gold and other precious metals to your portfolio today.\nUnderstanding the relationship between gold prices and the U.S .dollar: What to know for 2026\nAt its core, gold's historical relationship with the U.S. dollar is rooted in simple economics: Gold is priced in dollars globally, so when the dollar strengthens, gold becomes more expensive in other currencies and tends to lose some demand, putting downward pressure on its price. Conversely, when the dollar weakens, gold becomes relatively cheaper for holders of other currencies, which can boost demand and lift prices. This dynamic has created a generally inverse correlation between gold prices and the U.S. dollar over decades.\nBut why does this matter? For investors and analysts, movements in the U.S. Dollar Index, which acts as a measure of the dollar's strength against a basket of major world currencies, often serve as a quick barometer for how gold might fare. A rising U.S. Dollar Index historically corresponded with pressure on gold, while a falling U.S. Dollar Index offered a lift.\nYet the relationship isn't ironclad. In recent years, and particularly as markets dealt with rising global debt, geopolitical uncertainty and renewed demand for alternatives to traditional financial assets, gold and the dollar have occasionally moved in the same direction. For example, global safe-haven demand during periods of market stress can push both gold and the dollar higher simultaneously, even if that runs contrary to the usual inverse pattern.\nAnd, when it comes to how the U.S. dollar and gold could interact throughout the course of 2026, several factors could influence this dynamic, including:\nMonetary policy and interest rates\nFederal Reserve decisions on interest rates play a significant role in shaping both the dollar and gold prices, meaning that any Fed rate decisions that occur this year could have an impact. Higher interest rates tend to support the dollar by offering better returns on dollar-denominated assets, making non-yielding gold less attractive. Conversely, expectations of rate cuts, or even political pressure on the Fed, can weaken the dollar and make gold more appealing.\nStart protecting your investment portfolio with precious metals now.\nInflation expectations\nGold has long been viewed as a hedge against inflation, and right now, inflation, while cooler compared to recent highs, is still not fully under control. Where it heads next remains to be seen. When inflation expectations rise, particularly if real yields turn negative, investors often seek gold to preserve purchasing power. A weaker dollar often accompanies rising inflation expectations, reinforcing gold's safe-haven appeal.\nGeopolitical tension and safe-haven demand\nCon"
            },
            {
                "title": "Spot gold at $4,955/oz after final Consumer Sentiment rises to 56.4, but long-term inflation expectations rise - KITCO",
                "source": "KITCO",
                "url": "https://www.kitco.com/news/article/2026-01-23/spot-gold-4955oz-after-final-consumer-sentiment-rises-564-long-term",
                "body": "Ernest Hoffman\nErnest Hoffman is a Crypto and Market Reporter for Kitco News. He has over 15 years of experience as a writer, editor, broadcaster and producer for media, educational and cultural organizations. Ernest began working in market news in 2007, establishing the broadcast division of CEP News in Montreal, Canada, where he developed the fastest web-based audio news service in the world and produced economic news videos in partnership with MSN and the TMX. He has a Bachelor's degree Specialization in Journalism from Concordia University. You can reach Ernest at 1-514-670-1339."
            },
            {
                "title": "US dollar falls further as gold nears $5000 - investingLive",
                "source": "investingLive",
                "url": "https://investinglive.com/forex/us-dollar-falls-further-as-gold-nears-5000-20260123/",
                "body": "The US dollar is coming under some broad pressure ahead of the weekend, particularly in USD/JPY.\nThere could be fears of intervention in the thin liquidity at the open on Sunday or it could reflect the record highs in precious metals and increasing talk of de-dollarization. Another curious move today is the rally in oil markets, which might suggest that something is afoot via the US military over the weekend. Given the drama since the start of the year, I wouldn't rule that out.\nIn any case, these moves are notable and USD/JPY is having a look at the post-BOJ lows.\nIt's certainly not only the yen though as cable is at the best levels in 14 weeks and is further pressing higher. From Monday's low, it's up 230 pips and has been lifted by hawkish comments from Greene, along with stronger retail sales and PMI beats.\nThe week ahead is also a big one as Trump is likely to name a new Fed chief. There are risks around US equity flows as well with all the megacap tech names reporting earnings.\nThe rule of thumb on the Fed decision is that Kevin Warsh or Kevin Hassett (particularly the latter) would be dollar negative while Rick Rieder or Chris Waller would be dollar supportive.\nWe also get a proper Fed decision on Wednesday, though the market is pricing in virtually no likelihood of a rate cut, and no cut is fully priced in until July. The Fed wants to wait and see how the economy develops as we get mixed indications on growth. Airlines have reported high spending in premium segments but today, railroad CSX had a downbeat view on 2026 freight volumes and overall macro.\nInflation appears to be trending down but there is still some angst about how inflation plays out."
            }
        ]
    },
    {
        "asset_name": "Silver",
        "symbol": "EIGHTCAP:XAGUSD",
        "status": "Success",
        "data": {
            "day_range": "5.802",
            "open": "92.992",
            "close": "96.082",
            "high": "96.586",
            "low": "90.784"
        },
        "market_summary": "### Silver (XAG/USD) Market Briefing\n\n* **Key Drivers:** Rising geopolitical tensions, economic uncertainty, and a **weaker US dollar** are fueling **bullish momentum**. The **gold-silver ratio** has dropped to its lowest level since 2011, at just above **50**.\n* **Price Action:** Surged past the **$100** per ounce mark, with a **220%** year-on-year increase, outperforming **gold**. Current price is **$99.72** per ounce as of January 23, 2026.\n* **Technical Outlook:** Immediate support is near the **$90** level, with resistance at **$110**. The market is in a **persistent deficit**, driven by strong **industrial demand** and limited **mine supply growth**.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Silver Price Surges Past US$100, Hitting Triple-Digit Territory - Investing News Network",
                "source": "Investing News Network",
                "url": "https://investingnews.com/silver-price-surges/",
                "body": "Silver Price Surges Past US$100, Hitting Triple-Digit Territory\nThe silver price hit yet another a new record, pushing past US$100 per ounce.\nThe silver price hit a new all-time high on Friday (January 23), rising as high as US$100.87 per ounce.\nThe white metal's most recent rise continues a breakout that began earlier this month on a mixed bag of economic uncertainty, rising geopolitical tensions in Venezuela and Iran and underlying industrial demand strength.\nAdding fuel to the fire this week are US President Donald Trump's comments about Greenland.\nOn January 17, Trump said on his social media platform Truth Social he would place tariffs on Denmark and seven other European countries until a deal was reached for the US to purchase Greenland.\nThe statement raised hackles in Europe, and Trump ultimately removed the tariff threat, saying the US will not use force to take control of Greenland. However, the president also said he's reached a deal framework with NATO regarding Greenland's future; details about the deal have not been released at this time.\nTensions between Trump and US Federal Reserve are also providing support for silver, which like gold acts as a safe haven in times of turmoil. On January 9, the US Department of Justice served the Fed with grand jury subpoenas, threatening a criminal indictment over Chair Jerome Powell's testimony to the Senate Banking Committee this past June.\nTrump denied knowledge of the investigation, but the move has still reignited concerns about Fed independence, with Powell linking it to the Fed's refusal to lower interest rates as quickly as Trump would like.\nPowell's term as Fed chair ends in May, but two years still remain on his term as a governor of the board.\nTarget rate probabilities for January Fed meeting.\nChart via CME Group.\nThe Fed's next rate announcement is set for January 28, and CME Group's (NASDAQ:CME) FedWatch tool shows strong expectations for a hold. That's despite core consumer price index (CPI) data showing that inflation rose by a lower-than-expected 0.2 percent for December. On an annual basis, core CPI was up 2.6 percent.\nTrump has frequently criticized Powell for not lowering rates quickly enough, and Powell's replacement, who has not yet been announced, is widely expected to be more in line with Trump's views.\n“We see increased interference with the Fed as a key bullish wildcard for the precious metals in 2026,” Carsten Menke, head of next-generation research at Julius Baer Group, told Bloomberg. He noted that because silver is a smaller market than gold, it typically reacts “more strongly to such concerns.”\nSilver price chart, January 15 to 23, 2026.\nChart via the Investing News Network.\nSilver and its sister metal gold tend to fare better when rates are lower, meaning rate cut expectations coupled with the investigation of Powell and the Fed have helped to stoke prices for the precious metals.\nWhile silver is known for lagging behind gold before outperforming, it's now ahead in terms of percentage gains — silver is up about 220 percent year-on-year, while gold has risen around 78 percent.\nThe yellow metal also hit a new all-time high on Friday, peaking at US$4,987.28 per ounce.\nIn addition to rate-related factors, silver's breakout this year has been driven by various other elements.\nAs a precious metal, it's influenced by many of the same factors as gold, but its October price jump, which took it past the US$50 level, was also driven by a lack of liquidity in the London market.\nWhile that issue appears to have resolved, silver remains in a multi-year supply deficit. Tariff concerns and silver's new status as a critical mineral in the US have also provided support.\nIn addition to its appeal as a precious metal, silver's industrial side shouldn't be forgotten — according to the Silver Institute, the white metal's \"global silver industrial demand is poised to grow further as demand from vital technology sectors accelerates over the next five years. Sectors such "
            },
            {
                "title": "What is the price of silver today? - CBS News",
                "source": "CBS News",
                "url": "https://www.cbsnews.com/news/what-is-the-price-of-silver-today/",
                "body": "What is the price of silver today?\nIn recent years, with inflation problematic and higher interest rates impacting investors of all types, many turned to gold for protection and portfolio diversification. And the yellow metal subsequently surged in price, surpassing numerous price records on its way toward the $5,000 per ounce mark. But another precious metal has quietly but impressively grown at the same time: silver.\nLong considered the cost-effective precious metal alternative to gold, the price of silver has surged recently and is now up by more than 200% from where it sat in January 2025. And that remarkable growth could easily continue in the weeks and months ahead, especially if certain economic conditions are met. This potential can be both daunting and encouraging for prospective investors – and advantageous for those who are already invested in the metal or considering adding more to their portfolio right now.\nTo better determine the value of investing in silver now, it helps to know where the price currently stands. So, what is the price of silver per ounce now? That's what we'll outline below (and explain why getting invested now could make the most sense).\nProtect your portfolio with gold and silver here now.\nWhat is the price of silver today?\nThe price of silver is $99.72 per ounce as of January 23, 2026, according to American Hartford Gold, a precious metals dealer. That's up dramatically from just $31 for the same amount of metal in January 2025. So the price growth here is unmistakable and, for investors who have been priced out of the gold market entirely, this could be the smart (and affordable) way to get invested in precious metals now.\nWaiting for the price to decline is generally not advisable. While silver prices can be more volatile than gold, over time, they tend to only increase, so waiting for a temporary drop in the price could be an expensive mistake worth avoiding.\nGet started with a silver investment today.\nWhy should you invest in silver now?\nWhile not identical, the benefits of silver investing are similar to those gold offers. Thanks to a consistent price, particularly during inflationary periods, silver can help your portfolio hedge against the corrosive impacts of inflation in a way that other assets cannot. Accordingly, it can help function as a critical diversifier for those whose portfolios are otherwise too heavily made up of stocks, bonds, real estate or other investment types.\nAnd while gold and silver aren't typically considered income-producing assets, a quick glance at the price chart for either over the past year illustrates that, right now at least, both may be able to be sold for a rapid profit. Still, with industrial demand for silver expected to remain powerful, waiting around to invest may not make sense, either. Instead, consider speaking with a financial advisor or precious metal company that can answer any questions you may have and help you determine the exact role silver can play in your portfolio now.\nThe bottom line\nThe price of silver per ounce currently sits just under $100 per ounce. That said, this is the price for the metal before any dealer mark-ups, which can easily cause the price to rise considerably higher. So, if you need the inflation hedge and portfolio diversification the metal represents and don't want to pay the exorbitant price you'd otherwise have to in order to secure the same benefits with gold, it could make sense to get started with the metal this month. Just be sure to keep silver as a critical but limited portion of your overall portfolio, typically capped at 10% or less, to avoid overcrowding your other assets at the same time."
            },
            {
                "title": "Silver hits $100/oz for the first time - ING THINK economic and financial analysis | ING THINK",
                "source": "ING THINK economic and financial analysis | ING THINK",
                "url": "https://think.ing.com/articles/silver-hits-100-oz-for-the-first-time/",
                "body": "Silver hits $100/oz for the first time\nSilver has just broken above the $100/oz mark for the first time, extending an exceptional rally\nPrices surged nearly 150% last year, with a further 40% increase year‑to‑date, significantly outperforming gold. This strength reflects both resilient safe‑haven flows and robust industrial demand, pushing the gold-silver ratio to just above 50 - its lowest level since 2011. Silver’s higher volatility relative to gold, driven by its smaller market size and dual role as both an industrial and investment metal, has amplified recent moves.\nSupport for silver has been reinforced by a weaker US dollar, lower real yields, and stronger investor appetite for hard assets amid heightened policy uncertainty. Silver has also been boosted by a historic short squeeze and strong retail buying. At the same time, industrial demand - particularly from solar, electrification, and grid infrastructure investment - has tightened the physical market at a time when mine supply growth remains limited. With most silver produced as a by‑product of other metals, the sector is unable to respond quickly to higher prices, leaving the market in a persistent deficit that continues to underpin the bullish narrative.\nRisks do remain though. A sharper global slowdown or sustained high prices could trigger demand destruction, especially across industrial sectors. Silver’s inherent volatility also means it can overshoot in both directions.\nDespite these risks, the broader setup remains constructive. Strong industrial demand, tight physical balances, and solid investor interest continue to support the market. Silver is benefiting simultaneously from its precious metal momentum and industrial strength - a rare combination that continues to define this cycle.\nMeanwhile, gold is nearing the key $5,000/oz level, extending a blistering rally, surging a further 14% this year, supported by a weaker dollar, escalating geopolitical concerns, continued central bank buying, and mounting worries over the Federal Reserve’s independence.\nThis publication has been prepared by ING solely for information purposes irrespective of a particular user's means, financial situation or investment objectives. The information does not constitute investment recommendation, and nor is it investment, legal or tax advice or an offer or solicitation to purchase or sell any financial instrument. Read more\nDownload\nDownload article"
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.765",
            "open": "65.187",
            "close": "64.345",
            "high": "65.437",
            "low": "63.672"
        },
        "market_summary": "### Spot Brent Crude Oil Market Briefing\n\n* **Key Drivers:** Geopolitical tensions in the Middle East and potential US influence over Venezuelan oil production are **bullish** factors, while **OPEC** output increases may lead to **bearish** pressure.\n* **Price Action:** Rebounded from previous losses after President Trump announced an \"armada\" of warships to the Middle East, with **$70** acting as a key psychological level.\n* **Technical Outlook:** Immediate support is near the 50-day moving average at **$65**, with resistance at **$75**.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "Crude oil bounces as Trump says 'armada' headed for Iran, rekindling Middle East fears - Seeking Alpha",
                "source": "Seeking Alpha",
                "url": "https://seekingalpha.com/news/4542252-crude-oil-bounces-as-trump-says-armada-headed-for-iran-rekindling-middle-east-fears",
                "body": "Oil futures rebounded Friday from the previous session's losses after President Trump said the U.S. is sending an \"armada\" of warships to the Middle East that is set to arrive in the coming days and announced additional sanctions on vessels\nOil futures rebounded Friday from the previous session's losses after President Trump said the U.S. is sending an \"armada\" of warships to the Middle East that is set to arrive in the coming days and announced additional sanctions on vessels"
            },
            {
                "title": "SLB Predicts Worst Is Behind Global Oil Market as OPEC Output to Climb - Bloomberg",
                "source": "Bloomberg",
                "url": "https://www.bloomberg.com/news/articles/2026-01-23/slb-predicts-worst-is-behind-global-oil-market-as-opec-output-to-recover",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            },
            {
                "title": "A US Capture of Venezuelan Oil Could Come at OPEC’s Expense - arabcenterdc.org",
                "source": "arabcenterdc.org",
                "url": "https://arabcenterdc.org/resource/a-us-capture-of-venezuelan-oil-could-come-at-opecs-expense/",
                "body": "The Organization of Petroleum Exporting Countries (OPEC) has a checkered relationship with American oil companies. In the 1970s, OPEC member states pushed the likes of Exxon, Chevron, Shell, and BP—part of what has been dubbed Big Oil—out of the developing world, seizing their concessions and handing them over to their own national oil companies. In the decades since, however, OPEC has quietly become a friend to Big Oil. OPEC has used its market power to keep prices high, making it profitable for North American and European companies to develop their own oil that was often expensive to produce, such as crudes lifted by deepwater rigs, fracked from shale, or melted from solid bitumen.\nFrom one perspective, the US capture of Venezuelan leader Nicolas Maduro, and its apparent capture of the oil sector of a founding member of OPEC, looks like a bid to reclaim Washington’s lost influence over the global oil supply. Thus, the Trump administration’s assault on climate action and cleaner substitutes such as electric vehicles and renewable energy may represent a complementary policy to sustain oil demand. While closer alignment between US and Venezuelan production may eventually undercut OPEC’s market power, Trump’s rollback of climate policy may ultimately reinforce global demand for oil in ways that the cartel is well placed to exploit.\nForeign Investors and Energy Nationalists\nIt is unlikely that the Trump administration’s urging of international oil companies (IOCs) to restart investment in Venezuela will move the needle on supply much in the short term. In the longer term, however, US influence on Venezuelan oil suggests the potential for a larger American role in the global oil market. OPEC has yet to react publicly, although it is certainly paying close attention to any potential challenge to its dominant position.\nPresident Donald Trump has said that he aims to “take back” control of natural resources that US firms lost to Venezuela in past decades. In 1976, the Venezuelan government cancelled the concessions of Exxon, Gulf, Mobil, Texaco, Chevron, and Arco seven years early, albeit with compensation. The 1976 nationalization was the culmination of taxation changes that started in 1958 (by some accounts earlier) and that saw the Venezuelan state tilt the terms ever more deeply in its favor. In further nationalizations between 2005 and 2007, ConocoPhillips and Exxon pulled out rather than acquiesce to the Venezuelan government’s punitive changes in terms. Outstanding claims against Venezuela exceed $10 billion for ConocoPhillips and $1.5 billion for ExxonMobil. Other companies, notably Chevron, accepted the new terms and stayed, which is why Chevron is now in pole position to lead any recovery in Venezuela. These past bouts of energy nationalism are partly behind the reluctance of Exxon and other foreign investors to get back into the country.\nToday, Venezuela is considered still one of the riskiest countries for investors.\nToday, Venezuela is considered still one of the riskiest countries for investors. In 2021, the most recent year for which the Fraser Institute (a prominent Canadian thinktank) polled mining firms to rank the country’s investment attractiveness, Venezuela came in 76th out of 84 nations. In 1970, it ranked near the top of the list of free economies. With Washington claiming influence over Venezuela—holder of the world’s largest oil reserves—will investment risks decline to reasonable levels?\nCredible analysis finds that supply from Venezuela is likely to rise by roughly 500,000 barrels/day over the next year or two, likely through such companies as Chevron, Spain’s Repsol, Italy’s ENI, and France’s Maurel & Prom, which have all applied for US authorization to export oil from the country. For context, that amount is about as much as is produced per day in the North Sea oilfields. Such an increase would push Venezuelan production to around 1.4 million barrels/day, almost as much as Nigeria.\nFurther gains—beyond t"
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.840",
            "open": "60.763",
            "close": "59.773",
            "high": "60.913",
            "low": "59.073"
        },
        "market_summary": "### Spot WTI Crude Oil Market Briefing\n* **Key Drivers:** OPEC output is expected to climb, with SLB predicting the worst is behind the global oil market. Additionally, the potential US capture of Venezuelan oil could come at OPEC's expense, potentially **undercutting** OPEC's market power.\n* **Price Action:** No specific price action mentioned in the articles, but the potential increase in supply from Venezuela and diversification of crude supply by Indian refiners could impact **price levels**.\n* **Technical Outlook:** No specific technical outlook mentioned in the articles, but the increase in supply and potential changes in global demand could affect the **technical indicators** of Spot WTI Crude Oil, including support and resistance levels, such as **$70** or **$80** per barrel.\n\n--- \n**Overall Sentiment:** **Neutral** 📊",
        "source_articles": [
            {
                "title": "SLB Predicts Worst Is Behind Global Oil Market as OPEC Output to Climb - Bloomberg",
                "source": "Bloomberg",
                "url": "https://www.bloomberg.com/news/articles/2026-01-23/slb-predicts-worst-is-behind-global-oil-market-as-opec-output-to-recover",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            },
            {
                "title": "A US Capture of Venezuelan Oil Could Come at OPEC’s Expense - arabcenterdc.org",
                "source": "arabcenterdc.org",
                "url": "https://arabcenterdc.org/resource/a-us-capture-of-venezuelan-oil-could-come-at-opecs-expense/",
                "body": "The Organization of Petroleum Exporting Countries (OPEC) has a checkered relationship with American oil companies. In the 1970s, OPEC member states pushed the likes of Exxon, Chevron, Shell, and BP—part of what has been dubbed Big Oil—out of the developing world, seizing their concessions and handing them over to their own national oil companies. In the decades since, however, OPEC has quietly become a friend to Big Oil. OPEC has used its market power to keep prices high, making it profitable for North American and European companies to develop their own oil that was often expensive to produce, such as crudes lifted by deepwater rigs, fracked from shale, or melted from solid bitumen.\nFrom one perspective, the US capture of Venezuelan leader Nicolas Maduro, and its apparent capture of the oil sector of a founding member of OPEC, looks like a bid to reclaim Washington’s lost influence over the global oil supply. Thus, the Trump administration’s assault on climate action and cleaner substitutes such as electric vehicles and renewable energy may represent a complementary policy to sustain oil demand. While closer alignment between US and Venezuelan production may eventually undercut OPEC’s market power, Trump’s rollback of climate policy may ultimately reinforce global demand for oil in ways that the cartel is well placed to exploit.\nForeign Investors and Energy Nationalists\nIt is unlikely that the Trump administration’s urging of international oil companies (IOCs) to restart investment in Venezuela will move the needle on supply much in the short term. In the longer term, however, US influence on Venezuelan oil suggests the potential for a larger American role in the global oil market. OPEC has yet to react publicly, although it is certainly paying close attention to any potential challenge to its dominant position.\nPresident Donald Trump has said that he aims to “take back” control of natural resources that US firms lost to Venezuela in past decades. In 1976, the Venezuelan government cancelled the concessions of Exxon, Gulf, Mobil, Texaco, Chevron, and Arco seven years early, albeit with compensation. The 1976 nationalization was the culmination of taxation changes that started in 1958 (by some accounts earlier) and that saw the Venezuelan state tilt the terms ever more deeply in its favor. In further nationalizations between 2005 and 2007, ConocoPhillips and Exxon pulled out rather than acquiesce to the Venezuelan government’s punitive changes in terms. Outstanding claims against Venezuela exceed $10 billion for ConocoPhillips and $1.5 billion for ExxonMobil. Other companies, notably Chevron, accepted the new terms and stayed, which is why Chevron is now in pole position to lead any recovery in Venezuela. These past bouts of energy nationalism are partly behind the reluctance of Exxon and other foreign investors to get back into the country.\nToday, Venezuela is considered still one of the riskiest countries for investors.\nToday, Venezuela is considered still one of the riskiest countries for investors. In 2021, the most recent year for which the Fraser Institute (a prominent Canadian thinktank) polled mining firms to rank the country’s investment attractiveness, Venezuela came in 76th out of 84 nations. In 1970, it ranked near the top of the list of free economies. With Washington claiming influence over Venezuela—holder of the world’s largest oil reserves—will investment risks decline to reasonable levels?\nCredible analysis finds that supply from Venezuela is likely to rise by roughly 500,000 barrels/day over the next year or two, likely through such companies as Chevron, Spain’s Repsol, Italy’s ENI, and France’s Maurel & Prom, which have all applied for US authorization to export oil from the country. For context, that amount is about as much as is produced per day in the North Sea oilfields. Such an increase would push Venezuelan production to around 1.4 million barrels/day, almost as much as Nigeria.\nFurther gains—beyond t"
            },
            {
                "title": "Indian Refiner BPCL to Sign $780 Million Oil Supply Deal With Petrobras - Crude Oil Prices Today | OilPrice.com",
                "source": "Crude Oil Prices Today | OilPrice.com",
                "url": "https://oilprice.com/Latest-Energy-News/World-News/Indian-Refiner-BPCL-to-Sign-780-Million-Oil-Supply-Deal-With-Petrobras.html",
                "body": "Canadian Prime Minister Mark Carney…\n\"It's most important 8 minute read of my week…\"\nIndia’s state-owned refiner Bharat Petroleum Corporation Limited (BPCL) is set to sign next week an oil supply deal with Brazilian state giant Petrobras for the delivery of 12 million barrels of crude, valued at about $780 million.\nThe signing of the agreement is expected to take place during the India Energy Week 2026 forum, which will be held between January 27 and January 30 in Goa, the Indian government said in a statement on Friday carried by Reuters.\nIndian refiners, including BPCL, are looking to diversify their crude supply as the U.S. sanctions on Russia’s top oil producers, Rosneft and Lukoil, forced the world’s third-largest crude importer to seek alternatives to a large volume of the Russian crude it had previously bought.\nIn October, Petrobras signed an oil sales contract with another Indian state-owned refiner, Hindustan Petroleum Corporation (HPCL). The contract provides for the delivery of up to six million barrels of oil and is valid for one year.\nEarlier this week, refining and trade sources told Reuters that BPCL had awarded tenders to buy Iraqi and Omani crude on the spot market, as India’s refiners are raising supply of crude from the Middle East to offset in part the volumes they lost from Russia following the U.S. sanctions.\nAll Indian refiners have said they would comply with the U.S. sanctions on Rosneft and Lukoil, and Russian supply to India has now plunged to a three-year low.\nAdditionally, BPCL is scouring the market for spot cargoes of Murban crude from the United Arab Emirates (UAE) in a separate tender, according to Reuters’ sources.\nOver the past weeks, India’s refiners have significantly raised purchases of non-Russian oil supplies as they want to avoid angering the United States amid difficult India-U.S. trade negotiations.\nThe biggest state refiner, Indian Oil Corporation, is also said to have bought several crude oil cargos from Angola, Brazil, and the UAE to replace Russian barrels under sanctions.\nBy Tsvetana Paraskova for Oilprice.com\nMore Top Reads From Oilprice.com\nADVERTISEMENT\nTsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews."
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0086",
            "open": "1.1680",
            "close": "1.1754",
            "high": "1.1755",
            "low": "1.1670"
        },
        "market_summary": "### EUR/USD Market Briefing\n* **Key Drivers:** The EUR/USD has surged due to rumors of Japanese intervention in the FX market, which has significantly weakened the **US Dollar**. Additionally, **strained EU-US relations** and **policy divergence** between the Federal Reserve and the European Central Bank are supporting the **euro**.\n* **Price Action:** The pair has broken out above **1.1800**, showing strong **bullish momentum** after hitting a four-month high of **1.1826**. It is currently positioned just above **1.1730**.\n* **Technical Outlook:** Immediate resistance is noted around the **1.1765** area, with targets set beyond this level. The **23.6% retracement** from the recent study plots at **1.1717**, offering potential for higher-low support. Other levels of note for pullbacks include **1.1748** and **1.1686**, along with the swing-low from yesterday at **1.1669**.\n--- \n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "EUR/USD soars above 1.1800 as Yen intervention rumors slam Dollar - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/eur-usd-soars-above-11800-as-yen-intervention-rumors-slam-dollar-202601232113",
                "body": "EUR/USD soars above 1.1800 as Yen intervention rumors slam Dollar\n- EUR/USD jumps over 0.70% as intervention rumors trigger aggressive US Dollar selling.\n- DXY sinks to September 2025 lows after reports of Fed-linked rate checks fuel market speculation.\n- Focus shifts to ECB speakers, Eurozone GDP, and the upcoming FOMC meeting for direction.\nEUR/USD registers solid gains late in the North American session on Friday after rumors of an intervention in the FX markets to boost the Japanese Yen sent the US Dollar (USD) sliding, with losses of over 0.70%, according to the US Dollar Index (DXY). This, despite the economic data being moderately positive on Friday. At the time of writing, the pair trades at 1.1811 after hitting a four-month high of 1.1826 earlier during the day.\nEuro rallies sharply as speculation of FX intervention sends the Dollar to multi-month lows\nA Bloomberg headline, “Yen jumps most since August as risk of intervention ramps up,” broke late during the session amid speculation that Japanese authorities could be preparing to intervene in the markets.\nThe Bloomberg story mentions “traders reported that the Federal Reserve Bank of New York had conducted a so-called rate check with major banks to ask for indicative exchange rates — a move that was seen as an indication it may be preparing to assist with another intervention.“\nConsequently, DXY, which measures the US currency value against other six, extended its losses to levels last seen in September 2025, down from 98.33, and lies at 97.53.\nUS economic data revealed that American consumer sentiment improved, according to a poll of the University of Michigan. Regarding business activity, S&P Global Flash Purchasing Managers Indices revealed signs of strength in the economy, yet S&P Chief Economist stated that economic growth for Q1 2026 in the US could decelerate further.\nIn Europe, HCOB Flash PMIs for the bloc were mixed, with the Composite and Services PMI dipping below estimates, while the Manufacturing PMI shows signs of a slight expansion.\nEconomic data for the next week\nThe schedule in Europe will feature Germany’s Business Climate and GfK Consumer. Gross Domestic Product (GDP) figures will be revealed for the bloc, Germany, Spain and France. Also, traders will eye speeches by European Central Bank (ECB) officials like Nagel, Lagarde, Elderson and Schnabel.\nIn the US, traders will focus on Durable Goods Orders, ADP Employment Change four-week average, the Federal Open Market Committee policy decision, and the subsequent press conference by Fed Chair Jerome Powell.\nDaily digest market movers: Euro appreciates as the Dollar collapses\n- The Consumer Sentiment of the University of Michigan on its final reading in December exceeded forecasts of 54, coming at 56.4. Joanne Hsu, the economist in charge, revealed that households remain pressured on purchasing power and are concerned about elevated prices and a weaker job market.\n- The survey revealed that inflation expectations have eased. One-year expectations slipped to 4.0% from 4.2%, while five-year expectations fell to 3.3% from 3.4%.\n- The S&P Global Composite PMI showed a modest uptick in December, rising to 52.8 from 52.7. However, Chris Williamson, Chief Business Economist at S&P Global Market Intelligence, warned that subdued new business growth across both manufacturing and services increases the risk that first-quarter growth could disappoint.\n- Eurozone flash PMI data showed a weak services sector in January, with the index declining to 51.9, below both December’s reading and market expectations. Earlier releases from Germany surprised to the upside, with the Services PMI exceeding estimates in expansionary territory, while the Manufacturing PMI showed improvements, but remains below the expansion/contraction level.\nEuro Price This week\nThe table below shows the percentage change of Euro (EUR) against listed major currencies this week. Euro was the strongest against the US Dollar.\nThe heat map shows perce"
            },
            {
                "title": "USD Breaks Down as USD/JPY Snaps Back: EUR/USD, GBP/USD - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en/news-and-analysis/usd-breaks-down-as-usd-jpy-snaps-back-eur-usd-gbp-usd/?amp=true",
                "body": "USD Breaks Down as USD/JPY Snaps Back: EUR/USD, GBP/USD\nUS Dollar Drops with Aggression\nWith just a few hours to go until the close the US Dollar is down by more than 1.6% on the week, which would mark the largest weekly sell-off for the currency since May, just before the swing-low was set on the first day of Q3.\nThe week opened with fear around heightened tariffs after President Trump ramped up tensions over last weekend and I had warned that something of this nature could show in last Friday’s video. In the article last Friday, I had highlighted EUR/USD grinding at a big spot of support of 1.1592 but I still held preference for USD-weakness against the British Pound, which has broken out in a big way so far this week.\nThis is helped along by a larger pullback in USD/JPY, which is driving on the back of both fears of more rate hikes from the BoJ and the possibility of intervention at the 160.00 level as it seems the bank wants to set a line-in-the-sand for speculators. This doesn’t necessarily mean that reversal is near but given the change of pace it is something that needs to be monitored in early trade next week.\nThat said – we’re at the point now where we can see what USD bears are made of. It’s simple to be bearish at highs or near resistance, but what ultimately will make the trend is whether bears can push while near support or lows, as lower-lows are necessary for downside continuation. And that’s really been the missing piece for the past almost seven months now, after the sell-off in the Dollar stalled on the first day of Q3 and H2, 2025.\nUS Dollar Weekly Chart\nChart prepared by James Stanley; data derived from Tradingview\nEUR/USD\nThe mirror image of that six months of stall following a clean trend last year is EUR/USD, which is now testing a breakout from a symmetrical triangle and bull pennant formation. The 1.2000 level looms large here as buyers shied away from a test of that level last September, again, right when the Fed cut rates. But there’s also a lower-high from that at 1.1804 which is what I’m looking at as next resistance, and given shorter-term structure, there’s backdrop for trend continuation that I’ll look at a little lower.\nEUR/USD Weekly Chart\nChart prepared by James Stanley; data derived from Tradingview\nEUR/USD Shorter-Term\nAs I said in the Tuesday webinar my preference for USD-weakness remains GBP/USD and as a comparison, Cable is already at a fresh high which speaks to that. But – if we are going to see a legitimate trend build in the US Dollar it’s the Euro that it will need some help from, as the single currency is a whopping 57.6% of the DXY basket.\nIf looking to work with the move, chasing this breakout test, particularly when so close to a prior lower-high, can be a challenge. Instead, there’s a few levels of note for pullbacks that can at least allow for more cogent risk management on continuation scenarios.\nIn last Friday’s article I looked at the 1.1592 level that was in-play at the time, and this was notable as it’s a Fibonacci level related to the 1.1492 price that helped to set the lows back in November. Now – the 23.6% retracement from that same study plots at 1.1717, and this is an area for higher-low support potential. There are also longer-term Fibonacci levels at 1.1748 and 1.1686, along with the swing-low from yesterday at 1.1669.\nEUR/USD Four-Hour Chart\nChart prepared by James Stanley; data derived from Tradingview\nGBP/USD\nI still prefer GBP/USD for USD-weakness scenarios and the way the pair has traded over the past couple of weeks keeps that alive. When USD-strength was running into the end of last week, GBP/USD was building a falling wedge formation. That began to breakout earlier this week, helped along by the initial dash of USD-weakness.\nI looked at an updated setup in the webinar on Tuesday, getting more detailed with the four-hour chart to show how the trend could be worked with after the initial breakout, and the 1.3414 Fibonacci level came in cleanly as support that"
            },
            {
                "title": "Positioned just above 1.1730, EUR/USD maintains its recent gains, anticipating US flash PMIs - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/positioned-just-above-1-1730-eur-usd-maintains-its-recent-gains-anticipating-us-flash-pmis/",
                "body": "EU-US Strained Relations Impact\nEurozone flash PMIs displayed mixed results with services expanding. Manufacturing PMI showed some improvement but remained below the 50-mark, signalling contraction. US economic data supports a steady interest rate outlook from the Federal Reserve, with Q3 GDP revised upward and inflationary pressures noted in November.\nEUR/USD remains within specific Fibonacci retracement levels. The pair holds a mild positive momentum, with technical indicators hinting at a bullish tendency. Resistance is noted around the 1.1765 area, with targets set beyond this level.\nPolitical Sentiment Over Economic Fundamentals\nGiven the US dollar’s weakness despite strong economic data, we believe the market is being driven more by political sentiment than by fundamentals. The current EUR/USD strength is a direct result of strained transatlantic relations, and this trend is likely to continue in the near term. Therefore, traders should be cautious about betting on a dollar rebound based on economic figures alone.\nThis geopolitical risk has pushed currency volatility to levels we haven’t seen in some time. The Cboe EuroCurrency Volatility Index (EVZ), for instance, touched a 10-month high of 9.8 just last week, up from an average of 6.5 throughout the last quarter of 2025. This elevated volatility suggests that options strategies designed to profit from large price swings could be more effective than placing simple directional bets.\nThe policy divergence between the central banks is also becoming a key factor supporting the euro. While the Fed is holding steady, we recall European Central Bank officials in December 2025 hinting at a more aggressive stance on inflation, which the market interpreted as hawkish. This contrasts with the Fed’s current wait-and-see approach, making the euro fundamentally more attractive.\nWe have seen this pattern before, particularly during the trade tariff disputes in 2024, when political headlines repeatedly overrode economic data releases. In such an environment, the dollar remained weak for extended periods even when US growth was outpacing Europe’s. History suggests that until these political tensions with the EU are clearly resolved, the path of least resistance for the dollar is down.\nFor the coming weeks, we see value in buying EUR/USD call options to capitalize on further upside while limiting risk. Given the high volatility, strategies like a bull call spread could help reduce the upfront premium cost. A break above the key 1.1765 resistance level could trigger a quick move towards the 1.1800 handle.\nToday’s upcoming US PMI data release will be a crucial test of this market dynamic. A stronger-than-expected reading might fail to lift the dollar if sentiment remains negative, confirming the political theme’s dominance. However, a miss on the data could significantly accelerate the EUR/USD rally, as it would align weak data with the existing bearish dollar sentiment."
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0105",
            "open": "1.3425",
            "close": "1.3498",
            "high": "1.3506",
            "low": "1.3401"
        },
        "market_summary": "### GBP/USD Market Briefing\n* **Key Drivers:** Unexpected improvements in UK Retail Sales and PMIs have led to a surge in the **GBP/USD** exchange rate, bolstering the outlook for a less **dovish** stance from the Bank of England. Meanwhile, **US inflation expectations** and mixed US labor data contribute to **Fed uncertainty**, affecting the dollar's value.\n* **Price Action:** The **GBP/USD** exchange rate has risen above **1.3540**, showing significant **bullish momentum**. The pair is currently trading around **1.3490**, with immediate resistance at **1.3560** and support at **1.3445**.\n* **Technical Outlook:** Immediate support is near the **1.3452** level, with resistance at **1.3788**. The **50-EMA** and **200-EMA** are key indicators to watch, as the pair's movement is influenced by these technical levels. A break above **1.3600** could lead to further gains, while a drop below **1.3400** may signal a reversal.\n\n--- \n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "With unexpected improvements in UK Retail Sales and PMIs, GBP/USD rises above 1.3540 during trading - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/with-unexpected-improvements-in-uk-retail-sales-and-pmis-gbp-usd-rises-above-1-3540-during-trading/",
                "body": "The GBP/USD exchange rate surged past 1.3540 as UK Retail Sales and PMIs posted unexpectedly positive results. Retail Sales increased by 0.4% month-over-month in December, surpassing forecasts of a 0.1% decline, while annual sales rose from 1.8% to 2.5%, outperforming expected growth of 1%.\nBusiness activity in the UK showed marked improvement in January, with Services and Composite PMIs rising to 54.3 and 53.9, respectively. This bolstered the outlook for a less dovish stance from the Bank of England, affecting traders’ expectations of interest rate cuts.\nConsumer Sentiment and Inflation in the US\nIn the United States, the final reading of the University of Michigan Consumer Sentiment for January climbed to a five-month high of 56.4, higher than anticipated. US inflation expectations dipped slightly, reflecting a one-year forecast of 4% and a five-year projection of 3.3%.\nA technical outlook for GBP/USD suggests potential further gains, with resistance at 1.3788 and support levels starting at 1.3452. The Bank of England’s policy decisions, based on price stability and inflation, play a major role in the currency’s value. Economic indicators like GDP and the trade balance also impact the Pound.\nBased on this positive UK economic data, we should anticipate the Bank of England will be less likely to cut interest rates soon. The surprise strength in retail sales and business activity reduces the pressure on them to ease monetary policy. Consequently, traders are now pricing in fewer rate cuts for this year, which is a bullish signal for the Pound.\nThis trend is further supported by the latest inflation figures we have seen from the Office for National Statistics. With the UK’s core Consumer Price Index (CPI) still elevated at 3.9%, well above the BoE’s 2% target, Governor Greene’s concerns about wage growth seem justified. This persistent inflation gives the central bank more reason to keep rates higher for longer compared to its peers.\nUS Economic Outlook and Market Impact\nOn the other side of the pair, the US economy presents a more mixed picture, creating a clear policy divergence. While US consumer sentiment has improved, recent figures from the Bureau of Labor Statistics show a slight uptick in weekly jobless claims, hinting at a softening labor market. The CME FedWatch Tool indicates that markets are still aggressively pricing in over 100 basis points of interest rate cuts from the Federal Reserve in 2026, a stance that weakens the US Dollar.\nFor derivatives traders, this suggests positioning for a continued rise in the GBP/USD exchange rate, especially if it can decisively break the 1.3600 level. Buying call options on GBP/USD or implementing bullish call spreads could be effective strategies to capitalize on this expected upward momentum. The key is the growing gap between a reluctant Bank of England and a Federal Reserve that is expected to start cutting rates.\nWe saw a similar dynamic unfold back in 2023 when expectations of faster BoE rate hikes relative to the Fed caused GBP/USD to rally significantly over several months. That historical pattern of policy divergence leading to Sterling strength appears to be re-emerging. Traders should watch the upcoming central bank meetings closely for any change in tone that could either accelerate or reverse this trend."
            },
            {
                "title": "US Dollar Price Forecast: DXY Slides on Fed Uncertainty – Are GBP/USD and EUR/USD Ready to Move? - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/us-dollar-price-forecast-dxy-slides-on-fed-uncertainty-are-gbp-usd-and-eur-usd-ready-to-move-1574577",
                "body": "The broad-based US dollar failed to stop its downward trend and remained under pressure on the day. As of now, the US Dollar Index (DXY), which measures the value of the Greenback against a basket of six major currencies, is hovering near a two-week low of 98.26.\nHowever, the reason for its bearish bias could be attributed to multiple factors, including the resolution of Greenland-related disputes, mixed US labor data, and ongoing speculation surrounding the Federal Reserve’s leadership and future policy direction.\nThe US Dollar initially gained some ground earlier in the week after a framework agreement on Greenland’s future was reached between the United States and the European Union. During a meeting between US President Donald Trump and NATO Secretary General Mark Rutte, both sides agreed on a framework addressing Greenland’s entitlements. In addition, President Trump lifted the 10% tariffs on several EU countries and made it clear that the US would not try to take Greenland by force.\nTherefore, these developments helped ease geopolitical concerns and gave the dollar a short-term boost, but it later fell again as markets worried about the Fed’s leadership and future policy plans.\nOn the data front, US labor market figures released by the Department of Labour also contributed to the mixed sentiment. Weekly initial jobless claims rose slightly to 200,000 for the week ending January 17, missing the initial estimate of 212,000 but marginally higher than the previous week’s revised figure of 199,000. Meanwhile, the four-week moving average decreased by 3,750 to 201,500. Continuing jobless claims also fell by 26,000 to 1.849 million for the week ending January 10.\nTherefore, the mixed US labor data added uncertainty for traders, limiting the US dollar’s gains, as slightly higher jobless claims and falling continuing claims signaled a stable but cautious economic outlook.\nThe US Dollar Index is trading around $98.45, attempting to stabilize after a sharp pullback from the $99.50 area. On the 2-hour chart, price recently tested a rising trendline near $98.25, where buyers stepped in, as shown by long lower candlestick wicks.\nThe structure has shifted into a short-term descending channel, while the broader uptrend remains intact above the trendline. Key support sits at $98.25–$98.00, followed by $97.77. On the upside, resistance aligns at $98.72, then $98.87, matching the 38.2% and 50% Fibonacci retracement zones.\nThe 200-EMA is acting as dynamic resistance, while RSI has rebounded from near-oversold levels, suggesting downside momentum is slowing.\nTrade idea: Buy on a hold above $98.25, target $98.85, stop below $97.95.\nGBP/USD is trading around $1.3490, struggling to extend gains after a rebound from the $1.3340 support zone. On the 2-hour chart, price has pushed above the 50-EMA but remains capped by a long-term descending trendline, keeping the broader structure mixed. Recent candlesticks show upper wicks near $1.3515, signaling selling interest at resistance.\nA horizontal resistance band sits between $1.3500–$1.3560, while support is layered at $1.3445, followed by $1.3400, where the 200-EMA and prior demand align. The move resembles a short-term range rather than a breakout. RSI is holding near 60, indicating improving momentum but not strong acceleration.\nTrade idea: Sell near $1.3500, target $1.3420, stop above $1.3560.\nEUR/USD is trading near $1.1730, pausing after a sharp rebound from the $1.1575 low. Price has broken out of a descending channel and is now moving within a short-term rising structure, but recent candlesticks show upper wicks near $1.1769, signaling supply.\nThe recovery has stalled around the 23.6% Fibonacci retracement at $1.1723, with higher resistance at $1.1769 and $1.1810. On the downside, former support at $1.1695 and $1.1672 aligns with the 38.2% and 50% Fib levels and the 200-EMA, forming a key demand zone. RSI has cooled from overbought territory toward 60, suggesting momentum is slowing but not re"
            },
            {
                "title": "Pound Sterling to Dollar Forecast: GBP/USD Tests Upper Ranges - CurrencyNews.co.uk",
                "source": "CurrencyNews.co.uk",
                "url": "https://www.currencynews.co.uk/forecast/20260123-45052_pound-sterling-to-dollar-forecast-gbp-usd-tests-upper-ranges.html",
                "body": "The Pound-to-Dollar exchange rate (GBP/USD) has pushed to 1.3535, as foreign exchange analysts at ING and MUFG argue that confidence in US policymaking has not fully recovered, keeping the risk of renewed “Sell America” flows alive despite calmer headlines.\nGBP/USD Forecasts: Tight Ranges\nThe Pound to Dollar (GBP/USD) exchange rate has been held in relatively narrow ranges and trading around 1.3440 after again finding support near 1.34 with Pound support from a boost to risk appetite offset by a firmer dollar.\nAccording to UoB; “we continue to expect range-trading today, most likely between 1.3400 and 1.3460.”\nGiven major global pressure points, it is dangerous to assume that narrow ranges will prevail.\nAccording to ING; “Some downside risks for the dollar persist: more volatility in JGBs spilling into Treasuries, scrutiny on upcoming US tech earnings, reignition in geopolitical/tariff risk. But the macro picture should favour a bit more dollar strength in the coming days, in our view.”\nRisk appetite secured an initial boost on Wednesday following President Trump’s comments that he would not use force to secure a deal on Greenland.\nSave on Your GBP/USD Transfer\nGet better rates and lower fees on your next international money transfer.\nCompare TorFX with top UK banks in seconds and see how much you could save.\nThere was a further boost to confidence after the European close after Trump stated that a deal on Greenland had been reached with NATO Secretary-General Rutte and that the threatened tariffs on eight European countries from February 1st would not go ahead.\nMarkets were concerned that US threats would trigger selling in US bonds and equities which would hurt the dollar. With the immediate threat easing, there was a rebound in the dollar.\nCommerzbank forex strategist Volkmar Baur commented; \"From a European perspective, it is too early to rejoice.\"\nHe added; “However, the most likely outcome is still that the next wave of excitement will pass us by after a brief period of volatility and that the market will refocus on central banks and interest rate differentials.\"\nING considers that attention will turn towards the Federal Reserve policy decision next week.\nAccording to the bank; “We discussed last week how Powell's fierce response to the criminal investigation signalled upside risks to the dollar, as he and other members could have turned more hawkish in a meeting without any rate change to reinforce the independence message.”\nThe Supreme Court also held a hearing on the US Administration case to dismiss Fed Governor Cook. The initial signs are that the court is not mindful to back Trump due to the threat to Fed independence.\nMUFG still sees dollar risks, but added; “The loss of confidence in US policymaking is likely to remain a headwind for the US dollar as we have seen at the start of this year. However, the risk of a sharper US dollar sell-off has diminished after President Trump’s quick climb down over Greenland, and early indications from the Supreme Court overnight that they are likely to rule against President Trump’s decision to fire Fed Governor Lisa Cook.”\nLike this piece? Please share with your friends and colleagues:\nInternational Money Transfer? Ask our resident FX expert a money transfer question or try John's new, free, no-obligation personal service! ,where he helps every step of the way,\nensuring you get the best exchange rates on your currency requirements."
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0091",
            "open": "0.6756",
            "close": "0.6839",
            "high": "0.6844",
            "low": "0.6753"
        },
        "market_summary": "### AUD/USD Market Briefing\n\n* **Key Drivers:** Stronger Australian jobs data and **PMI** figures are increasing bets on a **hawkish** Reserve Bank of Australia (**RBA**), while a weakening **US Dollar** due to increased risk aversion also supports the **AUD/USD**.\n* **Price Action:** Reached a **16-month high** of **0.6854**, showing significant **bullish momentum**, with the pair nearing its **2024 peak** of **0.6942**.\n* **Technical Outlook:** Immediate resistance is near the **2024 peak** at **0.6942**, with support at the recent breakout level of **0.6800**.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "RBA Rate Hike Looks Closer Than Ever After Surprise Jobs Data - Bloomberg",
                "source": "Bloomberg",
                "url": "https://www.bloomberg.com/news/newsletters/2026-01-22/rba-rate-hike-looms-canberra-s-political-chaos",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            },
            {
                "title": "Australian Dollar reaches 15-month highs following stronger PMI data - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/australian-dollar-strengthens-following-pmi-data-202601230229",
                "body": "Australian Dollar reaches 15-month highs following stronger PMI data\n- Australian Dollar hits a 15-month-high of 0.6854 on Friday.\n- Australia’s S&P Global Manufacturing PMI hit 52.4, while Services PMI rose to 56.0 in January.\n- The US economy expanded 4.4% in Q3, beating estimates, supported by stronger exports and a smaller inventory drag.\nThe Australian Dollar inches higher against the US Dollar (USD) on Friday, remaining in the positive territory for the second consecutive day. The AUD/USD pair holds ground following the preliminary reading of Australia's S&P Global Manufacturing Purchasing Managers Index (PMI), which came in at 52.4 in January versus 51.6 prior. Services PMI climbed to 56.0 in January from the previous reading of 51.1, while the Composite PMI climbed to 55.5 in January versus 51.0 prior.\nThe strong PMI data reinforced the likelihood of a tighter monetary policy from the Reserve Bank of Australia (RBA), supported by Thursday’s Australian employment data. Employment Change, which arrived at 65.2K in December, swung from 28.7K job losses (revised from 21.3K job losses in November, compared with the consensus forecast of 30K. Meanwhile, the Unemployment Rate declined to 4.1% from 4.3% prior, against the market consensus of 4.4%.\nThe AUD/USD pair also strengthened as the US Dollar weakened on increased risk aversion, which could be attributed to US-Greenland tensions. However, the sentiment improves slightly after US President Donald Trump reversed his stance after reaching a framework agreement with NATO for a possible future deal on Greenland.\nUS Dollar weakens ahead of PMI data\n- The US Dollar Index (DXY), which measures the value of the US Dollar against six major currencies, is holding ground and hovering around 98.30 at the time of writing. Traders await the preliminary reading of the US S&P Global Purchasing Managers Index (PMI), which will be released later on Friday.\n- The US Gross Domestic Product Annualized grew at 4.4% in the third quarter of 2025, slightly more than expected and the previous reading of 4.3%. Additionally, the Initial Jobless Claims came in at 200K last week, below the market consensus of 212K.\n- US Personal Consumption Expenditures (PCE) Price Index rose to 2.8% year-over-year in November from 2.7% in October. On a monthly basis, the PCE Price Index rose by 0.2%. The annual core PCE Price Index, the Federal Reserve's (Fed) preferred gauge of inflation, rose by 2.8% in November, following the 2.7% increase recorded in October and matching the market expectation.\n- US President Donald Trump said he would step back from imposing tariffs on goods from European nations opposing his effort to take possession of Greenland. He said earlier there is “no going back” on his ambitions regarding Greenland, alongside earlier threats to impose new 10% tariffs on eight European Union (EU) countries.\n- President Trump also said that the United States and the North Atlantic Treaty Organization (NATO) had “formed the framework of a future deal regarding Greenland.” However, he did not outline the parameters of the so-called framework, and it remained unclear what the agreement would entail.\n- Fed officials have signaled little urgency to ease policy further until there is clearer evidence that inflation is sustainably moving toward the 2% target. Morgan Stanley analysts revised their 2026 outlook, now forecasting one rate cut in June followed by another in September, compared with their previous expectation of cuts in January and April.\n- The People’s Bank of China (PBOC), China's central bank, announced on Tuesday that it would leave its Loan Prime Rates (LPRs) unchanged. The one-year and five-year LPRs were at 3.00% and 3.50%, respectively. It is essential to note that any changes in the Chinese economy could impact the Australian Dollar, as both countries are close trading partners.\n- The International Monetary Fund (IMF) has urged the RBA to remain cautious, highlighting that inflation has stay"
            },
            {
                "title": "Aussie Dollar Soars to 16-Month Peak - Sharecafe",
                "source": "Sharecafe",
                "url": "https://www.sharecafe.com.au/2026/01/23/aussie-dollar-soars-to-16-month-peak/",
                "body": "The Australian dollar reached a new 16-month high on Friday, hitting 68.53 US cents as financial markets increasingly anticipate interest rate rises later in the year. The Aussie dollar is nearing its 2024 peak of 69.42 US cents, recorded on September 30, and has increased by 2.3 US cents this week, marking its most significant weekly gain since early April 2023.\nMoney markets are currently pricing in a 61 per cent probability of a rate increase by the Reserve Bank of Australia (RBA) in February. The markets further suggest a fully priced move is expected by May. Market traders are also forecasting a continuation of the tightening cycle, indicating a 100 per cent certainty of an additional rate hike by the end of the year.\nThe Australian dollar also strengthened against other major currencies. It reached its highest level against the euro since April, trading at 58.31 euro cents. Against the Canadian dollar, it reached its strongest level since 2023, trading at 94.46 Canadian cents."
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "0.7130",
            "open": "158.2450",
            "close": "158.4040",
            "high": "158.8890",
            "low": "158.1760"
        },
        "market_summary": "### USD/JPY Market Briefing\n* **Key Drivers:** The Bank of Japan's (**BOJ**) decision to keep policy rates unchanged at **0.75%** and slightly **hawkish** tone, combined with Japan's political and fiscal risks, are influencing the **USD/JPY** forecast. \n* **Price Action:** The pair has seen two-way price movement after the BOJ announcement, initially gaining before tumbling on potential Ministry of Finance (**MoF**) intervention, and has since stabilized near the **160** level.\n* **Technical Outlook:** Immediate resistance is near the **160** level, with support potentially found at lower psychological levels if the **USD/JPY** pair breaks down due to increased **bearish** momentum.\n\n--- \n**Overall Sentiment:** Mildly **bullish** in the near term, primarily due to Japan's political uncertainty and rising bond yields, which could pressure the yen and support the **USD/JPY** pair. 📈",
        "source_articles": [
            {
                "title": "USD/JPY forecast: Forex Friday | January 26, 2025 - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/usd-jpy-forecast-forex-friday-january-26-2025/?amp=true",
                "body": "USD/JPY forecast: Forex Friday | January 26, 2025\n- USD/JPY forecast: The yen struggles to benefit from a slightly hawkish BoJ as political and fiscal risks dominate agenda\n- Japan’s bond market is becoming a growing source of pressure for JPY\n- Broader dollar weakness keeping USD/JPY pair steady - for now\nThe USD/JPY, and more noticeably other JPY pairs, have been quite strong in recent months, thanks the ongoing weakness in the yen. The USD/JPY is being pulled in opposite directions. On paper, the Bank of Japan is becoming more confident about growth and inflation, which should support the yen. In reality, political uncertainty and rising Japanese bond yields are undermining that narrative and keeping the USD/JPY forecast tilted to the upside. We may have seen some intervention from MoF post the BoJ meeting as the yen rallied after the initial drop. But the move has been quite contained and nothing’s confirmed.\nBOJ leaves policy unchanged\nThe BoJ left rates unchanged at 0.75%, striking a slightly more hawkish tone by upgrading both growth and inflation forecasts, and one member dissented by call for a hike. Governor Kazuo Ueda acknowledged that underlying inflation continues to grind higher. That matters because it keeps the door open for further tightening later this year.\nThe USD/JPY saw two-way price movement on the announcement. It initially gained during Ueda’s press conference, before tumbling on potential MoF activity. But the pair has since stabilised.\nMy base case is now a summer rate hike, although Ueda carefully avoided giving any strong forward guidance during his presser. He also declined to comment directly on the yen, focusing instead on inflation dynamics and how FX could influence price stability. In short, the BoJ looks more comfortable with the idea of higher rates, but it is still moving cautiously.\nPolitics and bonds are the real problem for JPY\nUnder normal circumstances, this BoJ meeting might have pushed USD/JPY lower. But Japan’s political and fiscal situation is dominating market psychology.\nPrime Minister Sanae Takaichi has dissolved the lower house ahead of the 8 February election, injecting some uncertainty into an already fragile fiscal backdrop. If Takaichi secures a strong mandate, investors fear policies that could further strain Japan’s public finances.\nThis concern is already visible in the bond market. The 40-year Japanese government bond yield this week surged to a record high, and overall JGB yields have seen their biggest swings since the original Trump trade war period. Although yields briefly eased, they are pushing higher again, and that is bad news for the yen.\nRising yields driven by fiscal risk are very different from rising yields driven by healthy growth. In this case, higher yields are being interpreted as a sign of deteriorating debt dynamics, which makes Japanese assets less attractive and puts pressure on JPY.\nAs long as this bond market story continues, it is difficult for the yen to benefit meaningfully from the BoJ’s slow shift toward tighter policy.\nDollar under mild pressure\nFrom the dollar side, it has been an interesting week after all the tariff-related volatility. However, volatility has already cooled, and the dollar has remained largely on the back foot, especially against commodity and emerging market currencies. We have also seen record highs for precious metals, which underscore the ongoing “dollar debasement” trade. Here, fears of a more politically influenced Fed is pushing investors towards gold and silver.\nBut against currencies with weak fiscal positions, the dollar stands ready to benefit, including against the yen. Recently we have also seen some strength is US activity data which could still delay Fed rate cuts and give the dollar support against the lower yielding yen.\nUSD/JPY forecast: Near-term upside, medium-term risks\nPutting it all together, the USD/JPY forecast remains mildly bullish in the near term, mainly due to political risk in Japan, rising"
            },
            {
                "title": "USD/JPY Today, January 24: BOJ Hold and Intervention Risk Jolt Yen - Meyka",
                "source": "Meyka",
                "url": "https://meyka.com/blog/usdjpy-today-january-24-boj-hold-and-intervention-risk-jolt-yen-2401/",
                "body": "USD/JPY Today, January 24: BOJ Hold and Intervention Risk Jolt Yen\nUSD/JPY is in focus today after the BOJ kept the policy rate at 0.75% and signaled a steady normalization path. Traders weigh yen intervention risk near the 160 level as a Japan snap election injects policy uncertainty. Volatility is high, with quick swings that challenge carry trades and corporate hedges. For Japan-based investors, the mix of central bank guidance, fiscal debate, and overseas rates sets the tone. We outline key risks, levels, and practical steps to manage exposure.\nWhat BOJ Hold Means for Yen and Rates\nThe BOJ’s hold at 0.75% keeps gradual tightening in view, while higher growth guidance suggests confidence in the recovery. Markets read this as a slow path, not a pause in intent. USD/JPY stayed sensitive around the 160 area as traders tested policy tolerance. For local investors, the message is to expect two-way moves, with each data point feeding the pace of normalization.\nAuthorities have signaled vigilance when moves turn disorderly. Recent spikes highlight rate check chatter and the possibility of action if volatility worsens. Bloomberg reported the yen’s biggest jump since August as intervention risk increased, underscoring headline sensitivity source. USD/JPY traders should respect liquidity pockets around Tokyo hours and the fix, where swings can accelerate.\nSnap Election and Policy Uncertainty\nA Japan snap election adds uncertainty on fiscal priorities, energy subsidies, and wage policy. Campaign pledges may shape growth and inflation expectations, which feed back into currency views. USD/JPY could whipsaw as investors handicap the size and timing of support packages. Watch whether parties emphasize cost-of-living relief or long-term capex, since that affects demand and external balances.\nPolicy risk can lift term premiums in JGBs, especially if investors expect larger deficits or faster demand. Higher long yields tighten local financial conditions, which can temper yen weakness. For USD/JPY, that means rallies may fade if JGB yields firm relative to U.S. peers. Keep an eye on auction results and investor demand from life insurers and pension funds.\nInvestor Playbook for Volatility\nExporters can ladder forwards and layer zero-cost collars to guard margins while keeping some upside. Importers can trim open USD payables, pre-hedge near known cash flows, and use call spreads to cap worst-case moves. Calibrate tenor to shipment cycles and invoice dates. For USD/JPY, set hedge ratios that reflect budget rates and the firm’s real FX pass-through.\nCarry trades face gap risk near event headlines and thin liquidity. Use defined stop-losses, maintain option protection, and size positions for higher realized vol. Diversify funding legs to reduce single-currency shocks. For USD/JPY, monitor cross-asset signals like JGB swaps and U.S. front-end moves. Avoid adding into spikes; scale only after volatility cools.\nKey Levels, Data, and Catalysts to Watch\nRound numbers attract options interest and dealer hedging, which can drive sharp, temporary breaks. Spot tests near 160 matter for sentiment and official tolerance. Track intraday behavior around the Tokyo fix and option cut. USD/JPY momentum often flips when liquidity improves in London hours, so avoid chasing moves if spreads widen or depth thins.\nFocus on BOJ communication, Tokyo CPI, wage signals, and U.S. rate expectations. CNBC noted the BOJ kept rates at 0.75% and raised growth forecasts ahead of the election source. For USD/JPY, pair these with U.S. data and Fed guidance. Calendar planning helps align hedge roll dates with key releases to reduce slippage.\nFinal Thoughts\nUSD/JPY sits at the center of Japan’s market story today. A BOJ hold at 0.75% with steady normalization, rising yen intervention risk near 160, and a snap election create a volatile mix. We suggest practical steps: set clear hedge ratios, ladder forward maturities, and use options to cap tail risk. Traders should respect liquid"
            },
            {
                "title": "USD/JPY: BOJ Stands Pat as Language Firms and Ueda Looms - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/analysis/usdjpy-boj-stands-pat-as-language-firms-and-ueda-looms-200673733",
                "body": "Stock market today: S&P 500 slips to second-weekly loss as Intel-led slump weigh\nThe BOJ delivered a fully expected hold with a single dissent and only modest forecast tweaks. With markets unmoved, attention turns to Ueda, where post-meeting dovishness could still matter for USD/JPY.\n- BOJ held rates at 0.75% in an expected 8–1 decision\n- Takata dissented again, but no broader support followed\n- Inflation language firmed while risks were judged balanced\n- Markets now look to Ueda for direction in USD/JPY\nPolicy Rate Holds at 0.75%\nThe Bank of Japan held policy steady in January, voting 8–1 to keep the overnight call rate around 0.75%, a decision fully expected by markets and economists. Takata was the sole dissenter, arguing that the price stability target had largely been achieved and that risks to prices were skewed to the upside, but with no support from other board members, the outcome was not read as hawkish. That contrasts with November, when both Takata and Tamura dissented ahead of December’s hike, a reminder that while broader dissent does not guarantee action, it is when the risk of a move starts to feel more live.\nInflation, Growth Forecasts Upgraded\nIn its updated forecasts, the bank left its core inflation projections for fiscal years 2025 and 2027 unchanged at 2.7% and 2% respectively, the latter consistent with its inflation mandate. The 2026 forecast was nudged up by a tenth to 1.9%. More notable adjustments were made to the alternative core measure that excludes fresh food and energy, with forecasts for 2025 and 2026 lifted by two tenths to 3% and 2.2% respectively. The 2027 projection was left unchanged at 2%, easing pressure to tighten policy aggressively by Japanese standards. The upward revisions to the nearer-term inflation outlook partly reflected firmer growth expectations, with real GDP forecasts for 2025 and 2026 raised by 0.2% and 0.3% to 0.9% and 1%, respectively.\nSource: BOJ\nAssessment Firms Post December Hike\nFollowing the decision to lift rates by 25bp to 0.75% in late December, there was a clear shift in tone in the latest Outlook for Economic Activity and Prices. On underlying inflation, the language was firmer than before. Previously, inflation was described as sluggish and closely tied to the pace of growth. That wording has gone. Now, underlying inflation is seen rising moderately, with wages and prices reinforcing each other, suggesting the bank is increasingly comfortable that inflation momentum can be sustained, even as policy continues to normalise.\nThe labour market narrative has also firmed relative to three months ago. Before the December hike, labour shortages were framed as something that would emerge later if growth improved. In the latest assessment, labour tightness is more clearly embedded in the inflation story, reinforcing the idea that wage pressures are no longer hypothetical and are starting to look more durable. That’s important. On risks, the earlier assessment that growth risks were skewed to the downside has been dropped, replaced by a broadly balanced view for both activity and prices.\nOn the external backdrop, the tone is noticeably calmer. Trade and overseas policy risks are still acknowledged, but they are no longer framed as dominant headwinds. Overseas growth is treated as stabilising, which helps explain why the bank appears comfortable letting policy normalisation proceed at a gradual pace.\nMarkets Unmoved, Ueda Awaits\nSource: Bloomberg\nThere was little reaction in the swaps market to the decision, outlook or updated forecasts, with another 25bp increase essentially deemed a lock by June with a second fully priced by December. That path would see the overnight rate lifted to 1.25%.\nSource: TradingView\nUSD/JPY was also relatively steady, holding onto earlier modest gains, while the JGB 2s10s curve continued to bull-flatten, fitting with the move seen in the run-up to the meeting. Attention now turns to Governor Ueda’s press conference, scheduled to begin at 3:30 "
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0062",
            "open": "1.3830",
            "close": "1.3784",
            "high": "1.3844",
            "low": "1.3782"
        },
        "market_summary": "### USD/CAD Market Briefing\n* **Key Drivers:** Strengthening **Canadian Retail Sales** data, steady **Oil prices**, and **broad USD weakness** are lifting the **Loonie**, while the **US Dollar** remains pressured by **policy uncertainty** and **Fed independence concerns**.\n* **Price Action:** USD/CAD has broken below **1.3840**, extending its decline, with the pair currently trading around **1.3767**, marking a **fifth consecutive daily decline** and showing **bearish momentum**.\n* **Technical Outlook:** Immediate support is near **1.3728**, with resistance at **1.3806**, **1.3875**, and **1.3932**. A break below **1.3728** could see the pair test the **December low** near **1.3643**.\n\n--- \n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "USD/CAD drifts lower as Canadian Retail Sales surprise to the upside - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-cad-drifts-lower-as-canadian-retail-sales-surprise-to-the-upside-202601231439",
                "body": "USD/CAD drifts lower as Canadian Retail Sales surprise to the upside\n- USD/CAD extends its decline as strong Canadian Retail Sales and broad USD weakness lift the Loonie.\n- US Dollar remains pressured by policy uncertainty and Fed independence concerns.\n- Focus shifts to US PMI data, UoM sentiment and next week’s BoC and Fed meetings.\nThe Canadian Dollar (CAD) extends gains against the US Dollar (USD) on Friday, supported by a broadly softer Greenback and stronger-than-expected Canadian Retail Sales data. At the time of writing, USD/CAD trades around 1.3767, marking a fifth consecutive daily decline.\nData released by Statistics Canada showed that Retail Sales rose 1.3% MoM in November, beating market expectations of 1.2% and rebounding sharply from October’s 0.3% decline.\nRetail Sales excluding autos were even stronger, climbing 1.7% on the month, above forecasts of 1.2%, after falling 0.6% in October.\nThe rebound in retail activity supports the Bank of Canada’s (BoC) wait-and-see approach after inflation data released earlier this week showed easing monthly price pressures, even as annual inflation remains sticky above the BoC’s 2% target. On a yearly basis, CPI accelerated to 2.4% in December from 2.2% in November, while the BoC’s core CPI measure eased slightly to 2.8% from 2.9%.\nMarkets widely expect the BoC to keep its policy rate unchanged at 2.25% at next week’s meeting. In its December policy statement, the BoC said that ‘if inflation and economic activity evolve broadly in line with the October projection, Governing Council sees the current policy rate at about the right level to keep inflation close to 2% while helping the economy through this period of structural adjustment.’\nThe central bank also stressed that ‘uncertainty remains elevated’ and added that if the outlook shifts materially, it stands ‘prepared to respond.’”\nSteady Oil prices add another layer of support to the Loonie, given Canada’s status as a major energy exporter. West Texas Intermediate (WTI) trades around $61 per barrel, up nearly 2.7% on the day.\nMeanwhile, the US Dollar remains under sustained pressure despite some easing in US-EU trade tensions, as President Trump’s protectionist trade agenda and growing interference with the Federal Reserve’s (Fed) independence continue to weigh on investor sentiment.\nPreliminary S&P Global Purchasing Managers Index (PMI) data showed Manufacturing PMI rising to 51.9 in January from 51.8, below expectations of 52.1, while Services PMI came in at 52.5, unchanged from December but below the 52.8 forecast.\nLooking ahead, traders await the release of the University of Michigan Consumer Sentiment survey, along with inflation expectations data. Markets are also widely expecting the Fed to keep interest rates unchanged at its January 27-28 monetary policy meeting.\nBank of Canada FAQs\nThe Bank of Canada (BoC), based in Ottawa, is the institution that sets interest rates and manages monetary policy for Canada. It does so at eight scheduled meetings a year and ad hoc emergency meetings that are held as required. The BoC primary mandate is to maintain price stability, which means keeping inflation at between 1-3%. Its main tool for achieving this is by raising or lowering interest rates. Relatively high interest rates will usually result in a stronger Canadian Dollar (CAD) and vice versa. Other tools used include quantitative easing and tightening.\nIn extreme situations, the Bank of Canada can enact a policy tool called Quantitative Easing. QE is the process by which the BoC prints Canadian Dollars for the purpose of buying assets – usually government or corporate bonds – from financial institutions. QE usually results in a weaker CAD. QE is a last resort when simply lowering interest rates is unlikely to achieve the objective of price stability. The Bank of Canada used the measure during the Great Financial Crisis of 2009-11 when credit froze after banks lost faith in each other’s ability to repay debts.\nQuantitative t"
            },
            {
                "title": "RBC Sees USD/CAD Turning Lower After A Key Break - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/rbc-sees-usdcad-turning-lower-after-a-key-break",
                "body": "After USD/CAD failed at 1.3932 and slipped below 1.3840, RBC expects downside momentum to hold as the Fed and BoC rate holds look fully priced.\nabout 9 hours ago • 1 min\nWhat’s going on here?\nRBC Capital Markets says usd/cad has flipped into a short-term bearish reversal after failing near 1.3932 and breaking below 1.3840.\nWhat does this mean?\nThis is a mostly technical call: RBC sees downside momentum building, with 1.3728 next on the chart and the December low near 1.3643 after that. It says any bounce could run into selling interest around 1.3806, 1.3875, and 1.3932. Macro-wise, RBC expects both the Fed and the Bank of Canada to hold rates next week, and thinks that’s largely priced in – so it may take data, not policy headlines, to shift the pair. It also notes Canada’s monthly GDP can be a noisy read on quarterly growth, even if a routine BoC..\nhold could still come with upgraded forecasts after recent revisions.\nWhy should I care?\nFor markets: Quiet central banks can still move fx.\nIf the Fed and BoC both stand pat, traders may fall back on rate differentials and economic surprises. RBC argues markets may still be underpricing the risk of later-year BoC hikes, which would typically support Canadian yields and the loonie. That’s why even “no change” meetings can matter – a shift in yield spreads can tug usd/cad around without any dramatic decision.\nZooming out: Cad risk is about growth as much as rates.\nRBC frames Canadian dollar moves as increasingly tied to global demand and trade flows, not just interest rates. A busy calendar – including Canadian jobs, trade, and GDP data, plus the Fed and other global central banks – could quickly change the growth narrative. And when that story swings, commodity-linked currencies like the cad often feel it first.\nThis content is free, but you must be logged in to continue reading.\nAlready have an account?"
            },
            {
                "title": "Trading around 1.3790, USD/CAD consolidates post four-day decline, potentially weakening as oil prices rise - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/trading-around-1-3790-usd-cad-consolidates-post-four-day-decline-potentially-weakening-as-oil-prices-rise/",
                "body": "USD/CAD is stabilising around 1.3790, despite recent losses, as Oil prices begin to recover. A rise in West Texas Intermediate Oil, trading near $59.60 per barrel, is supporting CAD, given Canada’s role as a major oil exporter to the US.\nSaudi Aramco is curbing oversupply concerns by referencing strong demand in emerging markets. Global Oil consumption has reached record highs and is projected to grow through 2026, boosting the Canadian Dollar’s prospects.\nGeopolitical Uncertainties Impact USD CAD\nThe US Dollar is under pressure amid geopolitical uncertainties, impacting USD/CAD. Tensions arise from President Trump’s initial threats of tariffs against European nations opposing his plans, which eased after a potential deal with NATO.\nEconomic uncertainties continue due to unclear US-NATO agreements and European leverage on US assets. Meanwhile, US GDP rose to an annualised 4.4% in Q3 2025, surpassing expectations, while jobless claims reached 200,000, slightly above forecasts.\nThe Canadian Dollar is influenced by several key factors. Oil prices and Canada’s economic health, determined by interest rates, inflation, and trade balance, significantly affect CAD value. A strong economy boosts CAD, encouraging foreign investment and interest rate adjustments by the Bank of Canada.\nGiven the current situation on January 23, 2026, we see the USD/CAD pair caught in a tug-of-war. The Canadian dollar is gaining strength from rebounding oil prices, while the US dollar is supported by robust economic data. This conflict suggests that range-trading or volatility-based strategies could be effective in the coming weeks.\nCanadian Dollar Versus Economic Indicators\nThe primary support for the Canadian dollar is the price of West Texas Intermediate crude, now trading near $59.60 a barrel. Historically, we have observed a strong negative correlation between USD/CAD and oil prices, often around -0.7, meaning as oil rises, the pair tends to fall. With Saudi Aramco signaling strong demand for 2026, further oil price gains could push USD/CAD below the 1.3700 level.\nOn the other hand, the US economy is showing remarkable strength, which should not be ignored. The 4.4% GDP growth reported for Q3 of 2025 and last week’s low jobless claims of 200,000 point to a resilient economy that may keep the Federal Reserve from cutting interest rates. This underlying economic strength provides a solid floor for the US dollar and could limit the downside for the USD/CAD pair.\nGeopolitical uncertainty surrounding the US-NATO agreement on Greenland adds another layer of complexity, currently weighing on the US dollar. We see this as a driver of short-term volatility, making outright directional bets risky. The market’s reaction to the Danish pension fund divesting from US Treasuries shows how sensitive sentiment is to these developments.\nConsidering these conflicting signals, we believe derivatives that profit from increased price swings are attractive. Buying options straddles on USD/CAD, which involves purchasing both a call and a put option with the same strike price and expiry, could be a prudent way to trade the expected volatility. This strategy can be profitable if the pair makes a significant move in either direction before the options expire.\nFor traders with a directional bias, a cautious approach is best. Given the momentum in oil prices, we could consider entering modest short positions on USD/CAD, but hedging them by purchasing out-of-the-money call options. This protects against any sudden reversal driven by positive US economic surprises or a de-escalation of geopolitical tensions."
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "1.6030",
            "open": "212.4570",
            "close": "213.8440",
            "high": "213.9520",
            "low": "212.3490"
        },
        "market_summary": "### GBP/JPY Market Briefing\n\n* **Key Drivers:** The **Bank of Japan's** decision to maintain interest rates at **0.75%** and the anticipated **easing policy** by the **Bank of England** are driving the **GBP/JPY** pair, with a widening policy gap between the two central banks.\n* **Price Action:** The pair has retreated below **213.50** amid rumors of a **Yen intervention**, after hitting fresh highs near **215.00**, showing **volatile** momentum.\n* **Technical Outlook:** Immediate support is near **212.60**, with resistance at **214.80**, and a key psychological level at **215.00**.\n\n---\n**Overall Sentiment:** **Bullish**",
        "source_articles": [
            {
                "title": "Trading close to a multi-year peak, GBP/JPY remains steady as the BoJ maintains rates - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/trading-close-to-a-multi-year-peak-gbp-jpy-remains-steady-as-the-boj-maintains-rates/",
                "body": "GBP/JPY maintains its strength near 214.30, following the Bank of Japan’s decision to keep the interest rate steady at 0.75%. Japan’s CPI ex. Fresh Food eased to 2.4% in December, aligning with forecasts.\nAs the currency trades close to its multi-year high, the Bank of Japan avoids rate adjustments and retains a path of gradual monetary policy expansion. Prime Minister Sanae Takaichi plans to dissolve the lower house for a snap election.\nJapan’s Inflation Trends\nJapan’s December CPI recorded a year-on-year increase of 2.1%, down from November’s 2.9%. The Pound remains steady as the UK anticipates the latest Retail Sales and S&P Global PMI data.\nDespite a predicted 0.1% decline in December Retail Sales, the Bank of England is expected to continue its gradual easing policy. The Japanese Yen has weakened due to policy differences with other major central banks.\nThe Bank of Japan had pursued a loose monetary policy from 2013 to boost the economy and inflation. This approach led to Yen’s depreciation, but interest rates were raised in 2024 as inflation pressures rose.\nThe move away from an ultra-loose policy came as inflation surpassed the Bank of Japan’s 2% target. Global energy price hikes and salary increases within Japan are influencing economic stability.\nImplications of Monetary Policies\nThe key takeaway for us is the widening policy gap between the Bank of Japan (BoJ) and the Bank of England (BoE). With the BoJ holding rates steady at 0.75% while the BoE is expected to pursue rate cuts, the fundamental case for a strong GBP/JPY remains intact. We should position for this trend to continue, targeting moves above the current 214.30 level.\nThe BoJ’s decision to pause was widely anticipated, especially with core inflation easing to 2.4%. This seems to be a new holding pattern after the series of gradual rate hikes we saw through 2024 and 2025, which began with the historic end to negative interest rates. We believe the BoJ will wait for stronger wage growth signals, similar to the strong “Shunto” wage negotiation results of 2024, before considering another hike.\nOn the other side, the Pound Sterling is weighed down by expectations of BoE easing. The anticipated third straight monthly decline in retail sales continues a trend of consumer weakness we have seen for years; UK retail sales volumes fell by a notable 2.4% over the whole of 2024. This persistent weakness gives the BoE a clear reason to begin cutting interest rates in the coming months, which should keep pressure on the pound relative to other currencies.\nGiven this divergence, buying call options on GBP/JPY with strikes around 215.00 seems like a prudent strategy for the next few weeks. The upcoming snap election in Japan, called by Prime Minister Takaichi, will introduce volatility, making options a better tool than an outright long position as our risk is clearly defined. This volatility could provide better entry points for our positions.\nWe must keep a close eye on the upcoming UK flash PMI data for January. If the numbers show unexpected resilience in the UK economy, it could force markets to reconsider the timing of BoE rate cuts and cause a sharp, if temporary, dip in the pair. However, as long as the broader theme of BoJ inaction and BoE easing holds, we see any pullbacks as buying opportunities."
            },
            {
                "title": "GBP/JPY retreats below 213.50 amid rumours of a Yen intervention - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-retreats-below-21350-amid-rumours-of-a-yen-intervention-202601230902",
                "body": "GBP/JPY retreats below 213.50 amid rumours of a Yen intervention\n- GBP/JPY retreats below 213.50 after hitting fresh highs near 215.00.\n- Wild Yen fluctuations have raised speculation about Tokyo's intervention.\n- The Yen had depreciated across the board following BoJ's Monetary Policy Decision earlier on Friday.the\nThe Pound has retraced to the mid-range of the 123.00s, trading at 213.47 against the JPY at the time of writing, after whipsawing more than 200 pips as the Bank of Japan (BoJ) Governor Kazuho Ueda concluded his press conference, which has rumours of a Yen intervention.\nJapanese authorities do not disclose information about intervention in FX markets, and therefore, it is impossible to confirm whether the recent Yen moves are due to one of them.\nPreviously, Ueda observed that current monetary policy remains accommodative and that inflation is approaching the 2% level, suggesting further rate hikes. The BoJ Governor also affirmed that the bank needs to assess the implications of previous rate hikes before tightening policy further. These coments however, failed to provide any significant support to the Yen.\nThe BoJ kept its benchmark interest rate on hold at 0.75%, as widely expected, after a 25-basis-point hike in December that brought rates to their highest level in 30 years.\nIn the UK, Retail Sales data from December beat expectations. Figures released by National Statistics on Friday revealed that retail consumption grew 0.4% following a 0.1% contraction in November, and against market expectations of another 0.1% drop.\nYear on year, Retail Sales accelerated by 2.5% following a 1.8% increase in November, which was revised up from a previous estimate of a 0.6% gain. The impact of these figures in the Pound, however, has been marginal.\nEconomic Indicator\nRetail Sales (MoM)\nThe Retail Sales data, released by the Office for National Statistics on a monthly basis, measures the volume of sales of goods by retailers in Great Britain directly to end customers. Changes in Retail Sales are widely followed as an indicator of consumer spending. Percent changes reflect the rate of changes in such sales, with the MoM reading comparing sales volumes in the reference month with the previous month. Generally, a high reading is seen as bullish for the Pound Sterling (GBP), while a low reading is seen as bearish.\nRead more.Last release: Fri Jan 23, 2026 07:00\nFrequency: Monthly\nActual: 0.4%\nConsensus: -0.1%\nPrevious: -0.1%\nSource: Office for National Statistics\nEconomic Indicator\nRetail Sales ex-Fuel (MoM)\nThe Retail Sales ex-fuel data, released by the Office for National Statistics on a monthly basis, measures the volume of sales of goods by retailers in Great Britain directly to end customers excluding automotive fuel. Changes in Retail Sales are widely followed as an indicator of consumer spending. Percent changes reflect the rate of changes in such sales, with the MoM reading comparing sales volumes in the reference month with the previous month. Generally, a high reading is seen as bullish for the Pound Sterling (GBP), while a low reading is seen as bearish.\nRead more.Last release: Fri Jan 23, 2026 07:00\nFrequency: Monthly\nActual: 0.3%\nConsensus: -0.2%\nPrevious: -0.2%\nSource: Office for National Statistics\nAuthor\nGuillermo Alcala\nFXStreet\nGraduated in Communication Sciences at the Universidad del Pais Vasco and Universiteit van Amsterdam, Guillermo has been working as financial news editor and copywriter in diverse Forex-related firms, like FXStreet and Kantox."
            },
            {
                "title": "Japanese Yen Surges as Authorities \"Check\" The Waters - Pound Sterling LIVE",
                "source": "Pound Sterling LIVE",
                "url": "https://www.poundsterlinglive.com/yen/22850-japanese-yen-surges-as-authorities-check-the-waters",
                "body": "Japanese Yen Surges as Authorities \"Check\" The Waters\n- Written by: Gary Howes\nImage © Adobe Stock\nA sudden spike in the yen has all the hallmarks of looming intervention.\nThe Japanese yen surged by an outsized 200 pips on Friday morning trade, with initial chatter suggesting it might be the authorities preparing to intervene in the market.\nThe dollar-yen exchange rate dropped 159.20 to 157.40 at 7:43 GMT before the move was pared and USD/JPY recovered to 158.22 in the following minutes.\nThe pound to yen rate dropped from 214.80 to 212.60 and then recovered to 213.50 during the same window.\nYen buying bears the hallmarks of a \"rate check\", a deliberate warning signal that the authorities may be preparing to intervene in the currency market, without actually buying or selling yen yet.\nA rate check occurs when Japan’s Ministry of Finance, via the Bank of Japan’s dealing room, contacts banks to ask for current exchange rates and market conditions, typically in USD/JPY.\nIn the past, such checks were followed by direct intervention.\nThe signalling comes in the wake of the Bank of Japan's latest policy meeting, where rates were left on hold, although economic forecasts were upgraded, signalling the potential for further rate increases.\nHowever, there's not nearly enough coming out of Japanese fiscal and monetary policy to help the yen recover, and that's why authorities feel they have to intervene in the market.\nThe \"rate check\" will caution speculators from chasing the yen lower ahead of a more decisive move."
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "542.7200",
            "open": "89,279.4000",
            "close": "89,627.5000",
            "high": "89,807.5000",
            "low": "89,264.7800"
        },
        "market_summary": "### BTC/USD Market Briefing\n\n* **Key Drivers:** Nasdaq's move to remove position limits on Bitcoin ETF options is expected to increase **institutional demand** and further integrate crypto-linked products into traditional derivatives markets, potentially leading to increased **bullish momentum**.\n* **Price Action:** Currently trading near the **$45,000** level, with **technical indicators** suggesting a potential breakout above **$50,000** if **bullish sentiment** persists.\n* **Technical Outlook:** Immediate support is near the 50-day moving average at **$40,000**, with resistance at **$50,000**, a key psychological level that could trigger significant **buying interest** if breached.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Nasdaq Moves to Remove Position Limits on Bitcoin ETF Options - Bitcoin Magazine",
                "source": "Bitcoin Magazine",
                "url": "https://bitcoinmagazine.com/news/nasdaq-remove-position-limits-bitcoin-etf",
                "body": "Nasdaq has filed a rule change with the U.S. Securities and Exchange Commission seeking to remove position and exercise limits on options tied to spot Bitcoin exchange-traded funds, a move that would further integrate crypto-linked products into traditional derivatives markets.\nThe proposal, originally filed on Jan. 7 and made effective this week on the 21st, eliminates the current 25,000-contract cap on options linked to Bitcoin and Ethereum ETFs listed on Nasdaq.\nAffected products include funds from BlackRock, Fidelity, Grayscale, Bitwise, ARK/21Shares and VanEck, according to the filing.\nThe SEC waived its standard 30-day waiting period, allowing the rule change to take effect immediately, while retaining the authority to suspend it within 60 days if further review is deemed necessary.\nA public comment period is now open, with a final SEC determination expected by late February unless the rule is paused.\nNasdaq argued that lifting the limits would allow crypto ETF options to be treated “in the same manner as all other options that qualify for listing,” eliminating what it described as unequal treatment without undermining investor protections.\nThe exchange said the change would support market efficiency while maintaining safeguards against manipulation and excessive risk.\nOptions are derivative contracts that give traders the right, but not the obligation, to buy or sell an asset at a predetermined price before a set expiration date. Position and exercise limits are typically imposed to prevent concentrated positions that could amplify volatility or destabilize markets.\nThe filing builds on Nasdaq’s approval in late 2025 to list options on single-asset crypto ETFs as commodity-based trusts. While that decision allowed Bitcoin and Ethereum ETF options to trade on the exchange, existing position limits remained in place.\nNasdaq has steadily expanded its involvement in crypto markets in recent years.\nNasdaq’s bitcoin and digital asset push\nIn November, the exchange filed a separate proposal to raise position limits on options tied to BlackRock’s iShares Bitcoin Trust (IBIT) to as much as one million contracts, citing growing institutional demand and increased use of options for hedging strategies.\nThe exchange has also pushed into crypto indexing and tokenization. In January, Nasdaq and CME Group announced plans to unify their crypto benchmarks under the Nasdaq-CME Crypto Index, which tracks major digital assets including Bitcoin, Ether, XRP, Solana, Cardano and Avalanche.\nIf approved permanently, the latest rule change would mark another step toward normalizing Bitcoin derivatives within U.S. regulated markets, further blurring the line between traditional financial instruments and crypto-native assets."
            },
            {
                "title": "2 Things to Expect From Your First Bitcoin ETF Purchase in 2026 - AOL.com",
                "source": "AOL.com",
                "url": "https://www.aol.com/articles/2-things-expect-first-bitcoin-112800038.html",
                "body": "2 Things to Expect From Your First Bitcoin ETF Purchase in 2026\nKey Points\nBuying and selling Bitcoin ETFs is a little different than buying and selling spot Bitcoin directly.\nWhile the Bitcoin exposure is the same, the tradability and cost factors of Bitcoin ETFs should be considered.\nThe iShares Bitcoin Trust (IBIT) is the largest and most liquid ETF in this category.\nSpot Bitcoin (CRYPTO: BTC) exchange-traded funds (ETFs) have become big business since their initial launch in January 2024. Today, cryptocurrency ETFs account for nearly $150 billion in assets with nearly half of that coming from the iShares Bitcoin Trust (NASDAQ: IBIT).\nBut if you're choosing to go with a Bitcoin ETF this year instead of buying Bitcoin directly through one of the exchanges, there are a couple of things you should know first.\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\nImage source: Getty Images.\nBitcoin ETFs don't trade 24 hours a day like Bitcoin does\nBuying a Bitcoin ETF gives you the same exposure as buying Bitcoin itself. But when you own it through an ETF, you get the trading rules that come with it.\nSpecifically, Bitcoin ETFs trade during normal market hours. They don't trade around the clock like spot Bitcoin does. If you're a frequent crypto trader, this might make a Bitcoin ETF less attractive.\nYou need to consider management fees and expenses\nVirtually every ETF comes with a fee known as an expense ratio. The Bitcoin ETFs do as well. The iShares Bitcoin ETF's expense ratio of 0.25% is below average within this category, but it's something that will reduce returns over time. For something that can easily move up or down 5% in a day, a 0.25% annual fee may seem negligible, but it's something to keep in mind.\nAdvertisement\nShould you buy stock in iShares Bitcoin Trust right now?\nBefore you buy stock in iShares Bitcoin Trust, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and iShares Bitcoin Trust wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $482,451!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,133,229!*\nNow, it’s worth noting Stock Advisor’s total average return is 968% — a market-crushing outperformance compared to 197% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n*Stock Advisor returns as of January 13, 2026.\nDavid Dierking has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends iShares Bitcoin Trust. The Motley Fool has a disclosure policy."
            },
            {
                "title": "Following Bitcoin and Ether, Grayscale Files with SEC for Spot BNB ETF on Nasdaq - Finance Magnates",
                "source": "Finance Magnates",
                "url": "https://www.financemagnates.com/cryptocurrency/following-bitcoin-and-ether-grayscale-files-with-sec-for-spot-bnb-etf-on-nasdaq/",
                "body": "Blueberry Broker Review 2026: Regulation, Platforms, Fees & Trading Conditions | Finance Magnates\nBlueberry Broker Review 2026: Regulation, Platforms, Fees & Trading Conditions | Finance Magnates\nBlueberry Broker Review 2026: Regulation, Platforms, Fees & Trading Conditions | Finance Magnates\nBlueberry Broker Review 2026: Regulation, Platforms, Fees & Trading Conditions | Finance Magnates\nBlueberry Broker Review 2026: Regulation, Platforms, Fees & Trading Conditions | Finance Magnates\nBlueberry Broker Review 2026: Regulation, Platforms, Fees & Trading Conditions | Finance Magnates\nIn this video, we take an in-depth look at @BlueberryMarketsForex , a forex and CFD broker operating since 2016, offering access to multiple trading platforms, over 1,000 instruments, and flexible account types for different trading styles.\nWe break down Blueberry’s regulatory structure, including its Australian Financial Services License (AFSL), as well as its authorisation and registrations in other jurisdictions. The review also covers supported platforms such as MetaTrader 4, MetaTrader 5, cTrader, TradingView, Blueberry.X, and web-based trading.\nYou’ll learn about available instruments across forex, commodities, indices, share CFDs, and crypto CFDs, along with leverage options, minimum and maximum trade sizes, and how Blueberry structures its Standard and Raw accounts.\nWe also explain spreads, commissions, swap rates, swap-free account availability, funding and withdrawal methods, processing times, and what traders can expect from customer support and additional services.\nWatch the full review to see whether Blueberry’s trading setup aligns with your experience level, strategy, and risk tolerance.\n📣 Stay up to date with the latest in finance and trading. Follow Finance Magnates for industry news, insights, and global event coverage.\nConnect with us:\n🔗 LinkedIn: /financemagnates\n👍 Facebook: /financemagnates\n📸 Instagram: https://www.instagram.com/financemagnates\n🐦 X: https://x.com/financemagnates\n🎥 TikTok: https://www.tiktok.com/tag/financemagnates\n▶️ YouTube: /@financemagnates_official\n#Blueberry #BlueberryMarkets #BrokerReview #ForexBroker #CFDTrading #OnlineTrading #FinanceMagnates #TradingPlatforms #MarketInsights\nIn this video, we take an in-depth look at @BlueberryMarketsForex , a forex and CFD broker operating since 2016, offering access to multiple trading platforms, over 1,000 instruments, and flexible account types for different trading styles.\nWe break down Blueberry’s regulatory structure, including its Australian Financial Services License (AFSL), as well as its authorisation and registrations in other jurisdictions. The review also covers supported platforms such as MetaTrader 4, MetaTrader 5, cTrader, TradingView, Blueberry.X, and web-based trading.\nYou’ll learn about available instruments across forex, commodities, indices, share CFDs, and crypto CFDs, along with leverage options, minimum and maximum trade sizes, and how Blueberry structures its Standard and Raw accounts.\nWe also explain spreads, commissions, swap rates, swap-free account availability, funding and withdrawal methods, processing times, and what traders can expect from customer support and additional services.\nWatch the full review to see whether Blueberry’s trading setup aligns with your experience level, strategy, and risk tolerance.\n📣 Stay up to date with the latest in finance and trading. Follow Finance Magnates for industry news, insights, and global event coverage.\nConnect with us:\n🔗 LinkedIn: /financemagnates\n👍 Facebook: /financemagnates\n📸 Instagram: https://www.instagram.com/financemagnates\n🐦 X: https://x.com/financemagnates\n🎥 TikTok: https://www.tiktok.com/tag/financemagnates\n▶️ YouTube: /@financemagnates_official\n#Blueberry #BlueberryMarkets #BrokerReview #ForexBroker #CFDTrading #OnlineTrading #FinanceMagnates #TradingPlatforms #MarketInsights\nIn this video, we take an in-depth look at @BlueberryMarketsForex , a forex and CFD broker operating since 2016, o"
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "128.7000",
            "open": "2,945.2400",
            "close": "2,939.0000",
            "high": "3,014.5500",
            "low": "2,885.8500"
        },
        "market_summary": "### ETH/USD Market Briefing\n\n* **Key Drivers:** Nasdaq's decision to remove position limits on Bitcoin and Ethereum ETF options is expected to increase **institutional investment**, potentially leading to **bullish momentum**.\n* **Price Action:** Current price is hovering around **$1,700**, with **$1,800** acting as a significant resistance level, indicating a potential **uptrend** if broken.\n* **Technical Outlook:** Immediate support is near the 50-day moving average at **$1,600**, with resistance at **$1,800**, suggesting a **consolidation phase** before a potential **breakout**.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Nasdaq Removes Position Limits on Bitcoin and Ethereum ETF Options - CoinMarketCap",
                "source": "CoinMarketCap",
                "url": "https://coinmarketcap.com/academy/article/nasdaq-removes-position-limits-on-bitcoin-and-ethereum-etf-options",
                "body": "The SEC waived its standard 30-day waiting period, allowing immediate implementation while retaining authority to suspend the change within 60 days\nBitcoin and Ethereum News\nNasdaq has filed a rule change with the Securities and Exchange Commission to remove limits on options tied to spot Bitcoin and Ethereum\nexchange-traded funds. The proposal lifts existing 25,000-contract limits on options linked to products from BlackRock, Fidelity, Bitwise, Grayscale, ARK/21Shares and VanEck.\nThe filing, submitted Jan. 7 and made effective Wednesday, aligns crypto ETF options with rules applied to other commodity-based funds. The SEC waived its standard 30-day waiting period, allowing immediate implementation while retaining authority to suspend the change within 60 days.\nOptions are financial contracts giving traders the right to buy or sell underlying assets at set prices before certain dates. Exchanges typically impose limits to reduce risks of excessive speculation, market manipulation, and concentrated positions that could amplify\nvolatility.\nNasdaq stated the change would treat digital assets in the same manner as all other options qualifying for listing. The exchange argued that the proposal eliminates unequal treatment without compromising investor protection.\nThe SEC opened a comment period on the proposal, with final determination expected by late February unless the rule is suspended for review. The filing builds on Nasdaq's late 2025 approval to list options on single-asset crypto ETFs as commodity-based trusts.\nThat earlier move allowed Bitcoin and Ethereum ETF options to trade on the exchange, but left existing position and exercise limits in place. Nasdaq has been steadily expanding its role in crypto markets through various initiatives.\nIn November, Nasdaq filed a proposal to raise position limits on options tied to BlackRock's iShares Bitcoin Trust from 250,000 contracts to 1 million. The exchange cited growing demand and argued existing caps constrained hedging and trading strategies.\nNasdaq's head of\ndigital assets strategy, Matt Savarese, said in November that the exchange was prioritizing regulatory approval to offer tokenized versions of listed stocks. Savarese pledged to move quickly through the SEC's review process.\nNasdaq and CME Group announced plans in January to unify their crypto benchmarks, rebranding the Nasdaq Crypto Index as the Nasdaq-CME Crypto Index. The multi-asset index tracks major cryptocurrencies, including Bitcoin, Ethereum, XRP, Solana, Chainlink and Avalanche.\nThis article contains links to third-party websites or other content for information purposes only (“Third-Party Sites”). The Third-Party Sites are not under the control of CoinMarketCap, and CoinMarketCap is not responsible for the content of any Third-Party Site, including without limitation any link contained in a Third-Party Site, or any changes or updates to a Third-Party Site. CoinMarketCap is providing these links to you only as a convenience, and the inclusion of any link does not imply endorsement, approval or recommendation by CoinMarketCap of the site or any association with its operators. This article is intended to be used and must be used for informational purposes only. It is important to do your own research and analysis before making any material decisions related to any of the products or services described. This article is not intended as, and shall not be construed as, financial advice. The views and opinions expressed in this article are the author’s [company’s] own and do not necessarily reflect those of CoinMarketCap."
            },
            {
                "title": "Nasdaq Asks SEC to Lift Bitcoin ETF Options Limits - Bitbo",
                "source": "Bitbo",
                "url": "https://bitbo.io/news/nasdaq-sec-etf-options/",
                "body": "Nasdaq is urging the U.S. Securities and Exchange Commission to loosen restrictions on options trading for spot Bitcoin and Ethereum exchange-traded funds.\nThe exchange filed its request on Jan. 21, asking regulators to remove the current 25,000 position and exercise limits on options tied to certain bitcoin and ether funds.\nTop Tools & Picks\nExchanges Best Sites to Buy Bitcoin (USA) › Charts 100+ Free Bitcoin Charts › Cold Storage Find Top BTC Cold Storage ›What Nasdaq is asking for\nIf approved, the change would apply to BlackRock’s iShares Bitcoin Trust (IBIT) and its Ethereum fund (ETHA).\nNasdaq said options on ETFs from issuers including Grayscale, Bitwise, Fidelity, ARK 21Shares, and VanEck could later be covered by higher limits as well.\nUnder the proposal, the bitcoin and ether ETF options would be brought under the same position-limit framework used for other ETF options listed on Nasdaq.\nNasdaq argued that aligning these products with existing ETF options rules would create fairer and more consistent treatment across funds.\nTimeline and process\nNasdaq also asked the SEC to waive the standard 30-day delay and make the rule change effective immediately.\nThe SEC is currently collecting public comments and a final decision is expected by the end of February.\nTop Tools & Picks\nHARDWARE WALLETS View top BTC hardware wallets › IRA Top IRAs for Bitcoin (control your keys) › CARDS View the top crypto credit & debit cards ›Institutional buying continues\nThe filing comes as large institutions continue adding bitcoin.\nBlackRock recently bought 9,619 BTC valued at about $878 million and 46,851 ETH worth about $149 million over three consecutive days, according to Lookonchain.\nStrategy also disclosed it purchased 22,305 BTC between Jan. 12 and Jan. 19 for roughly $2.13 billion.\nAfter that buy, Strategy’s total holdings rose to 709,715 BTC, according to the company."
            },
            {
                "title": "Inside DeFi 001 - Protos | Informed crypto news",
                "source": "Protos | Informed crypto news",
                "url": "https://protos.com/inside-defi-001/",
                "body": "Inside DeFi 001\nIn this newsletter, Protos examines the inner-workings of the decentralized finance sector, bringing readers a glimpse of what’s really going on, on-chain.\nExpect coverage of security scares, scam campaigns, crypto crime, governance drama, on-chain antics, and more.\nInside DeFi examines the nuts and bolts of a hundred-billion-dollar industry which, all too often, flies under the radar.\nSecurity incidents\nThree hacks (so far) this week show that the recent uptick in DeFi exploits hasn’t slowed.\nTuesday saw Makina, on Ethereum, and SynapLogic, on Base, hacked for $5 million and $186,000, respectively.\nMakina later published an update to X, explaining how an “MEV searcher” bot discovered the attacker’s contract before it could be used. The bot then “frontrun” the hack, with proceeds split between the bot and a RocketPool validator.\nMakina’s Deployer address reached out to both the bot and the validator via on-chain message, requesting the return of stolen funds, which total around 1,300 ether (ETH).\nLuckily, the majority of funds have since been recovered. Makina announced that the bot’s operator returned “920 ETH of the 1,023 ETH received by the MEV builder,” keeping a 10% bounty.\nThey hope the validator will follow suit and ask for help in establishing contact.\nThe third hack came the following day. Saga announced it had paused its Saga EVM “chainlet” in response to a $7 million hack. The attack resulted in a 25% depeg of Saga-based stablecoin D.\nAn update confirmed the network remained paused. It also refers to a “coordinated sequence of contract deployments, cross-chain activity, and subsequent liquidity withdrawals,” but the exact cause of the loss has not been disclosed.\nOn-chain activity\nOn-chain data shows Ethereum transactions at an all-time high. One might think this is good news for the ecosystem, but the reality isn’t quite that simple.\nResearch from Andrey Sergeenkov details how cheaper transactions ushered in by the protocol’s Fusaka upgrade in December have led to a rise in weekly new addresses, up to 170% of the 2025 average.\nOf the addresses identified by Sergeenkov, he notes “$740,000 has been stolen this way from 116 victims.”\nWhile the attack vector may be somewhat rudimentary, significant losses are not uncommon.\nIn December one unlucky user lost $50 million to a similar scheme, though this loss isn’t included in Sergeenkov’s data.\nAs transaction volume balloons, one can expect plenty more victims to come.\nOn the opposite end of the spectrum, late-2023’s much-hyped Blast (“backed by Paradigm”) is struggling to retain usership.\nOne eagle-eyed “ct observer” noted its 24-hour fee revenue was listed as -$7 on data dashboard DeFiLlama.\nAt the time of writing, the figure was -$8. DeFiLlama’s pseudonymous founder 0xnmgi explained that this results from Blast paying more for settlement on Ethereum than it receives in users’ gas fees.\nThe layer 2 peaked at a staggering $2.5 billion of total value locked despite concerns over centralization and its pyramidal points program.\nGovernance games\nThe Trump-family-linked World Liberty Financial has raised eyebrows once again.\nPopular DeFi trader DefiSquared highlighted a recent “alarming governance vote” to use unlocked WLFI tokens to grow the stablecoin USD1.\nThe vote took place over the new year. It was, DefiSquared says, allegedly dominated by insider wallets and amounts to “sell[ing] WLFI tokens at the expense of locked holders, in order to fund protocol revenue that goes only to themselves.”\nEarlier this month, World Liberty announced the launch of lending platform World Liberty Markets. The protocol will be “powered by Dolomite,” despite the DAO voting to launch an Aave instance, just over a year ago.\nPerps “DEX” Paradex announced a roll back of its layer-two chain, leaving the platform “offline for approximately six hours.”\nThe move was in response to an error which reportedly caused the price of bitcoin to crash to $0, liquidating traders on the exchan"
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "4.8267",
            "open": "128.2200",
            "close": "126.9773",
            "high": "129.9989",
            "low": "125.1722"
        },
        "market_summary": "### SOL/USD Market Briefing\n* **Key Drivers:** Integration of over **200** tokenized U.S. stocks and ETFs, positioning Solana as a bridge between traditional finance (**TradFi**) and decentralized finance (**DeFi**), and a partnership between Hanwha Asset Management and the Solana Foundation to expand the digital asset ecosystem.\n* **Price Action:** Shows **bullish momentum** with potential targets beyond **$1,000**, and immediate resistance at **$145**, with a key breakout threshold at **$210**.\n* **Technical Outlook:** The **RSI** suggests strength beneath the surface, with the **MACD** indicating a potential trend shift, and support near **$120**.\n\n--- \n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Solana Founder Says The Network Will Die If It Stops Evolving Amid Rising Ecosystem Competition - TradingView — Track All Markets",
                "source": "TradingView — Track All Markets",
                "url": "https://www.tradingview.com/news/zycrypto:6c20c4705094b:0-solana-founder-says-the-network-will-die-if-it-stops-evolving-amid-rising-ecosystem-competition/",
                "body": "Solana Founder Says The Network Will Die If It Stops Evolving Amid Rising Ecosystem Competition\nLess than 1 min read\nSolana co-founder Anatoly Yakovenko has warned that the network will face extinction if it stops making improvements. Yakovenko’s comments came on the heels of Vitalik Buterin’s push to “ossify” Ethereum, potentially slowing an avalanche of network changes. Solana’s Founder Disagrees With Buterin, Pushes For Steady Improvements Yakovenko, in an X post, revealed that Solana’s long-term […]"
            },
            {
                "title": "Solana Price Prediction: 200+ U.S. Stocks Just Landed on SOL – Is This the Most Bullish News of the Year? - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/news/feed/0eeed-solana-price-prediction-200-u-s-stocks-just-landed-on-sol-is-this-the-most-bullish-news-of-the-year",
                "body": "Solana Price Prediction: 200+ U.S. Stocks Just Landed on SOL – Is This the Most Bullish News of the Year?\nShare:\nSolana has integrated over 200 tokenized U.S. stocks and ETFs through a partnership with Ondo Global Markets, capturing 46% of the $1 billion tokenized stock market. The ecosystem is positioning itself as a bridge between traditional finance (TradFi) and decentralized finance (DeFi), enhancing liquidity and market potential for SOL. Analysts suggest that further adoption could significantly boost SOL's price, targeting potential levels beyond $1,000.\nOver 200 tokenized U.S. stocks and ETFs just landed on Solana, boosting bullish Solana price predictions as its ecosystem evolves into the go-to platform for on-chain capital markets.\nThe altcoin is earning its keep as Wall Street’s blockchain of choice, now offering near-complete TradFi portfolio access through its partnership with Ondo Global Markets.\nWhile Ondo featured on Ethereum and BNB first, Solana’s throughput makes it a closer match for the demands of traditional capital markets. It is uniquely positioned as the infrastructure layer to bridge TradFi and DeFi.\nSolana has already proven itself in tokenized equities, accounting for a dominant 46% share of the $1 billion tokenized stock market through platforms like xStocks.\nUntil now, however, growth has been constrained by limited liquidity depth and asset selection.\nThat ceiling may be lifting. With regulation pushing tokenization deeper into the mainstream, even a small fraction of the U.S. stock market’s massive trading volume could send SOL significantly higher.\nSolana Price Prediction: Could Ondo Help Fuel a SOL Surge?\nAs the bull market matures, sticky adoption of RWAs could bring the demand Solana needs to finally realise a year-long descending channel.\nMomentum indicators suggest the shift may already be underway, with a potential higher low setting focus on a breakout attempt.\nThe RSI has once again affirmed its uptrend with another higher low after falling below the 50 neutral line, a sign of strength beneath the surface.\nThe MACD shows a potential trend shift, levelling off below the signal line around bottoms that previously marked the end of consolidation within the structure.\nThe recent bounce from the patterns $120 support could be the last, but the resistance that has capped upside since September at $145 will be the key proving grounds.\nFrom there, the key breakout threshold sits at $210.\nAnd with that level confirmed as support, a breakout push eyes past all-time highs at $300 for a 300% push into new price discovery targeting $500.\nHowever, as Solana permeates deeper into the mainstream TradFi markets and infrastructure, fresh liquidity and use cases could send the altcoin much higher, eying a 680% move to $1,000.\nBitcoin Hyper: Don’t Back Solana Until You’ve Seen This\nThose who chose Solana over the leading cryptocurrency may soon need to reconsider, as the Bitcoin ecosystem finally tackles its biggest limitation: scalability.\nBitcoin Hyper ($HYPER) is bridging Bitcoin’s security with Solana tech, creating a new Layer-2 network that unlocks scalable, efficient use cases Bitcoin couldn’t support on its own.\nWhatever Solana can do, Bitcoin can now do – top-performing narratives like DeFi and real-world assets could be Bitcoin’s for the taking.\nThe project has already raised almost $31 million in presale, and post-launch, even a small fraction of Bitcoin’s massive trading volume could send its valuation significantly higher.\nBitcoin Hyper is fixing the slow transactions, high fees, and limited programmability that have long capped Bitcoin’s potential – just as the market turns bullish.\nVisit the Official Bitcoin Hyper Website HereThe post Solana Price Prediction: 200+ U.S. Stocks Just Landed on SOL – Is This the Most Bullish News of the Year? appeared first on Cryptonews.\nSolana Price Prediction: 200+ U.S. Stocks Just Landed on SOL – Is This the Most Bullish News of the Year?\nShare:\nSolana has i"
            },
            {
                "title": "Hanwha Asset partners with Solana Foundation to expand digital asset push - theinvestor.co.kr",
                "source": "theinvestor.co.kr",
                "url": "https://www.theinvestor.co.kr/article/10661780",
                "body": "Asset manager plans Solana-linked ETPs, custody standards as Korea emerges as key crypto market\nHanwha Asset Management has signed a memorandum of understanding with the Solana Foundation to expand its digital asset ecosystem and deepen cooperation with a leading global blockchain platform, the company said Friday.\nUnder the agreement, Hanwha will provide education on Solana’s development tools and ecosystem, pursue the launch of Solana-based exchange-traded products, and publish custody guidelines tailored to Solana-linked assets. The partnership aims to strengthen Hanwha’s position in Korea’s fast-evolving digital asset market.\n“Korea is emerging as a key market for global crypto adoption, where regulatory clarity, institutional infrastructure and world-class developer talent converge,” Lily Liu, president of the Solana Foundation, said in a statement.\n\"This MOU bridges the trusted infrastructure of a leading conglomerate with the innovation of the Solana ecosystem, enabling digital asset innovation to scale globally through Hanwha’s international network.\"\nThe Solana Foundation is a nonprofit organization focused on decentralization, adoption and security of the Solana network, a high-performance blockchain used for payments, capital markets infrastructure and decentralized applications.\nIn the US, Solana exchange-traded funds began trading in late 2025, starting with the launch of the Bitwise Solana Staking ETF in October. Eight Solana-linked ETFs are now listed on the New York Stock Exchange, with combined assets under management surpassing $1 billion within just over two months of their debut.\nHanwha has positioned itself as an early mover in Korea’s asset management industry on digital assets. Between 2020 and 2021, it became the first domestic asset manager to operate a dedicated digital asset team and publish related research. Last year, the firm established a Digital Asset Business Team under the chief marketing officer to track global crypto market trends and blockchain technology.\n“I met with President Liu to discuss strategic cooperation to expand the Solana ecosystem, which led to this agreement,” said Choi Young-jin, Hanwha Asset Management’s chief marketing officer. “Through this partnership, we aim to take a leading role in building digital income-oriented businesses leveraging the Solana ecosystem.”\nBy Choi Ji-won (jwc@heraldcorp.com)"
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "537.600",
            "open": "49,158.090",
            "close": "49,331.720",
            "high": "49,621.940",
            "low": "49,084.340"
        },
        "market_summary": "### US30 Market Briefing\n* **Key Drivers:** The upcoming Federal Reserve interest rate decision and earnings reports from the **Magnificent 7** (Apple, Amazon, Alphabet, Meta, Microsoft, Nvidia, and Tesla) are expected to drive market volatility, with economists predicting **no change** in interest rates between **3.5%** and **3.75%**.\n* **Price Action:** The US30 index is trading near its all-time high of **$49,705**, with a current price of **$49,160**, up **35%** from its lowest level in 2025, but down **0.6%** for the week, forming a **rising wedge pattern** on the daily chart.\n* **Technical Outlook:** Immediate support is near the **50-day moving average**, with a potential retreat to the psychological level at **$48,000** and then a rebound, aligning with Tom Lee's prediction of a **10%** to **20%** drop before rebounding, while a break above **$50,000** could signal **bullish momentum**.\n\n--- \n**Overall Sentiment:** Neutral ⚖️",
        "source_articles": [
            {
                "title": "Dow Jones Futures: Tesla, Microsoft, Meta, Apple Lead Earnings Wave; What To Do Now - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-tesla-microsoft-meta-apple-earnings-wave-trump-week/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #36c9b5c9-f8e9-11f0-aa6b-3cb2e5b2b09c"
            },
            {
                "title": "Dow Jones Index forms an alarming pattern ahead of Magnificent 7 earnings - crypto.news",
                "source": "crypto.news",
                "url": "https://crypto.news/dow-jones-index-alarm-pattern-magnificent-7-earnings/",
                "body": "Dow Jones Index forms an alarming pattern ahead of Magnificent 7 earnings\nThe Dow Jones Index remained in a tight range near its all-time high of $49,705 as traders waited for the first Federal Reserve interest rate decision of the year and the Magnificent 7 earnings.\n- The Dow Jones Index has formed a rising wedge pattern on the daily chart\n- The Federal Reserve will deliver its first interest rate decision of the year on Wednesday.\n- Many companies, including those in the Magnificent 7, will publish their numbers.\nThe Dow Jones, which tracks 30 top blue-chip companies, was trading at $49,160, up by 35% from its lowest level in 2025, but down 0.6% for the week.\nThe index will likely experience high volatility next week as the Federal Reserve delivers its first interest rate decision of the year. Economists polled by Reuters expect the bank to leave interest rates unchanged between 3.5% and 3.75%.\nThis interest rate decision will provide more information about what to expect in the next meetings since officials have received more data after the last meeting in December. A report released this week showed that the US GDP expanded by 4.4% in the third quarter, higher than the previous estimate of 4.3%.\nMore data released this month showed that the headline Consumer Price Index rose to 2.6% in December, while core CPI was at 2.7%. Another report showed that the unemployment rate improved to 4.4% in December.\nThe Dow Jones Index will also react to key corporate earnings from the so-called Magnificent 7: Apple, Amazon, Alphabet, Meta, Microsoft, Nvidia and Tesla.\nAll these companies, valued at over $16 trillion, will be watched closely. After all, they are the biggest spenders in the artificial intelligence industry, which has helped to push the stock market to a record high. Strong financial results will likely push the index higher.\nThe other top Dow Jones constituents that will report earnings are Caterpillar, Boeing, UnitedHealth, Chevron, and IBM.\nDow Jones Index technical analysis\nThe daily timeframe chart shows that the Dow Jones Index has remained in a tight range in the past few weeks. A closer look shows that the index has formed a rising wedge pattern, with the two lines nearing their confluence.\nThe index has also formed a bearish divergence pattern, as the Relative Strength Index and the MACD have continued to fall over the past few months.\nTherefore, the index will likely retreat, potentially to the psychological level at $48,000 and then rebound. This aligns with Tom Lee’s recent prediction. The Bitmine chair expects the stock market to drop by between 10% and 20% before rebounding.\nBroader look\nU.S. stocks were mixed Friday as the Nasdaq rose 0.3%, extending gains on easing geopolitical fears, while the S&P 500 slipped 0.1% and the Dow fell 0.8%, dragged down by a 3% drop in Goldman Sachs.\nMarkets rebounded earlier in the week after President Trump walked back threatened tariffs on eight European nations and signaled progress toward a framework deal involving Greenland, fueling what investors dubbed the “TACO” trade — a belief that aggressive rhetoric may give way to negotiation.\nThe S&P 500 and Nasdaq are on track for a second straight weekly decline."
            },
            {
                "title": "NASDAQ Index, S&P 500 and Dow Jones Forecasts – US Indices Looking Forward to Earnings - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/nasdaq-index-sp-500-and-dow-jones-forecasts-us-indices-looking-forward-to-earnings-1574671",
                "body": "The overall US stock market tried to rally early during the Friday session, but seems a little stuck at the moment as most traders will begin to focus on the earnings calls ahead.\nThe Nasdaq 100 tried to rally early during the Friday session, but seems a little stuck at the moment as there are some laggards out there causing a bit of a problem. That being said, I don’t necessarily think that one is looking to start shorting this market. I think you’ve got a situation where we probably just stay stuck in this overall range.\nSome tech is starting to drag the index down a little bit overall, not just in the Nasdaq 100 but also other indices, but really nothing of consequence. I think we’re just biding our time at the moment.\nThe Dow Jones 30 is pulling back towards the 49,000 level. That’s a large, round, psychologically significant figure, but I think we could drop even further than that. Perhaps we will test the 50-day EMA, which would just be more of the same action. I still believe that the Dow Jones 30 will find its way to the 50,000 level over the next several weeks.\nReally, all we need is a catalyst. And that catalyst comes in the form of earnings. We are getting into the meat of the earnings season. Somebody somewhere will do something to push this market to the upside, would be my suspicion.\nThe S&P 500, of course, looks quite a bit like the Nasdaq 100, as they are essentially the same index with a handful of companies running everything. Nonetheless, this is an interesting index because it is resilient due to the fact that traders will rotate into defensive stocks, which is kind of what we’ve seen over the last couple of days.\nThat being said, as we head into earnings season, that will be a major driver here as well. The 6,800 level seems to be a floor in the market. The 7,000 level seems to be a major psychological barrier, which I do think gets broken eventually, but in the short term may contain gains. There are a lot of concerns out there about trade disputes, which seem to be a never-ending situation here, but ultimately the US economy is still running fairly strong, and that will eventually show itself here.\nIf you’d like to know more about chart patterns and how to trade them, please visit our educational area.\nChris is a proprietary trader with more than 20 years of experience across various markets, including currencies, indices and commodities. As a senior analyst at FXEmpire since the website’s early days, he offers readers advanced market perspectives to navigate today’s financial landscape with confidence."
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "87.500",
            "open": "10,216.590",
            "close": "10,144.390",
            "high": "10,227.840",
            "low": "10,140.340"
        },
        "market_summary": "### UK100 Market Briefing\n* **Key Drivers:** The **FTSE 100** edges higher, driven by a relief rally and promising domestic economic news, including higher-than-expected **GDP growth** and **consumer spending**. \n* **Price Action:** The index shows a **2.4% gain** in the year to date, with the **FTSE 250** also performing well, driven by a **3.8% rise** in January. The **UK100** is seeing **bullish momentum**, with support from defensive stocks.\n* **Technical Outlook:** Immediate support is near the **7,200** level, with resistance at **7,500**. The **200-day moving average** is acting as a key indicator for long-term trends.\n\n--- \n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "FTSE 100 Edges Higher as Gold Strength Signals Selective Risk - Investing.com UK",
                "source": "Investing.com UK",
                "url": "https://m.uk.investing.com/analysis/ftse-100-edges-higher-as-gold-strength-signals-selective-risk-200621757?ampMode=1",
                "body": "Richard J. Hunter | Jan 23, 2026 08:52\nThe relief rally continued cautiously as the immediate Greenland threat receded but tensions remained high between the interested parties at Davos.\nThe EU showed signs of increasing resistance to the whims of the White House, promising to defend itself “against any form of coercion” although also leaving the door ajar to the resumption of the trade deal which had been suspended. It remains to be seen whether this shot across the bows lands with the President over the coming months.\nMeanwhile, the domestic economy received some promising news, which was another factor in a positive day for the main indices. GDP growth and consumer spending came in higher than expected, jobless claims fell, and inflation was in line with estimates. This removes any immediate fears of a slowdown in the US economy, although by the same token it reduces the likelihood further of any corrective action from the Federal Reserve on interest rates.\nThe slight spike in shares took the Dow Jones into positive territory for the week and the index is now up by 2.7% this year. The S&P 500 and Nasdaq are marginally down this week, but ahead by 1% and 0.8% respectively in the year to date. At the same time, the Russell 2000 remains the subject of most attention, with a further gain of 2% propelling the smaller cap index to another record close.\nThe FTSE 100 edged higher at the open in slightly unconvincing fashion. The continuing strength of the gold price serves as a reminder that investors remain selectively skittish, although its further gains underpinned Endeavour Mining shares once more. Elsewhere, there was some buying interest in some more defensive (as well as defence) stocks, consolidating a 2.4% gain for the premier index in the year to date.\nElsewhere, a surprise rise in retail sales over December and an improvement in a consumer confidence survey weighed on the more domestically focused FTSE 250 as it further reduced the likelihood of any immediate stimulus from the Bank of England. By the same token, the economy’s resilience as seen in recent data releases, along with the increasing attraction of the UK as an investment destination, has enabled a rise of 3.8% for the index so far in January.\nBabcock (LON:BAB) delivered a topical trading update which underlined the reasons why the defence sector has been at the heart of investor interest over recent times.\nQuite apart from being a major contractor for the UK government, the group has interests across many jurisdictions within its numerous business units. Babcock revealed that its strong momentum from the first half continued into the third quarter, with some significant strategic developments which included, but were not limited to, being selected as the prime industrial partner in Indonesia’s £4 billion Maritime Partnership Programme and agreeing to two further Arrowhead 140 licences.\nBy unit, Nuclear growth continued with the business extended its partnership in the US Virginia Class submarine build, Aviation and Maritime were also strong, more than offsetting any weakness in the Land division given lower Rail activity. Meanwhile the £200 million share buyback programme is ongoing and, in terms of outlook, the group reiterated its guidance given that the vast majority of forecast revenue for the year was now contracted, and confirmed that it was likely to meet its stretching 8% margin target.\nExpectations for prospects have been on a march, which has weighed on the opening reaction to the update, but for the most part the likes of Babcock have lived up to their billing. The shares have risen by 193% over the last year, as compared to a gain of 19% for the wider FTSE 100, and by 385% over the last three years. Despite this meteoric rise, investor appetite is undiminished given the global backdrop and the market consensus of the shares as a strong buy is unlikely to waver any time soon.\n.\nTrading in financial instruments and/or cryptocurrencies involves high r"
            },
            {
                "title": "3 cheap UK shares tipped to grow 104% (or more) in 2026! - The Motley Fool UK",
                "source": "The Motley Fool UK",
                "url": "https://www.fool.co.uk/2026/01/23/3-cheap-uk-shares-tipped-to-grow-104-or-more-in-2026/",
                "body": "The FTSE 100 and FTSE 250 are still soaring, but the UK is still a great place to buy cheap shares. Some quality names have actually fallen in price, providing scope for a potential share price rebound in 2026.\nI’ve done some research to dig out stocks with the best chances of a recovery this year. My work shows that City analysts think their share prices will double in value or more during the next 12 months.\nI too am optimistic these cheap stocks could rebound. Want to know why I think they’re worth considering right now?\nGamma Communications\nGamma Communications (LSE:GAMA) helps companies switch to cloud-based systems, allowing them to modernise how they handle voice, video and messaging communications. It’s a hot growth area, but one that’s currently underperforming amid tough economic conditions.\nYet analysts remain overwhelmingly positive on the stock. Of the eight studying the FTSE 250 firm, seven consider it a Strong Buy, with the remaining one rating it a Buy.\nEven the least optimistic of this grouping’s predicting a sharp price rebound over the next 12 months. They’re tipping a 21% rise, to £10.80. The most bullish number cruncher, meanwhile, is expecting Gamma shares to reach £18.20, a whopping 104% uplift.\nHelped by falling interest rates, demand for its services might rebound strongly as businesses boost IT-related investment. Gamma will also benefit approaching the shutdown of all copper-based phone services in the UK next January.\nCard Factory\nCard Factory‘s (LSE:CARD) another FTSE 250 company trending lower over the last year. Not even its focus on the value end of the greetings market has protected its share price. But could it be about to turn higher?\nSeven brokers currently have ratings on the retailer. And their views on the company are largely positive — five class it as a Strong Buy, with two giving it a Hold rating.\nThis is reflected in their price forecasts for Card Factory shares. One analyst thinks the price will reach 170p during the next year, up 153% from today. Even the least bullish forecasts predicts a healthy 12% increase, to 75p.\nA prolonged downturn in the UK economy could hinder any such price recovery. But aided by recent international expansion, I think Card Factory could bounce back strongly this year.\nJD Sports Fashion\nJD Sport Fashion (LSE:JD.) is another casualty of tough market conditions. In particular, it’s struggled to tackle weak consumer spending in its major US region. Fierce competition on main street and online haven’t helped it either.\nCity analysts aren’t overwhelmingly positive in their view of the FTSE 100 share. But opinions are undeniably more positive than negative. Out of 17 rating the stock, seven consider it a Strong Buy or Buy. The remainder have a Hold rating, with not a single one giving it a Sell.\nThe most optimistic JD share price target is 200p, up 146% from today. The most pessimistic is 85p, suggesting a 5% increase.\nI think there’s a good chance of a robust rebound as analysts expect. Conditions are improving in North America — this week it reported “improved” like-for-like sales there. And the broader athleisure fashion segment is tipped for further broad growth."
            },
            {
                "title": "West Craven woman named one of UK's 100 most inspiring female entrepreneurs - cravenherald.co.uk",
                "source": "cravenherald.co.uk",
                "url": "https://www.cravenherald.co.uk/news/25790368.coach-named-uks-100-inspiring-female-entrepreneurs/",
                "body": "A West Craven woman has been named one of the UK’s 100 most inspiring female entrepreneurs.\nDeborah Bulcock from Sough, who runs Deborah Bulcock Coaching, has been recognised as part of Small Business Britain’s f:Entrepreneur #iAlso100 campaign, which celebrates women driving innovation and impact through their businesses.\nMs Bulcock said: \"When I was told I’d been selected by Small Business Britain as one of the 100 women, I gratefully accepted, knowing how important this campaign is.\n\"Female entrepreneurship still lags behind, representing a missed opportunity for the economy, flexible work, families and women themselves.\n\"This initiative is about paving the way, setting an example and showing what’s possible when people build businesses on their own terms.\"\nMs Bulcock supports senior leaders through executive coaching, leadership development, and strategic advisory work.\nShe has worked with clients across FTSE 100 and 250 firms, the public sector, and fast-growing start-ups.\nMichelle Ovens CBE, CEO and founder of Small Business Britain, said: \"It is brilliant to feature Deborah Bulcock in this year’s #IAlso100 campaign.\n\"All of the female entrepreneurs in this year’s line-up are inspirational and remarkable role models.\n\"Their creativity, leadership, and community impact show exactly why supporting female founders is so important, not only for the UK’s economic growth but for the positive difference they make to wider society.\"\nEstimates suggest that up to £250 billion could be added to the UK economy if women started and scaled businesses at the same rate as men, according to The Invest Women Taskforce.\nMs Bulcock added: \"If sharing my story encourages even one person to believe in themselves and take a step forward, that’s a legacy worth leaving.\"\nMs Bulcock is also an Amazon best-selling author, a non-executive director, a food bank trustee, and an active presence on LinkedIn."
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "173.750",
            "open": "24,893.520",
            "close": "24,831.120",
            "high": "24,948.120",
            "low": "24,774.370"
        },
        "market_summary": "### GER40 Market Briefing\n\n* **Key Drivers:** The European Central Bank's (**ECB**) policy dilemma, **inflation** concerns, and **Germany's industrial production** are driving the **GER40**.\n* **Price Action:** The index is experiencing **choppy swings** and **sharp intraday reversals** around key zones, indicating a **tug-of-war** between **bulls** and **bears**. The **GER40** is hovering around a crucial decision zone, with **cautious optimism** and **underlying macro stress**.\n* **Technical Outlook:** Immediate support is near the **50-day moving average**, with resistance at the **recent highs** of **$15,500**. A break above this level could indicate **bullish momentum**, while a break below could signal **bearish** sentiment.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "DAX 40: Hidden Opportunity or Trap Door Risk for Germany’s Blue-Chip Index? - AD HOC NEWS",
                "source": "AD HOC NEWS",
                "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/dax-40-hidden-opportunity-or-trap-door-risk-for-germany-s-blue-chip/68512591",
                "body": "DAX 40: Hidden Opportunity or Trap Door Risk for Germany’s Blue-Chip Index?\n23.01.2026 - 15:46:25Get the professional edge. Since 2005, the 'trading-notes' market letter has delivered reliable trading recommendations – three times a week, directly to your inbox. 100% free. 100% expert knowledge. Simply enter your email address and never miss a top opportunity again. Sign up for free now\nVibe Check: The DAX 40 is in classic tug-of-war mode – not a euphoric melt-up, not a brutal crash, but a tense, emotional battlefield between cautious dip-buyers and macro-worried bears. Price action is defined by choppy swings, sharp intraday reversals, and constant fakeouts around key zones. That is exactly the kind of environment where disciplined traders can shine while FOMO chasers get punished.\nInstead of a clean straight-line rally, the German benchmark is showing a nervous, stop-hunt-heavy structure: quick pops on positive headlines, followed by fast profit-taking whenever economic doubts or central bank anxiety resurface. This is not weak; it is what a market looks like when big money is repositioning under the surface and nobody wants to admit yet whether we are closer to a fresh bull phase or a deeper correction.\nThe Story: To understand the current DAX mood, you have to zoom out from the candles and look at the European macro mix: ECB policy, German industry, energy prices, the euro versus the dollar, and global risk appetite.\n1. ECB and interest-rate nerves\nThe European Central Bank remains the main puppet master. Inflation in the eurozone has cooled compared to the extreme spikes of the previous years, but it is still sticky enough to keep the ECB in a cautious stance. Markets are constantly trying to front-run future rate cuts: whenever investors sense that the ECB might pivot to a more dovish tone, European equities, including the DAX, see a wave of risk-on buying. But any signal that the ECB could stay restrictive for longer quickly flips the script back to risk-off.\nThat push–pull dynamic is feeding into German blue chips that are highly sensitive to financing conditions, from industrial giants to real estate-exposed names. Cheaper money would be rocket fuel for growth and cyclicals, but a longer spell of tight policy keeps a lid on valuations and encourages investors to stay selective rather than all-in.\n2. German economy: industrial powerhouse under pressure\nGermany’s core story is still industrial production, exports, and the auto sector. But the narrative has shifted from unstoppable powerhouse to fragile champion. Manufacturing data has been sending mixed signals: some stabilisation in orders, but no clear breakout in momentum. The market is stuck between fears of a prolonged industrial slowdown and hopes that the worst of the energy and demand shock is already behind us.\nThe German auto heavyweights – the classic backbone of the DAX – are in the spotlight. They are fighting on multiple fronts: competition from US and Asian EV players, tightening emissions rules, and a shifting global demand map. When headlines are positive (for example, strong order books, better margins, or resilient guidance), the DAX gets a lift. When there are warnings about demand in China or cost pressure, the index feels the hit immediately.\n3. Energy prices and Germany’s cost base\nEurope’s energy drama is no longer at full crisis mode, but it is far from irrelevant. Natural gas and electricity prices remain a structural concern for Germany’s energy-intensive industries: chemicals, metals, and manufacturing. Even if spot prices are calmer, companies are still adjusting to the reality of higher average costs than in the pre-crisis era. That bites into margins and caps how aggressively investors are willing to rerate these stocks.\nEvery time energy prices calm down or supply looks secure, you see renewed interest in cyclicals and industrials. Any hint of energy tension or geopolitical risk, and the DAX feels the weight again. This is why traders mus"
            },
            {
                "title": "DAX 40 Breakout or Bull Trap? Is Germany Hiding the Biggest Opportunity in Europe Right Now? - AD HOC NEWS",
                "source": "AD HOC NEWS",
                "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/dax-40-breakout-or-bull-trap-is-germany-hiding-the-biggest-opportunity-in/68512466",
                "body": "DAX 40 Breakout or Bull Trap? Is Germany Hiding the Biggest Opportunity in Europe Right Now?\n23.01.2026 - 14:59:30Get the professional edge. Since 2005, the 'trading-notes' market letter has delivered reliable trading recommendations – three times a week, directly to your inbox. 100% free. 100% expert knowledge. Simply enter your email address and never miss a top opportunity again. Sign up for free now\nVibe Check: The DAX 40 is sitting in a crucial decision zone, caught between cautious optimism and underlying macro stress. Instead of a clean, trending move, we are seeing a tense mix of choppy sessions, sudden spikes, and fast profit taking. German blue chips have shaken off some of the darkest recession fears, but nobody is fully relaxing. This is classic late-cycle behaviour: rallies that look powerful on the surface but are built on a very fragile foundation of central bank hope and global liquidity.\nOn the surface, European indices are trying to push higher, with the DAX hovering around a region that traders recognise as a major battleground for bulls and bears. The market is not collapsing, but it is not mooning either. Think grinding climb with traps on both sides: late buyers risk getting shaken out, early shorts risk getting squeezed hard. Volatility is hiding under the calm, and that is exactly what short-term traders want.\nThe Story: To understand what is really driving the DAX right now, you have to zoom out to the European and global macro picture.\n1. ECB vs Inflation vs Growth\nThe European Central Bank is stuck in a classic policy dilemma. Inflation has cooled compared to its peak, but it is not fully tamed, while growth in Germany and the wider Eurozone remains weak. That means every ECB meeting and every speech from ECB officials is a volatility event for the DAX.\nMarkets are trying to price in the timing and depth of potential rate cuts. Too fast and the ECB risks reigniting inflation. Too slow and they risk strangling already fragile industrial activity. The current narrative from CNBC Europe and other outlets is all about this balancing act: can the ECB pivot to a more growth-friendly stance without destroying their inflation-fighting credibility?\nFor the DAX, that tension is everything. Lower rates would support valuations for exporters, autos, and growth names. But if the ECB sounds too hawkish, you will see immediate pressure on high-beta DAX components and cyclical sectors. Traders are basically front-running central bank language day by day.\n2. German Economy: From \"Sick Man of Europe\" to Quiet Stabilisation?\nGermany has been battling a cocktail of negative drivers: high energy costs, weaker global demand, structural issues in autos and manufacturing, and uncertainty around China. The recession narrative dominated headlines, and at one point sentiment around German assets was outright toxic.\nLately, the tone has shifted from pure doom to cautious stabilisation. Manufacturing data is no longer collapsing; it is more in a fragile sideways pattern. That is not bullish in a classic sense, but it is less bad than feared. And in markets, \"less bad\" after extreme pessimism often equals a powerful relief rally.\nGerman autos and industrials remain under intense scrutiny. Any positive surprise in order books, export data, or guidance from names like VW, BMW, Siemens, or the big chemical players can quickly flip sentiment. When those sectors show even a hint of recovery, DAX bulls tend to step in aggressively, betting that the worst is behind us.\n3. Euro vs Dollar, Energy, and Global Risk Mood\nThe DAX is not just a German story; it is a global risk asset that reacts to the US dollar, commodity prices, and Wall Street sentiment.\n- Euro vs Dollar: A softer euro is generally supportive for DAX exporters, making German products cheaper abroad and boosting earnings translated back into euros. A stronger euro, driven by expectations of a more hawkish ECB relative to the Fed, can weigh on export-heavy sectors and cap ind"
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "256.000",
            "open": "25,410.370",
            "close": "25,485.280",
            "high": "25,596.870",
            "low": "25,340.870"
        },
        "market_summary": "### NDX100 Market Briefing\n* **Key Drivers:** The **NDX100** is poised for a critical earnings season with the \"Magnificent Seven\" tech giants, including **Microsoft**, **Apple**, **Nvidia**, **Alphabet**, **Meta**, and **Tesla**, set to report. The market is focusing on **AI infrastructure buildout**, **digital advertising**, and **enterprise & AI spending** versus **consumer softness**.\n* **Price Action:** The **Nasdaq Composite** ended the week slightly up, with the **NDX100** showing **bullish momentum** ahead of the big tech earnings reports. The index is currently trading near **23,500**, with **23,000** acting as a key psychological support level.\n* **Technical Outlook:** Immediate resistance for the **NDX100** is at **24,000**, while support is at **22,500**. The **50-day moving average** is near **22,800**, which could be a crucial level to watch in case of a market downturn.\n\n--- \n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Stock market today: Dow, S&P 500 cap volatile week with back-to-back weekly losses - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-cap-volatile-week-with-back-to-back-weekly-losses-210233078.html",
                "body": "US stocks were mixed on Friday, as Wall Street capped a turbulent week stoked by President Trump's heated pursuit of Greenland, while chipmaker Intel (INTC) sank after its earnings disappointment.\nThe Dow Jones Industrial Average (^DJI) retreated roughly 0.6%. The S&P 500 (^GSPC) rose slightly, and the Nasdaq Composite (^IXIC) gained 0.2%.\nAll three major indexes posted back-to-back weekly losses.\nIntel posted worse-than-expected first quarter guidance late Thursday, raising concerns about its turnaround. The chip giant swung to a quarterly loss as it struggled to meet demand for its server chips used in AI data centers. Shares sank over 16% Friday.t\nStocks recorded weekly losses for the second week in a row as the relief that lifted stocks for two straight days of gains wore off. After a rough start to a holiday-shortened trading week, investors took heart from Trump cooling his Greenland rhetoric and backtracking on proposed tariffs on NATO allies. Trump argued that his moves worked out, as the market was \"just about even\" for the week.\nThat said, a shift out of US assets is gaining traction as US-EU tensions weigh on the dollar (DX-Y.NYB). And gold (GC=F) headed toward its best week since 2020, while silver (SI=F) topped $100 per ounce.\nElsewhere, there were signs of progress on the China-US front, as TikTok and ByteDance finally closed a deal with Oracle (ORCL) and others to let it operate in the US. Meanwhile, Beijing has reportedly told China's big techs they can start preparations to order Nvidia's (NVDA) H200 chips, whose imports are currently curbed.\nInvestors are bracing for a blockbuster earnings week next week, along with the Federal Reserve's meeting and interest rate decision. Trump said Thursday he has a pick for the next Fed chair in mind after wrapping up interviews, and he will name the replacement for Jerome Powell \"soon.\"\nLIVE COVERAGE IS OVER 22 updates- Ines Ferré\nS&P 500 posts back-to-back weekly loss\nUS markets finished the week on a mixed note on Friday, following days of volatility driven by geopolitical noise and a tech sector stumble.\nIntel (INTC) slid after the chipmaker posted underwhelming earnings, adding pressure to sentiment.\nThe Dow Jones Industrial Average (^DJI) retreated roughly 0.6%. The S&P 500 (^GSPC) rose just above the flat line, and the Nasdaq Composite (^IXIC) rose 0.2%.\nThe Dow, S&P 500, and Nasdaq posted back-to-back weekly losses.\nMeanwhile, gold (GC=F) saw its best week since 2020, while silver (SI=F) topped $100 per ounce for the first time.\n- Ines Ferré\nTesla is a 'believe or not' religion, not a stock based on fundamentals: Robinhood exec\nYahoo Finance's Francisco Velasquez reports:\nRead more here.\n- Grace O'Donnell\nAt Davos, fears about AI-driven job loss take center stage\nWorld leaders, from BlackRock CEO Larry Fink and JPMorgan CEO Jamie Dimon to the tech leaders ushering in advanced artificial intelligence models, had a lot to say about the potential for AI-driven layoffs and labor market alterations at the World Economic Forum in Davos, Switzerland, this year.\nYahoo Finance's Daniel Howley reports:\n- Grace O'Donnell\nAlaska Air stock jumps as premium push bears fruit\nAlaska Air Group (ALK) saw progress in its premium seat and international flight push in the latest sign of airline competition for high-income customers.\nOn Thursday, the airline reported adjusted earnings of $0.43, above consensus estimates of $0.11 per share, according to data compiled by S&P Global Market Intelligence. Revenue of $3.6 billion was roughly in line with analyst estimates on annual capacity growth of 2.2%.\nAlaska Air primarily operates routes along the US West Coast and plans to expand its international flights from two to five to eventually 12, including flights to London and Rome.\nThe stock rose about 5% on Friday afternoon.\nEchoing results from Delta (DAL) and United (UAL), Alaska Air said it saw strong demand in its premium segment in its earnings call on Friday.\nFirst Class and Premium C"
            },
            {
                "title": "Nasdaq 100 Forecast: “Magnificent Seven” Q4 2025 Earnings Preview - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/ie/news-and-analysis/nasdaq-100-forecast-magnificent-seven-q4-2025-earnings-preview/",
                "body": "Magnificent Seven, Nasdaq 100 Key Points\n- For the Magnificent Seven, the AI capex cycle is increasingly colliding with the real world: debt markets, power grids, and regulation.\n- This earnings season is no longer about whether AI is real, but whether the AI boom is entering a phase where these real world constraints will weigh on growth.\n- time.\nOver the last few years, the “Magnificent Seven” (Microsoft, Apple, Nvidia, Alphabet/Google, Meta/Facebook, and Tesla) largely marched together.\nEntering the current reporting window, however, differences matter again: AI and cloud-attached firms are being rewarded for infrastructure and monetization momentum, while consumer-sensitive and ad-exposed companies are more dependent on demand resilience and margin leverage.\nSource: TradingView, StoneX\nMagnificent 7 Earnings “Cheat Sheet”\nBelow is a compact, sourced “cheat sheet” with the expected report dates (company announcements / calendars) and the commonly-quoted consensus EPS figures available publicly right now:\nOptions Implied Earnings Moves\n“Magnificent Seven” Themes to Watch this Earnings Season\n- The Ongoing AI Infrastructure Buildout\nThe first and biggest evolution is that the AI capex cycle is increasingly colliding with the real world: debt markets, power grids, and regulation. 2026 capex estimates for the largest “hyperscalers” is widely forecast to hit the $600B+ range, driven primarily by AI infrastructure. At the same time, major tech firms have leaned more heavily into debt issuance to fund the infrastructure race. This matters for earnings because the market’s attention is moving from “who spends the most” to “who can sustain the spend without eroding free cash flow,” especially if AI monetization takes longer than expected.\nThat financing story runs straight into the second constraint: power. Datacenter development is increasingly bottlenecked by grid interconnections, equipment lead times, and local permitting. In some markets, datacenters face multi-year grid connection delays, and energy dynamics are already becoming a political and economic story in their own right. In practical terms, this makes AI capacity a more delicate operational issue than the market may assume, particularly for the largest cloud platforms.\nThis is where Microsoft, Amazon, Alphabet and Meta will be pressed most directly. Azure in particular is under a microscope, with traders hyper-focused on whether growth is decelerating and how much of that is demand versus capacity. Amazon has signaled that capex is likely to remain elevated into 2026 as it expands cloud capacity, and that’s the type of forward guidance that can swing sentiment sharply depending on how confident management sounds about payback. For Meta, the advertising engine remains healthy (more below), but the company has openly framed 2026 as another year of heavy AI infrastructure investment, which keeps the “ROI debate” front and center.\n- Digital Advertising\nWhile AI infrastructure dominates the top of the agenda, digital advertising is quietly setting up as the second major swing factor. According to Dentsu, global ad spending is expected to rise 5.1% and surpass $1 trillion in 2026 for the first time, with algorithm-driven advertising comprising roughly 71.6% of total spend.\nThat’s supportive for Alphabet and Meta broadly, but the details will matter. Meta, for example, has emphasized the scale of short-form consumption and monetization progress, but it will also need to justify the investment surge supporting ad delivery systems. Amazon’s ad business remains the wild card and could again be the biggest advertising story inside the Mag 7 if spending holds up.\n- Enterprise & AI Spending vs. Consumer Softness\nA third theme is the omnipresent “two-speed economy,” with the dividing line between AI-accelerated enterprise demand versus discretionary hardware and autos.\nApple may have a difficult time spinning a strong narrative this quarter because the market is weighing strong iPho"
            },
            {
                "title": "Nasdaq Leads Ahead of Big Tech Earnings: Stock Market Today - Kiplinger",
                "source": "Kiplinger",
                "url": "https://www.kiplinger.com/investing/stocks/nasdaq-leads-ahead-of-big-tech-earnings-stock-market-today",
                "body": "It was a mixed day on Wall Street, with technology lifting the Nasdaq Composite and the S&P 500 as Apple (AAPL), Meta Platforms (META), Microsoft (MSFT) and Tesla (TSLA) prepare to report earnings next week. Financials dragged on the Dow Jones Industrial Average after President Donald Trump sued JPMorgan Chase and CEO Jamie Dimon.\n\"The trend is still positive,\" writes Louis Navellier of Navellier & Associates, \"with the leading risks including geopolitical uncertainties, uncertain timing on when the Supreme Court will rule on tariffs, and the upward pressure on interest rates that is being driven by Japan.\"\nAs Navellier concludes, \"The focus next week will be on earnings, which should be positive for investor sentiment.\" Four of the Magnificent 7 stocks are scheduled to report results and provide guidance next week.\nFrom just $107.88 $24.99 for Kiplinger Personal Finance\nBecome a smarter, better informed investor. Subscribe from just $107.88 $24.99, plus get up to 4 Special Issues\nAlphabet (GOOGL) will report on February 4, Amazon.com (AMZN) on February 5. Nvidia (NVDA) and CEO Jensen Huang, the primary drivers of the AI boom, will report fiscal 2026 fourth-quarter results on February 25.\nInvestors, traders and speculators will also digest the next Fed meeting, which begins this Tuesday, ends on Wednesday and is the highlight of next week's economic calendar. CME FedWatch shows a 97.2% probability that the central bank maintains a target range of 3.50% to 3.75% for the federal funds rate.\nAt the closing bell, the Nasdaq Composite was up 0.3% to 23,501, though the tech-heavy index was down 14 points, or 0.06%, this week. The S&P 500 was up 0.03% to 6,915, but fell 0.4% over the five days. The Dow Jones Industrial Average was down 0.6% to 49,098, sliding into a weekly loss of 0.5%.\nBAH rises above DOGE\nBooz Allen Hamilton (BAH) is off to a strong start so far in 2026, rising 13.5% even before it announced results before the opening bell. The industrial stock added 6.8%, rallying as much as 13.9%, after management reported expectations-beating earnings per share and raised its full-year EPS forecast.\nFiscal 2026 third-quarter EPS of $1.77 beat Wall Street's estimate of $1.27, though revenue of $2.6 billion came up short of a $2.7 billion consensus.\nLooking for more timely stock market news to help gauge the health of your portfolio? Sign up for Closing Bell, our free newsletter that's delivered straight to your inbox at the close of each trading day.\nHeadquartered near Washington, D.C., in McLean, Virginia, Booz Allen makes about 98% of its money from contracts to provide IT and related services to the federal government, mostly its national security departments and agencies.\nAdditionally, Booz Allen announced a restructuring in late 2025 in response to federal budget cuts proposed by the Department of Government Efficiency (DOGE), which was led by Tesla CEO Elon Musk.\nBAH stock was down 33% last year, while the S&P 500 was up 17.9%. Price action so far this year represents \"rallying from the floor,” according to Cantor Fitzgerald analyst Colin Canfield, who has a Buy rating and a $160 12-month target price on BAH stock on the prospect of rising defense spending.\nThe president takes on financial stocks\nIn addition to the Mag 7, American Express (AXP) is on the earnings calendar next week. AXP was down 1.7% on Friday. Goldman Sachs (GS) shed 3.7% and was the worst performer among the 30 Dow Jones stocks.\nJPMorgan, named by the president along with its CEO in a lawsuit threatened in a January 17 Truth Social post and filed this week in a Florida state court alleging the bank closed Trump and Trump-related accounts for political reasons, also dragged on price-weighted Dow with a loss of 2.0%.\n\"Plaintiffs are confident that JPMC's unilateral decision came about as a result of political and social motivations, and JPMC's unsubstantiated, 'woke' beliefs that it needed to distance itself from President Trump and his conservative politic"
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "57.290",
            "open": "6,891.510",
            "close": "6,906.920",
            "high": "6,935.680",
            "low": "6,878.390"
        },
        "market_summary": "### SPX500 Market Briefing\n\n* **Key Drivers:** None of the provided articles mention the SPX500 or any relevant financial news that could impact the index.\n* **Price Action:** No information available from the provided articles to analyze the current price action of SPX500.\n* **Technical Outlook:** Without relevant data or news, it's impossible to provide a technical outlook for SPX500 based on the given articles.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "Colorado investigators confirm Hunter S Thompson’s 2005 death was a suicide - The Guardian",
                "source": "The Guardian",
                "url": "https://www.theguardian.com/books/2026/jan/23/hunter-thompson-journalist-suicide-investigation",
                "body": "A review of the 2005 shooting death of the journalist Hunter S Thompson has confirmed authorities’ original finding that his death was a suicide, Colorado investigators said on Friday.\nThe review by the Colorado bureau of investigation (CBI) was announced in September after Thompson’s wife, Anita Thompson, contacted authorities with “new concerns and potential information regarding the investigation” into Thompson’s death, the agency said in a news release.\nIn a statement included in the announcement, she thanked the bureau for its “kind and thorough work”.\n“This allows all of us who loved Hunter to move forward with a clean conscience,” she said.\nThompson, who popularized a first-person form of gonzo journalism in articles and books such as Fear and Loathing in Las Vegas, died at his Aspen-area home in February 2005. He was 67.\nHis remains were cremated and fired from a cannon at his request during a private ceremony in Colorado. Among the celebrities who attended was the actor Johnny Depp, who played the lead role in the 1998 film adaptation of Fear and Loathing in Las Vegas.\nThe sheriff for the Aspen area, Michael Buglione, said he believed the original investigation into Thompson’s death was conducted properly but investigators recognized the importance of an independent review.\nThe “CBI’s conclusions reaffirm the original findings and, we hope, provide reassurance and clarity,” he said."
            },
            {
                "title": "The Dangers That Scientists Found Inside L.A.’s Smoky Homes - The Atlantic",
                "source": "The Atlantic",
                "url": "https://www.theatlantic.com/science/2026/01/urban-fire-health/685723/",
                "body": "The Dangers That Scientists Found Inside L.A.’s Smoky Homes\nThe first studies of last year’s fires have revealed some unexpected hazards of urban mega-fires.\nAfter just a year, the fires that spread around Los Angeles are already the most studied urban wildfires in history. While the Palisades Fire lapped at the edge of UCLA, the Eaton Fire, on the east side of town, came dangerously close to Caltech. Even as the fires were spreading, these research powerhouses, as well as the University of Southern California, deployed sensors, scientists, and new hypotheses. Researchers around the city began collecting water, soil, and air samples; physicians started to recruit participants into long-term health studies.\nEven as the researchers absorbed the reality of the damage across an area that included 20 million residents, they understood that this was a chance, one that might never exist again, to better understand the nature of these types of disasters. These particular fires offered researchers opportunities to collect samples in ways they hadn’t before been able to—“so close to the fire and so timely,” Yifang Zhu, an environmental scientist at UCLA, told me.\nSome of these efforts will take years to become fully fleshed out. The Los Angeles Fire Human Exposure and Long-Term Health Study, for instance, is a multi-institution, 10-year effort to better understand the short- and long-term health impacts of the fires. A year after the fires, though, researchers have some early answers to what happens to mental and physical health after wildfires move from trees and shrubs to homes and buildings.\nNot all fires are the same, and although these fires started in the hills with scrub brush, they ended up in urban areas, flaming through more than 18,000 structures. “It’s a new type of fire, because it’s an urban conflagration,” David Eisenman, a researcher at UCLA who has spent the past 25 years studying the impact of disasters on mental and physical health, told me. These fires may start in areas where wildland and urban settlements edge up against one another, but as they spread, they “mostly consume, by volume, man‑made products in megacities—that’s a real difference.” Researchers have long studied what goes into the air when trees burn in a fire, but when the fuel is homes, cars, and businesses—the stuff of people’s lives—what ends up in the air is largely unknown. The many chemicals, including asbestos and lead, in our homes can form a toxic soup. The combustion process can also create new hazards; scientists were surprised to find airborne nanoparticles of hexavalent chromium, the contaminant made famous by the movie Erin Brockovich, hanging around cleanup sites.\nOne surprise lesson was that the fire risk didn’t end once the smoke had dissipated. Levels of benzene spiked, then came down after about a week. But even after the outdoor air began to clear, measures of hazardous chemicals in indoor air showed signals from fire-related compounds that had infiltrated people’s homes and kept off‑gassing. While people were looking to the smoke and fire as the danger, scientists were seeing real risk lurking inside homes, as people hunkered down. “The outdoor air became cleaner, but the indoor levels went up,” Zhu said.\nSmoke has been linked to increased respiratory and heart problems, so researchers were already on high alert for some issues. Still, they dug into emergency-room data from the weeks after the fire started without any assumptions about what they might find. When researchers combed through emergency diagnoses at Cedars-Sinai Medical Center for people living in fire-affected zip codes, then compared those numbers with the same period across the previous seven years, they found that respiratory illness spiked by 24 percent. They also observed a 46 percent increase in heart-attack rates. (Fine particulates from smoke can trigger inflammation and disrupt heart rhythms.) Although researchers expected to see some of these effects, the scal"
            },
            {
                "title": "Hunter S. Thompson’s death affirmed as a suicide - cpr.org",
                "source": "cpr.org",
                "url": "https://www.cpr.org/2026/01/23/hunter-s-thompsons-death-confirmed-suicide/",
                "body": "Editor's Note: This story contains mention of self-harm. If you or someone you know is considering suicide or other acts of self-harm, please visit 988Colorado.com, or call or text 988 from your cell phone for free, confidential, and immediate support.\nAfter a months-long review into the 2005 death of author and journalist Hunter S. Thompson, the Colorado Bureau of Investigation confirmed Friday that his death was a suicide.\nCBI began its review in September following a request from the Pitkin County Sheriff’s Office. Thompson’s widow had shared new concerns and potential information with the sheriff regarding the investigation into his death at their home in Woody Creek, a small town near Aspen.\nThe agency conducted interviews, reviewed law enforcement records and autopsy reports, and examined the scene. The CBI said Friday it did not uncover any new physical evidence, facts or circumstances.\nThompson died from a self-inflicted gunshot wound at age 67 on Feb. 20, 2005.\nAccording to CBI, interviews confirmed Thompson suffered from significant depression and chronic pain. The coroner noted that Thompson’s physical and mental health were in decline and that he had reported suicidal ideation.\n“While we have always believed the original investigation was conducted properly, we recognized the importance of an independent review for the Thompson family,” Pitkin County Sheriff Michael Buglione said in a statement.\nThompson is known for literary works like \"Fear and Loathing in Las Vegas,\" \"The Rum Diary\" and \"Hell’s Angels: A Strange and Terrible Saga.” He is also credited for pioneering a first-person style of reporting.\n“I’m thankful for the kind and thorough work done by the Colorado Bureau of Investigation in its review of this case, and for not a single attempt to overstep the ethical boundaries of a technical review, especially under such difficult circumstances,” his widow, Anita Thompson, said. “This allows all of us who loved Hunter to move forward with a clean conscience.”\nIf you need help, dial 988 to reach the Suicide and Crisis Lifeline. You can also reach the Colorado Crisis Services hotline at 1-844-493-8255 or text “TALK” to 38255 to speak with a trained counselor or professional. Counselors are also available at walk-in locations or online to chat."
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "896.250",
            "open": "53,263.020",
            "close": "54,007.290",
            "high": "54,109.270",
            "low": "53,213.020"
        },
        "market_summary": "### JPN225 Market Briefing\n\n* **Key Drivers:** The Bank of Japan's decision to keep its key interest rate unchanged at **0.75%** and upgrade its estimates for future inflation and economic growth has supported the **JPN225**, along with a modestly stronger yen.\n* **Price Action:** The **JPN225** edged **0.2%** higher to **53,800.28**, showing **bullish momentum** as banks outperformed on higher yields.\n* **Technical Outlook:** Immediate support is near the **50-day moving average** at **52,500**, with resistance at **55,000**.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Yen jumps against dollar on intervention watch - Nikkei Asia",
                "source": "Nikkei Asia",
                "url": "https://asia.nikkei.com/business/markets/currencies/yen-jumps-against-dollar-on-intervention-watch",
                "body": "NEW YORK/LONDON -- The yen rose sharply against the dollar in volatile trading Friday, hitting the 155 yen range as currency market players kept alert for signs of an intervention by the Japanese government and the Bank of Japan.\nJapan's currency takes wild ride after BOJ chief shows no urgency on rate hikes\nThe yen gained sharply against the dollar during New York trading hours. © Reuters\nNEW YORK/LONDON -- The yen rose sharply against the dollar in volatile trading Friday, hitting the 155 yen range as currency market players kept alert for signs of an intervention by the Japanese government and the Bank of Japan."
            },
            {
                "title": "Asian shares, US futures gain as Japan keeps its key interest rate unchanged - baytobaynews.com",
                "source": "baytobaynews.com",
                "url": "http://baytobaynews.com/middletownsmyrna/stories/asian-shares-us-futures-gain-as-japan-keeps-its-key-interest-rate-unchanged,288891",
                "body": "Asian shares and U.S. futures were modestly higher Friday after U.S. regained more of their losses after a tumultuous several days.\nTokyo's Nikkei 225 edged 0.2% higher to 53,800.28 after the Bank of Japan kept its key interest rate unchanged, as expected. The central bank just raised the policy rate to 0.75% in December. Wrapping up its policy meeting, it also slightly upgraded its estimates for future inflation and economic growth.\nThe Japanese yen fell against the U.S. dollar, which was trading at 158.64 yen, up from 158.42 yen.\n“With underlying inflation price pressures remaining firm, we expect the Bank of Japan to resume its tightening cycle in the coming months,” Abhijit Surya of Capital Economics said in a commentary.\nChinese markets also saw moderate gains. The Hang Seng in Hong Kong added 0.3% to 26,718.13, while the Shanghai Composite index also was up 0.3%, at 4,133.58.\nSouth Korea's Kospi climbed 0.6% to 4,983.36. The benchmark had topped 5,000 for the first time on Thursday but fell back later in the day.\nIn Australia, the S&P/ASX 200 edged 0.2% higher to 8,862.20.\nTaiwan's Taiex jumped 0.8% and the Sensex in India was nearly unchanged.\nOn Thursday, the S&P 500 climbed 0.5% to 6,913.35, extending its rally after U.S. President Donald Trump called off tariffs on European countries that he said opposed his calls for U.S. control of Greenland.\nThe Dow Jones Industrial Average rose 0.6% to 49,384.01, and the Nasdaq composite gained 0.9% to 23,436.02.\nDetails were sparse about a deal on Greenland that Trump said he reached with the head of NATO, leaving investors wary of what’s to come. It's not signed yet.\nIt was the latest example of Trump making a big, initial threat, only to pull back after a dramatic reaction in financial markets. The pattern has led to the “TACO” acronym, suggesting that “Trump Always Chickens Out” if markets react strongly enough. Tuesday’s drop for the U.S. stock market was the worst since October and large enough that Trump, who often takes credit when Wall Street is doing well, acknowledged “the dip.”\nJPMorgan Chase rose 0.5% after a lawsuit filed by Trump against the bank caused minor ripples for its stock. Trump accused JPMorgan Chase of closing his accounts for political reasons after he left office in 2021.\nTreasury yields held relatively steady, suggesting foreign investors weren’t rushing out of the U.S. bond market.\nYields got some support from reports on the U.S. economy’s strength that came in better than expected. One said fewer U.S. workers applied for unemployment benefits last week than economists expected in a potential signal that the pace of layoffs remains low. A second suggested the U.S. economy grew at a faster rate during the summer than the government initially estimated.\nA third said that inflation in November was close to economists’ expectations, while spending by U.S. consumers was a touch better than expected.\nGlobal markets have calmed following an easing of long-term Japanese government bonds, which had spiked early in the week on worries that Japan’s Prime Minister Sanae Takaichi might make moves that would add heavily to the government’s already big debt.\nThe 40-year Japanese government bond yield slipped back after hitting a record of more than 4%. It was trading at 3.0955% early Friday.\nIn other dealings early Friday, the price of gold rose 0.8%, remaining close to the $5,000 level. Silver gained 2.3%. Prices of such precious metals often rise when investors are looking for something safer to own.\nU.S. benchmark crude oil added 52 cents to $59.88 per barrel, while Brent crude, the international standard, was up 54 cents at $64.60 per barrel.\nThe euro slipped to $1.1750 from $1.1755.\n___\nAP Business Writers Stan Choe, Matt Ott and Yuri Kageyama contributed."
            },
            {
                "title": "Japan Stocks Today, January 24: BOJ Hold Lifts Banks; Nikkei Extends Rally - Meyka",
                "source": "Meyka",
                "url": "https://meyka.com/blog/japan-stocks-today-january-24-boj-hold-lifts-banks-nikkei-extends-rally-2301/",
                "body": "Japan Stocks Today, January 24: BOJ Hold Lifts Banks; Nikkei Extends Rally\nNikkei today extended its rally after the Bank of Japan kept the policy rate at 0.75% by an 8–1 vote and upgraded its outlook. Banks outperformed on higher yields, while chip names were mixed after Intel’s weak guide. The BOJ press conference with Governor Ueda is the key risk event, as traders seek clues on the yen and the pace of future hikes. With a busy earnings calendar ahead, the BOJ rate decision shapes near-term sector leadership in Japan.\nBOJ hold and upgraded outlook: what it means now\nThe BOJ held the short-term policy rate at 0.75% with an 8–1 vote, signaling a steady hand after recent tightening. The BOJ rate decision keeps financial conditions supportive while acknowledging progress toward its price goal. Markets now price a slower path of hikes, pending the BOJ press conference. Stocks reacted with gains led by rate-sensitive groups, while traders watched JGB yields and the yen for confirmation.\nPolicymakers upgraded their outlook, pointing to sustained inflation near target and firm wage trends. This supports a gradual normalization but not a rapid series of hikes. Any hint of tolerance for higher 10-year yields could lift bank net interest margins. We will watch the BOJ press conference for signals on balance sheet plans and how officials weigh growth risks against sticky services inflation.\nSector moves: banks lead, chips mixed\nMegabanks and insurers outperformed as curve steepening improves lending spreads and investment income. Domestic loan growth and lower deposit beta add support. If long yields rise modestly, value factors can stay in favor. Traders also cited a calmer tone into the BOJ press conference, which reduced volatility hedges. Cash-rich banks with conservative payout policies remain in focus for dividend investors in Japan.\nChip-related names were mixed after Intel’s weak guide, while index heavyweights helped the benchmark advance. Contribution data showed testing and pharma strength aiding the close, reflecting stock-specific flows rather than a broad tech surge. See the day’s contribution snapshot from Yahoo! Finance Japan. Exporters tracked the yen, with investors weighing BOJ tone against global demand for electronics.\nYen watch and what to listen for from Ueda\nA firmer yen typically pressures exporters but supports domestic demand and small caps via lower import costs. A softer yen helps overseas earners and tourism plays. The BOJ press conference can shift FX-sensitive flows within minutes. We focus on references to the neutral rate, wage settlements, and tolerance for higher term yields, all of which set the near-term path for Nikkei today sector leadership.\nFirst, wording on inflation persistence and services prices. Second, guidance on the pace and scale of future hikes or balance sheet runoff. Third, any comment on FX spillovers. Even small changes in phrasing can move USD/JPY. As Reuters noted, traders stayed cautious ahead of remarks, keeping dry powder for post-press moves.\nEarnings calendar and trading playbook\nA busy results slate this week will test the rally. Banks could guide on net interest margins and buybacks. Exporters will detail currency assumptions and orders. Chip names face scrutiny on capex and AI server demand after Intel. The BOJ press conference sets the macro backdrop, but earnings will decide stock selection, especially where guidance and dividend policies surprise.\nConsider barbell exposure: megabanks and insurers for rising-yield support, plus quality exporters with natural hedges and pricing power. Add defensives in healthcare and rail if yen volatility spikes. Use earnings to upgrade winners with improving free cash flow. Keep position sizes flexible around the BOJ press conference and key guidance dates, using staggered entries to manage event risk.\nFinal Thoughts\nJapan’s equity rally extended as the BOJ held at 0.75% with an 8–1 vote and upgraded its outlook, reinforcing a gradual"
            }
        ]
    }
]