[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "106.680",
            "open": "4,671.900",
            "close": "4,763.280",
            "high": "4,766.270",
            "low": "4,659.590"
        },
        "market_summary": "### Gold (XAU/USD) Market Briefing\n\n* **Key Drivers:** Escalating tensions between the U.S. and European leaders, coupled with a \"**sell America**\" trade sentiment, are driving investors towards safe-haven assets, boosting **gold** prices.\n* **Price Action:** **Gold** is on track for its biggest one-day gain since **2020**, with prices spiking as investors flee U.S. assets, indicating strong **bullish momentum**.\n* **Technical Outlook:** The precious metal has broken above key resistance levels, with immediate support near the **$1,900** level, and resistance at **$2,000**.\n\n---\n**Overall Sentiment:** Positive ️",
        "source_articles": [
            {
                "title": "How Gold’s Safe-Haven Appeal Is Fueling Record Prices - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/articles/2026-01-20/gold-price-record-how-trump-s-greenland-tariff-threat-is-spurring-haven-demand",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            },
            {
                "title": "'This is sell America' — U.S. dollar, Treasury prices tumble and gold spikes as globe flees U.S. assets - CNBC",
                "source": "CNBC",
                "url": "https://www.cnbc.com/2026/01/20/sell-america-trade-dollar-treasury-gold-us-trump-greenland.html",
                "body": "The \"sell America\" trade is in full swing Tuesday morning after President Donald Trump and European leaders escalated tensions over Greenland.\nU.S. bond prices tumbled, sending yields spiking. The U.S. Dollar Index, which weighs the greenback against a basket of six foreign currencies, fell nearly 1%. The euro jumped 0.6% against the dollar.\n\"This is 'sell America' again within a much broader global risk off,\" Krishna Guha, head of global policy and central banking strategy at Evercore ISI, wrote in a note to clients.\nPrecious metals gold and silver marched to fresh highs. Gold, which has long been viewed as a safe-haven investment during periods of geopolitical turmoil, was on track for its biggest one-day gain since 2020.\nU.S. stocks tumbled as investors mitigated exposure to American assets. The Dow Jones Industrial Average slid more than 800 points, while the S&P 500 and Nasdaq Composite each dropped more than 2%. The Cboe Volatility Index (VIX), known Wall Street's \"fear gauge,\" spiked to a highs last seen in November.\nThe latest flare-up in so-called sell America positioning follows Trump's threats to impose 10% tariffs on eight European countries as part of his push to take over Greenland. Representatives from the 27-nation European Union gathered for an emergency meeting in response to Trump's tariff call, which he said would start Feb. 1 and then rise to 25% on June 1.\nGreenland has repeatedly rejected Trump's request to purchase the arctic island, with Prime Minister Jens-Frederik Nielsen saying Monday that it would \"not be pressured\" and \"stand firm on dialogue, on respect and on international law.\" European officials are reportedly considering using a salvo of counter-tariffs and other punitive economic measures against the U.S. in retaliation.\nThe \"sell America\" trade suggests that global investors will place higher risk premiums on U.S. investments amid fears that the U.S. is no longer a reliable trading partner. Following Trump's latest threats, some investors worry that European countries could dump U.S. assets in a show of power.\n\"On the other side of trade, deficits, and trade wars, there are capital and capital wars,\" Bridgewater Associates founder Ray Dalio told CNBC's \"Squawk Box\" at the World Economic Forum in Davos, Switzerland. \"If you take the conflicts, you can't ignore the possibility of the capital wars. In other words, maybe there's not the same inclination to buy ... U.S. debt and so on.\"\nThe drop in the U.S. Dollar Index was the largest since Trump's so-called Liberation Day rollout of sharply higher tariffs in April, many of which were subsequently pared back.\nInternational markets continued to slide Tuesday after starting to retreat on Monday, when U.S. markets were closed for the Martin Luther King Jr. Day holiday. Trump's latest threats to tariff French wine and other imported goods rattled investors who feared the U.S. would no longer act as an unwavering commercial ally of Europe. The pan-European Stoxx 600 extended its recent decline, following Asian markets into the red.\nEvercore ISI's Guha said the dollar falling and the euro rising suggests that global investors are \"looking to reduce or hedge their exposure to a volatile and unreliable\" United States. Impacts on the dollar and other U.S. assets could be severe and long-term, if Trump does not walk back his plans — a trade known as \"TACO,\" or \"Trump Always Chickens Out,\" that was coined last spring — or find a compromise, Guha said.\n\"What remains to be determined is the magnitude and duration of these dynamics,\" Guha said.\nMore broadly, investors may be looking for ways to diversify away from U.S. stocks at a time when indexes are near all-time highs and American equities take up a majority of the world's total market capitalization, according to Russ Mould, investment director at AJ Bell.\n\"Markets may already be pricing in full the concept of American exceptionalism, at least barring an epic, crack-up economic boom,\" Mould said. \"It ma"
            },
            {
                "title": "Bitcoin, U.S. Dollar Skid, Gold Rallies On 'Sell America' Trade - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/news/bitcoin-dollar-fall-gold-precious-metals-rally-trump-tariffs-greenland-europe/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #1b4a539c-f68d-11f0-a785-e38ac971f11a"
            }
        ]
    },
    {
        "asset_name": "Silver",
        "symbol": "EIGHTCAP:XAGUSD",
        "status": "Success",
        "data": {
            "day_range": "3.280",
            "open": "94.364",
            "close": "94.492",
            "high": "95.852",
            "low": "92.572"
        },
        "market_summary": "### Silver (XAG/USD) Market Briefing\n* **Key Drivers:** Rising **industrial demand**, **supply deficits**, and **investor activity** are driving **silver** prices higher, with the metal being used in sectors such as **photovoltaics**, **electrification**, and **automotive production**.\n* **Price Action:** The price of **silver** has surged, currently standing at **$93.70** per ounce as of January 20, 2026, representing a growth of over **200%** since January 2025 and a gain from **$71** at the start of the month.\n* **Technical Outlook:** With **Peel Hunt** raising its **first-quarter 2026 silver price estimate** by **67%** to **$75/oz** and the **full-year 2026 forecast** by **79%** to **$75/oz**, the outlook remains **bullish** due to **tight supply** and **rising industrial demand**.\n\n--- \n**Overall Sentiment:** Positive 🚀",
        "source_articles": [
            {
                "title": "What is the price of silver today? - CBS News",
                "source": "CBS News",
                "url": "https://www.cbsnews.com/news/what-is-the-price-of-silver-today/",
                "body": "What is the price of silver today?\nIn recent years, with inflation problematic and higher interest rates impacting investors of all types, many turned to gold for protection and portfolio diversification. And the yellow metal subsequently surged in price, surpassing numerous price records on its way toward the $5,000 per ounce mark. But another precious metal has quietly but impressively grown at the same time: silver.\nLong considered the cost-effective precious metal alternative to gold, the price of silver has surged recently and is now up by more than 200% from where it sat in January 2025. And that remarkable growth could easily continue in the weeks and months ahead, especially if certain economic conditions are met. This potential can be both daunting and encouraging for prospective investors – and advantageous for those who are already invested in the metal or considering adding more to their portfolio right now.\nTo better determine the value of investing in silver now, it helps to know where the price currently stands. So, what is the price of silver per ounce now, as of January 20, 2026? That's what we'll outline below (and explain why getting invested now could make the most sense).\nProtect your portfolio with gold and silver here now.\nWhat is the price of silver today?\nThe price of silver is $93.70 per ounce as of January 20, 2026, according to American Hartford Gold, a precious metals dealer. That's up from just $71, approximately, at the start of the month, and just $31 for the same amount of metal in January 2025. So the price growth here is unmistakable and, for investors who have been priced out of the gold market entirely, this could be the smart (and affordable) way to get invested in precious metals now.\nWaiting for the price to decline is generally not advisable. While silver prices can be more volatile than gold, over time, they tend to only increase, so waiting for a temporary drop in the price could be an expensive mistake worth avoiding.\nGet started with a silver investment today.\nWhy should you invest in silver now?\nWhile not identical, the benefits of silver investing are similar to those gold offers. Thanks to a consistent price, particularly during inflationary periods, silver can help your portfolio hedge against the corrosive impacts of inflation in a way that other assets cannot. Accordingly, it can help function as a critical diversifier for those whose portfolios are otherwise too heavily made up of stocks, bonds, real estate or other investment types.\nAnd while gold and silver aren't typically considered income-producing assets, a quick glance at the price chart for either over the past year illustrates that, right now at least, both may be able to be sold for a rapid profit. Still, with industrial demand for silver expected to remain powerful, waiting around to invest may not make sense, either. Instead, consider speaking with a financial advisor or precious metal company that can answer any questions you may have and help you determine the exact role silver can play in your portfolio now.\nThe bottom line\nThe price of silver per ounce, as of January 20, 2026, sits just under $94 per ounce. That said, this is the price for the metal before any dealer mark-ups, which can easily cause the price to rise considerably higher. So, if you need the inflation hedge and portfolio diversification the metal represents and don't want to pay the exorbitant price you'd otherwise have to in order to secure the same benefits with gold, it could make sense to get started with the metal this month. Just be sure to keep silver as a critical but limited portion of your overall portfolio, typically capped at 10% or less, to avoid overcrowding your other assets at the same time."
            },
            {
                "title": "inflation and interest rates Archives - GoldSilver",
                "source": "GoldSilver",
                "url": "https://goldsilver.com/tag/inflation-and-interest-rates/",
                "body": "The DOJ vs. Jerome Powell — And Why Gold Is Responding\nAs the DOJ investigates Fed Chair Jerome Powell, markets are reading between the lines. This isn’t about a building—it’s about interest rates, debt pressure, and why gold and silver are already responding."
            },
            {
                "title": "Silver surges as supply deficits, industrial demand drive prices higher – Peel Hunt - Mining Weekly",
                "source": "Mining Weekly",
                "url": "https://www.miningweekly.com/article/silver-surges-as-supply-deficits-industrial-demand-drive-prices-higher-peel-hunt-2026-01-20",
                "body": "Silver surges as supply deficits, industrial demand drive prices higher – Peel Hunt\nPhoto by Bloomberg\nPhoto by Bloomberg\nSilver is entering this year in the spotlight after prices gained almost 150% in 2025, with tight supply, rising industrial demand and investor activity underpinning sharply higher prices, according to Peel Hunt.\nThe brokerage has raised its first-quarter 2026 silver price estimate by 67% to $75/oz, its full-year 2026 forecast by 79% to $75/oz and its 2027 projection to $65/oz, while also increasing its long-run estimate from $30/oz to $50/oz.\nPeel Hunt said on January 20 that the metal remained structurally undersupplied, with global mine production growth remaining weak. The firm estimated 2025 mine output increased by about 2% to 830-million ounces, marking the fifth consecutive year of deficits.\nBase metal operations supplied over 50% of global production, with more than half located in Latin America, while primary silver mines accounted for just 28% of total output. The accumulated deficit between 2021 and 2025 is estimated at about 900-million ounces, continuing to pressure known above-ground stocks held in identifiable bullion inventories.\nInvestment demand has also increased sharply. Peel Hunt estimates net inflows to silver-backed exchange-traded funds (ETFs) reached almost 150-million ounces in 2025, with holdings rising to 864-million ounces by the end of December 2025, before falling slightly to 847-million ounces by January 16. ETF holdings, the firm said, remain a structurally important source of supply and can accentuate price movements.\nIndustrial demand is increasingly shaping the market, the brokerage said. Silver’s applications include its traditional role as a store of value and a critical industrial metal, particularly in sectors driving the green energy transition such as photovoltaics, electrification, and automotive production.\nPeel Hunt noted that industrial demand now accounted for more than half of total consumption, up 50% since 2015. Rising prices had intensified efforts in the photovoltaic sector to reduce silver usage per solar panel, but the firm said alternatives remained limited, including silver-copper pastes and emerging pure copper substitutes.\nGeopolitical and regulatory factors also continue to influence the market.\nFrom January 1, China implemented a new licensing regime for silver exports, restricting eligibility to producers with a minimum output of 80 t/y and a $30-million credit line, effectively limiting exports to 44 companies. The move is intended to ensure domestic industries, including renewables, consumer electronics, and electric vehicles, remain sufficiently supplied.\nPeel Hunt estimated that 60% to 70% of global refined silver supplies could be affected, as much of China’s silver output is a by-product of copper, zinc and gold processing.\nThe US also maintains an unresolved stance on silver as a critical mineral, Peel Hunt noted. In November 2025, the US Geological Survey published its list of critical minerals, prompting speculation that silver could face Section 232 tariffs.\nA proclamation issued by US President Donald Trump did not impose tariffs or quotas, but indicated potential future agreements to secure supplies, floating price floors, and possible levies to support domestic producers. Leading up to this, inventories in the US had built up, while shortages in London and Shanghai created unusual arbitrage opportunities and volatility.\nHistorical comparisons underline silver’s current market conditions. The gold-to-silver ratio, which is used to assess production economics and relative valuation, averaged 60x since 1971 and 69x since 2000. The ratio reached 105x in April 2025, a level considered unsustainable, before falling to 50x following the surge in silver prices. Extreme relative pricing, combined with speculative activity, highlights the market’s volatility and the risk that gains may be unevenly distributed.\nState actor activity has also inf"
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.740",
            "open": "64.227",
            "close": "63.995",
            "high": "65.212",
            "low": "63.472"
        },
        "market_summary": "### Spot Brent Crude Oil Market Briefing\n\n* **Key Drivers:** Disruptions in Black Sea oil production, a decline in the **dollar index**, and reduced global crude supplies are supporting **bullish momentum** for crude oil prices.\n* **Price Action:** February Brent crude oil prices rallied sharply, driven by **supply chain disruptions** and a decline in the **US dollar**, with prices approaching the key resistance level of **$90**.\n* **Technical Outlook:** Immediate support is near the 50-day moving average at **$85**, with resistance at **$92**, as the market reacts to **geopolitical tensions** and **production cuts**.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "OPEC's Smallest Producer Seeks Prepaid Oil and Gas Deals with Traders - Crude Oil Prices Today | OilPrice.com",
                "source": "Crude Oil Prices Today | OilPrice.com",
                "url": "https://oilprice.com/Latest-Energy-News/World-News/OPECs-Smallest-Producer-Seeks-Prepaid-Oil-and-Gas-Deals-with-Traders.html",
                "body": "A new report suggests the…\n\"It's most important 8 minute read of my week…\"\nEquatorial Guinea is looking to strike prepaid oil and LNG delivery deals with commodity traders as OPEC’s smallest oil producer needs money to maintain operating fields and revive its upstream sector, anonymous sources with knowledge of the plans told Bloomberg on Tuesday.\nThe central African country has been struggling to attract upstream investments in recent years and has seen its oil production drop. The country has also been an LNG exporter for two decades.\nBut Equatorial Guinea needs capital to cover expenses and the government’s shares in producing and exploratory assets. Prepayment deals with the major trading houses would give Equatorial Guinea money upfront in exchange for crude and LNG deliveries over time, with interest.\nThe country is looking for $300 million in prepaid funding in return for crude and LNG deliveries over multiple years, according to Bloomberg’s sources.\nPrepaid delivery is a fairly common practice between major commodity traders and governments that need cash to fund upstream development.\nLast year, the government of Equatorial Guinea signed an Incentives Agreement with U.S. supermajor Chevron for the development of the Aseng Gas Project in Block I, which is set to boost LNG exports from the country.\nThe country is struggling to reverse a decline in its oil production, especially after Exxon left Equatorial Guinea in 2024 after a three-decade presence in the OPEC member.\nAs part of its long-term strategy, Exxon divested non-core operations to focus on the Permian, Guyana, and LNG developments globally.\nOver the past few years, trading houses have struck several prepaid deals with African oil and gas producers. The Nigerian National Petroleum Company has launched a $3.3 billion crude oil prepayment facility with Afreximbank, Africa’s multilateral trade finance institution, and commodity trader Gunvor International.\nLast year, Gunvor also provided financial support to Gabon National Oil Company (GOC) for part of the acquisition costs to buy 100% in Tullow’s subsidiary, Tullow Oil Gabon S.A, for a total cash consideration of $307 million.\nBy Michael Kernfor Oilprice.com\nMore Top Reads From Oilprice.com\nADVERTISEMENT"
            },
            {
                "title": "Industry - Five trends impacting oil and gas operators in 2026 - Oil Review Middle East",
                "source": "Oil Review Middle East",
                "url": "https://oilreviewmiddleeast.com/industry/five-trends-impacting-oil-and-gas-operators-in-2026",
                "body": "Paul Bansil, director of KBR’s international consulting business, outlines five major trends that will shape how oil and gas operators navigate the year ahead, as project developers allocate capital more selectively, face growing regulatory scrutiny and tackle the challenges of decarbonising existing assets\n2026 will be defined by bankability, repurposing of existing infrastructure, lifetime planning and geopolitically driven divergence, Bansil says.\n“In 2026, what the industry needs is certainty and bankability. This presents a firm footing to turn good ideas into investable, technically sound projects,” said Paul Bansil “The time pressure has always been there, but the current fiscal and geopolitical uncertainty makes timely decision-making an order of magnitude more challenging for operators, whether they are investing in new opportunities, modernising, repurposing or retiring assets.”\n1. Bankability the decisive success factor\nBansil expects disciplined early-stage development planning to be one of the strongest determinants of project viability in 2026.\n“Many energy transition schemes, including hydrogen, ammonia, fertiliser modernisation and refinery decarbonisation, continue to stall at the pre-FEED or FEED stage because owners have sometimes moved too quickly into engineering without first proving and stress-testing the commercial, regulatory and financial aspects of the business case,” said Paul.\nSuitable fit-for-purpose early-phase opportunity screening will enable operators to focus valuable time and resources on those prospects most likely to progress through project sanction and into execution.\n2. Sanction of undeveloped oil and gas projects\nContinued responsible development of oil and gas projects is emerging as a recognised necessity if an orderly and prosperous energy transition is to be realised.\n“We have seen a re-focus towards energy security in a number of areas. This will continue in 2026 as the demand for hydrocarbon fuels and petrochemical feedstock remains a fundamental cornerstone of our society in a global context,” says Bansil.\n“This is not about one thing versus another, but rather a pathway towards an orderly and sustainable transition built on confidence.”\n3. Existing assets will act as a bridge to energy transition\nA strong emphasis on repurposing and progressive decarbonisation of existing oil & gas, LNG, refining and petrochemical infrastructure is expected as operators seek practical and scalable transition pathways. This will allow affordable production while enabling development of emissions-reducing technologies for further cost-effective reductions in the future.\nThis includes adapting terminals to become multipurpose new energy molecule import terminals to handle a variety of energy carriers including ammonia for import and cracking to hydrogen as well as handling carbon dioxide for sequestration.\nModular LNG and FLNG solutions will remain a key building block in the gas supply chain.\nAt the same time, brownfield decarbonisation is growing across refineries and petrochemical sites, where operators are prioritising retrofit and circularity over greenfield developments. Operators are increasingly turning to lighter feedstocks, recovered gases, recycled hydrocarbons and low-carbon hydrogen options.\n“Gas remains central to system stability and affordability,” Bansil adds. “But the real shift is the industry’s focus on making today’s assets cleaner and more flexible, rather than waiting for perfect conditions for new-build projects.”\n4. Master planning and end-of-life responsibilities come to the fore\n2026 will be the year when structured master planning takes centre stage, encompassing clear consideration of uncertainty. Investors and operators now expect integrated assessments of market outlooks, emissions pathways, technology options, CAPEX and OPEX priorities, and an understanding of regulatory requirements to support investment or re-investment decisions.\nWith hundreds of assets globally "
            },
            {
                "title": "Crude Rallies as the Dollar Falls and Black Sea Oil Production Disrupted - TradingView — Track All Markets",
                "source": "TradingView — Track All Markets",
                "url": "https://www.tradingview.com/news/barchart:b885e2bea094b:0-crude-rallies-as-the-dollar-falls-and-black-sea-oil-production-disrupted/",
                "body": "Crude Rallies as the Dollar Falls and Black Sea Oil Production Disrupted\nFebruary WTI crude oil (CLG26) on Tuesday closed up +0.90 (+1.51%), and February RBOB gasoline (RBG26) closed up +0.0386 (+2.16%).\nCrude oil and gasoline prices recovered from early losses on Tuesday and rallied sharply after the dollar index DXY tumbled to a 2-week low. Also, reduced global crude supplies are supporting oil prices after Kazakhstan's largest oil producer shut production after fires at the Tengiz and Korolev oil fields.\nDon’t Miss a Day: From crude oil to coffee, sign up free for Barchart’s best-in-class commodity analysis.Crude oil rallied on Tuesday after Reuters reported that Kazakhstan's Tengiz and Korolev oil fields would be shuttered for another 10 days due to power generator fires. Kazakhstan has curbed some 900,000 bpd of crude production that feeds the Caspian Pipeline Consortium terminal on Russia's Black Sea Coast due to drone strikes.\nUnrest in Iran, OPEC's fourth-largest producer, is also underpinning crude prices as Iranian security forces have killed thousands of protesters, and President Trump threatened attacks on Iran if the killing of protesters continues. Reuters reported last Wednesday that some US personnel have been advised to leave the US Al Udeid Air base in Qatar. The facility was targeted by Iran in retaliatory airstrikes last year after the US attacked Iran's nuclear facilities. Iran, OPEC's fourth-largest producer, produces more than 3 million bpd, and its crude production could be disrupted if the protests against the government worsen and the US decides to strike government targets.\nVortexa reported Monday that crude oil stored on tankers that have been stationary for at least 7 days fell -8.6% w/w to 115.18 million bbl in the week ended January 16.\nStrength in Chinese crude demand is supportive for prices. According to Kpler data, China's crude imports in December are set to increase by 10% m/m to a record 12.2 million bpd as it rebuilds its crude inventories.\nCrude garnered support after OPEC+ on January 3 said it would stick to its plan to pause production increases in Q1 of 2026. OPEC+ at its November 2025 meeting announced that members would raise production by +137,000 bpd in December, but will then pause the production hikes in Q1-2026 due to the emerging global oil surplus. The IEA in mid-October forecasted a record global oil surplus of 4.0 million bpd for 2026. OPEC+ is trying to restore all of the 2.2 million bpd production cut it made in early 2024, but still has another 1.2 million bpd of production left to restore. OPEC's December crude production rose by +40,000 bpd to 29.03 million bpd.\nUkrainian drone and missile attacks have targeted at least 28 Russian refineries over the past five months, limiting Russia's crude oil export capabilities and reducing global oil supplies. Also, since the end of November, Ukraine has ramped up attacks on Russian tankers, with at least six tankers attacked by drones and missiles in the Baltic Sea. In addition, new US and EU sanctions on Russian oil companies, infrastructure, and tankers have curbed Russian oil exports.\nLast month, the IEA projected that the world crude surplus will widen to a record 3.815 million bpd in 2026 from a 4-year high of over 2.0 million bpd in 2025.\nLast Tuesday, the EIA raised its 2026 US crude production estimate to 13.59 million bpd from 13.53 million bpd last month, and cut its US 2026 energy consumption estimate to 95.37 (quadrillion btu) from 95.68 last month.\nLast Wednesday's EIA report showed that (1) US crude oil inventories as of January 9 were -3.4% below the seasonal 5-year average, (2) gasoline inventories were +3.4% above the seasonal 5-year average, and (3) distillate inventories were -4.1% below the 5-year seasonal average. US crude oil production in the week ending January 9 was down -0.4% w/w to 13.753 million bpd, just below the record high of 13.862 million bpd from the week of November 7.\nBaker Hughes reported las"
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.780",
            "open": "59.531",
            "close": "59.616",
            "high": "60.621",
            "low": "58.841"
        },
        "market_summary": "### Spot WTI Crude Oil Market Briefing\n* **Key Drivers:** Disruptions in **Black Sea oil production**, **Unrest in Iran**, and a decline in the **US dollar** are driving **bullish momentum**. Additionally, **OPEC+'s decision to pause production increases** in Q1 2026 and **Kazakhstan's shutdown of its largest oil producer** due to fires are supporting prices.\n* **Price Action:** Spot WTI Crude Oil prices have rallied, with **February WTI crude oil** closing up **+0.90 (+1.51%)**, and are expected to be supported by **reduced global crude supplies** and **strength in Chinese crude demand**.\n* **Technical Outlook:** Immediate support is near **$70**, with resistance at **$80**. The **IEA's forecast of a record global oil surplus** of **4.0 million bpd** for 2026 could cap further price gains, but **OPEC+'s efforts to restore production cuts** and **geopolitical tensions** may counterbalance this effect.\n\n--- \n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Harold Hamm to shut down oil drilling in North Dakota - inforum.com",
                "source": "inforum.com",
                "url": "https://www.inforum.com/news/north-dakota/harold-hamm-to-shut-down-oil-drilling-in-north-dakota",
                "body": "BISMARCK — Harold Hamm, founder of Continental Resources, one of the largest oil companies in North Dakota, plans to halt drilling in the state.\nAccording to a report from Bloomberg, Hamm said he plans to stop drilling in North Dakota’s Bakken for the first time in 30 years because of low crude oil prices.\nDepending on prices, he could return to drilling in the Bakken at some point, Hamm told Bloomberg.\nHamm was a pioneer of drilling for oil in the Bakken formation, an oil-rich shale patch in western North Dakota. In the 2000s, he led the North Dakota oil boom with the use of horizontal drilling and hydraulic fracturing, or fracking, to access the oil.\nNorth Dakota is the third-largest oil-producing state in the U.S., according to industry statistics. It produces around 1.15 million barrels of oil per day.\nOil prices declined over 2025. In December, the North Dakota Monitor reported that North Dakota Department of Mineral Resources leaders were pessimistic about oil prices coming into 2026, but officials predicted oil production would hold steady.\nContinental Resources did not immediately respond to a request for comment."
            },
            {
                "title": "OPEC's Smallest Producer Seeks Prepaid Oil and Gas Deals with Traders - Crude Oil Prices Today | OilPrice.com",
                "source": "Crude Oil Prices Today | OilPrice.com",
                "url": "https://oilprice.com/Latest-Energy-News/World-News/OPECs-Smallest-Producer-Seeks-Prepaid-Oil-and-Gas-Deals-with-Traders.html",
                "body": "Rio Tinto and Glencore are…\n\"It's most important 8 minute read of my week…\"\nEquatorial Guinea is looking to strike prepaid oil and LNG delivery deals with commodity traders as OPEC’s smallest oil producer needs money to maintain operating fields and revive its upstream sector, anonymous sources with knowledge of the plans told Bloomberg on Tuesday.\nThe central African country has been struggling to attract upstream investments in recent years and has seen its oil production drop. The country has also been an LNG exporter for two decades.\nBut Equatorial Guinea needs capital to cover expenses and the government’s shares in producing and exploratory assets. Prepayment deals with the major trading houses would give Equatorial Guinea money upfront in exchange for crude and LNG deliveries over time, with interest.\nThe country is looking for $300 million in prepaid funding in return for crude and LNG deliveries over multiple years, according to Bloomberg’s sources.\nPrepaid delivery is a fairly common practice between major commodity traders and governments that need cash to fund upstream development.\nLast year, the government of Equatorial Guinea signed an Incentives Agreement with U.S. supermajor Chevron for the development of the Aseng Gas Project in Block I, which is set to boost LNG exports from the country.\nThe country is struggling to reverse a decline in its oil production, especially after Exxon left Equatorial Guinea in 2024 after a three-decade presence in the OPEC member.\nAs part of its long-term strategy, Exxon divested non-core operations to focus on the Permian, Guyana, and LNG developments globally.\nOver the past few years, trading houses have struck several prepaid deals with African oil and gas producers. The Nigerian National Petroleum Company has launched a $3.3 billion crude oil prepayment facility with Afreximbank, Africa’s multilateral trade finance institution, and commodity trader Gunvor International.\nLast year, Gunvor also provided financial support to Gabon National Oil Company (GOC) for part of the acquisition costs to buy 100% in Tullow’s subsidiary, Tullow Oil Gabon S.A, for a total cash consideration of $307 million.\nBy Michael Kernfor Oilprice.com\nMore Top Reads From Oilprice.com\nADVERTISEMENT"
            },
            {
                "title": "Crude Rallies as the Dollar Falls and Black Sea Oil Production Disrupted - TradingView — Track All Markets",
                "source": "TradingView — Track All Markets",
                "url": "https://www.tradingview.com/news/barchart:b885e2bea094b:0-crude-rallies-as-the-dollar-falls-and-black-sea-oil-production-disrupted/",
                "body": "Crude Rallies as the Dollar Falls and Black Sea Oil Production Disrupted\nFebruary WTI crude oil (CLG26) on Tuesday closed up +0.90 (+1.51%), and February RBOB gasoline (RBG26) closed up +0.0386 (+2.16%).\nCrude oil and gasoline prices recovered from early losses on Tuesday and rallied sharply after the dollar index DXY tumbled to a 2-week low. Also, reduced global crude supplies are supporting oil prices after Kazakhstan's largest oil producer shut production after fires at the Tengiz and Korolev oil fields.\nDon’t Miss a Day: From crude oil to coffee, sign up free for Barchart’s best-in-class commodity analysis.Crude oil rallied on Tuesday after Reuters reported that Kazakhstan's Tengiz and Korolev oil fields would be shuttered for another 10 days due to power generator fires. Kazakhstan has curbed some 900,000 bpd of crude production that feeds the Caspian Pipeline Consortium terminal on Russia's Black Sea Coast due to drone strikes.\nUnrest in Iran, OPEC's fourth-largest producer, is also underpinning crude prices as Iranian security forces have killed thousands of protesters, and President Trump threatened attacks on Iran if the killing of protesters continues. Reuters reported last Wednesday that some US personnel have been advised to leave the US Al Udeid Air base in Qatar. The facility was targeted by Iran in retaliatory airstrikes last year after the US attacked Iran's nuclear facilities. Iran, OPEC's fourth-largest producer, produces more than 3 million bpd, and its crude production could be disrupted if the protests against the government worsen and the US decides to strike government targets.\nVortexa reported Monday that crude oil stored on tankers that have been stationary for at least 7 days fell -8.6% w/w to 115.18 million bbl in the week ended January 16.\nStrength in Chinese crude demand is supportive for prices. According to Kpler data, China's crude imports in December are set to increase by 10% m/m to a record 12.2 million bpd as it rebuilds its crude inventories.\nCrude garnered support after OPEC+ on January 3 said it would stick to its plan to pause production increases in Q1 of 2026. OPEC+ at its November 2025 meeting announced that members would raise production by +137,000 bpd in December, but will then pause the production hikes in Q1-2026 due to the emerging global oil surplus. The IEA in mid-October forecasted a record global oil surplus of 4.0 million bpd for 2026. OPEC+ is trying to restore all of the 2.2 million bpd production cut it made in early 2024, but still has another 1.2 million bpd of production left to restore. OPEC's December crude production rose by +40,000 bpd to 29.03 million bpd.\nUkrainian drone and missile attacks have targeted at least 28 Russian refineries over the past five months, limiting Russia's crude oil export capabilities and reducing global oil supplies. Also, since the end of November, Ukraine has ramped up attacks on Russian tankers, with at least six tankers attacked by drones and missiles in the Baltic Sea. In addition, new US and EU sanctions on Russian oil companies, infrastructure, and tankers have curbed Russian oil exports.\nLast month, the IEA projected that the world crude surplus will widen to a record 3.815 million bpd in 2026 from a 4-year high of over 2.0 million bpd in 2025.\nLast Tuesday, the EIA raised its 2026 US crude production estimate to 13.59 million bpd from 13.53 million bpd last month, and cut its US 2026 energy consumption estimate to 95.37 (quadrillion btu) from 95.68 last month.\nLast Wednesday's EIA report showed that (1) US crude oil inventories as of January 9 were -3.4% below the seasonal 5-year average, (2) gasoline inventories were +3.4% above the seasonal 5-year average, and (3) distillate inventories were -4.1% below the 5-year seasonal average. US crude oil production in the week ending January 9 was down -0.4% w/w to 13.753 million bpd, just below the record high of 13.862 million bpd from the week of November 7.\nBaker Hughes reported las"
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0136",
            "open": "1.1641",
            "close": "1.1725",
            "high": "1.1768",
            "low": "1.1632"
        },
        "market_summary": "### EUR/USD Market Briefing\n* **Key Drivers:** Rising diplomatic tensions between the US and Europe, **loss of momentum in the U.S. dollar**, and a **neutral stance on interest rates** by the European Central Bank (ECB) are driving the EUR/USD price action.\n* **Price Action:** The pair has posted consecutive **bullish sessions**, accumulating gains of more than **1%**, and is currently trading around **1.1730**, with a **short-term bullish impulse** re-emerging.\n* **Technical Outlook:** The broad **sideways range** continues to dominate price action, with immediate **support** near **1.15095** and **resistance** at **1.18197**. The **RSI** is reading around **45**, supporting \"**bear**\" control, while the **MACD signal lines** remain steadily downward. \n--- \n**Overall Sentiment:** **Bullish** 📈",
        "source_articles": [
            {
                "title": "EUR/USD Analysis: The Euro Stands Out as Diplomatic Tensions Continue to Rise - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en/news-and-analysis/eurusd-analysis-the-euro-stands-out-as-diplomatic-tensions-continue-to-rise/?amp=true",
                "body": "EUR/USD Analysis: The Euro Stands Out as Diplomatic Tensions Continue to Rise\nThe euro has started to gain dominance in the short term, with EUR/USD posting two consecutive bullish sessions and accumulating gains of more than 1%. The recent buying pressure has been driven mainly by a loss of momentum in the U.S. dollar, amid a backdrop of intensifying political and economic tensions between the United States and Europe. If this renewed sense of risk persists, a more dominant bullish bias could continue to support EUR/USD price action in the coming sessions.\nThe dollar gives up significant ground\nSince the weekend, markets have been reacting to announcements from President Donald Trump, who outlined plans to impose initial 10% tariffs, starting February 1, on products imported from approximately eight European countries, should support for his proposal to acquire Greenland fail to materialize. It was also stated that these tariffs could increase to as much as 25% if European countries do not cooperate.\nDuring the latest trading session, further developments emerged as President Trump directly threatened France with imposing a nearly 200% tariff on wine exports if the country does not join his international initiative known as the “Board of Peace”, amid the broader diplomatic dispute surrounding Greenland. The French government has described these threats as an attempt at economic coercion and political interference, firmly rejecting the idea of complying with U.S. demands to avoid trade sanctions.\nThis ongoing exchange of statements has steadily increased risk perception across markets, prompting capital outflows from the dollar toward alternative safe-haven assets and currencies. As the U.S. dollar is directly involved in the escalation of tensions, it has begun to show persistent weakness. This trend is already reflected in the DXY index, which measures the dollar’s strength against its major peers and has fallen from 99.4 to around 98.5 in just two sessions, highlighting a notable decline in short-term demand.\nSource: TradingEconomics\nUnder this scenario, the euro appears to be benefiting from dollar weakness, attracting increased demand as the European region is perceived as more predictable and stable compared to the political noise coming from the United States. As long as indecision and repeated threats remain part of the U.S. agenda, the dollar may continue to lose ground, allowing a more dominant buying pressure to support EUR/USD movements in the near term.\nDoes the European Central Bank matter in this context?\nBeyond the diplomatic backdrop, it is important to note that the European Central Bank (ECB) will hold its first monetary policy meeting of 2026 on February 3. At this stage, markets assign a probability of around 94.5% that the deposit rate will remain at 2.00%, an expectation that also extends to the next three policy decisions.\nSource: ECBWATCH\nIn an environment where the euro is beginning to assume a role as a temporary safe-haven currency, the ECB’s neutral stance on interest rates becomes particularly relevant. This stability helps prevent significant downside pressure in the European fixed-income market in the short term. As investors continue to seek exposure to perceived safe assets, such as European bonds, a steady inflow of capital into the region could persist, strengthening demand for the euro and potentially supporting sustained buying pressure in EUR/USD.\nEUR/USD Technical Outlook\nSource: StoneX, Tradingview\n- The broad sideways range continues to dominate price action: For several months, EUR/USD has traded within a well-defined sideways range, capped near 1.18197 and supported around 1.15095. In the short term, a meaningful bullish impulse has re-emerged, reviving buying pressure; however, this move remains insufficient to break above the upper boundary of the range. As long as this resistance holds, the sideways structure is likely to remain a key feature of the pair’s behavior.\n- RSI: The RSI"
            },
            {
                "title": "EUR/USD remains stronger near 1.1750 as US Dollar weakens, Germany's ZEW index surges - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/eur-usd-remains-stronger-near-11750-as-us-dollar-weakens-germanys-zew-index-surges-202601210305",
                "body": "EUR/USD remains stronger near 1.1750 as US Dollar weakens, Germany's ZEW index surges\n- EUR/USD extends gains for the third successive day amid rising geopolitical tensions.\n- President Trump reiterated his Greenland ambitions and threatened a 200% tariff on French wines.\n- The Euro gained support as Germany’s ZEW Economic Sentiment Index surged to 59.6 in January.\nEUR/USD extends its gains for the third consecutive session, trading around 1.1730 during the Asian hours on Wednesday. The pair appreciates as the US Dollar (USD) continues to lose ground amid rising United States (US)–Greenland concerns.\nUS President Donald Trump said there is “no going back” on his ambitions regarding Greenland, alongside earlier threats to impose new 10% tariffs on eight European Union (EU) countries, fuelling concerns over slower economic growth. Additionally, Trump threatened a 200% tariff on French wines as President Emmanuel Macron refrained from joining Trump's \"Board of Peace\".\nThe European Parliament plans to suspend approval of the US trade deal agreed in July, with the decision set to be announced on Wednesday in Strasbourg, France. An escalation in US–Europe tensions.\nThe downside of the Greenback could be restrained as the latest US labor market data have pushed back expectations for further Federal Reserve (Fed) rate cuts until June. Fed officials have signaled little urgency to ease policy further until there is clearer evidence that inflation is sustainably moving toward the 2% target.\nThe Euro (EUR) receives support against its peers despite increased risk aversion, supported by stronger-than-expected German economic data. Germany’s ZEW Economic Sentiment Index surged to 59.6 in January, its highest since July 2021 and well above the 50 forecast, signalling optimism for a 2026 economic turnaround despite uncertainty over US trade policy.\nEuro FAQs\nThe Euro is the currency for the 20 European Union countries that belong to the Eurozone. It is the second most heavily traded currency in the world behind the US Dollar. In 2022, it accounted for 31% of all foreign exchange transactions, with an average daily turnover of over $2.2 trillion a day. EUR/USD is the most heavily traded currency pair in the world, accounting for an estimated 30% off all transactions, followed by EUR/JPY (4%), EUR/GBP (3%) and EUR/AUD (2%).\nThe European Central Bank (ECB) in Frankfurt, Germany, is the reserve bank for the Eurozone. The ECB sets interest rates and manages monetary policy. The ECB’s primary mandate is to maintain price stability, which means either controlling inflation or stimulating growth. Its primary tool is the raising or lowering of interest rates. Relatively high interest rates – or the expectation of higher rates – will usually benefit the Euro and vice versa. The ECB Governing Council makes monetary policy decisions at meetings held eight times a year. Decisions are made by heads of the Eurozone national banks and six permanent members, including the President of the ECB, Christine Lagarde.\nEurozone inflation data, measured by the Harmonized Index of Consumer Prices (HICP), is an important econometric for the Euro. If inflation rises more than expected, especially if above the ECB’s 2% target, it obliges the ECB to raise interest rates to bring it back under control. Relatively high interest rates compared to its counterparts will usually benefit the Euro, as it makes the region more attractive as a place for global investors to park their money.\nData releases gauge the health of the economy and can impact on the Euro. Indicators such as GDP, Manufacturing and Services PMIs, employment, and consumer sentiment surveys can all influence the direction of the single currency. A strong economy is good for the Euro. Not only does it attract more foreign investment but it may encourage the ECB to put up interest rates, which will directly strengthen the Euro. Otherwise, if economic data is weak, the Euro is likely to fall. Economic data for th"
            },
            {
                "title": "EUR/USD Analysis: Selling Pressure Mounts—Will We See 1.1500 Soon? - DailyForex",
                "source": "DailyForex",
                "url": "https://www.dailyforex.com/forex-technical-analysis/2026/01/eurusd-analysis-20-january-2026/240043",
                "body": "EUR/USD Analysis Summary Today\n- Overall Trend: Bearish.\n- Support Levels for EUR/USD Today: 1.1580 – 1.1520 – 1.1440.\n- Resistance Levels for EUR/USD Today: 1.1680 – 1.1740 – 1.1800.\nEUR/USD Trading Signals:\n- Buy EUR/USD from the support level of 1.1560 with a target of 1.1800 and a stop-loss at 1.1470.\n- Sell EUR/USD from the resistance level of 1.1730 with a target of 1.1500 and a stop-loss at 1.1800.\nTechnical Analysis of EUR/USD Today:\nConcerns regarding Greenland have dominated Euro trading against other major currencies. This follows recent market anxiety over the future of U.S. Federal Reserve policies. According to performance data from trusted trading platforms, the EUR/USD price plummeted at the start of the trading week to the support level of 1.1576—the pair's lowest level in nearly two months—before quickly rebounding to settle around the 1.1645 resistance level at the time of writing.\nTop Regulated Brokers\nFrom a technical perspective, the EUR/USD bias remains bearish. It could quickly drop toward the psychological support level of 1.1500 in the coming days if fears of a persistent conflict between the U.S. and Europe intensify, especially following mutual threats of imposing tariffs. The 14-day RSI is reading around 45, supporting \"bear\" control, while the MACD signal lines remain steadily downward. Conversely, the psychological resistance at 1.1800 remains the key target to confirm a shift to a bullish trend.\nFor economic calender today, The euro's price will be affected today by the release of the German Producer Price Index (PPI) at 9:00 AM Egypt time, followed by the Eurozone current account figures at 11:00 AM Egypt time. An hour later, the German ZEW index will be released. No major economic releases are expected from the US.\nEUR/USD Exchange Rate and the Future of Fed Policies\nThe EUR/USD exchange rate has retreated from its recent highs, falling back toward 1.16 as investors grow cautious about the timing and scale of Fed interest rate cuts. While some banks still see room for the Euro to rise in the medium term, strong U.S. economic data and a strengthening Dollar have capped these gains for now. Increasingly, markets are focused on the Fed's credibility and whether U.S. rates could remain high well into 2026.\nEUR/USD Forecast for the Coming Days\nIn this regard, RBC Capital Markets expects the EUR/USD exchange rate to strengthen in 2026, but has lowered its year-end forecast to 1.20 from 1.24, now anticipating it will reach that level by the end of 2024. However, after a slight initial shift, ING still supports a rise to 1.22 by the end of 2026, driven by continued US interest rate hikes.\nOverall, markets anticipate two US interest rate cuts by the Federal Reserve in 2026. Crédit Agricole expects the euro to depreciate further as the Fed resists further rate cuts: “We still expect interest rates to remain unchanged in January. After that, our current baseline forecast suggests the pause will extend throughout 2026, subject to the stability of the labor market in upcoming reports. Weaker-than-expected data would increase the risk of a shorter pause and/or greater monetary easing than we currently anticipate.”\nMeanwhile, the independence of the US Federal Reserve will remain a pivotal issue for currency exchange rates.\nEarlier this week, the Justice Department issued subpoenas against the Federal Reserve and its chairman, Jerome Powell, for alleged misconduct related to renovations at the Fed headquarters. Powell strongly rejected the move and defended the bank. MUFG commented on the development, stating, “The continued attacks on the Fed’s independence, in response to President Trump’s desire to lower interest rates, pose a downside risk to the US dollar and support our expectations of a decline.” The bank added, “However, this could backfire on President Trump if Fed officials maintain their stance and keep US interest rates unchanged, challenging the Fed’s continued independence in setting monetary p"
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0082",
            "open": "1.3421",
            "close": "1.3440",
            "high": "1.3491",
            "low": "1.3410"
        },
        "market_summary": "### GBP/USD Market Briefing\n* **Key Drivers:** The pair is influenced by **USD weakness**, with markets eyeing **UK CPI inflation** data for **BoE policy signals**. Recent trade tensions and concerns over Japan's fiscal position have contributed to a **'sell America' trend**, supporting **GBP/USD**.\n* **Price Action:** GBP/USD has edged higher, trading at **1.3463**, driven by **broad US dollar softness** rather than strong UK fundamentals. The pair faces resistance at **1.3500**, with potential levels to watch at **1.3550/75** and **1.3600**.\n* **Technical Outlook:** Immediate support is near the **1.2450** support zone, while the **200-day moving average** near **1.3400** acts as distant long-term resistance. Selling options premium, particularly out-of-the-money calls against rallies, presents a viable strategy given the current range-bound price action.\n\n--- \n**Overall Sentiment:** Neutral",
        "source_articles": [
            {
                "title": "GBP/USD steadies amid USD weakness, UK CPI inflation in focus - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-usd-steadies-amid-usd-weakness-uk-cpi-inflation-in-focus-202601202326",
                "body": "GBP/USD steadies amid USD weakness, UK CPI inflation in focus\n- Pound steady as USD weakness offsets softer UK labour data\n- Markets eye UK CPI on Wednesday for BoE policy signals\n- GBP/USD edges higher this week on broad US dollar softness\nThe British Pound (GBP) traded with a cautious tone on Tuesday as investors digested mixed UK labour market data. While unemployment held steady, slower wage growth dampened confidence and revived expectations that the Bank of England could move toward interest rate cuts later in the year. This tempered Sterling enthusiasm, particularly against European peers.\nAt the same time, broader market dynamics helped limit downside pressure on the Pound. Renewed geopolitical tensions and trade-related uncertainty weighed on global risk sentiment, pressuring US equities and weakening the US dollar. That USD softness provided an important counterbalance, allowing Sterling to remain supported despite domestic data concerns.\nComing up on Wednesday: UK CPI inflation\nLooking ahead, investor attention is shifting to UK Consumer Price Index (CPI) inflation data due Wednesday, which is expected to play a decisive role in shaping near-term expectations for the Bank of England. Any surprise in inflation, either higher or lower than forecast, could quickly recalibrate the timing of rate cuts and drive renewed volatility in Sterling pairs.\nGBP/USD price forecast\nGBP/USD has shown a modest upward bias this week, largely driven by broad-based US dollar weakness rather than strong UK fundamentals. The pair has rebounded from recent lows as geopolitical risk and tariff concerns undermined confidence in the greenback, allowing Sterling to advance even as UK macro data disappointed.\nHowever, gains have remained measured. Softer UK labour figures and lingering uncertainty around the Bank of England’s policy path have capped upside momentum, keeping GBP/USD trading within a relatively contained range. Markets remain highly sensitive to incoming data, with Wednesday’s inflation release likely to determine whether this week’s recovery can extend or stall near current levels.\nGBP/USD daily chart\nPound Sterling FAQs\nThe Pound Sterling (GBP) is the oldest currency in the world (886 AD) and the official currency of the United Kingdom. It is the fourth most traded unit for foreign exchange (FX) in the world, accounting for 12% of all transactions, averaging $630 billion a day, according to 2022 data. Its key trading pairs are GBP/USD, also known as ‘Cable’, which accounts for 11% of FX, GBP/JPY, or the ‘Dragon’ as it is known by traders (3%), and EUR/GBP (2%). The Pound Sterling is issued by the Bank of England (BoE).\nThe single most important factor influencing the value of the Pound Sterling is monetary policy decided by the Bank of England. The BoE bases its decisions on whether it has achieved its primary goal of “price stability” – a steady inflation rate of around 2%. Its primary tool for achieving this is the adjustment of interest rates. When inflation is too high, the BoE will try to rein it in by raising interest rates, making it more expensive for people and businesses to access credit. This is generally positive for GBP, as higher interest rates make the UK a more attractive place for global investors to park their money. When inflation falls too low it is a sign economic growth is slowing. In this scenario, the BoE will consider lowering interest rates to cheapen credit so businesses will borrow more to invest in growth-generating projects.\nData releases gauge the health of the economy and can impact the value of the Pound Sterling. Indicators such as GDP, Manufacturing and Services PMIs, and employment can all influence the direction of the GBP. A strong economy is good for Sterling. Not only does it attract more foreign investment but it may encourage the BoE to put up interest rates, which will directly strengthen GBP. Otherwise, if economic data is weak, the Pound Sterling is likely to fall.\nAnother significan"
            },
            {
                "title": "As the ‘Sell America’ trend strengthens, GBP/USD rises towards 1.3460, led by USD sell-offs - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/as-the-sell-america-trend-strengthens-gbp-usd-rises-towards-1-3460-led-by-usd-sell-offs/",
                "body": "The GBP/USD exchange rate rises towards 1.3460 amid increased selling of US assets following trade tensions between the US and Europe. Japanese bond sell-off contributes to global yield increases, pressuring the Dollar and maintaining high market volatility. Currently, GBP/USD trades at 1.3463, a 0.30% increase.\nConcerns over Japan’s Fiscal Position\nConcerns over Japan’s fiscal position, particularly tax cuts and spending plans, have heightened risk aversion, leading to higher global bond yields and a weaker US Dollar. The US Dollar Index falls by 0.53% to 98.50 amidst this ‘sell America’ trend. US job data shows a slight decrease in job creation, while UK jobs data indicates a steady unemployment rate at 5.1%.\nDespite stable unemployment, UK markets expect a BoE rate hold at 3.75% but foresee easing by year-end. The British finance minister emphasised de-escalation in Greenland issues. Technically, GBP/USD faces resistance at 1.3500, with potential levels to watch at 1.3550/75 and 1.3600.\nThe Pound Sterling, the UK’s currency, is crucially affected by the BoE’s monetary policy, economic data, and trade balance. Positive economic indicators and a favourable trade balance bolster the currency, while weakness can lead to depreciation.\nLooking back at early 2025, we saw a potent “Sell America” theme emerge, driven by trade tensions and turmoil in the Japanese bond market. This pushed volatility to yearly highs and sent the US Dollar Index tumbling towards 98.50. Today, the environment has reversed, with the CBOE Volatility Index (VIX) trading calmly around 15 and the Dollar Index holding strong above 104, signaling a profound shift in market confidence.\nThis time last year, we watched GBP/USD climb toward 1.3500 as the dollar weakened across the board. In contrast, the pair is now struggling to hold ground below 1.2500, a testament to the renewed focus on US economic outperformance. This move shows how quickly market narratives can change, with fears of a US slowdown in 2025 giving way to a more resilient picture in early 2026.\nMarket Strategy and Risk Management\nWe can recall how markets were pricing in Bank of England rate cuts from 3.75% throughout 2025. Those expectations proved premature as UK inflation has remained stubbornly above target, with the latest December 2025 CPI data showing a rate of 3.8%. Consequently, the BoE base rate is now at 4.5%, and the debate has shifted from when to cut to how long to hold.\nGiven that volatility is significantly compressed compared to last year, selling options premium presents a viable strategy. Traders should consider selling out-of-the-money calls against any rallies in GBP/USD, especially as the pair approaches the 1.2600 resistance level. This approach benefits from the current range-bound price action and the decay of option value over time.\nThe primary risk now is a further leg down, driven by diverging central bank policies. The technical levels we watched in 2025, such as the 200-day moving average near 1.3400, are now distant long-term resistance. Instead, traders should use put options to protect against a break of the key 1.2450 support zone, which could trigger a swift decline."
            },
            {
                "title": "Five years of turbulence: Key political moments raising and lowering the British pound - Digital Journal",
                "source": "Digital Journal",
                "url": "https://www.digitaljournal.com/business/five-years-of-turbulence-key-political-moments-raising-and-lowering-the-british-pound/article",
                "body": "From Brexit, trade tariffs to the uncertainty surrounding leadership changes, the British pound has recently weathered a rollercoaster of ups and downs. Following weakened growth in the second half of 2025, economists warn the slowdown could intensify in 2026 as over half (56%) of people polled think the UK will be in recession this year – slightly above the global average of 48%.\nFor investors, these political and economic twists are far more than headlines as every shift can spark sudden swings in currency markets, affecting risk, returns and trading opportunities.\nWhich political events have moved the pound the most?\nBy analysing the pound’s movement immediately before and after key UK political moments from 2020, the firm BrokerChooser has uncovered the moments that strengthened the pound the most – and those that sent it tumbling. The insights have been provided to Digital Journal.\nNotably, the Bank of England’s emergency bond purchase on 28 September 2022 delivered the pound’s biggest single-day boost in recent years, lifting GBP/USD by a notable +1.33%. This came just days after the sharpest single-day decline of -3.52%, triggered by the 23 September ‘Mini Budget’ disaster, which announced the biggest tax-cutting measures in 50 years without clear funding plans.\nKey political moments that boosted the pound revealed\nAlso notable was Rishi Sunak’s first speech as Prime Minister on 25 October 2022, which strengthened the pound by 1.27%. Sunak’s appointment came after weeks of political chaos and fiscal uncertainty under Liz Truss, and markets welcomed his pledge to place “economic stability and confidence at the heart of this government’s agenda”.\nDespite being a highly divisive move, the third largest strengthening event came on 31 January 2020, when the UK officially left the European Union, lifting GBP/USD by 0.91%. While Brexit had weighed heavily on sterling for years, the finality of the UK’s departure allowed investors to reprice the pound with greater clarity over the country’s future economic direction.\nKey political moments that put the GBP under pressure\nFrom the above table, the largest single-day fall in the pound came after the UK’s ‘Mini Budget’ was announced by Chancellor Kwasi Kwarteng on 23 September 2022. This triggered a 3.52% plunge in GBP/USD, sending the currency to a 37-year low against the dollar. Markets reacted sharply to the biggest tax-cutting measures in 50 years, which were estimated to reduce Treasury revenues by around £45 billion in 2026/27. The scale of the largely unfunded tax cuts and the prospect of significantly higher borrowing prompted a rapid sell-off.\nOther notable declines also occurred during budget-related events, with Jeremy Hunt’s Spring Budget on 15 March 2023 causing a 0.69% fall, while Rachel Reeves’ Autumn Budget on 30 October 2024 saw GBP/USD slip by 0.42%."
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0042",
            "open": "0.6705",
            "close": "0.6735",
            "high": "0.6747",
            "low": "0.6705"
        },
        "market_summary": "### AUD/USD Market Briefing\n* **Key Drivers:** The Australian Dollar is gaining strength due to a combination of factors, including a rise in commodity prices, an improvement in the country's Terms of Trade, and escalating **US-EU tensions**. The **hawkish** stance of the Reserve Bank of Australia (RBA) and expectations of tighter monetary policy are also supporting the AUD.\n* **Price Action:** The AUD/USD pair has surged toward **0.6730**, driven by a **0.25%** increase, as the US Dollar weakens due to tensions between the US and EU. The pair is showing **bullish momentum**.\n* **Technical Outlook:** Immediate resistance is near the **0.6730** level, with support at **0.6700**. The AUD/USD is expected to remain volatile ahead of Australia's December employment figures, which could provide insights into the RBA's future policy direction.\n--- \n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "The Great Rotation Begins: Following the Aussie Dollar Back to Commodities - Fat Tail Daily",
                "source": "Fat Tail Daily",
                "url": "https://daily.fattail.com.au/the-great-rotation-begins-following-the-aussie-dollar-back-to-commodities/20260121/",
                "body": "Today, I thought we’d continue our look at the Aussie Dollar as a potential marker for understanding our position in the commodity cycle.\nA quick recap: a vital influence (or tailwind) on the AUD is the strength of the Australian economy, which relies on commodity exports, which in turn fuel the country’s Terms of Trade.\nSo what exactly does that mean… Terms of Trade?\nSimply put, it indicates how many imports a country can BUY with its exports.\nThink of it like this: Country ‘A’ exports corn, and Country ‘B’ exports tractors.\nNow, Country A sells 100 tonnes of corn for $100,000; Country B sells 10 tractors for $100,000. Their terms of trade are 1:1.\nBut now imagine that corn prices RISE.\nCountry A now gets $120,000 for 100 tonnes of corn.\nMeanwhile, in Country B, tractor prices have remained unchanged.\nCountry A can now buy 12 tractors for the same amount of corn.\nAnd that IMPROVES its terms of trade.\nHow this fits with the AUD/Commodity Idea\nAlrighty, improving terms of trade doesn’t necessarily translate into a one-for-one correlation with a strengthening Aussie Dollar.\nOther factors play a role, such as the nation’s overall economic health, including growth and the ability to pay down debt.\nMonetary policy is also critical; higher rates tend to attract foreign investment, further strengthening the AUD’s value.\nBut it all cascades back to the country’s Terms of Trade...\nStrong commodity prices boost export revenues, which help drive economic growth and allow the flexibility to pay down public debt (or spend more).\nAnd all this economic activity will prompt central bankers to favour rate hikes over cuts, further attracting foreign investors to the AUD.\nThat’s why, as commodity prices rise, it creates a positive snowball effect for the Aussie Dollar.\nHence, we can use it as a bellwether currency for understanding the commodity cycle.\nLast week, we looked at a key year for the Aussie Dollar: 2001.\nThat’s when the AUD traded as low as $0.47 against the US greenback, the lowest level ever reached for the AUD since the currency was floated back in 1983.\nAt the time, Prime Minister John Howard argued that the weakness was simply a reflection of the US dollar’s strength.\nYet, at the time, the AUD was also falling against the euro, yen and pound.\nThe situation looked dire, painting a bleak picture for Australia’s economic health.\nBut in hindsight, 2001 was a pivotal moment.\nWhile 2001 was a major low for the Aussie Dollar, it also marked the beginning of a new cycle… A transfer of global wealth.\nAs you can see below, global investment began to shift AWAY from the inflated tech bubble and back into the depressed commodity market:\nAnd significantly, a bottom in mining investment (back then) mirrored the all-time low in the Aussie Dollar.\nSo, it’s hard to argue against a strong correlation between the Aussie Dollar and commodity prices.\nThat’s why institutional traders use the AUD to leverage their commodity exposure.\nAnd it’s precisely why we should be paying close attention to this relationship, especially right now.\nWhy?\nWell, for the first time in a very long time, investors are finally favouring commodities over tech investments.\nThe Once-in-a-Decade Sector Rotation\nAs you can see on the chart above, capex investment in resources is hovering back around those 2001 lows.\nThat should get you excited about what could happen next!\nThere’s a strong historical pretext at play here…\nThe Aussie Dollar is near its major lows, just as the mining capex cycle bottoms (relative to tech).\nThink about it like this: the tech boom has created trillions in new wealth, far in excess of what the Dot-Com bubble of the late 1990s created.\nAfter the Dot-Com bubble, much of the capital flowed into the old economy, the resource market.\nIf we see that repeated, well, that could deliver an unprecedented opportunity for companies leveraged to higher commodity prices.\nTo find out more, be sure to check out my latest report here.\nRegards,\nJames Cooper,\nMining: "
            },
            {
                "title": "Australian Dollar gains as Westpac Leading Economic Index rises in December - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/amp/news/australian-dollar-gains-as-westpac-leading-economic-index-rises-in-december-202601210250",
                "body": "Australian Dollar moves sideways as US Dollar gains despite US-EU tensions\n|- Australian Dollar edges lower after two days of gains.\n- Australia’s Westpac Leading Economic Index rose 0.1% MoM in December 2025 after being flat previously.\n- The US Dollar recovers daily losses despite escalating US–Greenland uncertainty.\nThe Australian Dollar struggles against the US Dollar (USD) on Wednesday despite rising United States (US)–Greenland concerns.\nThe Westpac–Melbourne Institute Leading Economic Index for Australia rose 0.1% month-on-month (MoM) in December 2025, after remaining unchanged in the prior month. At the same time, the six-month annualized growth rate increased to 0.42% from 0.20% in November, indicating that the economic recovery through 2025 is extending into early 2026.\nThe AUD also finds support as emerging upward price pressures strengthen expectations of tighter monetary policy from the Reserve Bank of Australia (RBA). The International Monetary Fund (IMF) has urged the RBA to remain cautious, highlighting that inflation has stayed above the Bank’s 2%–3% target band for a prolonged period, even though headline CPI eased more quickly than anticipated in November.\nThe People’s Bank of China (PBOC), China's central bank, announced on Tuesday that it would leave its Loan Prime Rates (LPRs) unchanged. The one-year and five-year LPRs were at 3.00% and 3.50%, respectively. It is essential to note that any changes in the Chinese economy could impact the Australian Dollar, as both countries are close trading partners.\nUS Dollar weakens as US–Greenland concerns aggravate\n- The US Dollar Index (DXY), which measures the value of the US Dollar against six major currencies, is recovering its daily losses and trading around 98.60 at the time of writing.\n- US President Donald Trump said there is “no going back” on his ambitions regarding Greenland, alongside earlier threats to impose new 10% tariffs on eight European Union (EU) countries, fueling concerns over slower economic growth.\n- The European Parliament plans to suspend approval of the US trade deal agreed in July, with the decision set to be announced on Wednesday in Strasbourg, France, signaling an escalation in US–Europe tensions.\n- US labor market data has pushed back expectations for further Federal Reserve (Fed) rate cuts until June. Fed officials have signaled little urgency to ease policy further until there is clearer evidence that inflation is sustainably moving toward the 2% target. Morgan Stanley analysts revised their 2026 outlook, now forecasting one rate cut in June followed by another in September, compared with their previous expectation of cuts in January and April.\n- Data from the National Bureau of Statistics showed on Monday that China’s Industrial Production rose 5.2% year-over-year YoY in December, accelerating from 4.8% in November, supported by resilient export-driven manufacturing activity. Meanwhile, Retail Sales rose 0.9% YoY, undershooting forecasts of 1.2% and November’s 1.3%.\n- China’s Gross Domestic Product (GDP) rose 1.2% quarter-over-quarter in Q4 2025, accelerating from 1.1% in Q3 and exceeding the market consensus of 1.0%. On an annual basis, GDP grew 4.5% in Q4, easing from 4.8% in the previous quarter but coming in above expectations of a 4.4% reading.\n- Australia’s TD-MI Inflation Gauge, released on Monday, rose to 3.5% year-over-year (YoY) in December, up from 3.2% previously. On a monthly basis, inflation surged 1.0% month-over-month (MoM) in December 2025, the fastest pace since December 2023 and a sharp acceleration from 0.3% in the prior two months.\n- RBA policymakers acknowledged that inflation has eased significantly from its 2022 peak, though recent data suggests renewed upward momentum. Headline CPI slowed to 3.4% YoY in November, the lowest reading since August, but remains above the RBA’s 2–3% target band. Meanwhile, trimmed mean CPI edged down to 3.2% from October’s eight-month high of 3.3%.\n- The RBA assessed that inflatio"
            },
            {
                "title": "AUD/USD surges toward 0.6730 as the US Dollar weakens due to tensions between the US and EU - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605160108",
                "body": "The AUD/USD currency pair advanced by 0.25%, trading close to 0.6730 during Tuesday’s European session. The Australian Dollar is strengthening as the US Dollar (USD) loses ground against other major currencies, largely due to ongoing disagreements between the United States (US) and the European Union (EU) regarding Greenland’s future.\nAt the time of reporting, the US Dollar Index (DXY)—which measures the USD’s performance against a basket of six key currencies—had dropped by 0.55% to around 98.50.\nThe US Dollar is facing significant selling pressure as the “Sell America” trend gains momentum. Investors are seeking alternative safe-haven assets amid concerns about deteriorating relations between the US and the EU. Over the weekend, President Donald Trump introduced 10% tariffs on several EU countries and the United Kingdom (UK) in response to their opposition to US plans to acquire Greenland.\nMeanwhile, US Treasury Secretary Scott Bessent stated at the World Economic Forum (WEF) in Davos that the US has no intention of withdrawing from NATO despite the ongoing Greenland dispute.\nOn the topic of monetary policy, Secretary Bessent mentioned that Washington may reveal the next Federal Reserve (Fed) Chair as soon as next week, with four candidates currently under consideration.\nAlthough the Australian Dollar has found support against the US Dollar, the greenback continues to lag behind other major currencies ahead of Australia’s December employment figures, which are due on Thursday. Market participants are closely monitoring the upcoming labor market data for insights into the Reserve Bank of Australia’s (RBA) future policy direction.\nExpectations for the Australian jobs report suggest that the economy added 30,000 new positions after shedding 21,300 jobs in November. The unemployment rate is projected to climb to 4.4%, up from the previous reading of 4.3%."
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "1.1330",
            "open": "157.9800",
            "close": "158.1180",
            "high": "158.5990",
            "low": "157.4660"
        },
        "market_summary": "### USD/JPY Market Briefing\n\n* **Key Drivers:** The **Bank of Japan (BoJ)** interest rate decision and policy statement, scheduled for Friday, are expected to be key drivers of **USD/JPY** price action, with markets anticipating a **hawkish** tone that could strengthen the yen.\n* **Price Action:** **USD/JPY** has climbed to the **159** area, nearing the psychologically important **160** level, where Japanese officials have warned of potential intervention, creating elevated risk for traders.\n* **Technical Outlook:** Immediate support is near **155.5**, with resistance at **160-160.5**, where intervention risks rise sharply; a **hawkish** BoJ tone could push **USD/JPY** lower toward **155.5**, while a **neutral** or **dovish** message could weaken the yen further, testing **160-160.5**.\n\n---\n**Overall Sentiment:** Cautiously **bullish** short-term, **bearish** medium-term",
        "source_articles": [
            {
                "title": "USD/JPY in Focus as Bank of Japan Decision Approaches - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/analysis/usdjpy-in-focus-as-bank-of-japan-decision-approaches-200673512",
                "body": "Asia stocks fall further as Greenland fears, Japan fiscal uncertainty weigh\nThe USD/JPY is back in the spotlight as markets brace for this week’s Bank of Japan (BoJ) interest rate decision, scheduled for Friday. While rates are widely expected to remain unchanged at 0.75%, the real market mover will be the policy statement and press conference, not the headline number.\nRecent price action across yen pairs highlights growing sensitivity to both domestic policy signals and global risk dynamics.\nYen Caught Between Monetary Tightening and Fiscal Stimulus\nThe BoJ continues to signal a hawkish bias, but its approach remains cautious and gradual. This contrasts sharply with Japan’s expansionary fiscal policy, where government stimulus measures continue to weigh on the currency. In effect, fiscal and monetary policies are working against each other, creating structural pressure on the yen.\nThis policy divergence has left the yen vulnerable, even as the BoJ slowly edges toward normalization.\nSafe-Haven Flows Offer Temporary Support\nDespite domestic headwinds, the yen has recently found support from geopolitical tensions. Escalating risks—from U.S.-Iran developments to renewed frictions between the U.S. and Europe—have triggered classic safe-haven flows into the Japanese yen.\nHowever, these flows remain reactive rather than structural, meaning they may fade quickly if risk sentiment stabilizes.\nUSD/JPY Near Critical Intervention Levels\nUSD/JPY has climbed aggressively, reaching the 159 area and edging closer to the psychologically important 160 level. This zone is particularly sensitive, as Japanese officials have repeatedly warned that they are prepared to act against excessive volatility.\nHistorically, currency intervention is swift and unannounced, often appearing as a sharp, one-minute drop of hundreds of pips. As a result, positioning near 160 carries elevated risk.Key Scenarios After the BoJ Decision\n- Hawkish Tone: If the BoJ reinforces its tightening bias, the yen could strengthen, pushing USD/JPY lower toward the 155.5 region as carry trades unwind.\n- Neutral or Dovish Message: A lack of new guidance or a clearly dovish tone could weaken the yen further, opening the door for a test of 160–160.5, where intervention risks rise sharply.\n- No Forward Guidance: In the absence of meaningful signals, price action may remain range-bound, with traders waiting for the next major catalyst, including political developments and upcoming elections in Japan.\nWhy the Yen Matters Beyond Japan\nThe yen plays a central role in global markets due to the carry trade, where investors borrow cheaply in yen to invest in higher-yielding assets abroad. When the BoJ surprised markets with a more aggressive hike in August 2024, the resulting volatility rippled across global equities as carry trades were rapidly unwound.\nThis dynamic means any shift in BoJ expectations can trigger outsized moves, not just in FX, but across broader risk assets.\nBottom Line\nThe Bank of Japan may hold rates steady, but markets are far from calm. With USD/JPY hovering near intervention levels and policy signals finely balanced, traders should expect elevated volatility, particularly during the press conference. For now, the yen remains trapped between slow monetary tightening, aggressive fiscal stimulus, and global risk sentiment—an unstable mix that keeps markets on edge.\nWhich stock should you buy in your very next trade?\nAI computing powers are changing the stock market. Investing.com's ProPicks AI includes dozens of winning stock portfolios chosen by our advanced AI.\nYear to date, 2 out of 3 global portfolios are beating their benchmark indexes, with 88% in the green. Our flagship Tech Titans strategy doubled the S&P 500 within 18 months, including notable winners like Super Micro Computer (+185%) and AppLovin (+157%).\nWhich stock will be the next to soar?"
            },
            {
                "title": "Japanese Yen Forecast: USD/JPY Rises Ahead of Japan Snap Election - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/japanese-yen-forecast-usd-jpy-rises-ahead-of-japan-snap-election-1573990",
                "body": "USD/JPY hovers at 158 as markets brace for a snap Japan election. 10-year Japanese Government Bond (JGB) yields have soared amid concerns over Prime Minister Sanae Takaichi’s fiscal spending plans and national debt-to-GDP levels.\nThe Japanese yen has weakened significantly since Prime Minister Takaichi won the Liberal Democratic Party leadership race to become Prime Minister. USD/JPY has gained 7.3% since October 3, reflecting sentiment toward Prime Minister Takaichi’s stance on fiscal and monetary policy.\nMeanwhile, President Trump’s threat of 10% tariffs on eight European countries weighed on demand for the US dollar, limiting USD/JPY gains.\nDespite concerns about Prime Minister Takaichi’s fiscal policy, rising bets on a BoJ rate hike in the second quarter to cool import prices support a cautiously bullish short-term outlook, but a bearish medium-term outlook.\nBelow, I’ll discuss the macro backdrop, the near-term price catalysts, and technical levels traders should closely watch.\nPrime Minister Takaichi’s call for a snap election sent 10-year JGB yields to 2.382%, the highest level in decades. 10-year JGB yields have climbed in tandem with USD/JPY. The risk premium for holding JGB yields has surged over debt-to-GDP worries.\nWhile Prime Minister Takaichi enjoys strong approval ratings, the Liberal Democratic Party remains unpopular with voters. This has created an element of uncertainty about the election outcome. The uncertainty adds another layer of weakness to the yen.\nRobin Brooks, Senior Fellow at the Brookings Institution, commented on the risks to the snap election, stating:\n“Calling an early election is risky. Just ask Theresa May or Emmanuel Macron. Running on tax cuts in an economy where public debt stands at 240% of GDP is even riskier. Japan’s 30-year JGB yield is already at unprecedented levels and the Yen at record lows.”\nThe political uncertainty and Prime Minister Takaichi’s policies suggest a cautiously bullish short-term outlook for USD/JPY.\nMeanwhile, the Bank of Japan’s monetary policy stance supports a bearish medium-term outlook. Economists expect the BoJ to stand pat on monetary policy on Friday, January 23. But, economists expect the BoJ to signal an interest rate hike in the summer, which would strengthen the yen. The weaker yen is pushing import prices higher, eroding households’ purchasing power, a key focal point for the BoJ.\nAccording to January’s Reuters poll, conducted between January 6-13, 43% of economists predicted a July BoJ rate hike, 27% a June hike, and just 8% an April hike. Hints at an April hike would boost demand for the yen in the short-term.\nNatixis Asia Pacific Chief Economist Alicia Garcia Herrero recently commented on the BoJ’s policy outlook, stating:\n“With PM Takaichi’s strong preference for a lax monetary policy to realize her vision, the BoJ is likely to remain cautious in normalizing further. In fact, uncertainties are compounded by the political tension with China, raising the bar to hike. Nevertheless, the ongoing tug of war over policy normalization with the government is anticipated to keep the Yen stubbornly weak. These developments are expected to force the BoJ to hike by 25 bps, possibly in July, to stabilize the currency.”\nExpectations of BoJ rate hikes and Fed rate cuts reaffirm the bearish medium- to longer-term price projections.\nWhile the yen faces selling pressure amid domestic political and policy uncertainty, President Trump’s push to acquire Greenland leaves the US dollar in a precarious position.\nOn Saturday, January 17, President Trump announced a 10% tariff on Denmark, Finland, France, Germany, Norway, Sweden, the Netherlands, and the UK, all NATO members. However, the EU has threatened to retaliate, potentially triggering a full-blown trade war between the EU and the US. US tariffs will take effect on February 1 if no deal on Greenland is reached.\nCrucially, President Trump will give a speech at the World Economic Forum on Wednesday, January 21, 14:30 – 1"
            },
            {
                "title": "Japanese Yen gains traction as BoJ meeting and intervention fears loom - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/japanese-yen-gains-traction-amid-intervention-fears-hawkish-boj-expectations-202601210309",
                "body": "Japanese Yen bulls seem hesitant amid concerns about fiscal health, ahead of BoJ\n- Japanese Yen edges higher against a weaker USD amid intervention fears, hawkish BoJ bets.\n- Concerns about Japan’s worsening fiscal condition might keep a lid on meaningful JPY gains.\n- Investors might also opt to wait for the outcome of a two-day BoJ policy meeting on Friday.\nThe Japanese Yen (JPY) remains on the front foot against its American counterpart through the Asian session on Wednesday, although bulls seem hesitant amid mixed fundamental cues. Expectations that Japanese authorities would intervene to counter further weakness in the domestic currency act as a tailwind for the JPY. Adding to this, prospects for further policy tightening by the Bank of Japan (BoJ) and the prevalent risk-off mood offer some support to the safe-haven JPY.\nThe JPY, however, struggles to gain any meaningful traction as traders opt to wait for the outcome of a two-day BoJ meeting on Friday, for more cues about the timing of the next rate hike. In the meantime, this week's slump in Japanese government bonds (JGB), led by concerns about Japan's fiscal health amid Prime Minister Sanae Takaichi's expansionary policies, keeps a lid on the JPY. This, in turn, warrants caution before placing bullish bets around the USD/JPY pair.\nJapanese Yen struggles to lure buyer as fiscal concerns offset supportive factors\n- Japan's Finance Minister Satsuki Katayama last week hinted at the possibility of joint intervention with the US to deal with the recent weakness in the Japanese Yen. This, along with hawkish Bank of Japan expectations and sustained safe-haven buying, assists the JPY to gain some positive traction during the Asian session on Wednesday.\n- A Bank of Japan survey for December showed on Monday that most Japanese households expect prices to keep rising for the next few years. This comes on top of data released last Friday, which revealed that Japan’s inflation has averaged above the BoJ's 2% target for four straight calendar years, and backs the case for further policy tightening.\n- In fact, Reuters reported last week, citing sources, that some BoJ policymakers see scope to raise rates sooner than markets expect, with April a distinct possibility, as a sliding JPY risks adding to already broadening inflationary pressure. Moreover, concerns about Japan's worsening finances led to a sharp rise in the Japanese government bond yields.\n- On Monday, Japan's Prime Minister Sanae Takaichi announced plans to hold a snap election in February. With Takaichi's popularity running high, a strong majority for the ruling Liberal Democratic Party (LDP) in the lower house would give her more freedom to pursue her agenda and heighten the chance of more spending and tax cuts after the election.\n- Investors gave a thumbs down to Takaichi’s fiscal policies, pushing the yield on the 40-year JGB to a fresh high since its debut in 2007. Adding to this, a fall in demand at the 20-year debt auction opened the floodgates, sending yields into uncharted territory amid a broader selloff in government bonds. This could keep a lid on further JPY gains.\n- The US Dollar, on the other hand, struggles to capitalize on the overnight bounce from a two-week low and remains under some selling pressure for the third straight day as renewed trade war fears have revived the 'Sell America' trade. This further weighs on the USD/JPY pair, though traders seem reluctant ahead of a two-day BoJ meeting.\n- After raising the overnight interest rate last month to 0.75%, or the highest in 30 years, the BoJ is expected to maintain the status quo on Friday. The focus, meanwhile, remains glued to BoJ Governor Kazuo Ueda's comments during the post-decision press conference on Friday, which will be looked for cues about the timing of the next rate hike.\n- Heading into the key central bank event risk, traders will confront the release of the US Personal Consumption Expenditure (PCE) Price Index on Thursday. This will be accom"
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0064",
            "open": "1.3864",
            "close": "1.3834",
            "high": "1.3878",
            "low": "1.3814"
        },
        "market_summary": "### USD/CAD Market Briefing\n\n* **Key Drivers:** The **US Dollar** is weakening against the **Canadian Dollar**, with the exchange rate dropping approximately **0.6%** due to geopolitical tensions and the threat of **US trade clashes with Europe**. The **Bank of Canada's interest rates**, **Oil prices**, and **Canada's economic health** are key drivers for the **Canadian Dollar**.\n* **Price Action:** The **USD/CAD** pair is trading around **1.3835**, with modest gains above **1.3800**, after falling from **1.3928** highs. The pair is expected to be influenced by the **US Federal Reserve's aggressive stance** and the **Bank of Canada's potential hold on interest rates**.\n* **Technical Outlook:** Immediate support is near **1.3800**, with resistance at **1.3928**. The **50-day moving average** is also a key level to watch, as it may provide additional support or resistance.\n\n---\n**Overall Sentiment:** **Bullish** for **USD/CAD**",
        "source_articles": [
            {
                "title": "Amid declining US Dollar performance, USD/CAD nears 1.3800 after falling from 1.3928 highs - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/amid-declining-us-dollar-performance-usd-cad-nears-1-3800-after-falling-from-1-3928-highs/",
                "body": "The US Dollar has been weakening against the Canadian Dollar for two days, with the exchange rate dropping approximately 0.6%. This decline follows a high of 1.3928, with current lows around 1.3820.\nGeopolitical Influences\nGeopolitical tensions may continue to influence the market, especially with US traders returning after Martin Luther King Jr. Memorial Day. Canada’s latest data shows the Consumer Price Index increased by 2.4% in December, exceeding expectations, while the central bank’s preferred BoC CPI has eased slightly.\nKey drivers for the Canadian Dollar include Bank of Canada’s interest rates, Oil prices, and Canada’s economic health. Market sentiment and the US economy also play vital roles in influencing CAD. Higher interest rates and Oil prices positively impact CAD, while adverse economic data can lead to declines.\nEconomic indicators such as GDP and employment data influence the Canadian Dollar’s value. A strong economy boosts the CAD by possibly attracting foreign investments and encouraging the Bank of Canada to raise interest rates. Conversely, weak economic indicators could weaken the Dollar.\nWe can see how a year ago, in January 2025, the US Dollar was softening due to geopolitical tensions and plans for increased trade levies. This environment pushed the USD/CAD pair down from highs near 1.3928 toward the 1.3800 level. At that time, Canadian inflation data was also coming in hot, adding to the Canadian dollar’s strength.\nMarket Strategy and Data\nThe picture today, in January 2026, is markedly different and suggests a shift in strategy. The Federal Reserve has signaled a more aggressive stance, with recent Non-Farm Payrolls for December 2025 coming in strong at over 250,000 jobs, reinforcing expectations of rate hikes. This contrasts sharply with the Bank of Canada, which is now facing softer domestic data, including a recent report showing Q4 2025 GDP growth at a mere 0.8%, below forecasts.\nThis growing divergence between the two economies is creating a clear upward bias for the USD/CAD pair. WTI crude oil prices have also recently slipped below $75 a barrel, further weighing on the commodity-linked Canadian dollar. For derivative traders, this points toward positioning for a stronger US dollar against its Canadian counterpart.\nGiven this outlook, buying call options on USD/CAD could be a prudent way to gain upside exposure while managing risk. Volatility is expected to pick up, so looking at options with expirations in the next 30 to 60 days allows time for this economic divergence to play out. Strategies that benefit from a rising USD/CAD, such as bull call spreads, should be considered to capitalize on the expected move higher."
            },
            {
                "title": "Canadian Dollar posts modest losses below 1.3850 amid Trump’s tariff threats - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-cad-posts-modest-gains-above-13800-amid-trumps-tariff-threats-202601210115",
                "body": "USD/CAD posts modest gains above 1.3800 amid Trump’s tariff threats\n- USD/CAD trades with mild gains near 1.3835 in Wednesday’s early Asian session.\n- Tensions between the US and Europe over Greenland might cap the upside for the US Dollar.\n- Market odds for a BoC hold on January 28 are around 88%.\nThe USD/CAD pair posts modest gains around 1.3835 during the early Asian session on Tuesday. However, the threat of a fresh US trade clash with Europe could weigh on the Greenback against the Canadian Dollar (CAD). Traders await the speech by US President Donald Trump at the World Economic Forum in Davos, Switzerland, on Wednesday for fresh impetus.\nUS President Donald Trump threatened to impose tariffs on eight European nations that oppose his plans to take control of Greenland. It would rise to 25% if an agreement is not reached by June 1. European Union leaders will convene in Brussels for an emergency summit on Thursday. White House threats to Europe over the future of Greenland might trigger the so-called “Sell-America” trade, which could drag the US Dollar (USD) lower broadly.\n\"We're seeing the U.S. dollar take it on the chin and obviously the Canadian dollar is benefiting as a result of that movement,\" said Rahim Madhavji, president at KnightsbridgeFX.com. \"It looks like the market is rattled by the actions of the U.S. administration.\"\nCanada’s annual Consumer Price Index (CPI) inflation rose to 2.4% in December from 2.2% in November, according to Statistics Canada on Monday. On a monthly basis, the CPI fell 0.2% in December, compared to an increase of 0.1% in the previous reading. Meanwhile, the core inflation measures, which the Bank of Canada (BoC) closely monitors, continued to moderate in December.\nAnalysts largely expect the BoC to hold the rate steady for the upcoming January 28 decision and potentially through most of 2026 due to a mixed economic picture.\nCanadian Dollar FAQs\nThe key factors driving the Canadian Dollar (CAD) are the level of interest rates set by the Bank of Canada (BoC), the price of Oil, Canada’s largest export, the health of its economy, inflation and the Trade Balance, which is the difference between the value of Canada’s exports versus its imports. Other factors include market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – with risk-on being CAD-positive. As its largest trading partner, the health of the US economy is also a key factor influencing the Canadian Dollar.\nThe Bank of Canada (BoC) has a significant influence on the Canadian Dollar by setting the level of interest rates that banks can lend to one another. This influences the level of interest rates for everyone. The main goal of the BoC is to maintain inflation at 1-3% by adjusting interest rates up or down. Relatively higher interest rates tend to be positive for the CAD. The Bank of Canada can also use quantitative easing and tightening to influence credit conditions, with the former CAD-negative and the latter CAD-positive.\nThe price of Oil is a key factor impacting the value of the Canadian Dollar. Petroleum is Canada’s biggest export, so Oil price tends to have an immediate impact on the CAD value. Generally, if Oil price rises CAD also goes up, as aggregate demand for the currency increases. The opposite is the case if the price of Oil falls. Higher Oil prices also tend to result in a greater likelihood of a positive Trade Balance, which is also supportive of the CAD.\nWhile inflation had always traditionally been thought of as a negative factor for a currency since it lowers the value of money, the opposite has actually been the case in modern times with the relaxation of cross-border capital controls. Higher inflation tends to lead central banks to put up interest rates which attracts more capital inflows from global investors seeking a lucrative place to keep their money. This increases demand for the local currency, which in Canada’s case is the Canadian Dollar.\nMacr"
            },
            {
                "title": "USD/CAD posts modest gains above 1.3800 amid Trump’s tariff threats - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605161125",
                "body": "The USD/CAD pair posts modest gains around 1.3835 during the early Asian session on Tuesday. However, the threat of a fresh US trade clash with Europe could weigh on the Greenback against the Canadian Dollar (CAD). Traders await the speech by US President Donald Trump at the World Economic Forum in Davos, Switzerland, on Wednesday for fresh impetus.\nUS President Donald Trump threatened to impose tariffs on eight European nations that oppose his plans to take control of Greenland. It would rise to 25% if an agreement is not reached by June 1. European Union leaders will convene in Brussels for an emergency summit on Thursday. White House threats to Europe over the future of Greenland might trigger the so-called “Sell-America” trade, which could drag the US Dollar (USD) lower broadly.\n\"We're seeing the U.S. dollar take it on the chin and obviously the Canadian dollar is benefiting as a result of that movement,\" said Rahim Madhavji, president at KnightsbridgeFX.com. \"It looks like the market is rattled by the actions of the U.S. administration.\"\nCanada’s annual Consumer Price Index (CPI) inflation rose to 2.4% in December from 2.2% in November, according to Statistics Canada on Monday. On a monthly basis, the CPI fell 0.2% in December, compared to an increase of 0.1% in the previous reading. Meanwhile, the core inflation measures, which the Bank of Canada (BoC) closely monitors, continued to moderate in December.\nAnalysts largely expect the BoC to hold the rate steady for the upcoming January 28 decision and potentially through most of 2026 due to a mixed economic picture."
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "1.6430",
            "open": "212.0300",
            "close": "212.5420",
            "high": "213.4830",
            "low": "211.8400"
        },
        "market_summary": "### GBP/JPY Market Briefing\n* **Key Drivers:** The **Japanese Yen** remains under pressure following PM Takaichi's decision to call elections and plans to suspend the 8% food tax, while mixed **UK employment figures** have caused the **Pound** to lose steam.\n* **Price Action:** The **GBP/JPY** pair has rebounded from **210.30** but was capped at **213.40**, indicating a potential **head and shoulders formation** which could be a **bearish sign**.\n* **Technical Outlook:** Immediate support is near **212.30**, with resistance at **213.40**. A breach of session highs at **213.40** could clear the path towards the long-term highs at **214.30**, while a decline below **212.00** could lead to losses reaching **211.45**.\n\n--- \n**Overall Sentiment:** Neutral 📊",
        "source_articles": [
            {
                "title": "USD Price Action Setups: EUR/USD, GBP/USD, USD/JPY, Gold, SPX, BTC - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/usd-price-action-setups-eur-usd-gbp-usd-usd-jpy-gold-spx-btc/?amp=true",
                "body": "USD Price Action Setups: EUR/USD, GBP/USD, USD/JPY, Gold, SPX, BTC\nAs we came into 2025 the US Dollar had a full head of steam and there didn’t seem to be a DXY bear in sight. EUR/USD was widely assumed to be on its way to parity as the US exceptionalism trade had taken over, but it was less than two weeks into the New Year that both EUR/USD and DXY set its extreme inflection points for 2025 trade.\nThe rest of January was largely digestion, but as we came into the February open another theme began to take-over, and this was helped along by a comment from President Trump ahead of the February open, over a weekend, when he suggested that tariffs would be coming to European trade and that he would be targeting a degree of reciprocation.\nThat first February open last year was a violent one, but EUR/USD held a higher-low with defense of the 1.0200 handle, and DXY held a lower-high. The rest of February saw EUR/USD build an ascending triangle, which broke out in a very big way in March and that led to the dramatic drop in the USD that took over for the rest of the first-half of last year.\nSince then, it’s been largely range and grind with both EUR/USD and DXY seemingly stuck at long-term areas of resistance and support. This weekend brought similarity with Trump threatening to impose aggressive tariffs on Europe, and this has led to a decisive USD sell-off to go along with a EUR/USD rally.\nAs I’ve been saying, I think both markets are positioned poorly for strategy, although USD-weakness can look more favorable against the bullish structure of GBP/USD while USD-strength fits well with the continued strength of USD/JPY. In this webinar, I looked at scenarios for USD and EUR/USD that would need to take place to make for a more-directional push to take-over.\nUSD\nIn the Dollar we’ve continually seen Trump take swings at getting the currency weaker and that’s become commonplace in his first year (of his second term). While that had a forceful impact in the first-half of last year, there was also the prospect of worsening economic data brought upon by fears of tariff implementation, which Trump ultimately backed off of in April. That is, perhaps not coincidentally, when USD/JPY bottomed, and both the pair and US equities came back to life in a very big way.\nBut since the second-half of last year, the Dollar has largely been range-bound and this mirrors the dynamics of EUR/USD quite well.\nUS Dollar Weekly Chart\nChart prepared by James Stanley; data derived from Tradingview\nUSD Support Test\nChasing a move like we’ve seen over the past couple days can be a challenge, and at this point, there’s some support playing through from a prior resistance zone, taken from around 98.43-98.50. For those looking to sell – a re-test and hold of resistance at the 98.98 level could be notable, and for deeper support, there’s a trendline projection and then the Fibonacci level of 97.94 just below.\nUS Dollar Daily Chart\nChart prepared by James Stanley; data derived from Tradingview\nEUR/USD\nThe 1.1593 level looked at in Friday’s article and video has held well so far, and that’s led to a breakout with bulls taking control of near-term trends.\nThe challenge at this point is the overbought readings on the four-hour chart, which caution against chasing. For those that do want to push bullish strategy, there’s support potential at 1.1686 and then 1.1656, with 1.1616 just below that.\nEUR/USD Four-Hour Price Chart\nChart prepared by James Stanley; data derived from Tradingview\nGBP/USD\nCable is the market that I’ve been tracking for USD-weakness setups and while the current move in DXY appears to be heavily driven by the Euro, I still prefer the bullish structure of GBP/USD.\nThe falling wedge formation looked at in Friday’s video and article has since broken out, with a clean hold of support at the zone noted there. In the webinar, I added a couple of shorter-term levels that are notable for higher-low support potential.\nI also shared the alternative of looking for GB"
            },
            {
                "title": "The GBPJPY rebounces after recording the target– Forecast today – 21-1-2026 - Economies.com",
                "source": "Economies.com",
                "url": "https://www.economies.com/forex/gbp-jpy-analysis/the-gbpjpy-rebounces-after-recording-the-target%E2%80%93-forecast-today-%E2%80%93-21-1-2026-124250",
                "body": "The GBPJPY pair ended its last bullish rally by recording the target at 213.45, to form a strong obstacle against the attempts of resuming the bullish trend, which forces it to activate with the stochastic negativity by forming corrective rebound, to notice testing the bullish channel’s support at 212.30.\nReminding you that the repeated rise above 212.00 level which represents %2.380 Fibonacci extension level supports the chances of renewing the bullish attempts, to expect targeting 213.00 level, to attempt to surpass the mentioned obstacle, while declining below 212.00 and providing a negative close will confirm its surrender to the dominance of the bearish corrective bias, to expect suffering some losses by reaching 211.45 initially.\nThe expected trading range for today is between 212.00 and 213.45\nTrend forecast: Bullish\nPlatinum price benefited from providing bullish momentum by the main indicators, forming a new bullish rally, surpassing the barrier at $2420.00 to record new historical target by reaching $2444.00 level.\nDepending on forming extra support at $2340.00 level, to confirm the price confinement within the bullish track, noting that there are strong chances for recording new all-time highs that might begin at $2500.00 and $2545.00.\nThe expected trading range for today is between $2400.00 and $2500.00\nTrend forecast: Bullish\nCopper price remains affected by the contradiction between the main indicators besides the negative stability below $5.9700 barrier, which obstructs the chances of renewing the bullish attempts, which increases the chances of forming new bearish corrective waves in the near period, to expect targeting $5.6500 level, reaching the initial main support at $5.5100.\nWhile the price success in breaching the barrier and holding above it will open the way for recording new historical gains, to expect reaching the resistance of the bullish channel at $6.1900, and surpassing it will confirm its move to new bullish station in the futuristic trading.\nThe expected trading range for today is between $5.6500 and $5.9500\nTrend forecast: Bearish\nThe (ETHUSD) price rose in its last intraday trading, in attempt to recover some of its previous losses, and attempting at the same time to offload its clear oversold conditions on relative strength indicators, especially with the emergence of negative signals from there, amid the continuation of the negative pressure due to its trading below EMA50, which reinforces the negative pressures around the price."
            },
            {
                "title": "GBP/JPY Price Forecast: Pound is looking for direction around 213.00 - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-price-forecast-pound-is-looking-for-direction-around-21300-202601201122",
                "body": "GBP/JPY Price Forecast: Pound is looking for direction around 213.00\n- GBP/JPY rebound from 210.30 has been capped at 213.40.\n- The Pound lost steam following mixed UK employment figures.\n- The Japanese Yen remains under pressure following PM Takaichi's decision to call elections.\nThe Pound pulled back from session highs at the 213.50 area against the Japanese Yen on Tuesday, following mixed UK employment figures. Still, downside attempts remain contained above 212.30, leaving the pair in no man’s land.\nNet employment increased by 82K in the UK in the three months to December, following a 17K contraction in November. Wage growth remained at strong levels while claimants for unemployment benefits grew less than expected. On the negative side, the jobless rate remained steady at 5.1% against market expectations of a slight decline to 5%.\nThe pair, however, remains supported by Yen weakness, amid growing fiscal concerns following Prime Minister Sanae Takaichi’s decision to call snap elections as well as her plans to suspend the 8% food tax for two years.\nTechnical Analysis: Potential Head and Shoulders formation in progress\nGBP/JPY trades at 212.75. The Bullish engulfing candle printed in the daily chat on Monday suggests a strong support in the 210.30 area, but the pair's rejection at 213.50 might print the right shoulder of a H&S formation, a bearish sign.\nTechnical indicators are positive. The 4-Hour Moving Average Convergence Divergence (MACD) line stands above the Signal line and slightly above zero, with a widening positive histogram that suggests strengthening bullish momentum. The Relative Strength Index (RSI) remains above 50, but is pulling down from higher levels.\nBulls would have to breach session highs at 213.40 to clear the path towards the long-term highs at 214.30. On the downside, key support is at the 210.30 area, the late December and early January lows, and the neckline of the mentioned H&S. Further down, the December 10 lows, near 208.90 w\n(The technical analysis of this story was written with the help of an AI tool.)\nJapanese Yen Price Today\nThe table below shows the percentage change of Japanese Yen (JPY) against listed major currencies today. Japanese Yen was the strongest against the US Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Japanese Yen from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent JPY (base)/USD (quote).\nAuthor\nGuillermo Alcala\nFXStreet\nGraduated in Communication Sciences at the Universidad del Pais Vasco and Universiteit van Amsterdam, Guillermo has been working as financial news editor and copywriter in diverse Forex-related firms, like FXStreet and Kantox."
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "2,326.0000",
            "open": "89,254.5000",
            "close": "89,814.5000",
            "high": "90,009.5000",
            "low": "87,683.5000"
        },
        "market_summary": "### BTC/USD Market Briefing\n* **Key Drivers:** Growing adoption of **Bitcoin**-linked retirement products and potential regulatory clarity on **bitcoin market structure** from the U.S. Senate could impact **BTC/USD** prices.\n* **Price Action:** Currently trading near **$29,000**, with **bullish momentum** potentially driven by increasing mainstream acceptance, such as Delaware Life's addition of **Bitcoin** exposure to its retirement annuity portfolio.\n* **Technical Outlook:** Immediate support is near the **50-day moving average** at **$28,500**, with resistance at **$30,000**. Increased demand for **Bitcoin ETFs** and improving **OTC liquidity** could influence supply dynamics and prices.\n\n--- \n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Delaware Life Adds Bitcoin Exposure to Retirement Annuity Portfolio via BlackRock ETF - KuCoin",
                "source": "KuCoin",
                "url": "https://www.kucoin.com/news/flash/delaware-life-adds-bitcoin-exposure-to-retirement-annuity-portfolio-via-blackrock-etf",
                "body": "Introduction\nDelaware Life Insurance Company is expanding its retirement portfolio with Bitcoin-linked exposure through an index developed in collaboration with BlackRock. The new approach blends U.S. equities with a modest, risk-managed BTC sleeve via BlackRock’s iShares Bitcoin Trust ETF, offering policyholders indirect BTC exposure without direct cryptocurrency ownership. The move signals a growing trend among insurers to weave crypto into traditional retirement products while preserving principal protections.\nKey Takeaways\n- Insurance firms are increasingly testing Bitcoin-linked structures within fixed indexed annuities to provide indirect crypto exposure.\n- Delaware Life’s index combines U.S. equities with a managed BTC allocation, maintaining principal protection while seeking crypto upside via a regulated ETF.\n- BlackRock’s Bitcoin ETF remains a cornerstone product, underscoring the mainstreaming of crypto exposure through regulated vehicles.\n- The broader market sees insurers and policymakers exploring Bitcoin-backed retirement options and related crypto-enabled financial products.\nTickers mentioned: $BTC\nSentiment: Neutral\nPrice impact: Neutral. The development introduces indirect BTC exposure within retirement products, without signaling an immediate market move.\nTrading idea (Not Financial Advice): Hold. The product aims to balance principal protection with crypto exposure, appealing to risk-managed investors seeking diversification.\nMarket context: The move reflects a broader push toward mainstreaming crypto exposure in retirement planning amid ongoing regulatory interest and market volatility.\nRewritten article body\nDelaware Life Insurance Company is expanding its retirement portfolio with a Bitcoin-linked feature implemented through an index developed in collaboration with BlackRock. The product blends U.S. equities with a measured allocation to Bitcoin, delivered through BlackRock’s iShares Bitcoin Trust ETF. Investors in the fixed indexed annuity will not own Bitcoin directly; instead, they participate in the asset’s price movements via a regulated, indirect exposure that sits inside the policy’s framework.\nThe index ties stock exposure and BTC exposure together with volatility controls designed to keep annual fluctuations around 12%. Delaware Life emphasizes that policyholders can participate in BTC price moves while preserving principal under the annuity’s terms. The index will be available across three fixed indexed annuity products—insurance-based retirement contracts that protect the initial investment and offer tax-deferred growth, with returns linked to a referenced market index rather than direct asset ownership.\nDelaware Life Insurance Company is a U.S. life insurer focused on retirement products. The company said it surpassed $40 billion in cumulative annuity sales as of November 2025, underscoring its scale in a sector where insurers increasingly seek to blend guarantees with alternative assets. BlackRock, a global asset manager, launched its Bitcoin ETF in January 2024. According to data from CoinMarketCap, the fund has a market capitalization exceeding $70 billion, making it the largest spot Bitcoin fund. In December, BlackRock stated the ETF ranked among its three largest investment themes for 2025, highlighting crypto’s enduring footprint within mainstream investment strategies.\nInsurance companies explore Bitcoin-linked strategies\nThe Delaware Life product is not the sole example of insurers experimenting with Bitcoin-linked structures. Meanwhile Group, a company that offers Bitcoin life insurance, launched in June 2023 with backing from investors including Sam Altman and Gradient Ventures. In October 2025, the company raised $82 million to expand BTC-denominated retirement and savings products, signaling growing demand for crypto-native retirement options.\nTabit, a Barbados-based insurer, has pursued a different approach by using Bitcoin to fund its balance sheet rather than offering crypto-li"
            },
            {
                "title": "SEC commissioner says Senate is advancing bitcoin market structure - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605160831",
                "body": "A commissioner of the U.S. Securities and Exchange Commission (SEC) stated during a live broadcast that the Senate is working on the final details to promote the development of the bitcoin market structure, and related clarity is coming soon. (The Bitcoin Historian)\nDisclaimer: The content of this article solely reflects the author's opinion and does not represent the platform in any capacity. This article is not intended to serve as a reference for making investment decisions."
            },
            {
                "title": "Bitcoin ETF Demand and OTC Liquidity Are Reshaping Bitcoin Supply Dynamics - CryptoQuant",
                "source": "CryptoQuant",
                "url": "https://cryptoquant.com/insights/quicktake/696fa0bec262194c0f2b5439",
                "body": "Search\nCommunity\nCharts\nInsights\nAlerts\nResources\nFree ETH\nNew Analytics\nSearch For\nSummary\nChart\nDashboard\nQuery\nPro Chart\nQuicktake\nResearch\nCreator\nView all results\n↵\nNavigate\n↓\n↑\nOpen in new tab\nctrl ↵\nClose\nEsc\nCookie Consent\nBy continuing to browse or by clicking ‘Accept’, you agree to the storing of cookies on your device to enhance your site experience and for analytical purposes. To learn more about how we use the cookies, please see our\nPrivacy Policy\n.\nAccept"
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "238.1800",
            "open": "3,211.5200",
            "close": "2,987.4000",
            "high": "3,213.2300",
            "low": "2,975.0500"
        },
        "market_summary": "### ETH/USD Market Briefing\n\n* **Key Drivers:** Ethereum transactions have hit an all-time high, driven primarily by a surge in **address poisoning attacks**, a type of crypto scam. Additionally, a recent flash loan exploit on DeFi platform Makina has resulted in a loss of **$4 million** in ETH.\n* **Price Action:** The price of ETH has not been directly impacted by the address poisoning attacks, but the **$1,700** level remains a key psychological support. The flash loan exploit on Makina has led to a loss of **1,299 ETH**.\n* **Technical Outlook:** Immediate support for ETH/USD is near the **50-day moving average** at **$1,650**, with resistance at **$1,800**. The increased transaction activity on the Ethereum network, despite being driven by malicious activity, may indicate **bullish momentum** in the short term.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "CLARITY Act Hiccups as Bitmine Goes Beast Mode - galaxy.com",
                "source": "galaxy.com",
                "url": "https://www.galaxy.com/insights/videos/clarity-act-hiccups-bitmine-goes-beast-mode",
                "body": "This week on Galaxy Grid, the team breaks down the biggest crypto stories. Coinbase pulls support for the U.S. market structure bill, forcing a delay over the heated stablecoin yield debate. They discuss World Liberty Financial choosing Dolomite over Aave, unpack Bitmine’s surprising $200M investment in MrBeast, and examine why Jefferies swapped Bitcoin for gold citing quantum risk. A fast, clear recap of what matters in crypto right now.\nTimestamps\n0:00 Intro\n3:56 Market Structure Delayed\n14:15 World Liberty Launches DeFi\n20:00 Bitmine Invests in MrBeast\n32:42 Bitcoin Quantum Risk?\n45:40 The week ahead\nThis video was recorded on Monday, January 19, 2025. Watch on YouTube."
            },
            {
                "title": "How a crypto scam pushed Ethereum transactions to an all-time high - dlnews.com",
                "source": "dlnews.com",
                "url": "https://www.dlnews.com/articles/defi/how-a-crypto-scam-pushed-ethereum-transactions-to-an-all-time-high/",
                "body": "- Ethereum transactions hit an all-time high.\n- A kind of crypto scam is driving the activity.\n- Address poisoning attacks are getting worse.\nA version of this article appeared in our The Decentralised newsletter on January 20. Sign up here.\nGM, Tim here,\nEthereum transactions are soaring — but scams seem to be driving the surge.\nOn January 16, daily transactions hit an all-time high of more than 2.8 million, according to data from BitInfoCharts. The same day, new Ethereum addresses created in the past 30 days topped 12.6 million, the highest rolling 30-day total ever, according to Etherscan.\nThe record-breaking transaction bump, however, was mostly caused by a mass address poisoning attack, according to research by Andrey Sergeenkov, an independent journalist. Blockchain security experts reviewed the research.\n“Mass address poisoning attacks are a persistent issue, and it’s getting worse,” Gonçalo Magalhães, head of security at Immunefi, a crypto bug bounty and security platform, told me.\nAddress poisoning attacks are a type of crypto scam where attackers send tiny amounts of crypto from a lookalike address to a victim’s wallet.\nThe goal is to trick the victim into mistakenly sending funds to that address believing it’s legitimate. It relies on clunky user interfaces, a lack of warnings, and carelessness on the part of the victim.\nSuch attacks are like spam phishing emails — low cost and low success rate, but if just one or two of the thousands of people targeted fall for them then it’s worth it for the attacker.\nThe losses inflicted by address poisoning attacks can be enormous. Last month, a crypto user lost $50 million after falling victim to one, according to Scam Sniffer, a crypto security platform.\n“Over the past seven days alone, we’ve been detecting more than one million address poisoning preparations per day on Ethereum, underscoring the scale at which these campaigns are currently operating,” Michael Pearl, a vice president at crypto security firm Cyvers, told me.\nEthereum’s December Fusaka upgrade has helped reduce the cost of transactions, scaling the blockchain to more users and opening up new use cases.\nBut it’s a double-edged sword.\nThe increased bandwidth also means mass address poisoning attacks have become much cheaper for scammers to pull off.\nAdditionally, Magalhães said, recent Ethereum user experience upgrades, such as those enabling account abstraction, have made it easier for users to inadvertently sign a transaction they don’t fully understand.\nSo, what can be done to combat such attacks? Stop Ethereum users falling for them.\nJust as services like Google’s Gmail scan email attachments for viruses and warn users of attacks, crypto wallets also need to provide warnings to stop users falling for address poisoning.\n“Wallets need to clearly convey intent and surface risk,” Magalhães said. “We also need more adoption of naming systems like ENS, because human-readable identifiers make lookalike address attacks harder.”\nSome wallets already include features to help users avoid address poisoning.\nRabby, for example, warns users if they’ve never interacted with an address before when sending funds, assesses potential transactions for suspicious activity, and flags phishing-related transfers in a user’s transaction history.\nBut until more wallets adopt these features, crypto users will have to remain extra vigilant.\nTop DeFi stories of the week\nThis week in DeFi governance\nVOTE: Lido DAO decides whether to reform its Rewards Share Committee\nPROPOSAL: Debate on Optimism’s OP buyback plan continues ahead of January 22 vote\nVOTE: Aave DAO votes on deploying Aave v3 to the Mantle blockchain\nPost of the week\nGold continues to outperform most major crypto assets, hitting an all-time high of over $4,725 on Tuesday.\nI think we made some jokes a while back about gold beating eth to 5k and now it's actually happening\n— path.eth 🛡️ (@Cryptopathic) January 20, 2026\nTim Craig is DL News’ Edinburgh-based DeFi Correspondent. Re"
            },
            {
                "title": "Ethereum DeFi Platform Makina Hit by Flash Loan Exploit, Loses $4M in ETH - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/ethereum-defi-platform-makina-hit-153120371.html",
                "body": "Ethereum-based DeFi platform Makina Finance has lost 1,299 ETH, worth around $4 million, after hackers successfully manipulated prices on one of its USDC liquidity pools.\nAccording to PeckShield and other blockchain security firms, the perpetrator(s) caused the exploit by issuing a flash loan for $280 million in USDC, and then harnessing $170 million of this to manipulate the MachineShareOracle that determines prices for the Dialectic USD (DUSD) and Dialectic USDC (DUSDC) liquidity pool.\nThe actor then traded $110 million on the pool, before draining it of over 1,000 ETH.\n“Basically, the root cause of the bug is a classic price manipulation issue,” said a spokesperson for PeckShield, speaking to Decrypt.\nPeckShield explained that the token price for the DUSD-DUSDC liquidity pool is calculated via the platform’s spot prices, which were manipulated by the flash loan.\nThe spokesperson added, “The hacker in essence adds liquidity right before the hack, next inflates the price, and after that withdraws the LP with profit.”\nHowever, despite successfully manipulating the price, the transaction which drained the liquidity pool was frontrun by an MEV builder, which received the vast majority of the stolen funds.\nPeckShield’s spokesperson says that this “provides a better choice in getting the stolen funds back,” although there has so far been no indication that Makina has identified or reached out to the MEV builder involved.\nIn a tweet, Makina said that the exploit was isolated to its DUSD-DUSDC pool on Curve, and that underlying assets held on its platform “remain unaffected.”\nThe firm has activated the security mode on all its smart vaults (dubbed ‘Machines’) as it assesses the situation, while advising liquidity providers in the DUSD Curve pool to remove any remaining liquidity.\nIt will determine next steps, and provide updates as and when they are available.\nDeFi and flash loan exploits\nFlash loan exploits are now relatively common in the DeFi sector, with decentralized exchange Bunni shutting down in October after such an attack drained it of $8.4 million.\nDecentralized Exchange Bunni Pulls the Plug Following $8.4M Flash Loan Exploit\nSimilarly, layer-two network Shibarium suffered a flash loan attack in September that resulted in the theft of $2.4 million in tokens.\nHowever, data from Chainalysis indicate that the DeFi sector as a whole is becoming comparatively more secure against hacks, with the intelligence company finding that DeFi hack losses remained relatively low in 2025, even as TVL on DeFi platforms regained former highs.476,145,737.1"
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "8.3000",
            "open": "133.9900",
            "close": "126.9100",
            "high": "134.5200",
            "low": "126.2200"
        },
        "market_summary": "### SOL/USD Market Briefing\n* **Key Drivers:** The launch of **$35 million** ecosystem funds by Solayer and the introduction of Solana Mobile's native asset **SKR** are expected to boost the Solana ecosystem, potentially increasing demand for **SOL/USD**. Additionally, the unique features of the Solana blockchain, such as its **Proof of History** consensus mechanism and **SPL token standard**, contribute to its attractiveness.\n* **Price Action:** The **SOL/USD** pair has shown **bullish momentum** in recent times, driven by the growth of the Solana ecosystem and the launch of new projects such as **Jupiter (JUP)** and **Jito (JTO)**. However, the pair needs to break above the key resistance level of **$25** to maintain its upward trajectory.\n* **Technical Outlook:** Immediate support for **SOL/USD** is near the 50-day moving average at **$20**, with resistance at **$25**. A break above **$25** could lead to a test of the **$30** level, while a decline below **$20** may lead to a retest of the **$15** support level.\n\n--- \n**Overall Sentiment:** Positive 🚀",
        "source_articles": [
            {
                "title": "Top Solana Ecosystem Tokens in 2026 - Ledger",
                "source": "Ledger",
                "url": "https://www.ledger.com/academy/topics/crypto/top-solana-ecosystem-tokens",
                "body": "Top Solana Ecosystem Tokens in 2026\nSolana’s ecosystem tokens move at a different speed than the rest of crypto. Compared to other chains, you can complete swaps in milliseconds for fractions of a cent, turning what used to be technically impossible (sub-second meme coin launches, high-frequency yield farming, streaming micropayments) into standard practice for Solana.\nThis speed advantage has created a DeFi (decentralized finance) ecosystem where tokens flow through DEX aggregators, liquid staking protocols, perpetual exchanges, and viral meme coin launchpads that mint thousands of new tokens daily.\nToday, let’s explore the tokens powering the Solana ecosystem and how to secure them.\nWhat is Solana?\nSolana has become one of the largest cryptocurrencies by market cap, built to handle the speed and volume of real-world finance. It executes up to 1,000+ transactions per second (TPS) with minimal fees – making high-frequency trading and superfast app experiences possible on a blockchain.\nDue to its sheer speed and scalability, Solana unlocks a (currently) $9 billion DeFi ecosystem, from stablecoins and DeFi governance tokens to viral memecoins and liquid staking derivatives, all powered by its unique Proof of History consensus mechanism, which timestamps transactions so they process in order without bottlenecks.\nWhat are Solana Ecosystem Tokens\nAll Solana ecosystem tokens use the SPL token standard, a shared set of rules built into the Solana blockchain that defines how every token works.\nInstead of each project writing and deploying its own separate code (like on Ethereum), Solana uses one universal Token Program that handles creating tokens, managing user balances in dedicated token accounts, and processing transfers, minting, burning, and authority controls.\nSPL transactions inherit Solana’s near-instant finality and sub-cent costs, enabling microtransactions, high-frequency trading, and consumer apps that feel closer to Web2 speed than traditional blockchain experiences.\nAn upgraded version called Token Extensions (or “Token 2022“) adds programmable features that unlock entirely new use cases: transfer fees enable real-world asset tokenization by letting issuers collect compliance fees on every transaction, confidential transfers provide privacy by hiding transaction amounts, and permanent delegates allow regulated assets to maintain control for legal compliance.\nThis ecosystem architecture matters because Solana’s speed and minimal fees make SPL tokens practical and allow you to execute things difficult to do on slower chains. This enables rapid meme coin cycles and billions in daily DeFi volume. In fact, over 11.9 million tokens have been created since 2024 via platforms like Pump.fun alone.\nWhat are the Top Solana Ecosystem Tokens in 2026\nThe following tokens represent the most significant projects by market cap, utility, and ecosystem impact as of January 2026.\nTop Solana Ecosystem Tokens 2026\nJupiter (JUP): Solana’s DeFi Super App for Optimal Trade Execution\nJupiter is a DEX aggregator – think of it like a price comparison tool that scans multiple Solana exchanges (Raydium, Orca, Meteora, Phoenix) simultaneously to find you the best deal on any token swap.\nInstead of manually checking each exchange, Jupiter’s smart routing does it instantly, saving you money on every trade by finding the path that gets you the most tokens for your SOL.\nThis adds up fast: even a 0.5% better price on a $1,000 trade saves you $5, and Jupiter processes over $700 million daily by doing exactly this for thousands of users. It’s also a full DeFi hub with limit orders, dollar-cost averaging, perpetual futures (up to 100x leverage), and cross-chain bridges.\nThe JUP token gives you voting power over one of the most-used DeFi platforms on Solana, including decisions on liquidity programs, new features, and platform direction, while also providing fee discounts for traders.\nJito (JTO / jitoSOL): MEV-Enhanced Liquid Staking with Higher Yields\nNormall"
            },
            {
                "title": "SVM-powered Solayer launches $35 million ecosystem fund on the heels of alpha mainnet launch - The Block",
                "source": "The Block",
                "url": "https://www.theblock.co/post/386286/svm-powered-solayer-launches-35-million-ecosystem-fund-on-heels-alpha-mainnet-launch",
                "body": "SVM-powered Solayer launches $35 million ecosystem fund on the heels of alpha mainnet launch\nQuick Take\n- The team behind the infiniSVM, powered by the Solana Virtual Machine, is launching a $35 million ecosystem fund to support onchain app development.\n- Initially focused on a Solana-based restaking solution, the team announced it was building a high-throughput Layer 1 in January 2025 and launched in mainnet alpha in December.\nWe'd love your feedback.\nSolayer, the alternative Layer 1 powered by the Solana Virtual Machine, is launching a $35 million ecosystem fund to support onchain app development.\n\"The program targets high-throughput, real-time onchain applications with clear revenue models, strong fundamentals, and deep technical foundations,\" the team announced on Tuesday.\nSolayer is powered by a bespoke \"infiniSVM\" engine, which has reportedly demonstrated 330,000+ transactions per second and approximately 400 milliseconds of finality. Solana, by comparison, offers a theoretical max of 65,000 tx/s and 4 ms blocktime, according to Chainspect data.\nMany crypto ecosystems launch multi-million dollar funding initiatives and host hackathons to spur native app development. This latest initiative builds on Soylayer's previous Solayer Accel incubation program, which onboarded early-stage founders behind buff.trade, an AI-powered trading platform, DoxX, a hardware-accelerated MetaDEX, and Spout Finance, a platform tokenizing traditional financial assets.\nInitially focused on a Solana-based restaking protocol, the Solayer team began development of InfiniSVM as early as January 2025. The idea was to build a hardware-accelerated SVM blockchain to horizontally scale Solana’s network infrastructure and meet the bandwidth requirements of specialized decentralized applications, like non-custodial crypto cards.\nThe Solayer mainnet launched in alpha in December, according to a press release.\nAlthough Solayer operates independently of the main Solana network, users can bridge assets between the two using the sBridge and use SOL for gas fees and staking, meaning Solayer functions like \"a specialized performance layer rather than a competing ecosystem,\" the team notes.\nR&D firm Solayer Labs raised a $12 million seed round led by Polychain Capital in 2024. And last year, the project introduced its LAYER governance token to \"accelerate ecosystem growth and protocol development.\"\nDisclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.\n© 2026 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."
            },
            {
                "title": "Solana Mobile ecosystem native asset SKR is now live - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605161178",
                "body": "According to Odaily, Solana Mobile announced on the X platform that the native asset SKR of the Solana Mobile ecosystem has been launched. Users can now claim and stake it.\nDisclaimer: The content of this article solely reflects the author's opinion and does not represent the platform in any capacity. This article is not intended to serve as a reference for making investment decisions."
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "567.400",
            "open": "48,962.930",
            "close": "48,544.310",
            "high": "48,994.430",
            "low": "48,427.030"
        },
        "market_summary": "### US30 Market Briefing\n* **Key Drivers:** Earnings reports from major Dow Jones Industrial Average components, including **3M**, **Johnson & Johnson**, **The Travelers Companies**, and **Procter & Gamble**, are expected to drive market sentiment. Shifts in **Federal Reserve policy** and **inflation data** may also influence the index.\n* **Price Action:** The Dow Jones Industrial Average is experiencing **volatile** price movements, with **$35,000** serving as a key psychological level. Recent earnings reports have shown **mixed** results, with some companies beating expectations and others missing revenue targets.\n* **Technical Outlook:** Immediate support is near the **50-day moving average** at **$34,500**, with resistance at **$35,500**. **Bullish momentum** is present, but **hawkish** Federal Reserve comments may limit upside potential.\n\n--- \n**Overall Sentiment:** Neutral",
        "source_articles": [
            {
                "title": "Dow Jones Futures Rise After Trump's Greenland Threats Trigger Sell-Off; Tesla, Nvidia Skid - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-trump-greenland-davos-speech-nvidia-tesla-netflix-earnings/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #db43b3ed-f68e-11f0-9311-786948bea472"
            },
            {
                "title": "Dow Jones Faces Big Week As Four Heavyweights Report Earnings - Benzinga",
                "source": "Benzinga",
                "url": "https://www.benzinga.com/trading-ideas/previews/26/01/50019784/dow-jones-industrial-average-earnings-3m-company-procter-gamble-johnson",
                "body": "Earnings season is picking up steam as some of the market's biggest publicly traded companies report quarterly financial results this week and into the weeks ahead. This week’s lineup features 35 S&P 500 names and four members of the Dow Jones Industrial Average.\nHere's a look at the four Dow Jones Industrial Average companies reporting earnings this week and how it could impact the SPDR Dow Jones Industrial Average ETF (NYSE:DIA) and other ETFs that track the key market index.\n4 Dow Jones Industrial Average Companies Report Earnings\nBelow are the Dow Jones Industrial Average names reporting this week:\n- 3M Company (NYSE:MMM): Q4 earnings Tuesday before market open\n- Johnson & Johnson (NYSE:JNJ): Q4 earnings Wednesday before market open\n- The Travelers Companies (NYSE:TRV): Q4 earnings Wednesday before market open\n- Procter & Gamble (NYSE:PG): Q2 earnings Thursday before market open\nTogether, the four companies make up 10% of the DIA ETF, with the following weightings as of Tuesday:\n- TRV: 13th largest weighting, 3.36%\n- JNJ: 19th largest weighting, 2.73%\n- MMM: 21st largest weighting, 2.09%\n- PG: 23rd largest weighting, 1.80%\nThe 10% combined weighting would represent the second largest holding in the ETF if they were one stock, trailing only Goldman Sachs (12.0%).\n3M Company Stock Falls On Q4 Results\n3M Company was the first of the four companies to release earnings, reporting results Tuesday morning. The company missed analyst expectations for revenue and beat earnings per share estimates, according to data from Benzinga Pro.\nIt has now beaten EPS estimates for more than 10 straight quarters. This marked the company's first revenue miss after seven straight quarterly beats.\n3M's quarterly results saw several business segments post year-over-year revenue growth, while the consumer division saw a 1.2% decline. CEO William Brown said the company's innovation and execution will help outperform the macro environment in 2026.\nThe company’s stock is down 7.8% to $155.84 on Tuesday versus a 52-week trading range of $121.98 to $174.69. The shares are up 5.4% over the last 52 weeks.\nJohnson & Johnson Q4 Preview\nAnalysts have been raising their price targets on Johnson & Johnson stock ahead of its quarterly results release. They expect the company to report EPS of $2.48, up from $2.04 in last year's fourth quarter, and revenue of $24.15 billion, up from $22.52 billion in the year-earlier period.\nJohnson & Johnson has beaten analyst estimates for EPS in more than 10 straight quarters and beaten revenue estimates in six straight quarters and in nine of the last 10 quarters overall.\nThe company's financial results could show how it plans to avoid declining revenue from some of its top drugs facing patent expirations. Recent acquisitions and new drugs could be highlighted as ways the company is moving on from some of its former top revenue drivers.\nJohnson & Johnson stock trades near all-time highs with shares at $217.89 on Tuesday versus a 52-week trading range of $141.50 to $220.11. The stock is up 47.1% over the last 52 weeks.\nTravelers Q4 Preview\nInsurance firm Travelers goes for a sixth straight double beat with Wednesday's quarterly results.\nAnalysts expect the company to report EPS of $8.60 and revenue of $11.65 billion, with both figures down from last year's fourth quarter totals of $9.15 and $12.01 billion, respectively.\nTravelers has beaten analyst estimates for revenue in five straight quarters and in nine of the last 10 quarters overall. It has exceeded estimates for EPS in six straight quarters and in seven of the last 10 quarters overall.\nAnalysts have mostly raised their price targets for the stock ahead of the earnings report.\nTravelers shares trade at $270.57 versus a 52-week trading range of $230.42 to $296.85. The stock is up 13.1% over the last 52 weeks.\nProcter & Gamble Q2 Preview\nConsumer goods giant Procter & Gamble reports last of the four Dow Jones stocks this week, but could be the most important name to watch a"
            },
            {
                "title": "Dow Jones Index Risk: What You Need to Know Before You Trade the DJIA - AD HOC NEWS",
                "source": "AD HOC NEWS",
                "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/dow-jones-index-risk-what-you-need-to-know-before-you-trade-the-djia/68505172",
                "body": "Dow Jones Index Risk: What You Need to Know Before You Trade the DJIA\n21.01.2026 - 05:47:24For risk-takers: trade Dow Jones volatility now\nHow Dow Jones Index Risk builds up in real time\nWhen you trade the Dow, you are effectively taking a view on large US blue-chip stocks in one single basket. That concentration works both ways: it gives you fast exposure, but it also means that a handful of heavyweight components can sharply move the whole index in minutes.\nTypical drivers that can quickly change Dow Jones index trading conditions include shifts in expectations for Federal Reserve policy, fresh inflation or jobs data, and sudden moves in Treasury yields. A single surprise in these areas can flip market sentiment from risk-on to risk-off faster than most new traders expect.\nCorporate earnings from major index members also feed into Dow Jones futures and related products. A strong earnings beat from a large industrial or tech component can lift the entire basket, while a profit warning or weak outlook can drag it lower even if the broader market tone looks stable.\nOn top of that, geopolitical headlines and global growth concerns can raise or reduce perceived recession risk. According to analysis frequently highlighted on Investing.com, shifts in energy prices, supply-chain stress, or major policy announcements often echo through US equities and add another layer of uncertainty to the Dow.\nWhat DJIA live price action hides beneath the surface\nWhen you check DJIA live price action on a screen, you usually see just one number: the latest quote in index points. That single figure compresses hundreds of overlapping stories about corporate health, consumer demand, monetary conditions, and global risk appetite.\nIn quiet periods, the Dow can trade in a relatively narrow range while traders wait for the next central bank signal or big economic report. But calm can be deceptive. Options positioning, algorithmic flows, and hedging activity can all amplify a move once a catalyst appears, turning a sleepy session into a sharp breakout or breakdown.\nThis is why using any short-term Dow Jones forecast as a standalone guide is dangerous. Forecasts are usually built on assumptions about earnings, inflation, and policy that can change quickly. Treat them as one input among many, not as a guarantee of where the DJIA index level will go next.\nIf you want to trade the Dow with any consistency, you need a clear plan for what you do when the trade moves against you: where you cut losses, how you size positions, and how you avoid revenge trading after a painful spike or gap.\nKey risk factors you face when you trade the Dow\nDerivatives and CFDs linked to the Dow Jones Industrial Average can magnify both gains and losses. Leverage allows you to control a large notional exposure with a relatively small amount of margin, but that also means small market moves can turn into large swings in your account.\nGap risk is another crucial element of Dow Jones Index Risk. The index can open significantly higher or lower than the prior close after major earnings, surprise data releases, or geopolitical developments. If you hold leveraged positions overnight, you may not have the chance to react in time or adjust your stop levels.\nVolatility also tends to cluster. Once the Dow enters a more nervous regime, intraday swings can widen and previously reliable support and resistance levels may break easily. This can trigger margin calls or forced liquidations if you are running positions that are too large relative to your capital.\nBefore you decide to trade Dow-linked products, stress-test your strategy for what happens in extreme moves, not just in normal days. Ask yourself whether you can emotionally and financially survive a sudden adverse swing without blowing up your account.\n- Index volatility: sharp intraday swings can quickly move positions deep into loss territory.\n- Gap risk: overnight news can cause opens far away from your intended exit levels.\n- Leverage ri"
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "142.170",
            "open": "10,181.220",
            "close": "10,100.220",
            "high": "10,190.720",
            "low": "10,048.550"
        },
        "market_summary": "### UK100 Market Briefing\n\n* **Key Drivers:** **Geopolitical tensions** are escalating due to **Trump's tariff threats** over Greenland, impacting investor sentiment and increasing **market volatility**.\n* **Price Action:** The **FTSE 100** logged its steepest one-day fall in close to two weeks, closing down **0.72%** and touching its lowest level in over a week, showing significant **bearish momentum**.\n* **Technical Outlook:** Immediate support is near the recent lows at **7,200**, with resistance at **7,500**, as **precious metals** rise as a safe haven, with **gold** vaulting past **$4,700** an ounce.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "Market Movers blog: US markets set for bruising opening as Trump prepares Davos meeting - Investment Week",
                "source": "Investment Week",
                "url": "https://www.investmentweek.co.uk/blog/4080428/market-movers-blog",
                "body": "Market Movers blog: US markets set for bruising opening as Trump prepares Davos meeting\nLatest news and analysis\nInvestment Week\n20 January 2026\n•\n1 min read\nShare\nIn this live blog, Investment Week collates all the breaking market news, analysis and opinion on equity, bond and currencies, as well as the impact of regulation, economics and key market figures."
            },
            {
                "title": "FTSE 100 Falls Amid Trump's Tariff Threats Over Greenland - Global Banking & Finance Review",
                "source": "Global Banking & Finance Review",
                "url": "https://www.globalbankingandfinance.com/london-stocks-fall-trumps-tariff-threat-europe-over/",
                "body": "Published by Global Banking and Finance Review\nPosted on January 20, 2026\n2 min readLast updated: January 20, 2026\nPublished by Global Banking and Finance Review\nPosted on January 20, 2026\n2 min readLast updated: January 20, 2026\nUK stocks dropped as Trump threatened tariffs over Greenland, impacting FTSE 100 and increasing market volatility. Precious metals rose as a safe haven.\nBy Tharuniyaa and Lakshmi\nJan 20 (Reuters) - The UK's FTSE 100 logged its steepest one-day fall in close to two weeks on Tuesday as rising uncertainty over U.S. President Donald Trump's threat of tariffs related to Greenland soured investor sentiment.\nThe blue‑chip FTSE 100 closed down 0.72%, after touching its lowest level in over a week. The domestically focused mid‑cap index fell 0.6%.\nTrump threatened to impose an additional 10% tariffs on imports from eight European countries, including Britain, from February 1 unless the U.S. is allowed to buy Greenland, a Danish territory, heightening volatility across global markets.\n\"Geopolitical tensions have dented sentiment and cooled early-year exuberance, but they haven't fundamentally altered the global growth or earnings outlook,” said Laura Cooper, senior macro strategist at Nuveen.\nEurope is more vulnerable to higher tariffs but defence and infrastructure spending should soften the blow, creating selective opportunities in European banks, Cooper added.\nIn London, pharmaceutical stocks fell 1.6%. AstraZeneca's 2.6% drop, after the Anglo-Swedish drugmaker said it would delist its American Depositary Shares and debt securities from Nasdaq, made it the biggest drag to the benchmark index.\nLife insurers lost the most, down 1.9%.\nConversely, precious metals miners rose 1.8% as gold vaulted past $4,700 an ounce for the first time, while silver hovered near record highs as Trump's tariff threats sparked a flight to safe‑haven assets. [GOL/]\nMiners have been among the biggest drivers of the FTSE 100's positive start to 2026, driving it to record highs.\nThis week at the World Economic Forum in Switzerland's Davos, world leaders, policymakers and corporate executives are scheduled to deliver speeches that could steer market sentiment.\nBack home, data showed Britain's jobs market weakened ahead of the government's November budget announcement and wage growth slowed, potentially easing the Bank of England's worries about persistent inflation pressures.\nInforma rose 4.5% to top the FTSE 100 after the events organiser launched a £200 million ($269.6 million) share buyback and forecast 6% underlying revenue growth for 2026. The media index led gains, up 2.1%.\n(Reporting by Tharuniyaa Lakshmi in Bengaluru; editing by Shinjini Ganguli and Mark Heinrich)\nThe FTSE 100 is an index that represents the 100 largest companies listed on the London Stock Exchange, reflecting the performance of the UK stock market.\nMarket volatility refers to the degree of variation in trading prices over time, indicating the level of uncertainty or risk in the market.\nA share buyback is when a company purchases its own shares from the marketplace, reducing the number of outstanding shares and often increasing the share price.\nWage growth refers to the increase in the average pay of workers over time, which can impact consumer spending and economic growth.\nExplore more articles in the Finance category"
            },
            {
                "title": "Danish pension fund sells off US debt amid Trump-Greenland row – latest updates - The Telegraph",
                "source": "The Telegraph",
                "url": "https://www.telegraph.co.uk/business/2026/01/20/trump-tariffs-greenland-uk-us-europe-ftse-100-markets/",
                "body": "A Danish pension fund has said it plans to divest its holdings of US government debt in response to Donald Trump’s threats against Greenland.\nAkademikerPension, which manages around $25bn in savings for teachers and academics, said it would sell off around $100m worth of US Treasuries by the end of this month.\nIts chief investment officer Anders Schelde announced the move with a swipe against the health of the US economy as president Trump ramps up a global trade war.\n“The US is basically not a good credit and long-term the US government finances are not sustainable,” he told Bloomberg.\nStock markets in the UK, Europe and on Wall Street have plunged today as tensions were ratcheted up in various meetings at the World Economic Forum in Davos.\nDanish prime minister Mette Frederiksen said she will not abandon Greenland while Gavin Newsom, the governor of California, told Britain and Europe to “fight fire with fire” if they hoped to negotiate successfully with Mr Trump.\nUS treasury secretary Scott Bessent urged Europe not to retaliate to president Trump’s plan to impose extra 10pc tariffs from February until a deal on Greenland is reached, rising to 25pc from June.\nHe told the World Economic Forum in Davos: “I would say this is the same kind of hysteria that we heard on April 2. There was a panic. And what I’m urging everyone here to do is sit back, take a deep breath, and let things play out.\n“As I said, the worst thing countries can do is escalate against the United States.”\nRachel Reeves, the chancellor, said families and businesses should keep “cool heads” over the prospect of higher US tariffs."
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "427.250",
            "open": "24,932.530",
            "close": "24,596.530",
            "high": "24,943.030",
            "low": "24,515.780"
        },
        "market_summary": "### GER40 Market Briefing\n\n* **Key Drivers:** Renewed interest in German large caps, with the Financial Services sector showing **1.56%** YTD performance and **4.98%** 6-month gain.\n* **Price Action:** The iShares Core DAX UCITS ETF (DE) is trading at **€4.98**, below its **50-day average** of **€6.02** and **200-day average** of **€5.66**, indicating recent underperformance.\n* **Technical Outlook:** Immediate support is near **€4.92**, with resistance toward the **200-day average** of **€5.66**; a break above **€5.66** on sustained volume could confirm a trend reversal.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "Volume spike pre-market: EXIC.F iShares Core DAX UCITS ETF DE XETRA 21 Jan 2026: €4.98 signal - Meyka",
                "source": "Meyka",
                "url": "https://meyka.com/blog/volume-spike-pre-market-exicf-ishares-core-dax-ucits-etf-de-xetra-21-jan-2026-498-signal-2101/",
                "body": "Volume spike pre-market: EXIC.F iShares Core DAX UCITS ETF DE XETRA 21 Jan 2026: €4.98 signal\nA large pre-market volume spike pushed EXIC.F stock higher on XETRA ahead of open on 21 Jan 2026. The iShares Core DAX UCITS ETF (DE) traded at €4.98, up 1.31%, with 50,000.00 shares reported and relative volume near 310.56. Traders should note price sits below the 50-day average of €6.02, yet liquidity surged, making short-term entries and exits easier. We examine what the spike means for liquidity, sector context in Germany, Meyka AI’s grade, and model forecasts for investors and intraday traders.\nPre-market volume spike and price action for EXIC.F stock\nEXIC.F stock is showing a clear liquidity event in pre-market trading on XETRA. Price opened at €4.92 and hit a pre-market high of €4.98, a €0.06 move from yesterday’s close of €4.91. Volume of 50,000.00 versus an average daily volume of 161.00 indicates a 310.56x jump in activity. For traders, that magnitude of relative volume signals active order flow and tighter fills in the near term.\nLiquidity, trading metrics, and what the spike means\nThe spike improves execution but increases volatility risk for EXIC.F stock. Market cap stands at EUR 6,578,518,013.00, and the ETF shows a dividend yield near 2.40% with dividend per share €0.12. The ETF’s PE is shown as 14.70 based on provided metrics. High relative volume trading windows often precede directional moves, so traders should watch intraday VWAP and orderbook depth on XETRA.\nFundamental snapshot and sector context for EXIC.F\niShares Core DAX UCITS ETF (DE) tracks the top 30 German companies. EXIC.F stock sits in Financial Services and Asset Management on XETRA in Germany. The Financial Services sector has modest YTD performance near 1.56% and a 6-month gain around 4.98%, which helps explain renewed interest in German large caps. The ETF’s price is below its 50-day average €6.02 and 200-day average €5.66, suggesting recent underperformance versus longer-term trend.\nMeyka AI rates EXIC.F with a score out of 100 and technical outlook\nMeyka AI rates EXIC.F with a score out of 100: 63.62 | Grade: B | Suggestion: HOLD. This grade factors in S&P 500 benchmark comparison, sector performance, financial growth, key metrics, and analyst consensus. Technically, the ETF shows short-term support near €4.92 and resistance toward the 200-day average €5.66. For traders using the volume spike strategy, a break above €5.66 on sustained volume would confirm a trend reversal.\nPrice targets, Meyka AI forecast and implied upside\nMeyka AI’s forecast model projects a 1-year target of €10.18, a 3-year target of €12.99, and a 5-year target of €14.78. Compared with the current price of €4.98, the 1-year projection implies an upside of about 104.54%. Forecasts are model-based projections and not guarantees. We present conservative and active trader scenarios: a near-term technical target at €5.66 (200-day) and a longer-term target range €10.18–€14.78 based on model outputs.\nRisks, catalysts, and what to watch next for EXIC.F\nKey risks for EXIC.F stock include weaker German equity performance, DAX sector rotations, and lower dividend distributions. Catalysts that could extend today’s volume spike include macro data from Germany, ECB commentary, and DAX rebalancing news. Watch: intraday volume profile, VWAP, and whether price can clear the €5.66 level on continued above-average volume.\nFinal Thoughts\nThe pre-market volume spike in EXIC.F stock on XETRA signals renewed trader attention ahead of the European session. With price at €4.98, volume at 50,000.00 and relative volume 310.56, the move improves execution for active traders but raises short-term volatility. Meyka AI rates EXIC.F with a score of 63.62 (Grade B, Suggestion: HOLD), reflecting sector performance and key metrics. Meyka AI’s forecast model projects €10.18 in one year, implying approximately 104.54% upside versus today’s price; this remains a model projection and not a guarantee. For conservative "
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "341.630",
            "open": "25,243.980",
            "close": "24,993.400",
            "high": "25,288.860",
            "low": "24,947.230"
        },
        "market_summary": "### NDX100 Market Briefing\n\n* **Key Drivers:** The NDX100 has reached new highs, driven by strong earnings reports from companies like Alphabet, with **$96.43 million** in revenue and **$2.31** EPS, beating expectations. However, Tesla's quarterly sales decline and **6%** drop in premarket trading have introduced some volatility.\n* **Price Action:** The NDX100 has broken above the **23,394** level, showing **bullish momentum**. The index is expected to continue its upward trend, with support near the **50-day moving average**.\n* **Technical Outlook:** Immediate resistance is near the **all-time high** of **23,394**, with support at the **23,000** level. The ** Relative Strength Index (RSI)** indicates a potential overbought condition, which may lead to a correction.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Nasdaq Composite Live: All-Time Highs With Earnings Season Heating Up - AOL.com",
                "source": "AOL.com",
                "url": "https://www.aol.com/nasdaq-composite-live-time-highs-132101235.html",
                "body": "Nasdaq Composite Live: All-Time Highs With Earnings Season Heating Up\nThis article will be updated throughout the day, so check back often for more daily updates.\nThe tech-heavy NASDAQ notched a new high this morning, just above 23,394 on earnings.\nIn fact, just last night, Alphabet (NASDAQ: GOOG) reported numbers that beat expectations on both revenue and earnings.\nRevenue of $96.43 million was above expectations of $94 billion. EPS of $2.31 was also above estimates calling for $2.18 a share. YouTube ad revenue soared to $9.8 billion, beating estimates of $9.56 million. Google Cloud revenue of $13.62 billion beat estimates for $13.11 billion.\nPlus, the company is planning to spend more on artificial intelligence. In February, it planned to invest $75 in capex for AI. But that was increased last night to $85 billion thanks to growing demand for Cloud products and services.\nUnfortunately, Tesla made a mess.\nDown about 6%, or $21 a share in premarket, Tesla (NASDAQ: TSLA) posted its worst quarterly sales decline in years. Revenue dropped 12% to $22.5 billion from $25.5 billion, with analysts looking for $$22.74 billion. EPS of 40 cents also came in below estimates of 43 cents. Not helping, Musk did mention the company could have a rough few quarters ahead as a result of expiring federal electric vehicle tax credits.\nAnalysts are a bit mixed with responses.\nWells Fargo sees further downside, dropping their price target to $120 a share. The firm is also cautious on robotaxis and the Optimus humanoid, fearing that both could take longer than expected. However, Goldman Sachs raised its 12-month price target to $300 from $285. The firm expects Tesla’s revenue growth and profits to improve in 2026\nAdvertisement\nPresident Trump and Chairman Jerome Powell are on deck, too.\nFor the first time in nearly two decades, a president will visit the Federal Reserve.\n“American presidents have traditionally respected the independence of the central bank, which is insulated both in law and in practice from the political whims of elected officials,” reported CNBC. “Trump’s visit is a remarkable symbolic move on that independence, bringing his drumbeat of criticism over Powell’s refusal to lower interest rates right to the chairman’s doorstep.”\nIt’ll be interesting to see what happens.\nPresident Trump is expected to visit the Federal Reserve at 4 pm EST.\nIf You have $500,000 Saved, Retirement Could Be Closer Than You Think (sponsor)\nRetirement can be daunting, but it doesn’t need to be.\nImagine having an expert in your corner to help you with your financial goals. Someone to help you determine if you’re ahead, behind, or right on track. With SmartAsset, that’s not just a dream—it’s reality. This free tool connects you with pre-screened financial advisors who work in your best interests. It’s quick, it’s easy, so take the leap today and start planning smarter!\nDon’t waste another minute; get started right here and help your retirement dreams become a retirement reality. (sponsor)\nThe post Nasdaq Composite Live: All-Time Highs With Earnings Season Heating Up appeared first on 24/7 Wall St.."
            },
            {
                "title": "Investors Can Find Comfort In Simply Good Foods' (NASDAQ:SMPL) Earnings Quality - simplywall.st",
                "source": "simplywall.st",
                "url": "https://simplywall.st/stocks/us/food-beverage-tobacco/nasdaq-smpl/simply-good-foods/news/investors-can-find-comfort-in-simply-good-foods-nasdaqsmpl-e",
                "body": "- United States\n- /\n- Food\n- /\n- NasdaqCM:SMPL\nInvestors Can Find Comfort In Simply Good Foods' (NASDAQ:SMPL) Earnings Quality\nThe market was pleased with the recent earnings report from The Simply Good Foods Company (NASDAQ:SMPL), despite the profit numbers being soft. However, we think the company is showing some signs that things are more promising than they seem.\nThe Impact Of Unusual Items On Profit\nImportantly, our data indicates that Simply Good Foods' profit was reduced by US$84m, due to unusual items, over the last year. It's never great to see unusual items costing the company profits, but on the upside, things might improve sooner rather than later. When we analysed the vast majority of listed companies worldwide, we found that significant unusual items are often not repeated. And that's hardly a surprise given these line items are considered unusual. If Simply Good Foods doesn't see those unusual expenses repeat, then all else being equal we'd expect its profit to increase over the coming year.\nThat might leave you wondering what analysts are forecasting in terms of future profitability. Luckily, you can click here to see an interactive graph depicting future profitability, based on their estimates.\nOur Take On Simply Good Foods' Profit Performance\nBecause unusual items detracted from Simply Good Foods' earnings over the last year, you could argue that we can expect an improved result in the current quarter. Because of this, we think Simply Good Foods' earnings potential is at least as good as it seems, and maybe even better! On the other hand, its EPS actually shrunk in the last twelve months. The goal of this article has been to assess how well we can rely on the statutory earnings to reflect the company's potential, but there is plenty more to consider. If you'd like to know more about Simply Good Foods as a business, it's important to be aware of any risks it's facing. In terms of investment risks, we've identified 2 warning signs with Simply Good Foods, and understanding these should be part of your investment process.\nToday we've zoomed in on a single data point to better understand the nature of Simply Good Foods' profit. But there is always more to discover if you are capable of focussing your mind on minutiae. Some people consider a high return on equity to be a good sign of a quality business. So you may wish to see this free collection of companies boasting high return on equity, or this list of stocks with high insider ownership.\nNew: Manage All Your Stock Portfolios in One Place\nWe've created the ultimate portfolio companion for stock investors, and it's free.\n• Connect an unlimited number of Portfolios and see your total in one currency\n• Be alerted to new Warning Signs or Risks via email or mobile\n• Track the Fair Value of your stocks\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nAbout NasdaqCM:SMPL\nSimply Good Foods\nA consumer-packaged food and beverage company, engages in the development, marketing, and sale of snacks and meal replacements, and other products in North America and internationally.\nExcellent balance sheet and good value."
            },
            {
                "title": "Hancock Whitney (NASDAQ:HWC) Issues Earnings Results, Beats Estimates By $0.02 EPS - MarketBeat",
                "source": "MarketBeat",
                "url": "https://www.marketbeat.com/instant-alerts/hancock-whitney-nasdaqhwc-issues-earnings-results-beats-estimates-by-002-eps-2026-01-20/",
                "body": "Hancock Whitney (NASDAQ:HWC - Get Free Report ) released its earnings results on Tuesday. The company reported $1.49 earnings per share for the quarter, topping analysts' consensus estimates of $1.48 by $0.01, Zacks reports. Hancock Whitney had a return on equity of 11.29% and a net margin of 23.99%.The company had revenue of $81.55 million during the quarter, compared to the consensus estimate of $391.63 million. During the same quarter in the previous year, the company posted $1.40 EPS.\nHere are the key takeaways from Hancock Whitney's conference call:\nGet Hancock Whitney alerts:\nSign Up\nBond portfolio restructuring: completed in early January and the company expects it to add about 7 bps to NIM , ~$24 million to NII and roughly $0.23 of EPS annually, improving near-term earnings power.\nAccelerating organic growth: Hancock Whitney plans to hire up to 50 revenue-generating associates in 2026 to support mid-single-digit loan growth and low-single-digit deposit growth, with emphasis on full-relationship business bankers.\nSolid operating results and constructive guidance: Q4 EPS was $1.49 with ROA 1.41% and efficiency under 55%, and 2026 guidance calls for NII up 5%–6% , PP&R up 4.5%–5.5%, and an efficiency ratio around 54%–55%.\nCredit, reserves and capital posture: criticized loans and non-accruals declined, allowance is ~1.43% of loans with Q4 net charge-offs at 22 bps and an expected 2026 NCO range of 15–25 bps; the board reauthorized a 5% buyback while CET1 is 13.66% and TCE just over 10%.\nHancock Whitney Stock Performance Hancock Whitney stock opened at $67.60 on Wednesday. Hancock Whitney has a fifty-two week low of $43.90 and a fifty-two week high of $68.84. The stock's 50 day simple moving average is $63.82 and its two-hundred day simple moving average is $61.66. The company has a debt-to-equity ratio of 0.05, a quick ratio of 0.81 and a current ratio of 0.81. The stock has a market cap of $5.65 billion, a price-to-earnings ratio of 12.09 and a beta of 1.05.\nHancock Whitney Announces Dividend The business also recently disclosed a quarterly dividend, which was paid on Monday, December 15th. Shareholders of record on Friday, December 5th were issued a $0.45 dividend. The ex-dividend date was Friday, December 5th. This represents a $1.80 annualized dividend and a yield of 2.7%. Hancock Whitney's dividend payout ratio (DPR) is 32.20%.\nInstitutional Trading of Hancock Whitney A number of hedge funds have recently modified their holdings of the business. IFP Advisors Inc lifted its holdings in shares of Hancock Whitney by 67.6% during the third quarter. IFP Advisors Inc now owns 627 shares of the company's stock valued at $39,000 after purchasing an additional 253 shares during the last quarter. Caitong International Asset Management Co. Ltd purchased a new position in Hancock Whitney during the third quarter valued at $45,000. Amundi purchased a new position in Hancock Whitney during the first quarter valued at $50,000. CIBC Private Wealth Group LLC boosted its holdings in Hancock Whitney by 84,400.0% in the third quarter. CIBC Private Wealth Group LLC now owns 845 shares of the company's stock worth $53,000 after acquiring an additional 844 shares in the last quarter. Finally, Quantbot Technologies LP purchased a new stake in shares of Hancock Whitney in the second quarter worth $58,000. Institutional investors own 81.22% of the company's stock.\nAnalysts Set New Price Targets A number of research analysts have recently issued reports on the company. Keefe, Bruyette & Woods raised their price objective on Hancock Whitney from $64.00 to $65.00 and gave the company a \"market perform\" rating in a research note on Tuesday, November 11th. Weiss Ratings reaffirmed a \"buy (b)\" rating on shares of Hancock Whitney in a research note on Monday, December 29th. Citigroup boosted their price objective on Hancock Whitney from $71.00 to $76.00 and gave the company a \"buy\" rating in a research report on Tuesday, December 30th. Barclays init"
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "93.830",
            "open": "6,878.810",
            "close": "6,802.970",
            "high": "6,882.310",
            "low": "6,788.480"
        },
        "market_summary": "### SPX500 Market Briefing\n\n* **Key Drivers:** No relevant market drivers found in the provided articles.\n* **Price Action:** No relevant price action information found in the provided articles.\n* **Technical Outlook:** No relevant technical outlook information found in the provided articles.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "Obituary for BRIANNE S ATKINS - rhodenmemorialhome.com",
                "source": "rhodenmemorialhome.com",
                "url": "https://www.rhodenmemorialhome.com/obituary/BRIANNE-ATKINS",
                "body": "We would like to offer our sincere support to anyone coping with grief. Enter\nyour email below for our complimentary daily grief messages. Messages run for up to one year and you\ncan stop at any time. Your email will not be used for any other purpose.\nOfficial Obituary of\nBRIANNE S ATKINS\nFebruary 15, 1993 ~ January 12, 2026 (age 32) 32 Years Old\n1 Tree, Flower, or Condolence has been shared with support of BRIANNE's family - View on Tribute Wall"
            },
            {
                "title": "Don’t let nature’s splendid rebirth fool you. L.A.’s fire zone is hurting, not healing - latimes.com",
                "source": "latimes.com",
                "url": "https://www.latimes.com/california/newsletter/2026-01-20/dont-let-natures-splendid-rebirth-fool-you-l-a-s-fire-zone-is-hurting-not-healing",
                "body": "Don’t let nature’s splendid rebirth fool you. L.A.’s fire zone is hurting, not healing\nYour morning catch-up: L.A.’s fire zone is far from healed, the battle over California’s billionaire tax and more big stories.\n- Share via\nMy friend and I (but mostly me) were polishing off a piece of Basque cheesecake, scanning the view of the Los Angeles basin from atop Mariposa Avenue in Altadena.\nIt was one of those crisp, clear L.A. winter nights. Twinkling lights of the cityscape danced along a perfect horizontal line in the distance — except for one spot where the lights suddenly became vertical.\n“That’s downtown,” said my friend, who has lived and worked in Altadena for decades. “You used to not be able to see it from here.”\nBut fire wiped out many of the buildings along Mariposa Avenue, revealing a skyline view few knew existed.\nNature is back. Humans are not\nA year after the firestorm, nature has been doing what it always does: regenerate. Record rains in December turned many of the flattened lots where homes once stood into meadows. Scarred hillsides are coming back to life. The experience is surreal to an outsider. Residential streets where generations of people raised families now resemble serene country roads. It’s perfectly charming unless you know what was there before.\nNature’s physical erasure of the fires’ aftermath is on display in a slider of photos my colleague Terry Castleman published comparing satellite images of Pacific Palisades in January and December, the moonscape of brown and ash white replaced by a Scotland-like, vibrant green.\nBut that’s the view from space.\nThat night on Mariposa Avenue, it was not just the views that felt so unnerving. It was the silence. The sounds of the city have been so muted you can hear that four-cylinder Toyota Corolla engine grunt up the hill on Lake Avenue before even the headlights flash into view. You can drive down some of Altadena’s throughways — New York Drive, Altadena Drive — at night and not see another car for a minute at a time.\nThe mirage of all that greenery\nAnd that is what makes Mother Nature’s miracle this winter a mirage.\nWe cannot forget about the people who lost everything and for whom this winter of renewal might feel like just one more cruel turn.\nThe fire victims entered 2026 with deep uncertainty and many challenges:\n- Residents are quickly running out of insurance to pay for temporary housing.\n- While some rebuilding is underway, many still are uncertain about whether they will have enough money to make it happen.\n- The housing market in the two fire zones has been upended by outside investors snapping up lots. Some real estate experts said this trend could slow the rebuilding process.\n- The ability to rebuild for some might come down to the outcome of class-action litigation against entities they blame for the fires, notably Southern California Edison. But it’s far from clear when those cases will be resolved and how much individuals will get.\nThe manzanitas, sagebrushes and oaks may be thriving. But humans not so much.\n‘A band of trauma survivors’\nMy Basque cheesecake marked the end of a meal at Betsy, a fancy Italian restaurant that has become a beacon of hope and a gathering point for post-fire Altadena.\nIts building survived the fire, but the ghostly remains of a historic storefront that once housed a beloved hardware store next door are a reminder that much of Mariposa Avenue did not.\nTimes restaurant critic Bill Addison recently reviewed Betsy, quoting one of the servers as saying: “Yeah, we’re a band of trauma survivors here.” Addison’s interpretation of her comment speaks not just for a restaurant but for the community too.\n“She doesn’t say the words with bitterness,” he wrote. “Like this whole operation, she’s conveying realism, and chosen purpose, and possibility.”\nToday’s top stories\nWill UCLA be forced to stay at the Rose Bowl?\n- Legal experts are split on how a lawsuit triggered by UCLA’s attempt to move football from the Rose Bowl to SoFi Stadi"
            },
            {
                "title": "Galen S. Asper Obituary January 18, 2026 - fogelsanger-brickerfuneralhome.com",
                "source": "fogelsanger-brickerfuneralhome.com",
                "url": "https://www.fogelsanger-brickerfuneralhome.com/obituaries/galen-asper",
                "body": "Galen S. Asper, 89, of Shippensburg, departed this life on the morning of Sunday, January 18, 2026.\nHe was born on July 21, 1936, in Shippensburg, a son of the late Hugh and Frances (Stoey) Asper.\nGalen farmed for the majority of his life and was also a long-time elected supervisor of Shippensburg Township for over twenty years. He was a member of the Hub City Club, a charter member of the Shippensburg Moose Lodge #2500, and loved horse racing, as he owned several race horses over the years.\nHe is survived by a daughter, Roxanne C. Asper of Shippensburg; a son, Wade L. Asper and wife Linda of Shippensburg; three grandchildren; two great grandsons; a brother, Glenn Asper of Raystown; and several nieces and nephews.\nIn addition to his parents and wife of over sixty years, Jeanette Ann (Yost) Asper, Galen was preceded in death by a daughter, Rosalie A. Asper; and a brother, Kenneth Asper.\nA celebration of Galen’s life will be held from 12:00 p.m. until 2:00 p.m., on Saturday, March 7, 2026, at the Shippensburg Moose Lodge #2500 at 32 Walnut Bottom Road, Shippensburg, PA 17257.\nIn lieu of flowers, memorial contributions may be made to Moose Charities at 155 North International Drive, Moosehart, IL 60539.\nLoyal Order of Moose #2500\nVisits: 1487\nThis site is protected by reCAPTCHA and the\nGoogle Privacy Policy and Terms of Service apply.\nService map data © OpenStreetMap contributors"
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "1,547.440",
            "open": "53,470.240",
            "close": "52,109.350",
            "high": "53,517.740",
            "low": "51,970.300"
        },
        "market_summary": "### JPN225 Market Briefing\n\n* **Key Drivers:** Political uncertainty due to the upcoming election and **Bank of Japan (BOJ)** decision, coupled with concerns over **fiscal policy** and **inflation**, are driving market volatility.\n* **Price Action:** The **Nikkei 225** has fallen for a fifth day, slipping **0.5%**, while the **Topix** fell **1.1%**, indicating **bearish** momentum.\n* **Technical Outlook:** Immediate support for the **USDJPY** is around **157.30**, with resistance at **159.45**. The **40-year Japanese government bond yield** has surged above **4%** for the first time, reflecting rising **yields** and **fiscal worries**.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "Japanese markets shudder ahead of BOJ decision and upcoming election - Capital.com",
                "source": "Capital.com",
                "url": "https://capital.com/en-gb/analysis/japanese-markets-shudder-ahead-of-boj-decision-and-upcoming-election",
                "body": "Japanese markets shudder ahead of BOJ decision and upcoming election\nA looming election and a BOJ decision has rattled Japanese financial marketsBank of Japan monetary policy and Japanese political uncertainty ripple through Japanese and global financial markets.\nInterest rate and fiscal policy uncertainty lifts volatility\nJapanese markets have experienced a triple whammy this week. Rising geopolitical and trade tensions between the US and European Union has shaken market sentiment globally. Meanwhile, a Bank of Japan decision on the 23rd of January looms and the Japanese parliament will also be dissolved on the same day heading into a snap election next month. The dynamic is stoking uncertainty about monetary and fiscal policy settings and reverberating through stocks, bonds and the Japanese Yen.\nThe political uncertainty in Japan is currently the largest risk. Japan’s Prime Minister Sanae Takaichi, riding a wave of popularity, has called an election to secure a strong public mandate for her fiscal and defence strategies. The policies would entail significant deficit spending, adding to Japan’s hefty public debt burden and putting upward pressure on inflation at a time where price growth remains above the Bank of Japan’s target.\nTo this point, the Bank of Japan has been permissive of above target inflation. Although it has lifted rates, by its own admission, it has kept policy in accommodative territory. It has also avoided taking a more hawkish stance on policy even as upside risks to prices from loose fiscal policy build. Recent communications suggest that the central bank is trying to guide the market to an earlier than expected hike, potentially in April. For now, the markets are baking-in the next move won’t come until July.\nThis week’s Bank of Japan meeting is all but certain to see policy kept unchanged. However, the markets will be focussing on the guidance regarding future policy and an updated set of economic forecasts. There’s a building expectation that the BOJ will revise higher growth and inflation projections, a move that would help build the case for sooner rate hikes.\nNikkei, bonds and Yen fall as policy uncertainty increases\nHeightened political uncertainty compounded by the prospect of even greater deficit spending in Japan and accommodative Bank of Japan policy has rattled Japanese markets. The greater inflationary risks stemming from more fiscal stimulus and low interest rates coupled with the subsequent higher JGB issuance to fund the spending has pushed down bond prices and the Yen. Meanwhile, the Nikkei, which had benefitted from the prospect of very loose policy settings, has fallen amid the political uncertainty, higher bond yields and rising global trade tensions.\nThe depreciation in the Yen is increasing speculation about possible intervention in the currency markets by the Ministry of Finance. The urgency has diminished with a broad-based weakening of the US Dollar following tariff threats made by the US against some European economies. The uptrend for the USDJPY remains intact, however. Short-term resistance appears to be around 159.45, while a confluence of support levels has emerged around 157.30. Short-term upward sloping trendline support will also be closely watched by traders to determine the pair’s directional bias in the immediate future.\n(Source: Trading View)\n(Past performance is not a reliable indicator of future results)"
            },
            {
                "title": "Japan Stocks Slide As Election Call And BoJ Decision Near - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/japan-stocks-slide-as-election-call-and-boj-decision-near",
                "body": "The Nikkei extended its longest losing streak in a year as political and policy uncertainty, plus easing JGB yields after a bond scare, kept investors cautious.\n13 minutes ago • 2 mins\nJoin the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nJapanese shares fell for a fifth day as investors waited for Friday’s one-two punch – a snap election call and a Bank of Japan policy decision – while keeping an eye on jumpy government bond yields.\nWhat does this mean?\nThe Nikkei 225 slipped 0.5% and the broader Topix fell 1.1%, as politics and monetary policy collided. Prime Minister Sanae Takaichi is expected to dissolve parliament to trigger an election, and the BoJ meets the same day, so investors are hesitant to take big bets. Bonds have been the pressure point: a recent selloff pushed super-long Japanese government bond yields to records amid fiscal worries after Takaichi floated scrapping sales taxes..\non groceries, which drew comparisons to the UK’s 2022 gilt shock. Yields cooled on the day, easing fears of balance-sheet hits, but weaker US stocks and fresh US tariff talk kept risk appetite muted.\nWhy should I care?\nFor markets: Yields are rewriting the sector playbook.\nWhen long-term yields swing, they hit Japan’s rate-sensitive heavyweights first. Financials led the drop, with banks, brokers, and insurers sliding as cooler yields can squeeze lending margins – even if they also reduce unrealized losses on bond portfolios. Any hint of bond-market support, like tweaks to issuance or buybacks, could steady sentiment, but it may not immediately lift sectors that depend on higher rates.\nThe bigger picture: Fiscal credibility is back in focus.\nJapan’s recent equity strength has leaned on the idea that policymakers can normalize rates without sparking a debt scare. The jump in super-long yields showed how quickly big tax-and-spending promises can force investors to demand more compensation to hold long-dated debt. Friday’s election launch and BoJ meeting will be a confidence test: markets want growth-friendly policy, but they also need reassurance that Japan won’t sacrifice bond-market stability to get it.\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies."
            },
            {
                "title": "Foreign players step in as Japan's investors shrink from ultralong JGBs - Nikkei Asia",
                "source": "Nikkei Asia",
                "url": "https://asia.nikkei.com/business/markets/bonds/foreign-players-step-in-as-japan-s-investors-shrink-from-ultralong-jgbs",
                "body": "BondsForeign players step in as Japan's investors shrink from ultralong JGBs\nOverseas buyers acquired majority of superlong bonds for 1st time amid rising yields\nThe auction of superlong bonds by Japan's Ministry of Finance on Jan. 20 drew weak demand from bidders. (Photo by Kei Higuchi)\nGENKI IKUTA\nJanuary 21, 2026 03:45 JST\nTOKYO -- The yield on 40-year Japanese government bonds surged above 4% for the first time on Tuesday amid weak domestic demand for the government securities, a trend that has foreign buyers playing an increasingly prominent role in the country's bond market."
            }
        ]
    }
]