[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "99.810",
            "open": "5,027.410",
            "close": "5,084.690",
            "high": "5,119.440",
            "low": "5,019.630"
        },
        "market_summary": "### Gold (XAU/USD) Market Briefing  \n* **Key Drivers:** Decoupling from interest rates, strong central bank demand, geopolitical uncertainty.  \n* **Price Action:** Holding above **$5,000**, up **17%** YTD.  \n* **Technical Outlook:** Mild bullish bias, resistance near **$5,117**, support at **$5,000**.  \n---\n**Overall Sentiment:** Positive 📈  \n\n**Key Developments:**  \n- **Correlation Breakdown:** Gold’s inverse relationship with real rates has collapsed, signaling heightened investor anxiety over inflation and traditional asset returns.  \n- **Jobs Data Impact:** Strong NFP (130K) and wage growth tempered Fed rate-cut expectations, but gold remains resilient above **$5,000**.  \n- **Geopolitical Tailwinds:** Persistent global risks and central bank buying continue to underpin demand.  \n- **Technical Setup:** Price holds above **$5,000**, RSI bullish at **61**, with narrowing Bollinger Bands suggesting consolidation before the next move.  \n\n**Near-Term Catalysts:**  \n- **CPI Report (Friday):** Inflation data could reignite rate-cut speculation.  \n- **Fed Policy:** Markets price in **2 cuts in 2026**, but Trump’s pressure for lower rates adds uncertainty.  \n\n**Risks:**  \n- Stronger-than-expected US data could strengthen the dollar and cap gold’s upside.  \n- Failure to break **$5,117** resistance may trigger profit-taking.",
        "source_articles": [
            {
                "title": "Wall Street top analyst sees decaying relationship between gold and interest rates - Fortune",
                "source": "Fortune",
                "url": "https://fortune.com/2026/02/11/wall-street-top-analyst-gold-prices-record-interest-rates-inflation/",
                "body": "Apollo chief economist Torsten Slok has found a head-scratcher buried in the financial data: For years, the price of gold and real interest rates have been inversely correlated; as interest rates rise, the price of gold goes down. Now, however, the relationship between the two variables is completely scrambled with no discernable pattern, and Slok sees it as yet another sign investors are getting jittery about the state of the economy.\n“Much to the frustration of the quant community, when the Fed started raising interest rates in 2022, the strong correlation between gold and real rates broke down,” Slok wrote in a blog post on Monday.\nGold has cemented itself as a safe-haven asset, viewed as a life preserver in a time of choppy market waters. Since the initial rate hike in 2022, the price of gold has skyrocketed, increasing by more than 150% to hit a record-breaking $5,000 per troy ounce last month. Investors like Bridgewater Associates founder Ray Dalio have advocated for 15% of one’s portfolio to be allocated toward gold amid crescendoing geopolitical tensions and mounting U.S. debt. But gold’s now unpredictable relationship with a once-reliable correlate is yet another sign investors are bracing themselves in case things go sideways.\n“It tells you that investors are anxious about the level of returns they get in traditional assets,” Slok told Fortune. “And that’s why investors are beginning to look at alternative assets.”\nCiting data from Bloomberg and Macrobond, Slok notes that prior to early 2022 when the Fed began hiking rates to curb post-pandemic inflation that peaked around 9%, the price of gold and interest rates were inversely correlated. But after the Fed’s 2022 hikes, this was no longer the case. Instead of gold prices falling, which would follow the pattern of previous rate hikes, they instead remained resilient. As the Fed held rates steady, gold prices continued to climb.\nAccording to Slok, this broken-down relationship signals to the market that in times of elevated interest rates, investors have additional considerations when pricing future outcomes—particularly for gold—in part a result of inflation remaining stubbornly elevated since early 2021.\n“The bottom line is that new risks emerge when inflation is persistently above the Fed’s 2% target, which is where we continue to be today,” Slok said in his blog post.\nWhat caused the breakdown in the gold–interest rate relationship?\nGold is a unique asset, wrote Goldman Sachs analysts Lina Thomas and Daan Struyven in an August 2025 Gold Market Primer report. It is hard to mine, and its supply grows only a little each year, with nearly all of the gold ever extracted from the earth still in supply, trading hands, as opposed to being produced or destroyed, giving it its precious value.\n“Each year, more rock, more energy, more labor, and more capital are needed to produce the same ounce,” the analysts said. “This limited, slow-moving, price-inelastic supply is what has given gold its status as a store of value—what made gold … gold.”\nIn the past, gold’s inverse interaction with interest rates has resulted from the fact that the precious metal does not have yields and does not pay interest or dividends. When interest rates are high, gold becomes less appealing because of the increased opportunity costs of holding other assets like bonds. Conversely, demand for gold usually skyrockets when rates are cut, when holding assets that can produce cash flow are viewed as less advantageous.\nBut swelling inflation following the onset of the pandemic changed this relationship. In 2022, conventional 60/40 portfolios—made up of 60% equities and 40% bonds—took a hit as markets roiled, and inflation and rate hikes made bonds less of a hedge for stocks. Meanwhile, gold, typically a hedge against inflation owing to its inelastic value, soared.\nWhile inflation has receded, hovering around 2.7%, Slok said he believes its persistent elevation has created a new normal of gold having more a"
            },
            {
                "title": "Gold up over 1% as investors look past strong US jobs report, focus turns to inflation - Nation Thailand",
                "source": "Nation Thailand",
                "url": "https://www.nationthailand.com/news/world/40062427",
                "body": "Gold prices climbed more than 1% on Wednesday (February 11, 2026, US time), as sustained long-term investment demand helped bullion regain momentum after a brief pullback when markets digested stronger-than-expected US employment data.\nSpot gold rose 1.25% to $5,085.93 an ounce at 4.08pm in New York (4.08am Thursday in Bangkok), after earlier touching a session high of $5,118.47 before easing slightly. US gold futures for April delivery settled 1.6% higher at $5,112.60 an ounce.\nUS non-farm payrolls for January rose by a stronger-than-expected 130,000, while the unemployment rate fell to 4.3%, signalling continued labour-market strength. That could give the Federal Reserve room to keep interest rates unchanged as it monitors inflation.\n“One strong jobs report alone won’t shake the case for buying gold, which is seen as a long-term investment based on fundamentals,” said independent metals trader Tai Wong.\nHe added that since the sharp sell-off, gold has largely returned to a pattern of “higher highs and higher lows”, as investors remain confident amid debt concerns and a gradual shift away from US assets.\nGold suffered steep losses over two sessions on January 30 and February 2 after US President Donald Trump announced his preferred candidate for the next Fed chair. Even so, gold is still up more than 17% so far this year, following last year’s record rally, supported by heightened geopolitical and economic uncertainty and increased central-bank buying.\nUS data released on Tuesday showed retail sales were unexpectedly flat in December, which may indicate consumer spending and the economy are slowing as the new year begins.\nA Reuters poll suggested the Fed will keep rates unchanged until the end of Chair Jerome Powell’s term in May, before beginning cuts in June. Economists also warned that monetary policy under Kevin Warsh, expected to take over next, could become too accommodative.\nGold, which offers no yield, tends to rise during periods of geopolitical or economic uncertainty and when interest rates are low. Investors are now watching for the US Consumer Price Index (CPI) report due on Friday.\nOther precious metals\nMorning update (February 12, 2026)\nBloomberg reported that spot gold slipped 0.4% to $5,065.56 an ounce at 7.45am Singapore time. Silver fell 0.8% to $83.60, platinum dipped 1%, and palladium dropped 1.5%. The Bloomberg Dollar Spot Index was flat after ending the previous session down 0.1%."
            },
            {
                "title": "Gold remains supported above $5,000 after strong US jobs data - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gold-climbs-on-softer-us-dollar-ahead-of-nfp-202602111143",
                "body": "Gold remains supported above $5,000 after strong US jobs data\n- Gold steadies after rebounding from $5,018 following the US jobs data.\n- Strong NFP and firm wage growth temper near-term Fed interest rate-cut expectations.\n- Technically, XAU/USD holds a mild bullish technical bias above the $5,000 level.\nGold (XAU/USD) holds firm on Wednesday after coming under brief pressure following an upbeat US labour market report. At the time of writing, the metal trades near $5,070 after bouncing from an intraday low of $5,018.\nThe delayed January US Employment Situation Report showed a firmer-than-expected labour market. Nonfarm Payrolls (NFP) rose by 130K in January, beating market expectations of around 70K and coming in above December’s revised 48K increase. At the same time, the Unemployment Rate edged lower to 4.3% from 4.4%.\nOn the earnings side, Average Hourly Earnings increased by 0.4% MoM in January, accelerating from 0.1% in the prior month and exceeding the 0.3% market forecast, while the annual pace held steady at 3.7% YoY, also topping expectations of 3.6%.\nThe stronger US labour market report reduces the urgency for near-term Federal Reserve (Fed) interest rate cuts and may offer some support to the US Dollar in the near term, which could limit upside in the Bullion.\nHowever, any downside in Gold is likely to remain limited, as broader macro drivers, including persistent geopolitical and economic risks and still-strong central bank demand, continue to underpin the metal’s overall outlook.\nMarket movers: Trump renews rate-cut calls as Fed policy outlook stays in focus\n- US President Donald Trump reiterated his call for lower interest rates in an interview with Fox Business on Tuesday, saying the US should have “the lowest interest rates in the world,” and again criticized Jerome Powell, calling him “so bad” and saying interest rates should be cut by around two percentage points.\n- The US Dollar Index (DXY), which tracks the Greenback against a basket of six major currencies, rebounds above 97.00 after slipping to daily lows near 96.49.\n- On the monetary policy front, markets currently expect around two interest rate cuts from the Fed this year, with those expectations reinforced by recent soft economic data. Retail Sales were unchanged in December at 0.0% MoM, undershooting expectations for a 0.4% increase. Meanwhile, last week’s JOLTS survey showed job openings fell to 6.542 million, marking their weakest level since 2020.\n- Market pricing remains largely unchanged after the NFP release, with the CME FedWatch Tool showing a 49% probability for the first Fed rate cut in June.\n- In addition, comments from Fed officials on Monday were in focus. Cleveland Fed President Beth Hammack said policymakers “could be on hold for quite some time” and stressed that it is important to see inflation return to 2% before changing interest rates again. Meanwhile, Dallas Fed President Lorie Logan said it would take “further material cooling” in the labour market for additional rate cuts to be appropriate.\nTechnical analysis: XAU/USD remains supported above $5,000\nFrom a technical perspective, XAU/USD maintains a mild bullish bias, with buyers gradually gaining traction after successfully defending the $5,000 psychological level.\nOn the 4-hour chart, price hovers just below the upper Bollinger Band at $5,117.43, and a sustained break above this level would likely extend the current advance.\nThe Relative Strength Index (RSI), at 61, is rising and remains in bullish territory, pointing to improving momentum. On the downside, initial support is seen at the 20-period Simple Moving Average (SMA), which also marks the mid-Bollinger Band, around $5,019.75.\nThe Bollinger Bands are narrowing, signalling a contraction in volatility and a coiling phase. Trend strength remains weak, with the ADX at 10.56, suggesting that a sustained directional move would likely require a fresh catalyst, with the US Nonfarm Payrolls report in focus.\nFailure to clear the u"
            }
        ]
    },
    {
        "asset_name": "Silver",
        "symbol": "EIGHTCAP:XAGUSD",
        "status": "Success",
        "data": {
            "day_range": "5.451",
            "open": "80.853",
            "close": "84.256",
            "high": "86.262",
            "low": "80.811"
        },
        "market_summary": "### Silver (XAG/USD) Market Briefing\n* **Current Price:** $85.65/oz, **+3.77** from yesterday\n* **Key Drivers:** Industrial demand surge, inflation hedge\n* **Price Action:** Near **$90** resistance, **10-day ATR $12.50**\n* **Technical Outlook:** Support at **$70**, resistance at **$90**\n\n---\n**Overall Sentiment:** Mixed ⚖️  \n* **Bullish Factors:** Multi-year supply deficit, booming AI/EV/solar demand, ETF flows building\n* **Bearish Factors:** Industrial substitution risk at high prices, demand destruction risk, ETF flows below 2025 peaks\n\n**Risk Note:** Half of global demand is industrial—elevated prices could trigger substitution and reduce long-term consumption. Strategy and exit planning critical.",
        "source_articles": [
            {
                "title": "How higher silver prices could impact industrial demand - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/video/higher-silver-prices-could-impact-113005808.html",
                "body": "Gold prices (GC=F) are back above $5,000 per ounce this week as silver (SI=F) also looks to recover from the recent sell-off in metal commodities.\nBlue Line Futures chief market strategist Phil Streible comes on Market Domination Overtime to discuss silver's biggest headwinds and tailwinds right now.\nAlso catch Phil Streible's comments around his forecast for gold prices in 2026.\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime.\nSo we talked gold, Phil. I do want your take on silver because it's been making some some wild moves. What what do you see ahead there for silver in the near intermediate term?\nYeah.\nI mean, you look at the silver, the 10-day average true range, $12.50. So we that critical support's like $70. Um resistance, we're right up against this resistance that we saw before, and we could really open up the door for a move back into the 90s.\nI mean, they've got a multi-year supply deficit. They've got booming industrial demand. You've got the AI, the EVs, the solar. But one thing that people have to know is that it's important to know that half of the global silver demand is really driven by industrial use and those higher prices could have long-term negative effects on demand. So high elevated costs make like components in uh solar panels just less economical. So you have this substitution risk that occurs. So when these prices go vertical, it's really important to have a strategy and an exit strategy. I mean, you're going to reduce your demand for silver or for jewelry, for silverware. And if you look at the ETF flows, they have not eclipsed those 2025 levels. So there are a lot of things out there to just be aware of. I'm not bearish on silver, but you have to look at both sides of everything."
            },
            {
                "title": "Current price of silver as of Wednesday, February 11, 2026 - Fortune",
                "source": "Fortune",
                "url": "https://fortune.com/article/current-price-of-silver-2-11-2026/",
                "body": "As of 8:30 a.m. Eastern Time, silver traded at $85.65 per ounce. That’s up $3.77 from yesterday at this hour—and represents a gain of more than $53 over the past 12 months.\nCheck Out Our Daily Rates Reports\n- Discover the highest high-yield savings rates, up to 5% for February 11, 2026.\n- Discover the highest CD rates, up to 4.18% for February 11, 2026.\n- Discover the best personal loan rates for February 11, 2026.\n- Discover the current mortgage rates for February 11, 2026.\n- Discover current refi mortgage rates report for February 11, 2026.\n- Discover current ARM mortgage rates report for February 11, 2026.\n- Discover the current price of gold for February 11, 2026.\n- Discover the current price of silver for February 11, 2026.\n- Discover the current price of platinum for February 11, 2026.\nHistorical silver performance\nSilver is not typically a high-growth play. Historically, it trails other investment options, like stocks. From 1921 onward, silver has underperformed the S&P 500 by about 96%. That means an equal sum invested in silver and stocks back then would now be worth 96% less in silver holdings than stocks.\nInstead, silver is prized for its stability and its power to hedge against inflation. Often dubbed a “store of value,” it tends to sustain purchasing power when inflation climbs.\nCompared with gold, silver prices generally swing more sharply due to industrial demand—solar equipment, healthcare devices, and more—whereas gold is almost purely a safe-haven asset.\nWhat does “spot silver” mean?\n“Spot silver” refers to the live market rate at which silver can be bought or sold instantly. That said, real-world buyers usually pay a premium over spot for markups, shipping, insurance, and other fees.\nThe spot price serves as a gauge of immediate market demand: a higher spot price means stronger buying interest.\nWhat is “price spread” in silver trading?\nThe term “price spread” describes the difference between the buying (ask) and selling (bid) prices for silver. Here’s how those terms are defined.\n- Ask price: the cost to purchase silver.\n- Bid price: the amount you receive when you sell silver.\nA narrower spread indicates high demand.\nHow to invest in silver\nSilver exposure can be achieved through physical ownership or via silver-backed exchange-traded funds (ETFs). ETFs let you own a stake in a fund that holds silver, sparing you storage and insurance responsibilities.\nKey silver investment options include:\n- Bullion bars and rounds. These are sold by weight and purity\n- Government-minted silver coins. Iconic examples include American Silver Eagles and Canada’s Silver Maple Leafs, which often trade at premiums for their rarity and backing.\n- Silver jewelry. Custom pieces that fetch prices above equal-purity bullion.\n- Silver mining equities. Stocks in companies extracting silver, offering a sort of indirect investment in silver.\nOn exchanges, bullion and coins must meet a minimum 99.9% purity. Lower-purity silver generally falls into collectible or industrial categories. Our guide to the best silver IRA companies provide more information on how to shrewdly invest in silver (and other precious metals).\nIs it a good time to invest in silver?\nSilver has surged more than 150% over the past year, hitting its highest levels in over a decade.\nDeciding whether to invest now depends on your unique attitude toward the market. If inflation is top of mind, adding precious metals can be prudent. Or, if you foresee rising industrial applications—such as electronics—demand could potentially push prices even higher.\nCurrent precious metals prices as of 8:30 a.m. ET today\nGold remains the benchmark metal, while platinum and palladium exhibit volatility patterns similar to silver due to smaller market caps. Gold’s larger market makes it comparatively stable.\nThe takeaway\nWith economic volatility persistent in the current market, precious metals deserve at least a quick look. Silver’s recent performance has outshined gold’s, and many experts "
            },
            {
                "title": "Silver’s Next Move: Life-Changing Opportunity Or Brutal Bull Trap For XAG Bulls? - AD HOC NEWS",
                "source": "AD HOC NEWS",
                "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/silver-s-next-move-life-changing-opportunity-or-brutal-bull-trap-for/68574540",
                "body": "Silver’s Next Move: Life-Changing Opportunity Or Brutal Bull Trap For XAG Bulls?\n12.02.2026 - 07:26:00Get the professional edge. Since 2005, the 'trading-notes' market letter has delivered reliable trading recommendations – three times a week, directly to your inbox. 100% free. 100% expert knowledge. Simply enter your email address and never miss a top opportunity again. Sign up for free now\nVibe Check: Silver is moving with serious attitude right now. The recent action has been a mix of sharp rallies and nervous pullbacks, a classic tug-of-war between bulls betting on inflation, rate cuts, and industrial demand – and bears hiding behind a stubbornly strong dollar and shaky growth signals. Volatility is elevated, spreads are wider than usual, and every macro headline is hitting the chart like a hammer.\nWant to see what people are saying? Check out real opinions here:\n- Watch deep-dive YouTube breakdowns on the latest Silver price setups\n- Scroll through Instagram Silver stacking pics and vault flex trends\n- Binge viral TikTok clips hyping the next big Silver investment wave\nThe Story: Silver sits right at the crossroads of two powerful narratives: safe-haven precious metal and high-demand industrial input. That dual identity is exactly why the current market is so explosive.\nOn the macro side, traders are laser-focused on central bank policy. The Federal Reserve has spent the last years fighting inflation with aggressive rate hikes. Higher interest rates tend to weigh on precious metals because they make cash and bonds relatively more attractive than non-yielding assets like Silver. When real yields rise, metals usually cool off; when yields fall, metals often catch a serious bid.\nInflation data remains the big wild card. Every CPI and PCE release is a volatility event for Silver. When inflation numbers come in hotter than expected, the market instantly starts whispering about renewed stagflation risk and long-term currency debasement. That feeds into the classic “hard asset” narrative, where Silver and Gold become the go-to insurance policies. When inflation cools, the market starts betting on gentler Fed policy, which can also support Silver through lower real yields and a weaker dollar. Paradoxically, both scenarios can be bullish over different timeframes – the key is how the Fed reacts and how the dollar trades.\nThen there is the dollar. Silver is priced in USD, so a strong dollar tends to pressure Silver, while a weaker dollar often lights the fuse under the metal. Recently, the greenback has been swinging between bursts of strength on safe-haven flows and sudden dips when the market sniffs out future rate cuts. Every bounce in the USD can trigger hesitation in Silver, every wobble in the USD can give Silver bulls courage to press harder.\nAdd geopolitics to the mix: tensions, conflicts, and global uncertainty keep safe-haven demand on the table. But unlike pure safe-haven assets, Silver also answers to the real economy. That is where industrial demand – especially from the green-energy transition – comes roaring in.\nSolar panels, EVs, 5G, electronics, and even emerging grid technologies all eat Silver. The metal has exceptional electrical and thermal conductivity, which makes it almost irreplaceable in many high-tech applications. Forecasts for solar capacity expansion, EV penetration, and energy storage growth are not shrinking – they are ramping. That means structural demand from industry is an ongoing bullish backbone, even when macro jitters cause short-term wobbles.\nMeanwhile, on the street level, social sentiment around Silver refuses to die. The “Silver Squeeze” crowd, born out of the meme-stock era, still watches every dip as a potential generational stacking opportunity. “Poor Man’s Gold” is trending again across forums and social channels whenever there is fear about currency debasement, bank stability, or government debt. You have a new generation of retail traders who do not just buy ETFs – they literally sta"
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.705",
            "open": "69.465",
            "close": "70.048",
            "high": "71.100",
            "low": "69.395"
        },
        "market_summary": "### Spot Brent Crude Oil Market Briefing  \n* **Key Drivers:** Middle East tensions, Iran supply concerns, OPEC+ output decisions.  \n* **Price Action:** Brent settled at **$69.40**, up 0.9%, nearing **$70** resistance.  \n* **Technical Outlook:** Geopolitical risk premium supports prices; oversupply risks loom.  \n---  \n**Overall Sentiment:** Mixed ⚖️  \n\n**Geopolitical Impact:**  \n- US considering Iran tanker seizures; second carrier strike group preparing for deployment.  \n- Iran produces ~3.3 million bpd; potential supply disruptions could push Brent above **$70**.  \n\n**Supply Dynamics:**  \n- US crude inventories surged 8.5 million barrels (EIA), below API’s 13.4 million forecast.  \n- Saudi supply to China set to rise in March, adding to oversupply concerns.  \n\n**Demand Outlook:**  \n- Strong US jobs data supports transport fuel demand.  \n- Total products supplied up 2.4% YoY, but distillate demand down 3.2%.  \n\n**OPEC+ Strategy:**  \n- Oversupply estimated at 2 million bpd.  \n- Group may increase output if Brent exceeds **$70**.  \n\n**Market Focus:**  \n- IEA monthly report Thursday may confirm supply surplus warnings.  \n- Brent’s proximity to **$70** key for OPEC+ response.  \n\n**Key Levels:**  \n- Resistance: **$70**  \n- Support: **$68**",
        "source_articles": [
            {
                "title": "Oil Gains As Middle East Tensions Rise - Rigzone",
                "source": "Rigzone",
                "url": "https://www.rigzone.com/news/wire/oil_gains_as_middle_east_tensions_rise-11-feb-2026-182967-article/",
                "body": "Oil Gains As Middle East Tensions Rise\nOil gained as tensions in the Middle East outweighed concerns that there is a supply glut building in the market.\nWest Texas Intermediate rose to settle above $64 after the Wall Street Journal said that the Pentagon has told a second aircraft carrier strike group to prepare to deploy to the Middle East, citing three US officials. That follows an earlier report from the news agency that the US is considering seizing tankers with Iranian crude.\n\"Oil right now, and just the rest of the commodity complex, is really dominated by three things: geopolitics, trade and technology,\" Francisco Blanch, head of commodities research at Bank of America Global Research, said in a Bloomberg Television interview. \"Certainly, right now, geopolitics are the main driving force pushing oil close to the high end of this year's range.\"\nIran is the fourth-largest OPEC producer, pumping an estimated 3.3 million barrels a day in January, according to a Bloomberg survey. Crude and condensate shipments totaled about 1.63 million barrels a day last month, vessel-tracking data show.\nThe WSJ report meant crude erased earlier losses after President Donald Trump said in a social media post that he insisted that talks with Iran continue in a meeting with Israeli Prime Minister Benjamin Netanyahu. It was widely expected that Netanyahu would push for a broad curtailment of the Islamic Republic's military activities in the region.\nThe commodity has also received support earlier after strong US jobs data brightened the outlook for the world's largest economy.\n\"A resilient labor market underpins demand for transport fuels, petrochemicals and power generation, reducing downside risks to US consumption at a time when macro sentiment had turned cautious,\" said Claudio Galimberti, chief economist at Rystad Energy. The strong numbers are a sign that the demand picture is firming up, he added.\nCrude has advanced almost 13% this year as geopolitical tensions added a risk premium to prices, following a 20% slump in 2025 on concern supplies will outpace demand. After the US and Iran said initial talks last week to seek a deal on Iran's nuclear program were positive, traders fear failure to reach an agreement may lead to US strikes and potential supply interruptions.\nOil Prices\n- WTI for March delivery added 1.1% to settle at $64.63 a barrel in New York.\n- Brent for April settlement gained 0.9% to settle at $69.40 a barrel.\nTraders are also watching for the monthly report from the International Energy Agency on Thursday. The IEA has been warning that there will be a major crude supply surplus this year.\n\"The market is oversupplied and inventories are rising,\" Bank of America's Blanch said. There is oversupply of roughly 2 million barrels a day in the market as the OPEC+ producers group has added output, he said. Should geopolitics push Brent above $70 a barrel, he expects the group will add even more.\nMeanwhile, US crude stockpiles rose by 8.5 million barrels, the biggest surge since January 2025 in barrel terms, figures from the Energy Information Administration show, but that volume was lower than the expected gain of 13.4 million barrels flagged by an industry group a day prior. Overall price reaction was subdued with investors' attention fixed on Iran.\nWhat do you think? We’d love to hear from you, join the conversation on the\nRigzone Energy Network.\nThe Rigzone Energy Network is a new social experience created for you and all energy professionals to Speak Up about our industry, share knowledge, connect with peers and industry insiders and engage in a professional community that will empower your career in energy."
            },
            {
                "title": "Saudi crude oil supply to China set to rise in March, sources say - marketscreener.com",
                "source": "marketscreener.com",
                "url": "https://www.marketscreener.com/news/saudi-crude-oil-supply-to-china-set-to-rise-in-march-sources-say-ce7e5ad2db8dfe27",
                "body": "Access Denied\nYou don't have permission to access \"http://www.marketscreener.com/news/saudi-crude-oil-supply-to-china-set-to-rise-in-march-sources-say-ce7e5ad2db8dfe27\" on this server.\nReference #18.4006d217.1770878429.12b7c815\nhttps://errors.edgesuite.net/18.4006d217.1770878429.12b7c815"
            },
            {
                "title": "EIA US Crude Oil Inventories See Big Spike - Crude Oil Prices Today | OilPrice.com",
                "source": "Crude Oil Prices Today | OilPrice.com",
                "url": "https://oilprice.com/Energy/Crude-Oil/EIA-US-Crude-Oil-Inventories-See-Big-Spike.html",
                "body": "Crude oil inventories in the United States increased by 8.5 million barrels during the week ending February 6, according to new data from the U.S. Energy Information Administration (EIA) released on Wednesday. The increase brings commercial stockpiles to 428.8 million barrels according to government data, which is still 3% below the five-year average for this time of year.\nThe EIA’s data release follows API’s figures that were released a day earlier, which suggested that crude oil inventories rose by 13.4 million barrels.\nCrude prices were trading up on Wednesday morning. At 10:40 a.m. in New York, Brent was trading at $69.94 per barrel—up $1.14 (+1.66%) on the day. This is up more than $2 per barrel drop week over week. WTI was also trading up, by $1.09 per barrel (+1.70%) in morning trade at $65.05 per barrel.\nFor total motor gasoline, the EIA reported that inventories had increased by 1.2 million barrels after gaining 700,000 barrels in the week prior. The most recent figures showed average daily gasoline production increased to 9.1 million barrels. For middle distillates, inventories decreased by 2.7 million barrels with production increasing by 45,000 barrels daily to an average of 4.9 million barrels daily.\nTotal products supplied—a proxy for U.S. oil demand—stayed at 20.8 million barrels per day over the last four weeks, up 2.4% compared to the same period last year. Gasoline demand averaged 8.3 million barrels per day over the last four weeks, while the distillate four-week average supplied averaged 4.1 million barrels—down 3.2 percent year over year.\nBy Julianne Geiger for Oilprice.com\nMore Top Reads From Oilprice.com\n- Trump to Order Pentagon to Buy Coal Power for National Security\n- Siemens Boasts Record Gas Turbine Demand\n- Oil Prices Rise as U.S.-Iran Tensions Simmer"
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.685",
            "open": "64.198",
            "close": "64.928",
            "high": "65.858",
            "low": "64.173"
        },
        "market_summary": "### Spot WTI Crude Oil Market Briefing\n* **Key Drivers:** Global shale expansion, Saudi supply to China rising, OPEC demand growth at **1.4 mb/d** in 2026.\n* **Price Action:** WTI averaged **$60.26/b** in January, up **$2.39/b** m-o-m; Brent-WTI spread widened to **$4.47/b**.\n* **Technical Outlook:** Backwardation in futures curves; speculative net longs sharply increased.\n\n---\n**Overall Sentiment:** Bullish 📈",
        "source_articles": [
            {
                "title": "U.S. Shale Majors Take Fracking Global - Crude Oil Prices Today | OilPrice.com",
                "source": "Crude Oil Prices Today | OilPrice.com",
                "url": "https://oilprice.com/Energy/Crude-Oil/US-Shale-Majors-Take-Fracking-Global.html",
                "body": "U.S. shale oil and gas producers are buying international assets to maintain supply amid revisions of oil demand outlooks for the long term. From South America to the Middle East, frackers are going global.\nContinental Resources is one example. The company of fracking icon Harold Hamm has been expanding in Argentina’s Vaca Muerta shale play, widely considered the second-largest shale oil and gas deposit after the Permian. In the last three months, Continental made two asset acquisition deals in the Vaca Muerta, with its chief executive, Doug Lawler, calling it “one of the most compelling shale plays in the world.”\nBut Continental is not limiting itself to Argentina. The company also recently sealed two exploration deals in Turkey, one for the Diyarbakir Basin of Southeast Turkey and the Thrace Basin of northwest Turkey. Early evaluations suggest the ultimate recoverable reserves could reach 6 billion barrels of oil and 12-20 trillion cubic feet of gas in the Diyarbakir Basin, and 20-45 trillion cu ft in the Thrace Basin, Continental Resources said.\nMeanwhile, the former chief executive of Parsley Energy, Bryan Sheffield, is investing in Australian unconventional energy resources. The Financial Times reported last month that Sheffield—son of Pioneer Natural Resources’ Scott Sheffield—is the biggest shareholder in a company called Tamboran Resources. The company holds the drilling rights to acreage spanning close to 2 million acres in Australia’s Beetaloo basin. The basin is considered to be one of the biggest shale gas deposits globally, with Australia’s Northern Territory government reporting estimated resources of over 500 trillion cu ft in discovered and prospective gas.\nRelated: Libya Awards First Oil Blocks In 20 Years to Chevron and Europe’s Oil Majors\nEOG Resources, meanwhile, recently started drilling in a shale play in the United Arab Emirates. The UAE is not the first country that comes to mind when talking about unconventional energy resources, but it appears to also be as rich in them as it is in conventional oil and gas. The shale major is also planning to drill for oil in a shale play in Bahrain, with chief executive Ezra Yakob saying at an industry event last year, “We have captured abundant resource in both plays, and we’ve partnered with companies that we have very, very strong stakeholder alignment with.”\nAccording to a recent Wall Street Journal article on U.S. shale drillers’ expansion campaign abroad, the move has been prompted by peaking production at home. The article cited a Wood Mackenzie analyst as saying the global expansion was in fact, long overdue, stumped by the prolific resources of the Permian, which kept everyone’s attention focused on oil and gas resources at home.\n“One of the things that killed Global Shale 1.0 was the Permian,” Rob Clarke told the WSJ, adding that now the time has come for Global Shale 2.0, as well productivity in the Permian declines from 65 barrels per lateral foot in 2016 to 46 barrels per lateral foot last year. According to data from Enverus from 2024, well productivity in the Permian, the star shale play in the U.S. unconventional oil and gas industry, had declined by 15% since 2020.\nThe international expansion is also an expansion in fracking technology. U.S. companies doubtlessly have the most accumulated expertise in how to extract oil and gas from shale rock, and they are happy to apply this expertise in other parts of the world. Liberty Energy, for instance, provided modern stimulation equipment for the successful drilling of Tamboran Resources’ gas wells in the Beetaloo basin. EOG is sharing its own shale drilling expertise with Adnoc in the UAE. In Saudi Arabia, SLB is working on the kingdom’s shale gas fields as Riyadh eyes a substantial increase in gas output.\nThe global expansion of American shale majors is very likely to continue and intensify in the coming years. According to a senior researcher from Enverus, the big shale players have about 7.5 years of hi"
            },
            {
                "title": "Saudi crude oil supply to China set to rise in March, sources say - marketscreener.com",
                "source": "marketscreener.com",
                "url": "https://www.marketscreener.com/news/saudi-crude-oil-supply-to-china-set-to-rise-in-march-sources-say-ce7e5ad2db8dfe27",
                "body": "Access Denied\nYou don't have permission to access \"http://www.marketscreener.com/news/saudi-crude-oil-supply-to-china-set-to-rise-in-march-sources-say-ce7e5ad2db8dfe27\" on this server.\nReference #18.d3427568.1770878487.1aa0a1d7\nhttps://errors.edgesuite.net/18.d3427568.1770878487.1aa0a1d7"
            },
            {
                "title": "Global oil market highlights in January 2026 as reported by OPEC (Report) - IranOilGas",
                "source": "IranOilGas",
                "url": "https://www.iranoilgas.com/news/details.aspx?id=28525&title=Global+oil+market+highlights+in+January+2026+as+reported+by+OPEC+(Report)",
                "body": "Crude Oil Price Movements\nIn January, the OPEC Reference Basket (ORB) value rose by $0.61/b, month-on-month (m-o-m), to average $62.31/b. The ICE Brent front-month contract rose by $3.10/b, m-o-m, to average $64.73/b, and the NYMEX WTI front-month contract increased by $2.39/b, m-o-m, to average $60.26/b. The GME Oman front-month contract rose by $0.83/b, m-o-m, to average $62.79/b. The Brent–WTI front-month spread rose by $0.71/b, m-o-m, to average $4.47/b. The forward curves of all major crude benchmarks strengthened, with the front end of the curves for both ICE Brent and NYMEX WTI moving into stronger backwardation. Oil supply outages, easing selling pressure from speculators and robust physical market fundamentals supported front-month contracts. The forward curve for GME Oman was little changed, m-o-m. Speculative sentiment turned bullish, with hedge funds and other money managers sharply increasing their net long positions.\nWorld Economy\nThe global economic growth forecasts remain unchanged from last month’s assessment at 3.1% in 2026 and 3.2% in 2027. The US economic growth forecast is revised up slightly to 2.2% for 2026, but remains at 2% for 2027. In the Eurozone, the economic growth forecasts remain at 1.2% for both 2026 and 2027. Japan’s economic growth forecasts remain at 0.9% for both 2026 and 2027. The economic growth forecasts for China remain at 4.5% for both 2026 and 2027. India’s economic growth forecasts remain at 6.6% for 2026 and 6.5% for 2027. Brazil’s economic growth forecasts remain at 2.0% for 2026 and 2.2% for 2027. Russia’s economic growth forecasts remain at 1.3% for 2026 and 1.5% for 2027.\nWorld Oil Demand\nThe global oil demand growth forecast for 2026 remains at 1.4 mb/d, y-o-y, unchanged from last month’s assessment. The OECD is forecast to increase by 0.15 mb/d, while the non-OECD is forecast to grow by about 1.2 mb/d. In 2027, global oil demand is forecast to grow by about 1.3 mb/d, y-o-y, unchanged from last month’s assessment. The OECD is forecast to grow by 0.1 mb/d next year, while the non-OECD is forecast to increase by about 1.2 mb/d, y-o-y.\nWorld Oil Supply\nNon-DoC liquids production (i.e., liquids production from countries not participating in the Declaration of Cooperation) is forecast to grow by about 0.6 mb/d, y-o-y, in 2026, unchanged from last month’s assessment, mainly driven by Brazil, Canada, US, and Argentina. In 2027, non-DoC liquids production is forecast to grow by about 0.6 mb/d, unchanged from last month’s assessment, mainly driven by Brazil, Canada, Qatar, and Argentina. Natural gas liquids (NGLs) and non-conventional liquids from countries participating in the DoC are forecast to grow by 0.1 mb/d, y-o-y, in 2026, to average about 8.8 mb/d, followed by similar growth in 2027 of about 0.1 mb/d, y-o-y, to average about 8.9 mb/d. In January, crude oil production by countries participating in the DoC decreased by 439 tb/d, m-o-m, to average about 42.45 mb/d, according to available secondary sources.\nProduct Markets and Refining Operations\nIn January, refining margins declined in all reported trading hubs. Stronger feedstock prices and seasonal demand-side pressures weighed on refining margins, despite a significant rise in offline capacity due to the severe winter in the Atlantic basin and extended maintenance in Asia. In the US Gulf Coast (USGC), losses stemmed from the bottom section of the barrel as increased availability of heavy crude supplies weighed on fuel oil and, to a more limited extent, on gasoil crack spreads. In Rotterdam, all key product margins declined, with gasoline leading the decline, followed by fuel oil. In Singapore, the decline was driven by elevated gasoline and jet/kerosene supplies in the region.\nTanker Market\nDirty tanker spot freight rates had a strong start to the year in January, supported by weather disruptions, geopolitical uncertainties, unplanned outages, and steady loading activity. VLCC spot freight rates began in 2026 with an exceptiona"
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0094",
            "open": "1.1892",
            "close": "1.1870",
            "high": "1.1927",
            "low": "1.1833"
        },
        "market_summary": "### EUR/USD Market Briefing  \n* **Key Drivers:** Fed-ECB divergence; strong US NFP report tempers rate cut bets.  \n* **Price Action:** Consolidating below **1.1900**; intraday range **1.1835–1.1875**.  \n* **Technical Outlook:** Resistance at **1.1900–1.1920**; support near **1.1780**.  \n\n---\n**Overall Sentiment:** Neutral to Bearish 📉  \n\n**Market Context:**  \n- **USD Strength:** Hawkish Fed rhetoric and robust NFP data (130K jobs vs. 70K expected) underpin the Greenback.  \n- **EUR Support:** Dovish ECB expectations limit downside for the pair.  \n- **Technical Levels:** Key resistance at **1.1900–1.1920**; downside target **1.1780** if broken.  \n\n**Trade Idea:** Sell rallies toward **1.1900–1.1920**, targeting **1.1780** with stops above **1.1970**.  \n\n**Key Events Ahead:** US CPI on Friday; Weekly Jobless Claims later today.",
        "source_articles": [
            {
                "title": "EUR/USD holds steady below 1.1900 as Fed-ECB divergence persists - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/eur-usd-flat-lines-below-11900-divergent-fed-ecb-expectations-offer-support-202602120056",
                "body": "EUR/USD flat lines below 1.1900; divergent Fed-ECB expectations offer support\n- EUR/USD consolidates in a range during the Asian session amid mixed fundamental cues.\n- The upbeat US NFP tempers bets for more Fed rate cuts and lends some support to the USD.\n- Relatively hawkish ECB expectations act as a tailwind for the EUR and the currency pair.\nThe EUR/USD pair struggles to capitalize on the overnight bounce from the 1.1835-1.1830 region and oscillates in a narrow band during the Asian session on Thursday. Spot prices currently trade around the 1.1875 area, remaining nearly unchanged for the day and staying within striking distance of an over one-week high, reached on Tuesday, amid mixed cues.\nInvestors trimmed their expectations for more aggressive policy easing by the US Federal Reserve (Fed) following the release of a strong US Nonfarm Payrolls (NFP) report on Wednesday. Furthermore, hawkish comments from Kansas City Fed President Jeffrey Schmid, saying that further rate cuts risk allowing high inflation to persist even longer, assist the US Dollar (USD) to hold steady above a nearly two-week low. This, in turn, is seen as a key factor acting as a headwind for the EUR/USD pair.\nMarket participants, however, are still pricing in the possibility of at least two 25 basis points (bps) Fed rate cuts in 2026. Adding to this, threats to the US central bank's independence, along with the underlying bullish sentiment, contribute to capping the safe-haven Greenback. The shared currency, on the other hand, is underpinned by the growing acceptance that the European Central Bank (ECB) would likely hold interest rates steady for the rest of the year, lending support to the EUR/USD pair.\nThere aren't any relevant market-moving economic releases due from the Eurozone on Thursday, while the US economic docket features the usual Weekly Initial Jobless Claims later during the North American session. The spotlight now shifts to the US consumer inflation figures, due on Friday. The crucial data will be looked for more cues about the Fed's rate-cut path, which, in turn, will play a key role in influencing the USD price dynamics and providing some meaningful impetus to the EUR/USD pair.\nUS Dollar FAQs\nThe US Dollar (USD) is the official currency of the United States of America, and the ‘de facto’ currency of a significant number of other countries where it is found in circulation alongside local notes. It is the most heavily traded currency in the world, accounting for over 88% of all global foreign exchange turnover, or an average of $6.6 trillion in transactions per day, according to data from 2022. Following the second world war, the USD took over from the British Pound as the world’s reserve currency. For most of its history, the US Dollar was backed by Gold, until the Bretton Woods Agreement in 1971 when the Gold Standard went away.\nThe most important single factor impacting on the value of the US Dollar is monetary policy, which is shaped by the Federal Reserve (Fed). The Fed has two mandates: to achieve price stability (control inflation) and foster full employment. Its primary tool to achieve these two goals is by adjusting interest rates. When prices are rising too quickly and inflation is above the Fed’s 2% target, the Fed will raise rates, which helps the USD value. When inflation falls below 2% or the Unemployment Rate is too high, the Fed may lower interest rates, which weighs on the Greenback.\nIn extreme situations, the Federal Reserve can also print more Dollars and enact quantitative easing (QE). QE is the process by which the Fed substantially increases the flow of credit in a stuck financial system. It is a non-standard policy measure used when credit has dried up because banks will not lend to each other (out of the fear of counterparty default). It is a last resort when simply lowering interest rates is unlikely to achieve the necessary result. It was the Fed’s weapon of choice to combat the credit crunch that occurred during"
            },
            {
                "title": "Euro Along for the Ride as EUR/USD Trips from Resistance to Support - Forex Factory",
                "source": "Forex Factory",
                "url": "https://www.forexfactory.com/news/1383500-euro-along-for-the-ride-as-eurusd-trips",
                "body": "-\nEuro Along for the Ride as EUR/USD Trips from Resistance to Support\nWhen the US Dollar broke down two weeks ago, there were significant breakouts in EUR/USD and GBP/USD despite the fact that there really wasn’t any great drivers for either Europe or the UK. Instead, it seemed to be a move rooted more from the USD/JPY major pair and the fact that USD/JPY is still about 50% above early 2021 levels. This rally was driven by the carry trade and the rate differentials between the two economies, and this can and has led to a crowded long position as the monetary policy of both the US and Japan have and continue to encourage bulls while discouraging bears. Even at this stage, the rollover ... (full story)"
            },
            {
                "title": "EUR/USD Slides After Strong US Jobs Data, Dollar Finds Fresh Support - FXDailyReport.Com",
                "source": "FXDailyReport.Com",
                "url": "https://fxdailyreport.com/eur-usd-slides-after-strong-us-jobs-data-dollar-finds-fresh-support/",
                "body": "EUR/USD faced renewed selling pressure on Wednesday after a stronger-than-expected US Nonfarm Payrolls (NFP) report boosted the US Dollar and dented demand for the Euro. The pair dropped sharply in the immediate aftermath of the release, falling around 68 pips to an intraday low near 1.1833 before stabilizing around 1.1875 at the time of writing.\nJanuary’s NFP report showed that the US economy added 130K jobs, comfortably exceeding market expectations of roughly 70K and improving on December’s revised 48K gain. Meanwhile, the Unemployment Rate ticked lower to 4.3% from 4.4%, signaling continued resilience in the labor market.\nHowever, the details beneath the headline figures painted a more nuanced picture. The Bureau of Labor Statistics (BLS) revised down the seasonally adjusted level of total Nonfarm employment for March 2025 by 898K. In addition, total job growth for 2025 was sharply reduced to 181K from a previously reported 584K, suggesting that underlying hiring momentum last year was significantly weaker than earlier believed. The BLS also indicated that average monthly job growth in 2025 stood at just 15K, underscoring a subdued longer-term trend.\nOn the wage front, Average Hourly Earnings rose by 0.4% month-on-month in January, accelerating from 0.1% previously and surpassing the 0.3% consensus forecast. On an annual basis, wage growth held steady at 3.7%, slightly above expectations of 3.6%. The stronger earnings data reinforced the view that inflationary pressures from wages remain persistent.\nOverall, the report dampened expectations for near-term Federal Reserve rate cuts and strengthened the argument for policymakers to maintain current rates for longer. According to the CME FedWatch Tool, futures markets now largely price the policy rate to remain unchanged within the 3.50%–3.75% range at both the March and April meetings.\nMeanwhile, the US Dollar Index (DXY) trades broadly flat near 96.95, after earlier dipping to around 96.49 before rebounding on the jobs data. For now, EUR/USD remains sensitive to shifts in Fed rate expectations, with the strong headline labor figures providing fresh support for the Greenback despite downward revisions to past employment trends.\nTrade Idea:\nSell EUR/USD on rallies toward 1.1900–1.1920, targeting 1.1780, with a stop above 1.1970, as strong US payrolls and firm wages support the Dollar."
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0103",
            "open": "1.3648",
            "close": "1.3627",
            "high": "1.3712",
            "low": "1.3609"
        },
        "market_summary": "### GBP/USD Market Briefing\n* **Key Drivers:** BoE dovishness, UK political uncertainty, Fed rate cut expectations.\n* **Price Action:** Pullback from 4-year highs; trading at **1.3627**, down **0.12%**.\n* **Technical Outlook:** Above 50- and 200-day EMAs; support at **1.3585**, resistance at **1.3735**.\n---\n**Overall Sentiment:** Neutral 📊\n\n**Key Takeaways:**\n- BoE holds rates, but 5-4 MPC split signals dovish tilt.\n- UK political risk mounts amid Mandelson scandal fallout.\n- Fed rate cut bets tempered by strong US NFP data (353K jobs vs. 170K forecast).\n- GBP/USD remains above key moving averages but faces resistance near 1.3735.",
        "source_articles": [
            {
                "title": "GBP/AUD Slumps to 13-Year Low as RBA–BoE Divergence Widens - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/gbp-aud-slumps-to-13-year-low-as-rba-boe-divergence-widens/?amp=true",
                "body": "GBP/AUD Slumps to 13-Year Low as RBA–BoE Divergence Widens\nGBP/AUD has plunged to a 13-year low as widening monetary policy divergence between the Reserve Bank of Australia (RBA) and the Bank of England (BoE) combines with rising UK political uncertainty.\nThe cross is on track for its worst monthly performance since September 2023, with bearish momentum accelerating as traders position for further divergence in rates and growth expectations. With technical levels breaking across multiple timeframes, the focus now shifts to how much further the downside could extend.\nView related analysis:\n- FX Futures Positioning: US Dollar, EUR/USD, USD/CAD | COT report\n- Gold and Silver Outlook: Whipsaws Persist, Bulls Look for a Bounce\n- Australian Dollar Outlook: Rates Lead AUD/USD, Options Signal Risk\n- GBP/USD, EUR/GBP Outlook: Sterling at a Crossroads as BoE Vote Split Looms\nGBP/AUD Slumps to 13-Year Low on RBA–BoE Policy Divergence\nDiverging RBA and BoE Policy, Political Risk Weigh on GBP/AUD\nWe’re not even halfway through a short month, and GBP/AUD is close to surpassing January as the worst month for the pair since September 2023. Traders have been handed the kind of divergent theme FX markets thrive on: a classic mix of diverging monetary policy expectations and mounting political uncertainty.\n- The Reserve Bank of Australia (RBA) delivered a hawkish 25bp hike. While the move itself was widely expected, the tone of the statement and upgraded forecasts provided the real upside surprise for Australian dollar bulls.\n- The Bank of England (BoE) held rates as expected, but the vote split was far tighter than the anticipated 7–2 in favour of a hold. Instead, five MPC members voted to hold and four to cut. The Bank also signalled that further rate reductions are likely.\n- On the political front, UK PM Keir Starmer is under pressure amid fallout linked to the Epstein files. While not directly implicated, scrutiny around his decision to appoint Mandelson — and whether he was aware of prior controversies — has raised questions over judgement and governance. Even without concrete findings, political uncertainty is adding to sterling’s headwinds.\nSource: LSEG\nGBP/AUD Hits 13-Year Low as Bearish Momentum Accelerates\nThis ideal mix of bearish drivers for GBP/AUD has pushed the cross to a 156-month low, with momentum clearly accelerating. The key question now is how much further it can fall.\nIf history is any guide, there may still be room to the downside. GBP/AUD has declined just 11.7% from its recent peak — less than half the magnitude of the previous two major tops.\n- March 2020 – September 2022: -23.7%\n- August 2015 – October 2016: -30.1%\n- April 2025 – Present: -11.7%\nIn other words, the current drawdown remains modest relative to prior cyclical declines, which suggests the move could extend further if the macro and political divergence persists.\nSource: TradingView / ICE\nGBP/AUD Tests 200-Month EMA as Bears Eye 1.80 Handle\nThe monthly chart shows GBP/AUD testing a break below its 200-month EMA (1.9186). While that could spark a near-term bounce, momentum suggests bears are targeting the 2024 low at 1.8605, or potentially the 200-month SMA near the 1.80 handle.\nFor context, a move down to 1.80 would amount to a 16.8% decline from the recent high. Even a drop to 1.70 would still fall short of the previous major market-top selloff of 23.7%.\nGBP/AUD Technical Analysis: British Pound vs Australian Dollar\nThe cross has now broken below its 200-week SMA — a technically significant level. With price hovering around the October 2024 low, bears should be alert to the risk of near-term two-way volatility before the broader downtrend potentially resumes.\nOn the daily chart, price is stretched well below the 10- and 20-day EMAs, while RSI (14) is deeply oversold. These are not precise timing tools, but they do flag the risk of interim mean reversion.\nThat said, with UK political uncertainty and BoE easing expectations weighing on sterling — and RBA poli"
            },
            {
                "title": "GBP/USD slips heading into the Thursday trading window - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-usd-slips-heading-into-the-thursday-trading-window-202602112314",
                "body": "GBP/USD slips heading into the Thursday trading window\n- GBP/USD hesitates despite bearish Greenback flows on Wednesday.\n- A hobbled BoE is keeping Cable bidders from finding a foothold.\nThe Pound Sterling pulled back from four-year highs on Wednesday, weighed down by a combination of Bank of England (BoE) dovishness and UK political uncertainty, even as the US Dollar weakened on soft labor market revisions. The BoE held rates unchanged at its February meeting but surprised markets with a 5-4 Monetary Policy Committee (MPC) vote split, with four members backing an immediate 25 basis point cut, a more dovish outcome than expected.\nGovernor Andrew Bailey noted that inflation is set to reach the 2% target sooner than anticipated, and markets are now pricing in 50 basis points of additional easing in 2026. UK political risk flared as Scottish Labour leader Anas Sarwar called for Prime Minister Keir Starmer to step down amid the Peter Mandelson scandal, though cabinet support has since steadied the situation. The critical event for the Pound this week is Thursday's release of UK preliminary Gross Domestic Product (GDP) for Q4 2025, with the quarter-over-quarter consensus at 0.2% (down from 0.1% in Q3) and year-over-year at 1.2% (previous 1.3%), alongside December industrial and manufacturing production data. The BoE recently downgraded its 2026 GDP forecast to 0.9% from 1.2%, adding to the cautious backdrop. On Friday, Bank of England MPC member Pill speaks, while the delayed US Consumer Price Index (CPI) for January takes center stage, with headline year-over-year expected at 2.5% and core month-over-month at 0.3%. A softer CPI print could reignite US Dollar selling, supporting GBP/USD despite the BoE's dovish lean.\nGBP/USD price forecast\nOn the daily chart, GBP/USD is trading at 1.3627, down 0.12% on the session, pulling back from the late-January swing high of 1.3869, a level not seen since early 2022. Price is trading above both the 50-day Exponential Moving Average (EMA) at 1.3516 and the 200-day EMA at 1.3312, keeping the broader bullish trend structure of higher highs and higher lows from the November low of 1.3010. The pullback from 1.3869 has been orderly, with the pair finding support near the 1.3600 handle on multiple sessions. The Stochastic Oscillator (14, 5, 5) reads 47.10/52.91, sitting at the midline and pointing to neutral momentum after resetting from overbought territory, which suggests the correction may be nearing completion. Immediate support lies at 1.3585 to 1.3620, a zone that aligns with recent consolidation lows and, if held, would preserve the bullish structure for a retest of 1.3735 and the 1.3869 high. Below that, deeper support sits at 1.3516 (50 EMA) and the 1.3380 to 1.3400 zone. Resistance stands at 1.3735, followed by 1.3869. A daily close below 1.3585 would open the door toward 1.3380 to 1.3400, while a bounce from current levels with a bullish Stochastic crossover would favor a push back toward the January high.\nGBP/USD daily chart\nPound Sterling FAQs\nThe Pound Sterling (GBP) is the oldest currency in the world (886 AD) and the official currency of the United Kingdom. It is the fourth most traded unit for foreign exchange (FX) in the world, accounting for 12% of all transactions, averaging $630 billion a day, according to 2022 data. Its key trading pairs are GBP/USD, also known as ‘Cable’, which accounts for 11% of FX, GBP/JPY, or the ‘Dragon’ as it is known by traders (3%), and EUR/GBP (2%). The Pound Sterling is issued by the Bank of England (BoE).\nThe single most important factor influencing the value of the Pound Sterling is monetary policy decided by the Bank of England. The BoE bases its decisions on whether it has achieved its primary goal of “price stability” – a steady inflation rate of around 2%. Its primary tool for achieving this is the adjustment of interest rates. When inflation is too high, the BoE will try to rein it in by raising interest rates, making it more expensive for peop"
            },
            {
                "title": "GBP/USD Trims Critical Gains After Blowout NFPs Temper Fed Cut Bets - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/news/feed/8d9bf-gbp-usd-trims-gains-nfps-fed-bets",
                "body": "GBP/USD Trims Critical Gains After Blowout NFPs Temper Fed Cut Bets\nShare:\nBitcoinWorld\nGBP/USD Trims Critical Gains After Blowout NFPs Temper Fed Cut Bets\nLONDON, January 10, 2025 – The GBP/USD currency pair surrendered significant early gains during Friday’s trading session after unexpectedly strong US employment data dramatically shifted market expectations for Federal Reserve monetary policy. This development represents a pivotal moment for currency traders who had positioned for imminent interest rate cuts from the world’s most influential central bank.\nGBP/USD Reacts to US Employment Data Surprise\nThe currency market experienced immediate volatility following the release of January’s Non-Farm Payrolls report. Initially, the British pound had strengthened against the US dollar during early European trading. However, the NFP data revealed the US economy added 353,000 jobs in December, substantially exceeding economists’ consensus forecast of 170,000. Consequently, the unemployment rate held steady at 3.7%, defying predictions of a slight increase. This robust employment picture prompted traders to reassess their positions rapidly.\nMarket participants quickly adjusted their outlook for the Federal Reserve’s policy path. Previously, futures markets had priced in a high probability of rate cuts beginning as early as March. Following the data release, however, these expectations diminished significantly. The shift in sentiment created immediate downward pressure on the GBP/USD pair, which fell from session highs near 1.2750 to trade around 1.2680. This movement illustrates the direct correlation between US economic data and major currency valuations.\nFederal Reserve Policy Expectations Recalibrated\nThe stronger-than-anticipated jobs report fundamentally altered the narrative surrounding the Federal Reserve’s next moves. For months, markets had anticipated a dovish pivot from the Fed as inflation showed signs of cooling. The employment data, however, suggests the US labor market remains remarkably resilient. This resilience gives the Federal Open Market Committee more flexibility to maintain higher interest rates for longer without triggering a recession.\nSeveral key metrics from the report influenced this recalibration:\n- Wage Growth: Average hourly earnings rose 0.6% month-over-month and 4.5% year-over-year, exceeding forecasts.\n- Labor Force Participation: The rate held at 62.5%, indicating stable workforce engagement.\n- Revisions: Previous months’ job gains were revised upward by 126,000, strengthening the trend.\nThese figures collectively reduced the perceived urgency for the Fed to cut rates. Higher wages can sustain consumer spending, potentially slowing disinflation. Therefore, the central bank may prioritize ensuring inflation returns sustainably to its 2% target before easing policy.\nHistorical Context of NFP Market Reactions\nHistorically, significant NFP surprises have produced substantial currency movements. The table below shows recent examples of how large data deviations moved the GBP/USD pair:\nThis pattern demonstrates that positive US employment surprises typically strengthen the dollar against other major currencies. The January 2025 reaction follows this established market behavior precisely.\nComparative Central Bank Dynamics\nThe GBP/USD movement reflects not just US developments but the contrasting monetary policy outlooks between the Federal Reserve and the Bank of England. While the Fed may delay cuts, the Bank of England faces its own complex economic landscape. UK inflation has proven stickier than in the US, particularly in services and wage growth. However, the British economy shows signs of weakness, with GDP contracting in recent quarters.\nThis divergence creates a challenging environment for currency traders. On one hand, delayed Fed cuts support the US dollar through higher relative interest rates. On the other hand, the Bank of England cannot easily cut rates while domestic inflation remains above"
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0078",
            "open": "0.7065",
            "close": "0.7126",
            "high": "0.7143",
            "low": "0.7065"
        },
        "market_summary": "### AUD/USD Market Briefing  \n* **Key Drivers:** RBA hawkish stance, inflation expectations at **5.0%**, widening yield spreads.  \n* **Price Action:** Reached **3-year high** at **0.7147**, extending gains for second session.  \n* **Technical Outlook:** Resistance near **0.7150**, potential for further upside if inflation data supports hawkish RBA.  \n---\n**Overall Sentiment:** Positive 📈  \n\n**Key Catalysts:**  \n- RBA Governor Michele Bullock: Rates may rise if inflation persists; \"unacceptable\" if above 3%.  \n- **CME FedWatch:** 94% probability of Fed holding rates, reducing USD support.  \n- **Yield Spreads:** Australia’s 3-year yield **75 bps above** US Treasuries, **223 bps above** German bunds.  \n\n**Risks:**  \n- US CPI data Friday could strengthen USD.  \n- Global risk-off sentiment may cap AUD gains.  \n\n**Next Events:**  \n- Q1 Australian inflation data (late April).  \n- US CPI inflation report (Friday).",
        "source_articles": [
            {
                "title": "Australian Dollar reaches fresh three-year highs as RBA signals hawkish stance - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/aud-usd-reaches-fresh-three-year-highs-as-rba-signals-hawkish-stance-202602120235",
                "body": "Australian Dollar reaches fresh three-year highs as RBA signals hawkish stance\n- AUD/USD rises as RBA's Bullock says rates may rise again if inflation persists.\n- Australia’s Inflation Expectations rose to 5.0% in February from 4.6%, ending seven months below 5%.\n- The CME FedWatch tool suggests that markets price a 94% chance the Fed will hold rates, up from 80% previously.\nAUD/USD extends its gains for the second successive session, reaching a three-year high of 0.7147 during the Asian hours on Thursday. The pair strengthened as the Australian Dollar (AUD) drew support after the Reserve Bank of Australia (RBA) signalled a continued hawkish stance.\nRBA Governor Michele Bullock said on Thursday that the board remains prepared to raise rates further if inflation proves persistent, stressing that any inflation “with a three in front of it” is unacceptable. The board will be data-dependent and continually reassess forecasts.\nAustralia’s Consumer Inflation Expectations rose to 5.0% in February from 4.6% previously, ending seven months below 5%. The February increase was broad-based across various measures and reinforces the RBA Board’s decision to lift the cash rate target to 3.85%.\nHowever, AUD/USD gains may be capped as the US Dollar (USD) strengthens after traders scaled back expectations for Federal Reserve (Fed) rate cuts following stronger-than-expected US jobs data released on Wednesday.\nThe CME FedWatch tool suggests that financial markets are now pricing in nearly a 94% probability that the Fed will leave rates unchanged at its next meeting, up from 80% from the previous day. The US Consumer Price Index (CPI) inflation report will be the highlight later on Friday.\nAustralian Dollar FAQs\nOne of the most significant factors for the Australian Dollar (AUD) is the level of interest rates set by the Reserve Bank of Australia (RBA). Because Australia is a resource-rich country another key driver is the price of its biggest export, Iron Ore. The health of the Chinese economy, its largest trading partner, is a factor, as well as inflation in Australia, its growth rate and Trade Balance. Market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – is also a factor, with risk-on positive for AUD.\nThe Reserve Bank of Australia (RBA) influences the Australian Dollar (AUD) by setting the level of interest rates that Australian banks can lend to each other. This influences the level of interest rates in the economy as a whole. The main goal of the RBA is to maintain a stable inflation rate of 2-3% by adjusting interest rates up or down. Relatively high interest rates compared to other major central banks support the AUD, and the opposite for relatively low. The RBA can also use quantitative easing and tightening to influence credit conditions, with the former AUD-negative and the latter AUD-positive.\nChina is Australia’s largest trading partner so the health of the Chinese economy is a major influence on the value of the Australian Dollar (AUD). When the Chinese economy is doing well it purchases more raw materials, goods and services from Australia, lifting demand for the AUD, and pushing up its value. The opposite is the case when the Chinese economy is not growing as fast as expected. Positive or negative surprises in Chinese growth data, therefore, often have a direct impact on the Australian Dollar and its pairs.\nIron Ore is Australia’s largest export, accounting for $118 billion a year according to data from 2021, with China as its primary destination. The price of Iron Ore, therefore, can be a driver of the Australian Dollar. Generally, if the price of Iron Ore rises, AUD also goes up, as aggregate demand for the currency increases. The opposite is the case if the price of Iron Ore falls. Higher Iron Ore prices also tend to result in a greater likelihood of a positive Trade Balance for Australia, which is also positive of the AUD.\nThe Trade Balance, which is the difference be"
            },
            {
                "title": "Aussie Dollar Rallies on RBA Hawkish Signals - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/te_news:525174:0-aussie-dollar-rallies-on-rba-hawkish-signals/",
                "body": "Aussie Dollar Rallies on RBA Hawkish Signals\nThe Australian dollar rose to above $0.71 on Thursday, extending its rally to a fresh three-and-a-half-year high after the central bank signaled another hawkish policy stance.\nRBA Governor Michele Bullock said the board remains ready to lift rates further if inflation proves persistent, describing any inflation “with a three in front of it” as unacceptable.\nHer comments reinforced warnings from Deputy Governor Hauser, who noted just a day earlier that inflation remains too high and continues to pose a major challenge for the rate-setting board.\nA consumer survey was released shortly after her speech showing inflation expectations jumped to 5% in February, the highest since mid-2025, reinforcing the hawkish tone.\nEconomists now widely expect a possible rate hike in May, as the RBA weighs first-quarter inflation data alongside upcoming employment and GDP reports.\nAssistant Governor Sarah Hunter is also scheduled to deliver a speech in Perth later Thursday, offering additional insight."
            },
            {
                "title": "Aussie Dollar Hits Three-Year High As Rate Gap Widens - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/aussie-dollar-hits-three-year-high-as-rate-gap-widens",
                "body": "A hawkish RBA and wider yield spreads versus the US and Europe are lifting the Australian dollar, with investors watching late-April inflation data for what comes next.\nabout 4 hours ago • 1 min\nWhat’s going on here?\nAustralia’s dollar hit a fresh three-year high near $0.7146 after the Reserve Bank of Australia (RBA) signaled it may keep rates higher for longer, pushing local bond yields further above those in the US and Europe.\nWhat does this mean?\nThis move isn’t just against the greenback: the aussie also reached a 12-month high versus the euro and a 10-month high versus the Swiss franc. The driver is rate math. Australia’s 3-year government yield is now roughly 75 basis points above comparable US Treasuries – a sharp swing from about 60 bps below a year ago – while the spread versus German bunds has widened to about 223 bps, the biggest since late 2022. That repricing..\nfollowed a hotter-than-expected inflation print and an RBA hike last week. Late-April Q1 inflation is the next big test for whether policymakers tighten again.\nWhy should I care?\nFor markets: Higher yields can pull a currency up fast.\nWhen a central bank looks more likely to hike while peers look closer to cutting, global money often flows toward that market’s bonds – and the currency tends to get a tailwind. That can squeeze exporters and firms with overseas earnings, but it can also damp imported inflation by making foreign goods cheaper. Either way, a data surprise can quickly unwind the trade.\nThe bigger picture: Central banks are drifting out of sync again.\nThe last few years were defined by synchronized tightening, but inflation is now cooling at different speeds across countries. Australia is grappling with stickier price pressures, while parts of Europe and the US are closer to debating cuts. That divergence can keep FX markets choppy and reshape trade and tourism flows.\nThis content is free, but you must be logged in to continue reading.\nAlready have an account?"
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "2.0990",
            "open": "154.3420",
            "close": "153.2580",
            "high": "154.6470",
            "low": "152.5480"
        },
        "market_summary": "### USD/JPY Market Briefing  \n* **Key Drivers:** BoJ hawkishness, USD weakness, bearish momentum below 153.00.  \n* **Price Action:** Trading near **152.50**, testing 200-day EMA support.  \n* **Technical Outlook:** Support at **152.00**, bearish MACD and RSI.  \n\n---  \n**Overall Sentiment:** Negative 📉  \n\n---  \n**Key Developments:**  \n- **BoJ Policy:** Hawkish stance supports JPY amid narrowing US-Japan yield spreads.  \n- **Political Clarity:** PM Takaichi’s victory boosts yen strength despite fiscal dove expectations.  \n- **USD Weakness:** Fed rate cut bets and NFP data uncertainty weigh on the dollar.  \n\n**Technical Levels:**  \n- **Support:** 152.00 (38.2% Fibo), 150.30 (200 SMA).  \n- **Resistance:** 154.50, 156.00, 157.65.  \n\n**Market Sentiment:**  \nBears retain control below 153.00, with USD/JPY vulnerable to further declines unless momentum improves.",
        "source_articles": [
            {
                "title": "USD/JPY Price Forecast: Approaches 200-day EMA as bears retain control below 153.00 - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-jpy-price-forecast-approaches-200-day-ema-as-bears-retain-control-below-15300-202602120201",
                "body": "USD/JPY Price Forecast: Approaches 200-day EMA as bears retain control below 153.00\n- USD/JPY remains depressed for the fourth consecutive day and seems vulnerable to slide further.\n- Prospects for further BoJ rate hikes underpin the JPY and weigh on spot prices amid a bearish USD.\n- Bears await a sustained break and acceptance below the 200-day EMA before placing fresh bets.\nThe USD/JPY pair sticks to its bearish bias for the fourth straight day on Thursday and trades just below the 153.00 mark during the Asian session, close to a two-week low set the previous day. Moreover, the fundamental backdrop and the broader technical setup support the case for an extension of the weekly downtrend triggered by Japanese Prime Minister Sanae Takaichi's landslide election victory.\nInvestors now seem hopeful that Takaichi could be more fiscally responsible and that her policies will boost the economy. This might prompt the Bank of Japan (BoJ) to stick to its hawkish stance, which continues to underpin the Japanese Yen (JPY). The US Dollar (USD), on the other hand, struggles to build on the upbeat US NFP-inspired bounce amid bets that the Federal Reserve (Fed) will cut rates further in 2026 and threats to the central bank's independence. This further contributes to the offered tone surrounding the USD/JPY pair.\nFrom a technical perspective, spot prices hold marginally above the 200-day Exponential Moving Average (EMA) at 152.50. The moving average continues to rise, keeping the broader bias supported. This is closely followed by the 38.2% Fibonacci retracement level of the 140.02-159.35 move higher, around the 152.00-151.95 region. The latter should act as a key pivotal support, and a close below would open the 50% retracement level at 149.68, where the corrective phase could deepen if breached.\nThe Moving Average Convergence Divergence (MACD) shows the MACD line below the signal line and below zero. The negative histogram widens, suggesting strengthening bearish pressure. RSI at 36 (neutral-to-bearish) and falling indicates sellers retain momentum.\nThat said, holding above the 38.2% Fibo. retracement level and reclaiming traction above the 200-day EMA would ease pressure and refocus recovery attempts, but until momentum improves, rallies could remain capped.\n(The technical analysis of this story was written with the help of an AI tool.)\nUSD/JPY daily chart\nJapanese Yen FAQs\nThe Japanese Yen (JPY) is one of the world’s most traded currencies. Its value is broadly determined by the performance of the Japanese economy, but more specifically by the Bank of Japan’s policy, the differential between Japanese and US bond yields, or risk sentiment among traders, among other factors.\nOne of the Bank of Japan’s mandates is currency control, so its moves are key for the Yen. The BoJ has directly intervened in currency markets sometimes, generally to lower the value of the Yen, although it refrains from doing it often due to political concerns of its main trading partners. The BoJ ultra-loose monetary policy between 2013 and 2024 caused the Yen to depreciate against its main currency peers due to an increasing policy divergence between the Bank of Japan and other main central banks. More recently, the gradually unwinding of this ultra-loose policy has given some support to the Yen.\nOver the last decade, the BoJ’s stance of sticking to ultra-loose monetary policy has led to a widening policy divergence with other central banks, particularly with the US Federal Reserve. This supported a widening of the differential between the 10-year US and Japanese bonds, which favored the US Dollar against the Japanese Yen. The BoJ decision in 2024 to gradually abandon the ultra-loose policy, coupled with interest-rate cuts in other major central banks, is narrowing this differential.\nThe Japanese Yen is often seen as a safe-haven investment. This means that in times of market stress, investors are more likely to put their money in the Japanese currency due to its sup"
            },
            {
                "title": "USD/JPY: Yen strength persists on policy and politics – Scotiabank - Mitrade",
                "source": "Mitrade",
                "url": "https://www.mitrade.com/au/insights/news/live-news/article-1-1470776-20260212",
                "body": "Scotiabank’s Analyst Team highlights strong Japanese Yen performance, with USD/JPY pressured by a post-election relief rally and supportive Bank of Japan policy stance. Analysts point to narrowing US-Japan yield spreads at multi-year lows as a key driver and see limited support for USD/JPY until the local low near 152, underscoring a bearish Dollar bias against the Yen.\n\"The yen is strong, outperforming all of the G10 currencies in an environment of broad-based USD strength.\"\n\"The post-election relief rally remains a critical source of strength for the yen, as market participants respond to PM Takaichi’s message of stability and continuity as she pursues her platform objectives.\"\n\"The outlook relative central bank policy remains supportive for the yen, given the BoJ’s continued hawkishness and the continued narrowing of interest rate differentials as US-Japan spreads compress to fresh multi-year lows.\"\n\"For USDJPY, we see limited support between current levels and the local low around 152.\"\n(This article was created with the help of an Artificial Intelligence tool and reviewed by an editor.)"
            },
            {
                "title": "USD/JPY, DAX Forecast: 2 Trades to Watch - Investing.com",
                "source": "Investing.com",
                "url": "https://m.investing.com/analysis/usdjpy-dax-forecast-2-trades-to-watch-200674851?ampMode=1",
                "body": "Fiona Cincotta | Feb 11, 2026 07:32AM ET\nUSD/JPY is falling as the dollar struggles across the board, while the yen continues to outperform following Prime Minister Takaichi’s landslide election victory at the weekend.\nExpectations had been for the yen to weaken if Takaichi, a fiscal dove, won a landslide victory, but the reality is the yen has strengthened amid optimism over the growth prospects, the potential for a more hawkish Bank of Japan and political clarity, which is encouraging speculators to scale back on short yen positions.\nMeanwhile, the US dollar is falling across the board, extending yesterday’s weakness, after slower-than-expected December retail sales and as investors look ahead to today’s nonfarm payrolls report.\nThe delayed jobs report, due to the government shutdown, is expected to show that 70,000 jobs were created last month, up from 50,000 in December.\nThe data comes at a time when the market is trying to decide whether the US economy is merely slowing towards trend or if the labour market is weakening in a way that would force the Fed to cut rates sooner.\nThe data could help shape expectations for Federal Reserve policy. The markets are currently pricing in 60 basis points of Fed easing by the end of the year. Weak data could lift Fed rate cut bets, weighing on USD/JPY\nAfter running into resistance at 157.65 USD/JPY rebounded lower, breaking below 154.50 support to test the rising trendline at 152.80.\nSellers supported by the RSI below 50 will look to break below the trendline to test 152, the 2026 low. A break below here creates a lower low and exposes the 200 SMA at 150.30.\nResistance is seen at 154.50, the mid-December low, with a rise above this level opening the door to 156.00. A rise above 157.80 creates a higher high.\nEuropean stocks are under pressure on Wednesday, pulled lower by tech and financial stocks amid ongoing worries that new AI models could hurt traditional software businesses\nWhile worries that AI is disrupting software companies hit tech stocks particularly hard in the US last week, those worries are also in Europe. French company Dassault’s shares are down almost 20% and on track for their largest daily drop after the software maker posted disappointing Q4 revenue growth and a weak outlook for this year.\nFears over AI disruption are not only affecting software firms; they are also spreading to other parts of the market, including insurers, asset managers, and index providers, following the release of several new AI tools.\nOn the macro front, attention is on the US jobs report later today, which could help gauge expectations for Federal Reserve rate cuts this year.\nThe nonfarm payroll report is expected to show 70,000 jobs added, up from 50,000 in December, and unemployment is expected to rise to 4.5%, up from 4.4%.\nSlightly weaker jobs data could support expectations for Fed cuts, which would be positive for risk assets globally.\nThe DAX rebounded from the rising trendline support, moving above the 50 SMA before encountering resistance around 25,000 as momentum faded. Buyers will look to rise above the 25,000 level towards 25,500 and fresh record highs.\nImmediate support is seen at 24,650, the October and July high and the 50 SMA. A break below 24,200, the February low creates a lower low.\nOriginal Post\n.\nTrading in financial instruments and/or cryptocurrencies involves high risks including the risk of losing some, or all, of your investment amount, and may not be suitable for all investors. Prices of cryptocurrencies are extremely volatile and may be affected by external factors such as financial, regulatory or political events. Trading on margin increases the financial risks.\nBefore deciding to trade in financial instrument or cryptocurrencies you should be fully informed of the risks and costs associated with trading the financial markets, carefully consider your investment objectives, level of experience, and risk appetite, and seek professional advice where needed.\nFusion Medi"
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0115",
            "open": "1.3544",
            "close": "1.3576",
            "high": "1.3618",
            "low": "1.3504"
        },
        "market_summary": "### USD/CAD Market Briefing\n* **Key Drivers:** Strong US NFP data, BoC minutes hinting at easier rate cuts.\n* **Price Action:** Fell to **1.3517**, rebounded to **1.3580** after NFP.\n* **Technical Outlook:** Support near **1.3520**, resistance at **1.3600**.\n\n---\n**Overall Sentiment:** Neutral ⚖️",
        "source_articles": [
            {
                "title": "USD/CAD plumbs 2-week low ahead of US NFP, BoC minutes - TradingPedia",
                "source": "TradingPedia",
                "url": "https://www.tradingpedia.com/2026/02/11/usd-cad-plumbs-2-week-low-ahead-of-us-nfp-boc-minutes/",
                "body": "The USD/CAD currency pair extended losses to a 2-week low of 1.3517 on Wednesday ahead of US jobs and inflation data prints, which may provide fresh clues over the Fed’s monetary policy trajectory.\nEmployers in all sectors of the US economy, excluding farming, probably added 70,000 job positions in January, according to market consensus, following a job growth of 50,000 in December.\nAnd, the unemployment rate probably remained steady at 4.4% in January.\nSan Francisco Federal Reserve President Mary Daly said last week that one or two additional interest rate cuts might be required to counteract weakness in the US labor market.\nAt the same time, US December retail sales fell short of market consensus, while indicating a slowdown in consumer spending and also reinforcing expectations of further policy easing by the Federal Reserve.\nMarkets are now pricing in a higher probability of three interest rate cuts this year, compared to two a week earlier.\nMeanwhile, CAD traders will be paying close attention to the minutes from the Bank of Canada’s January policy meeting.\nThe BoC kept its benchmark interest rate intact at 2.25% at its January meeting, in line with market expectations.\nBoC policy makers said that the current stance remained appropriate given the central bank’s baseline economic outlook.\nGovernor Tiff Macklem noted that a high level of trade uncertainty made it difficult to project when and in what direction the policy rate might next move.\nIn its quarterly monetary policy report, the central bank maintained its forecast for modest growth this year and in 2027, while inflation is expected to hover around the 2% target.\nThe USD/CAD currency pair was last down 0.19% on the day to trade at 1.3524."
            },
            {
                "title": "Canadian Dollar edges lower below 1.3600 as strong US NFP data boosts US Dollar - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/canadian-dollar-edges-lower-below-13600-as-strong-us-nfp-data-boosts-us-dollar-202602120121",
                "body": "Canadian Dollar edges lower below 1.3600 as strong US NFP data boosts US Dollar\n- USD/CAD edges higher to near 1.3580 in Thursday’s Asian session.\n- US NFP rose in January by the most in more than a year; the Unemployment Rate unexpectedly fell.\n- Traders brace for the US January CPI inflation data for fresh impetus, which is due on Friday.\nThe USD/CAD pair trades with mild gains around 1.3580 during the Asian trading hours on Thursday. The US Dollar (USD) edges higher against the Canadian Dollar (CAD) on a stronger-than-expected employment report. Traders will take more cues from the US Consumer Price Index (CPI) inflation report later on Friday.\nThe US economy added 130,000 jobs in January, above the market consensus of 70,000, according to the Bureau of Labor Statistics on Wednesday. The Unemployment Rate declined to 4.3% in January from 4.4% in December, better than the forecast of 4.4%.\nThe upbeat report suggests that the US labor market continued to stabilize at the start of 2026, reducing the chances the Federal Reserve (Fed) will see a need to cut interest rates again by midyear. This, in turn, provides some support to the Greenback against the CAD.\nThe US CPI inflation data will be closely watched on Friday. The headline and core CPI are projected to show a rise of 2.5% YoY in January. On a monthly basis, the headline and core CPI are estimated to show an increase of 0.3% during the same period. In case of a softer-than-expected outcome, this could drag the USD lower in the near term.\nOngoing geopolitical risks could boost crude oil prices and underpin the commodity-linked Loonie. It is worth noting that Canada is a major oil-exporting country, and high crude oil prices generally have a positive impact on the CAD.\nCanadian Dollar FAQs\nThe key factors driving the Canadian Dollar (CAD) are the level of interest rates set by the Bank of Canada (BoC), the price of Oil, Canada’s largest export, the health of its economy, inflation and the Trade Balance, which is the difference between the value of Canada’s exports versus its imports. Other factors include market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – with risk-on being CAD-positive. As its largest trading partner, the health of the US economy is also a key factor influencing the Canadian Dollar.\nThe Bank of Canada (BoC) has a significant influence on the Canadian Dollar by setting the level of interest rates that banks can lend to one another. This influences the level of interest rates for everyone. The main goal of the BoC is to maintain inflation at 1-3% by adjusting interest rates up or down. Relatively higher interest rates tend to be positive for the CAD. The Bank of Canada can also use quantitative easing and tightening to influence credit conditions, with the former CAD-negative and the latter CAD-positive.\nThe price of Oil is a key factor impacting the value of the Canadian Dollar. Petroleum is Canada’s biggest export, so Oil price tends to have an immediate impact on the CAD value. Generally, if Oil price rises CAD also goes up, as aggregate demand for the currency increases. The opposite is the case if the price of Oil falls. Higher Oil prices also tend to result in a greater likelihood of a positive Trade Balance, which is also supportive of the CAD.\nWhile inflation had always traditionally been thought of as a negative factor for a currency since it lowers the value of money, the opposite has actually been the case in modern times with the relaxation of cross-border capital controls. Higher inflation tends to lead central banks to put up interest rates which attracts more capital inflows from global investors seeking a lucrative place to keep their money. This increases demand for the local currency, which in Canada’s case is the Canadian Dollar.\nMacroeconomic data releases gauge the health of the economy and can have an impact on the Canadian Dollar. Indicators such as GDP, Manufacturing and"
            },
            {
                "title": "Bank of Canada Appears To Suggest There's \"At Least a Slightly Lower Bar\" For Further Rate Cuts, says Desjardins - marketscreener.com",
                "source": "marketscreener.com",
                "url": "https://www.marketscreener.com/news/bank-of-canada-appears-to-suggest-there-s-at-least-a-slightly-lower-bar-for-further-rate-cuts-say-ce7e5addd08af42c",
                "body": "Access Denied\nYou don't have permission to access \"http://www.marketscreener.com/news/bank-of-canada-appears-to-suggest-there-s-at-least-a-slightly-lower-bar-for-further-rate-cuts-say-ce7e5addd08af42c\" on this server.\nReference #18.343b2f17.1770878758.73e59ff1\nhttps://errors.edgesuite.net/18.343b2f17.1770878758.73e59ff1"
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "2.4850",
            "open": "210.5420",
            "close": "208.8460",
            "high": "210.6540",
            "low": "208.1690"
        },
        "market_summary": "### GBP/JPY Market Briefing  \n* **Key Drivers:** JPY strength fueled by BoJ hawkish expectations; GBP weakness from BoE dovish outlook.  \n* **Price Action:** Plunged to **207.60**, two-month low; bearish momentum intact.  \n* **Technical Outlook:** Below 200-day SMA; support eyed at **207.00**.  \n---\n**Overall Sentiment:** Negative 📉  \n\n**Key Drivers:**  \n- **JPY strength:** PM Takaichi’s election win boosts fiscal stimulus hopes, but BoJ hawkish stance persists.  \n- **GBP weakness:** BoE rate-cut expectations (March) and dovish signals weigh on Sterling.  \n- **Policy divergence:** BoJ normalization vs. BoE easing cycle.  \n\n**Price Action:**  \n- GBP/JPY hit **207.60**, lowest since December 17.  \n- Fourth consecutive day of losses amid relentless JPY buying.  \n- Technical breakdown below 200-day SMA exacerbates bearish pressure.  \n\n**Technical Outlook:**  \n- Immediate support at **207.00**; further downside possible if breached.  \n- USD weakness offers limited support to GBP.  \n\n**Market Focus:**  \n- UK Q4 GDP (Feb 12) for near-term direction.  \n- BoE rate-cut trajectory vs. BoJ tightening bets (June hike priced).  \n\n**Risk Factors:**  \n- UK political tensions (Starmer’s leadership crisis).  \n- Global risk sentiment and equity market trends.  \n\n**Sentiment:** JPY favored due to policy normalization; GBP vulnerable amid economic stagnation.",
        "source_articles": [
            {
                "title": "GBP/JPY hits two-month low, eyes UK GDP amid JPY strength - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-slumps-to-two-month-low-eyes-mid-20700s-amid-jpy-strength-ahead-of-uk-data-202602120347",
                "body": "GBP/JPY slumps to two-month low; eyes mid-207.00s amid JPY strength, ahead of UK data\n- GBP/JPY attracts heavy selling for the fourth straight day on Thursday amid relentless JPY buying.\n- The divergent BoJ-BoE policy expectations further contribute to the pair’s steep weekly decline.\n- Traders now look to the UK macro data, including the Q4 GDP, to grab short-term opportunities.\nThe GBP/JPY cross prolongs its weekly downtrend for the fourth straight day and dives to its lowest level since December 17, around the 207.65-207.60 region during the Asian session on Thursday. The downfall is exclusively sponsored by strong follow-through buying around the Japanese Yen (JPY), fueled by Prime Minister Sanae Takaichi's landslide victory in the lower house election on Sunday.\nThe clear political mandate gives Takaichi the leeway to pursue her expansionary policies. Moreover, investors remain hopeful that Takaichi could be more fiscally responsible and her policies will boost the economy, which might prompt the Bank of Japan (BoJ) to stick to its hawkish stance. Apart from this, speculations that authorities conducted rate checks following the release of the blowout US employment data trigger a fresh leg up in the JPY and exert heavy downward pressure on the GBP/JPY cross.\nThe JPY bulls, meanwhile, seem rather unaffected by softer domestic data, which showed that Japan's annual wholesale inflation slowed for a second consecutive month in January. Even the underlying bullish sentiment – as depicted by a generally positive tone around the equity markets – does little to hinder the safe-haven JPY's strong move up. Furthermore, the Bank of England's (BoE) dovish signal contributes to the British Pound's (GBP) underperformance and contributes to the GBP/JPY pair's decline.\nFrom a technical perspective, this week's breakdown below the very important 200-day Simple Moving Average (SMA) seems to have aggravated the bearish pressure surrounding the currency pair. That said, the prevailing selling bias surrounding the US Dollar (USD) offers some support to the British Pound (GBP) and might limit losses for the GBP/JPY cross. Traders now look forward to the UK data dump, including the preliminary Q4 GDP report, which might influence the GBP and provide a fresh impetus.\nEconomic Indicator\nGross Domestic Product (QoQ)\nThe Gross Domestic Product (GDP), released by the Office for National Statistics on a monthly and quarterly basis, is a measure of the total value of all goods and services produced in the UK during a given period. The GDP is considered as the main measure of UK economic activity. The QoQ reading compares economic activity in the reference quarter to the previous quarter. Generally, a rise in this indicator is bullish for the Pound Sterling (GBP), while a low reading is seen as bearish.\nRead more.Next release: Thu Feb 12, 2026 07:00 (Prel)\nFrequency: Quarterly\nConsensus: 0.2%\nPrevious: 0.1%\nSource: Office for National Statistics\nAuthor\nHaresh Menghani\nFXStreet\nHaresh Menghani is a detail-oriented professional with 10+ years of extensive experience in analysing the global financial markets."
            },
            {
                "title": "GBP/JPY drops to its lowest level in nearly eight weeks amid firm Yen demand - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/amp/news/gbp-jpy-drops-to-its-lowest-level-in-nearly-eight-weeks-amid-firm-yen-demand-202602111630",
                "body": "GBP/JPY drops to its lowest level in nearly eight weeks amid firm Yen demand\n|- GBP/JPY slips to a fresh multi-week low as broad-based Yen strength keeps the cross under pressure for a third straight day.\n- The Yen remains supported after Japan’s election and optimism around Prime Minister Sanae Takaichi’s policy agenda.\n- BoE rate-cut expectations keep the Pound on the defensive.\nThe British Pound (GBP) remains on the back foot against the Japanese Yen (JPY) on Wednesday, with GBP/JPY sliding to its lowest level since December 19 amid broad-based strength in the Yen. At the time of writing, the cross is trading near 209.25, extending losses for a third straight day.\nRenewed demand for the Yen is driven by improving investor sentiment following Japan’s election result, after Prime Minister Sanae Takaichi secured a decisive victory in the general election. However, some caution persists as Takaichi is expected to push through a ¥21 trillion stimulus package and has proposed a temporary suspension of the consumption tax on food.\nDespite these concerns, investor optimism around Takaichi's policy agenda and the prospect of stronger economic growth continue to underpin sentiment toward Japanese assets, with Japan’s stock market surging to record highs.\nMeanwhile, political tensions in the United Kingdom appear to be easing, though this has done little to offer meaningful support to the Pound. Prime Minister Keir Starmer survived a leadership crisis linked to controversy over the appointment of Peter Mandelson as UK ambassador to the United States, after securing backing from his Cabinet and a large number of MPs from the Labour Party.\nSpeaking on Tuesday, Starmer sought to downplay internal divisions, saying that “the real fight is not within the Labour Party, but with the right-wing party.” He added that he would “never walk away from the mandate I was given to change this nation.”\nInvestors also expect the Bank of England (BoE) to begin cutting interest rates as early as March, after the central bank held its Bank Rate at 3.75% at the February meeting in a narrowly split 5-4 vote.\nAccording to a Reuters report last week, investors polled by the BoE expect the policy rate to be eased gradually to around 3.0% by the March 2027 meeting, reinforcing expectations of a steady easing cycle ahead.\nAgainst this backdrop, GBP/JPY remains vulnerable in the near term as policy divergence favours the Yen, with the Bank of Japan (BoJ) seen staying on a gradual normalisation path.\nExpectations for another rate hike have picked up after the central bank’s recent hawkish hold, and markets are now increasingly pricing the next BoJ rate increase for June.\nAttention now shifts to the UK’s Gross Domestic Product (GDP), Industrial and Manufacturing Production data, scheduled for release on Thursday.\nJapanese Yen Price Today\nThe table below shows the percentage change of Japanese Yen (JPY) against listed major currencies today. Japanese Yen was the strongest against the Swiss Franc.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Japanese Yen from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent JPY (base)/USD (quote).\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, includi"
            },
            {
                "title": "GBP/JPY Plummets: Yen's Stunning Surge Sends Cross To 8-Week Low - Bitcoin world",
                "source": "Bitcoin world",
                "url": "https://bitcoinworld.co.in/gbp-jpy-plunge-yen-surge/",
                "body": "LONDON, March 2025 – The GBP/JPY currency cross has tumbled decisively, striking its weakest level in nearly eight weeks as sustained demand for the Japanese Yen overwhelms the British Pound. This significant move, unfolding across global trading sessions, reflects a potent confluence of shifting monetary policy expectations and contrasting economic fundamentals between the United Kingdom and Japan. Consequently, forex traders and institutional investors are now closely scrutinizing the dynamics behind this pronounced downtrend.\nGBP/JPY Technical Breakdown and Immediate Catalysts\nThe GBP/JPY pair breached several key technical support levels this week, accelerating its decline. Market data confirms the pair now trades at its lowest point since late January 2025. This downward trajectory is not an isolated event but rather the culmination of building pressure. Primarily, a hawkish recalibration of expectations surrounding the Bank of Japan (BoJ) has fueled the Yen’s strength. Simultaneously, softer-than-anticipated UK economic indicators have applied consistent selling pressure on Sterling.\nAnalysts point to recent comments from BoJ officials hinting at a potential near-term adjustment to its yield curve control framework. Furthermore, stronger Japanese wage growth data has bolstered the argument for sustainable inflation. Conversely, in the UK, a combination of muted retail sales figures and dovish rhetoric from certain Bank of England members has tempered expectations for aggressive future rate hikes. This policy divergence forms the core narrative driving the current price action.\nThe Fundamental Drivers Behind Yen Strength\nThe Japanese Yen’s resurgence is rooted in a fundamental reassessment of Japan’s monetary policy landscape. For years, the BoJ maintained an ultra-accommodative stance, making the Yen a favored funding currency for carry trades. However, the global inflationary environment and domestic price pressures are forcing a gradual shift. Market participants are now actively pricing in a higher probability of policy normalization, which increases the Yen’s appeal.\nKey factors supporting the Yen include:\n- Inflation Persistence: Japan’s core inflation has remained at or above the BoJ’s 2% target for over a year, challenging the bank’s previous ‘transitory’ view.\n- Wage Growth Momentum: The recent Shunto spring wage negotiations resulted in the highest pay rises in decades, a critical precondition for the BoJ to consider policy shifts.\n- Global Rate Peak: As other major central banks like the Federal Reserve signal a pause, the interest rate differential that weakened the Yen is beginning to compress.\nThis shift marks a significant change in market psychology. Investors are no longer solely focused on borrowing Yen to invest in higher-yielding assets elsewhere. Instead, they are beginning to account for the currency’s potential appreciation based on changing fundamentals.\nExpert Insight: Navigating the Policy Shift\n“The market is delicately repricing the terminal point of BoJ accommodation,” notes Dr. Aiko Tanaka, Chief Currency Strategist at the Tokyo Institute for Financial Research. “While an abrupt end to negative rates is unlikely, the path is now clearly toward less extreme stimulus. This changes the calculus for crosses like GBP/JPY, where the rate advantage for Sterling is perceived to be narrowing. Traders are front-running this adjustment.” Historical data supports this view; periods of BoJ policy inflection have typically led to sustained Yen strength for several quarters.\nBritish Pound Under Pressure: Economic Headwinds\nWhile Yen strength is a primary driver, the British Pound’s relative weakness has equally contributed to the GBP/JPY decline. Recent UK economic data has painted a mixed picture, leaning toward stagnation rather than robust growth. High-frequency indicators suggest consumer spending is softening under the weight of persistent cost-of-living pressures and previous interest rate increases.\n"
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "3,564.0000",
            "open": "68,649.5400",
            "close": "67,738.5000",
            "high": "69,253.5000",
            "low": "65,689.5000"
        },
        "market_summary": "### BTC/USD Market Briefing  \n* **Key Drivers:** Large holders offloading **170,000+ BTC**, ETF outflows, hawkish Fed concerns.  \n* **Price Action:** Hovers near **$66,000**, down **47%** from all-time high.  \n* **Technical Outlook:** Key support at **$60,000**, potential drop to **$50,000**.  \n---\n**Overall Sentiment:** Bearish 📉  \n\n**Key Developments:**  \n- **Whale Activity:** Large wallets sold **170,000+ BTC** since December, signaling reduced buying pressure.  \n- **ETF Exposure:** Goldman Sachs cut BlackRock’s IBIT holdings by **39%** in Q4 2025.  \n- **Liquidity Boost:** Hong Kong approved margin financing using BTC/ETH as collateral.  \n- **Four-Year Cycle:** Analysts expect a **\"bear leg\"** with BTC potentially falling to **$50,000** by summer 2026.  \n\n**ETF Comparison:**  \n- **IBIT** ($65B AUM) dominates liquidity; **FBTC** ($17.7B AUM) offers similar exposure.  \n- Both charge **0.25%** expense ratio, down **16.3%** YTD.  \n- IBIT’s higher trading volume reduces costs for active traders.",
        "source_articles": [
            {
                "title": "Bitcoin bounce fades as it hovers around $66,000 - CNBC",
                "source": "CNBC",
                "url": "https://www.cnbc.com/2026/02/11/bitcoin-price-today-crypto-volatility.html",
                "body": "Bitcoin's short-lived bounce faded on Wednesday as the volatility in the world's largest cryptocurrency continued.\nBitcoin was trading at around $66,166 at 10:21 a.m. ET on Wednesday, down roughly 4% on the day.\nThe digital coin has been on a downward trajectory since hitting an all-time high above $126,000 in October with the sell-off intensifying over the last month. Bitcoin dropped below $70,000 on Feb. 5 and slid to hold just above $60,000, which is seen as a key level.\nBitcoin then recovered from those lows and was back above $70,000, but has struggled to push higher from that, remaining in the range of $66,000 and $72,000.\nOn Thursday, bitcoin was around 47% lower than its record high.\nSeveral factors have weighed on crypto markets, including volatility in technology stocks in the U.S., with which crypto assets often move in tandem with.\nMeanwhile, the Feb. 5 sell-off was triggered by a wave of liquidations — when traders are forced to close positions if the price of bitcoin hits a certain point. This has a cascading effect, which can exacerbate selling. Those liqudiations have since slowed down.\nInvestors are also considering whether there will be a shift in U.S. monetary policy following U.S. President Donald Trump's nomination of Kevin Warsh for Fed chair late last month.\nSelling from issuers of bitcoin exchange-traded funds, or ETFs, which are large holders of the digital coin, led to outflows from these ETFs. That added to the pressure on the digital coin. However, in the last three days, bitcoin ETFs have recorded net inflows.\nBitcoin cycle back in focus\nMarket participants are looking at whether bitcoin's typical cycle is intact. This refers to the historical pattern after an event known as halving, which often leads to new all-time highs for the cryptocurrency and a subsequent crash before new highs.\nBitcoin's halving — an event written into its code that happens every four years —reduces the rewards given to bitcoin miners and effectively slows down the supply of bitcoin on the market. The supply squeeze typically precedes rallies to fresh record highs for bitcoin. The most recent halving took place in April 2024.\nThere has been a debate as to whether the typical bitcoin cycle is over or if the patterns are breaking. But investors and analysts suggest the cycle is very much intact.\n\"2026 I expect to be a bear leg to the four-year cycle,\" Steven McClurg, CEO of Canary Capital, told CNBC on Wednesday. \"We have experienced several four-year cycles since bitcoin has launched and this is no different than any other.\"\nMcClurg added that he expects bitcoin to fall to as low as $50,000 in the summer before \"things turn around in the fall.\"\nMarkus Thielen of 10X Research told CNBC last week that bitcoin could fall to the $50,000 level."
            },
            {
                "title": "Key facts: Large Bitcoin holders sell 170,000 coins; Hong Kong approves margin financing; Goldman Sachs cuts Bitcoin ETF exposure - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/tradingview:0d0d25f54546b:0-key-facts-large-bitcoin-holders-sell-170-000-coins-hong-kong-approves-margin-financing-goldman-sachs-cuts-bitcoin-etf-exposure/",
                "body": "Key facts: Large Bitcoin holders sell 170,000 coins; Hong Kong approves margin financing; Goldman Sachs cuts Bitcoin ETF exposure\nLess than 1 min read\n- Large Bitcoin holders sold over 170,000 coins from major wallets since mid-December, indicating limited market participation in the current buying trend.1\n- Hong Kong's Securities and Futures Commission approved a framework for licensed brokers to offer margin financing using Bitcoin (BTC) and Ether (ETH) as collateral, enhancing market liquidity.23\n- Goldman Sachs reduced its Bitcoin ETF exposure in the fourth quarter of 2025, cutting its holdings in BlackRock's iShares Bitcoin Trust ETF by 39% and decreasing stakes in other Bitcoin-related funds.4"
            },
            {
                "title": "Is iShares Bitcoin Trust the Best Bitcoin ETF You Can Buy? - AOL.com",
                "source": "AOL.com",
                "url": "https://www.aol.com/finance/ishares-bitcoin-trust-best-bitcoin-212226768.html",
                "body": "Is iShares Bitcoin Trust the Best Bitcoin ETF You Can Buy?\nKey Points\nBoth IBIT and FBTC charge a 0.25% expense ratio and provide direct exposure to bitcoin’s price movements.\nIBIT is significantly larger by assets under management, while FBTC has a slightly smaller drawdown and had a marginally better one-year return as of Jan. 30, 2026.\nNeither ETF pays a dividend or yield, and both hold bitcoin almost exclusively, offering minimal diversification.\niShares Bitcoin Trust ETF (NASDAQ:IBIT) and Fidelity Wise Origin Bitcoin Fund (NYSEMKT:FBTC) both deliver pure-play bitcoin exposure with identical expense ratios, but differ in assets under management, trading statistics, and subtle variations in historical performance and risk.\nBoth iShares Bitcoin Trust ETF and Fidelity Wise Origin Bitcoin Fund are designed for investors seeking straightforward access to bitcoin price performance through traditional brokerage accounts, avoiding the technical and custody challenges of holding cryptocurrency directly. This comparison highlights the practical differences that may matter most for those weighing these two leading spot bitcoin ETFs.\nSnapshot (cost & size)\nBeta measures price volatility relative to the S&P 500; beta is calculated from five-year weekly returns. The 1-yr return represents total return over the trailing 12 months.\nBoth funds are priced at 0.25% annually, making them more affordable than most actively managed vehicles targeting alternative assets. With no dividend or yield offered by either ETF, cost efficiency is the primary differentiator on fees.\nPerformance & risk comparison\nWhat's inside\nFidelity Wise Origin Bitcoin Fund is a straightforward vehicle for bitcoin exposure, holding 99.98% of assets in Bitcoin (XBTUSD) and the remainder in net other assets. Sector allocation is not reported, but with just two holdings and over two years on the market, the fund is focused exclusively on tracking bitcoin’s price. There are no notable quirks or leverage resets, and the fund does not track a named index.\niShares Bitcoin Trust ETF is even more concentrated, with 100% of its portfolio in bitcoin and cash, and no sector diversification. Its assets under management (AUM) are much larger, at roughly $64.8 billion, and the fund’s top holdings mirror FBTC’s, with bitcoin dominating the exposure. Like FBTC, IBIT is structured for simplicity, with no additional overlays or quirks.\nFor more guidance on ETF investing, check out the full guide at this link.\nWhat this means for investors\nThese are the two largest spot bitcoin ETFs available to investors, but IBIT is far and away the largest at around $65 billion in assets under management. FBTC is a distant second with about $17.7 billion.\nThere really is no difference in holdings, as both are 100% invested in bitcoin and have basically identical returns. Both are down about 16.3% year-to-date and 26% over the past 12 months, as of Feb. 4.\nThe similarities don’t end there, as the two ETFs carry the same expense ratio of 0.25%. IBIT had a lower ratio to start, but it is now 0.25% for new investors.\nAdvertisement\nSo, what, if anything, would give the edge to one of these ETFs over the other? Obviously, if you are a Fidelity brokerage customer, it would be more convenient to buy on the Fidelity platform and have custody handled in-house. It would also be kept with your other investments.\nThe advantage IBIT has is that it provides greater liquidity from significantly more trading volume. This typically results in lower trading costs and faster trade execution.\nSo, in reality, there is not a huge difference between the two aside from convenience for Fidelity brokerage customers and the liquidity edge for the iShares ETF.\nShould you buy stock in Fidelity Wise Origin Bitcoin Fund right now?\nBefore you buy stock in Fidelity Wise Origin Bitcoin Fund, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Fid"
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "129.6500",
            "open": "2,006.5000",
            "close": "1,966.7000",
            "high": "2,029.6000",
            "low": "1,899.9500"
        },
        "market_summary": "### ETH/USD Market Briefing  \n* **Key Drivers:** BlackRock's DeFi move with BUIDL on Uniswap, tokenized equities integration with Chainlink, and high gas fee anomalies.  \n* **Price Action:** No specific price data provided; focus on ecosystem developments.  \n* **Technical Outlook:** Not applicable due to lack of price-specific data.  \n\n---  \n**Overall Sentiment:** Neutral 🔄  \n\n**Key Developments:**  \n- **BlackRock's DeFi Entry:** BlackRock listed its $2.2B tokenized U.S. Treasury fund, BUIDL, on Uniswap, marking its first DeFi step. UNI surged 25% on the news, now trading at $4.11.  \n- **Tokenized Equities Integration:** Chainlink launched live on-chain price feeds for Ondo Finance’s tokenized equities (SPYon, QQQon, TSLAon) on Ethereum, enabling DeFi lending and real-time price tracking.  \n- **High Gas Fee Anomaly:** A user paid 64 ETH (~$125,700) in gas fees for a single Ethereum transaction, highlighting network activity and potential scalability concerns.  \n\n**Implications:**  \n- BlackRock’s move signals institutional adoption of DeFi, potentially boosting Ethereum’s utility and demand.  \n- Tokenized equities integration expands Ethereum’s use cases in traditional finance, enhancing DeFi’s composability.  \n- High gas fees underscore Ethereum’s ongoing scalability challenges, which could impact user activity and sentiment.  \n\n**Next Steps:**  \n- Monitor UNI’s price action post-BlackRock announcement for market reaction.  \n- Track Ethereum’s gas fee trends and potential upgrades (e.g., EIP-4844) to address scalability.  \n- Watch for further institutional DeFi integrations and tokenized asset adoption.  \n\n---  \n**Overall Sentiment:** Neutral 🔄",
        "source_articles": [
            {
                "title": "Uniswap news: UNI surges 25% on BlackRock investment - CoinDesk",
                "source": "CoinDesk",
                "url": "https://www.coindesk.com/markets/2026/02/11/blackrock-takes-first-defi-step-lists-buidl-on-uniswap-as-uni-jumps-25",
                "body": "BlackRock takes first DeFi step, lists BUIDL on Uniswap as UNI jumps 25%\nBlackRock will make shares of its $2.2 billion tokenized U.S. Treasury fund tradable on the decentralized exchange Uniswap.\nWhat to know:\n- BlackRock will make shares of its $2.2 billion tokenized U.S. Treasury fund, BUIDL, tradable on the decentralized exchange Uniswap, marking its first move into DeFi.\n- UNI, the exchange's governance token, jumped 25% on the news.\n- Trading BUIDL on UniswapX will allow pre-qualified, whitelisted investors to swap the tokenized Treasury fund around the clock with approved market makers using stablecoins, with Securitize handling compliance.\nBlackRock, the world-wide largest asset manager, on Wednesday said it will make shares of its tokenized U.S. Treasury fund, BUIDL, tradable on Uniswap, marking the asset manager’s first step into decentralized finance (DeFi).\nAs part of the move, BlackRock also disclosed a strategic investment in Uniswap and purchased an undisclosed amount of UNI, Uniswap’s governance token, which surged 25% on the news, now trading at $4.11.\nBUIDL, which launched in 2024, is the largest tokenized U.S. Treasury fund on the market with nearly $2.2 billion in total value locked, according to data from rwa.xyz. It’s a blockchain-based fund backed 100% by U.S. Treasury bills and cash, offering yield on-chain.\nIts arrival on Uniswap — one of the largest decentralized exchanges — means investors can now trade the tokenized fund in a peer-to-peer setting without a traditional intermediary.\nTo make this work, BlackRock partnered with Uniswap Labs and Securitize, a firm that handles the regulatory and compliance legwork of tokenizing real-world assets. BUIDL shares will be available through UniswapX, a trading system that sources quotes from approved market makers and settles trades on the blockchain. All users must be pre-qualified and whitelisted through Securitize, which will facilitate the transactions.\n“This collaboration with Uniswap Labs alongside Securitize is a notable step in the convergence of tokenized assets with decentralized finance,” Robert Mitchnick, BlackRock’s global head of digital assets, said in a statement. “The integration of BUIDL into UniswapX marks a major leap forward in the interoperability of tokenized USD yield funds with stablecoins.”\nDeFi platforms like Uniswap allow users to trade assets, borrow, or earn yield without relying on centralized financial institutions. Instead, they run on smart contracts — self-executing code stored on public blockchains.\nUniswap, in particular, is the largest decentralized exchange on Ethereum\nThe integration allows qualified investors to swap BUIDL 24/7 with approved market makers using stablecoins.\nMore For You\nTrump-linked WLFI's Zak Folkman teases forex platform at Consensus Hong Kong\nFolkman says more details will be revealed soon at an event at Mar-a-Lago\nWhat to know:\n- World Liberty Financial, a Trump-family-linked crypto project, plans to launch a foreign exchange platform called World Swap as part of its USD1 stablecoin ecosystem.\n- Co-founder Zak Folkman said World Swap aims to simplify cross-border transfers and challenge traditional remittance providers that charge fees of 2% to 10% per transaction.\n- The company is building a broader financial stack around its cash-backed USD1 stablecoin, including the recently launched World Liberty Markets lending platform, which has attracted hundreds of millions of dollars in deposits."
            },
            {
                "title": "One user paid 64 ETH in gas fees for a single transaction, equivalent to approximately $125,700. - MEXC",
                "source": "MEXC",
                "url": "https://www.mexc.com/news/689601",
                "body": "PANews reported on February 11 that, according to Lookonchain, a user paid a gas fee of up to 64.09 ETH (approximately $125,700) when executing a transaction on Ethereum.\nDisclaimer: The articles reposted on this site are sourced from public platforms and are provided for informational purposes only. They do not necessarily reflect the views of MEXC. All rights remain with the original authors. If you believe any content infringes on third-party rights, please contact service@support.mexc.com for removal. MEXC makes no guarantees regarding the accuracy, completeness, or timeliness of the content and is not responsible for any actions taken based on the information provided. The content does not constitute financial, legal, or other professional advice, nor should it be considered a recommendation or endorsement by MEXC."
            },
            {
                "title": "Ondo enables real-time price feeds and DeFi lending - Cryptopolitan",
                "source": "Cryptopolitan",
                "url": "https://www.cryptopolitan.com/chainlink-brings-live-prices-to-ondo/",
                "body": "Chainlink, the leading decentralized oracle network, has launched live on-chain price feeds for Ondo Finance’s tokenized U.S. equities on the Ethereum blockchain.\nOndo Global Markets, the tokenization platform created by Ondo Finance, has integrated Chainlink Data Feeds to deliver reliable, institutional‑grade price information for tokenized stocks such as SPYon (a tokenized SPDR S&P 500 ETF), QQQon (a tokenized Invesco QQQ ETF), and TSLAon (a tokenized Tesla share).\nThese feeds are now live on Ethereum and updating in real time, allowing decentralized applications to reference accurate market data for these assets directly onchain.\nChainlink now gives Ondo’s tokenized stocks live price updates on Ethereum.\nLending in DeFi must be transparent, since proper pricing is key: the protocol must know and continue to follow the current value of the collateral asset as it moves. Without live prices, the protocol wouldn’t know when the asset is becoming risky, when it needs adjustment, or when it needs to be liquidated to protect the lending pool.\nTokenized equities (as opposed to passive investments) are now available for use on a DeFi protocol because they have real numbers on which it can establish rules for borrowing, collateral limits, and liquidation thresholds.\nOndo also said the tokenized stocks remain aligned with the real value of the equities they represent because the price feeds include updates like dividends and other corporate charges. This keeps tokens up to date, so DeFi apps can use the latest values that reflect what is happening in traditional stock markets.\nThe first group of supported tokenized equities is SPYon, representing the SPDR S&P 500 ETF, QQQon, representing the Invesco QQQ ETF, and TSLAon, representing Tesla stock. Ondo said they will add more tokenized stocks and ETFs with time as Chainlink covers more options and as DeFi protocols start integrating these assets.\nEuler now lets people borrow stablecoins by using Ondo’s tokenized stocks as collateral.\nUsers on the modular lending platform Euler can now use Ondo’s tokenized US stocks as collateral in a DeFi lending market and even borrow stablecoins against them. People can use these tokenized equities to unlock liquidity on Ethereum instead of just holding them to watch the price move.\nIt’s the first time people can use tokenized stocks as collateral in Ethereum-based lending, because users usually buy them for exposure but never use them as crypto assets like ETH or stablecoins.\nUntil now, tokenized real-world assets have been purely passive. Investors could hold a tokenized version of a stock and track its price, but they could not borrow against it, leverage it, or use it to generate income as traditional finance allows. In traditional finance, stocks are often used as collateral for loans, and Ondo wants to make this available in DeFi.\nNow, Ondo believes that the pieces are finally coming together. Tokenized stocks can begin to behave like true building blocks in decentralized finance, with strong liquidity driven by traditional stock exchanges, and Chainlink providing reliable on-chain price feeds.\nCEO of Euler, Jonathan Han, said users can now borrow against securities instead of selling them and giving up long-term profits.\nOf course, good markets require good risk management, especially when new forms of collateral are used. So Ondo said the Senator will set and monitor critical safety limits, such as collateral requirements, liquidation levels, and borrowing limits, to ensure the system remains stable even when markets become volatile.\nSentora CEO Anthony Demartino said retail investors didn’t have the freedom to use their securities before, but they can now use their assets productively while maintaining their long-term investments through tokenization.\nOndo also made it clear that lending is just the first step, as it plans to expand tokenized equities into vaults, structured products, and broader DeFi applications.\nSo, eventually, Ondo’s toke"
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "6.2520",
            "open": "82.3470",
            "close": "80.0600",
            "high": "84.2420",
            "low": "77.9900"
        },
        "market_summary": "### SOL/USD Market Briefing\n* **Key Drivers:** ICE launches CoinDesk futures; Solana meme coin PIPPIN surges 20% to $450M market cap.\n* **Price Action:** Trading at **$122**, down **47%** YoY; neutral RSI suggests potential long-term buy.\n* **Technical Outlook:** Neutral sentiment, RSI indicates oversold conditions could attract buyers.\n---\n**Overall Sentiment:** Mixed ⚖️",
        "source_articles": [
            {
                "title": "Best Altcoin to Hold For Now – SUI or Solana SOL? - Altcoin Buzz",
                "source": "Altcoin Buzz",
                "url": "https://www.altcoinbuzz.io/cryptocurrency-news/best-altcoin-to-hold-for-now-sui-or-solana-sol/",
                "body": "Bitcoin’s been holding steady around $90K, but alts? They’re a mixed bag in early 2026. Solana’s ecosystem is pumping with memecoin frenzy and DeFi revivals, while Sui is quietly stacking real tech wins.\nWhich one sets you up better for the rest of the year? Sui or Solana? Let’s check it out!\nSolana: The High Speed Casino Crushing On Volume\nSolana’s always been the speed demon of blockchains. It processes thousands of transactions per second with that Proof-of-History magic.\nIt’s a timestamp system that lets validators agree on order without endless chit-chat. We’ve seen it handle 65,000 TPS in tests, way faster than Ethereum’s base layer. Think of it like this. It’s like a Ferrari on a racetrack, blazing past competitors when the network’s humming.\nThis is powered by an intelligent routing system on Solana’s blazing-fast blockchain—a true game-changer that could redefine the standard for on-chain payments forever! 🚀\nSolana dominates nearly every test with its insane ~65,000 theoretical TPS, sub-second finality (~400ms…\n— ChainX (@FreedomXTech) December 13, 2025\nThat said, outages have bitten us before. Remember those 2022 downtimes? Solana’s improved with Firedancer upgrades, but congestion from memecoins still spikes fees.\nEcosystem-wise, it’s exploding. Jito’s restaking hit $2B TVL by Jan 2026. Pump.fun launched 1.2 million tokens last month alone and 37,000 yesterday.\nJito – @jito_sol TVL climb from around $648 million in early 2024 to more than $2.3 billion today + $50M investment in JitoSol by a16z https://t.co/1tGO4q3hrA\n— Gally Sama (@hdcharting) November 14, 2025\nAnd DeFi on Solana? Jupiter DEX aggregator swapped $150B volume in Q1 2026. Pretty sweet.\nNFTs and gaming? Magic Eden dominates with 40% market share, and Helium migrated for IoT scalability. Developers love it as you see with 3 million daily active wallets during 2025 . Something we love: the mobile push with Solana’s Seeker phone. They are serious about getting into mobile.\nPrice Action\nSOL trades at $122 at a market cap of $69B, per Coingecko. It’s down 47% in the last 12 months. RSI as are most of the oscillator indicators on TradingView are neutral. And that’s OK for now. It also means sentiment isn’t that great and it could be a bargain for a long-term buy at this price.\nSui: Making the Most of Move\nSui flips the script with its object-centric model using Move language.\nIt’s like combining the Rust language’s safety with parallel execution. No more global state bottlenecks like Ethereum or even Solana.\nIt shards data so transactions process independently, hitting 297,000 TPS in lab tests late 2025. Why does this matter? It’s like upgrading from a single-lane highway to infinite parallel lanes. No traffic jams during peaks. And remember, sharding is Ethereum’s ultimate goal for scalability. Sui does it already.\nSui’s Mysticeti consensus achieves up to 297k TPS in tests, outpacing Aptos’ 13k mainnet peak, though real-time averages are similar at ~25 tx/s for both; Sui leads in TVL at $2.6B vs Aptos’ $0.5B as of 2026.\nA purple monkey horse hybrid logically combines primate agility with…\n— Grok (@grok) January 18, 2026\nThe ecosystem’s maturing fast. TVL surged to $850 million, led by Navi Protocol’s lending at $284M. DeepBook, their native aggregator, makes a lot of that volume happen in the background.\nIn The Sui Stack, Walrus storage enables blob throughput. That’s big blocks of unstructured data. It has led to a 400% increase in AI data. It’s 17 TB worth of data now.\n🚨 HUGE: 17.8 TB uploaded to Walrus yesterday 🦭\nOur largest single-day upload ever. More than double the previous record.\nThe infrastructure is handling enterprise-scale data exactly as designed. pic.twitter.com/MNucIeu0xN\n— Walrus 🦭/acc (@WalrusProtocol) January 27, 2026\nInstitutions? Franklin Templeton tokenized funds on Sui, $250M AUM already. And zkLogin lets users sign in with Google. This easier onboarding exploded to more than 2M wallets. Our crack Research Team’s been tracking this. S"
            },
            {
                "title": "ICE’s CoinDesk crypto futures are live, with DeFi rate contracts next on the list - CoinDesk",
                "source": "CoinDesk",
                "url": "https://www.coindesk.com/markets/2026/02/11/ice-s-coindesk-crypto-futures-are-live-with-defi-rate-contracts-next-on-the-list",
                "body": "ICE’s CoinDesk crypto futures are live, with DeFi rate contracts next on the list\nThe NYSE owner’s CoinDesk index futures began trading Monday. Attention now shifts to planned USDC rate futures tied to onchain borrowing costs.\nWhat to know:\n- Intercontinental Exchange has begun trading cash-settled cryptocurrency futures tied to seven CoinDesk indices, including broad-market and single-asset contracts for bitcoin, ether, solana, XRP and BNB.\n- The new futures are dollar-settled and aimed at institutions seeking crypto price exposure without the operational and custody challenges of holding tokens directly.\n- ICE plans to introduce One Month CoinDesk Overnight Rates USDC futures, pending regulatory review, to bring decentralized finance-style onchain interest rates into regulated markets and expand crypto’s role as a funding and credit market.\nHONG KONG — Intercontinental Exchange, the owner of the New York Stock Exchange, began trading a new set of cryptocurrency futures tied to CoinDesk benchmarks earlier this week with plans to bring onchain interest rates into regulated markets next.\nThe contracts went live on Monday after being announced Jan. 9, ICE said, offering cash-settled, U.S. dollar denominated futures linked to seven CoinDesk indices.\nThat includes broad-market products tied to the CoinDesk 20 and CoinDesk 5 indices, alongside single-asset futures tracking bitcoin, ether, solana, XRP and BNB.\nBecause they settle in dollars rather than delivering tokens, the products are aimed at institutions that want price exposure without the operational and custody friction of spot crypto.\nUp next is ICE’s stated plan to list One Month CoinDesk Overnight Rates USDC futures, subject to regulatory review, the companies said in a press release.\nThese products are designed to reflect the annualized effective interest rate paid by borrowers in decentralized finance markets, a crypto-native analogue to the way traditional markets trade expectations around overnight benchmarks such as SOFR — which serves as a reference interest rate that helps financial experts price loans and other dollar-based financial products.\nSuch rates products shift the conversation toward crypto as a funding and credit market, where traders can express views on borrowing costs and liquidity conditions rather than only whether bitcoin goes up or down.\nICE also pointed to the scale already built around CoinDesk indices, saying tens of billions of dollars are tied to the benchmarks. The CoinDesk 20, ICE said, is designed to represent most of the digital asset market through a capped market-cap weighted methodology.\nMore For You\nTrump-linked WLFI's Zak Folkman teases forex platform at Consensus Hong Kong\nFolkman says more details will be revealed soon at an event at Mar-a-Lago.\nWhat to know:\n- World Liberty Financial, a Trump-family-linked crypto project, plans to launch a foreign exchange platform called World Swap as part of its USD1 stablecoin ecosystem.\n- Co-founder Zak Folkman said World Swap aims to simplify cross-border transfers and challenge traditional remittance providers that charge fees of 2% to 10% per transaction.\n- The company is building a broader financial stack around its cash-backed USD1 stablecoin, including the recently launched World Liberty Markets lending platform, which has attracted hundreds of millions of dollars in deposits."
            },
            {
                "title": "Solana Ecosystem Meme Coin PIPPIN Continues to Surge, Market Cap Surpasses $450 Million, Up Over 20% in 24 Hours - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605193631",
                "body": "BlockBeats News, February 11th, according to GMGN monitoring, the Solana ecosystem Meme coin PIPPIN has been continuously rising since February 6th, with its market value increasing from a low of about $160 million to $450 million, and a 20% increase in the past 24 hours.\nBlockBeats reminds users that Meme coin trading is highly volatile, relies heavily on market sentiment and hype, has no actual value or use case, and investors should be aware of the risks."
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "607.000",
            "open": "50,267.740",
            "close": "50,124.370",
            "high": "50,508.340",
            "low": "49,901.340"
        },
        "market_summary": "### US30 (Dow Jones Industrial Average) Market Briefing\n* **Key Drivers:** Stronger-than-expected January jobs report, earnings reactions.\n* **Price Action:** Closed down **0.1%** after three consecutive record highs.\n* **Market Sentiment:** Cautious 📉\n\n**Technical Outlook:** Minor pullback after bullish streak; support levels under observation.\n\n**Key Movers:**\n* **Decliners:** Mattel (-25%), Lyft (-17%), Robinhood (-9%)\n* **Gainers:** Hinge Health (+17%), Cloudflare (+5%), T-Mobile (+5%), Ford (+2%)\n\n**Economic Data Impact:**\n* January jobs added: **130,000** (vs. 55,000 expected)\n* Unemployment rate: **4.3%** (down from 4.4%)\n* Treasury yields: **4.18%** (up from 4.15%)\n\n**Fed Outlook:** 94% probability of no rate change in March (up from 80%).\n\n**Sector Rotation:** AI/software stocks under pressure; earnings-driven volatility dominates.\n\n**Overall Sentiment:** Neutral-to-negative amid data recalibration and mixed earnings.",
        "source_articles": [
            {
                "title": "Futures: Two Dow Earnings Movers After Market Pauses - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-cisco-mcdonalds-applovin-earnings/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #111bcd88-07df-11f1-9129-515cc83e11ff"
            },
            {
                "title": "Markets News, Feb. 11, 2026: Major Indexes Close Lower After Stronger-Than-Expected January Jobs Report, Earnings Flurry - Investopedia",
                "source": "Investopedia",
                "url": "https://www.investopedia.com/stock-market-today-dow-jones-s-and-p-500-02112026-11904254",
                "body": "Major stock indexes ended slightly lower Wednesday as investors digested a flurry of earnings and a January U.S. employment report that came in better than economists expected.\nThe tech-heavy Nasdaq and blue-chip Dow Jones Industrial Average finished down 0.2% and 0.1%, respectively, while the benchmark S&P 500 closed less than a point lower. The Dow had set both intraday and closing record highs the previous three sessions.\nBureau of Labor Statistics data released before the open revealed U.S. employers added 130,000 jobs in January, well above the 55,000 expected. The unemployment rate ticked down to 4.3% from 4.4% in December; economists expected it to remain unchanged.\nThe yield on the 10-year Treasury—which impacts interest rates on a variety of consumer loans including mortgages—was at 4.18% at 4 p.m. ET, up from Tuesday's close below 4.15%. CME Group's FedWatch tool indicated traders expect a 94% likelihood that the Federal Reserve will keep interest rates steady at its March meeting, up from about 80% yesterday.\n\"The immediate reaction was textbook: bond yields moved higher as traders recalibrated rate-cut expectations,\" Siebert Financial CIO Mark Malek said. \"For now, policymakers get a pass. There is nothing in this report that forces their hand toward immediate easing.\"\nMagnificent Seven stocks finished mixed Wednesday, with Nvidia (NVDA) and Tesla (TSLA) rising less than 1% apiece. Google parent Alphabet (GOOGL) was the biggest decliner with a 2.4% pullback.\nShares of Mattel (MAT) plummeted 25%, Lyft (LYFT) sank 17%, Robinhood Markets (HOOD) retreated 9%, and Humana (HUM) fell more than 3%. Meanwhile, Hinge Health (HNGE) popped 17%, Cloudflare (NET) advanced 5%, T-Mobile US (TMUS) rose 5%, and Ford Motor (F) gained nearly 2%.\nBitcoin was trading near $67,600, down from overnight highs around $69,200. The U.S. dollar index, which tracks the value of the greenback against a basket of global currencies, ticked higher to 96.86.\nGold futures rose 1.6% to $5,110 an ounce, while silver futures surged 4.5% to above $84 an ounce. West Texas Intermediate crude futures, the U.S. benchmark, were 1.5% higher to near $65 a barrel.\nRobinhood's CEO Says a Prediction Markets 'Supercycle' Is Just Starting\nInvestors dumped shares of Robinhood Wednesday after the company reported disappointing quarterly results. Its CEO says they should be excited about its newest slate of offerings, particularly in prediction markets.\n\"We're just at the beginning of a prediction market supercycle that could drive trillions in annual volume over time,\" Vlad Tenev told investors during the company's earnings call late Tuesday, according to a transcript provided by AlphaSense.\nRobinhood said in its earnings report that its prediction markets volume more than doubled in the fourth quarter, with $12 billion in contracts in the first full year of operations in 2025. The company said it's already at $4 billion so far this year.\nRead the full article here.\nThese 5 Software Stocks Could Double in Price This Year, Says Morgan Stanley\nSoftware stocks may be down, but they’re not out, according to analysts at Morgan Stanley.\nShares of software companies have been hammered this year by concerns that AI will upend the industry. The iShares Expanded Tech-software Sector ETF (IGV) has shed more than a fifth of its value since the start of the year, led lower by industry giants Intuit (INTU), ServiceNow (NOW), and Salesforce (CRM).\nInvestors entered the year worried that increased competition from AI-native startups will pressure incumbents’ profit margins and AI tools will shrink corporate headcount, limiting seat-based revenue growth. Those fears reached a fever pitch last week when the release of AI legal tools by Anthropic sparked a sell-off dubbed “SaaSpocalypse.”\nThe rout was “broad and largely indiscriminate, with limited differentiation across business models or fundamentals,” wrote Morgan Stanley analysts in a note on Wednesday. That, they say, has created b"
            },
            {
                "title": "Stock Market Today: Vertiv Sparks Strong Buying In AI, Chip Stocks; Nasdaq-100 Rallies, Dow Cools (Live Coverage) - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-sp500-nasdaq-jobs-report-astera-robinhood/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #15ab5700-07df-11f1-abb6-a15f963f6c51"
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "160.000",
            "open": "10,380.210",
            "close": "10,508.710",
            "high": "10,525.410",
            "low": "10,365.410"
        },
        "market_summary": "No relevant news articles were found to generate a summary.",
        "source_articles": []
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "218.250",
            "open": "25,028.660",
            "close": "24,919.660",
            "high": "25,055.160",
            "low": "24,836.910"
        },
        "market_summary": "### GER40 Market Briefing  \n* **Key Drivers:** ECB policy uncertainty, euro/USD volatility, German manufacturing weakness.  \n* **Price Action:** Choppy, range-bound near resistance; rallies sold, dips aggressively bought.  \n* **Technical Outlook:** Key support at recent lows; resistance near current levels.  \n---\n**Overall Sentiment:** Neutral ⚖️  \n\n**Sector Rotation:**  \n- **Autos (VW, BMW, Mercedes):** Under pressure from EV transition, China competition, and margin squeeze.  \n- **Industrials (Siemens):** Holding relative strength amid macro uncertainty.  \n- **Tech (SAP):** Limited exposure but benefiting from global software demand.  \n\n**Macro Themes:**  \n- ECB in \"wait-and-see\" mode; inflation sticky, growth fragile.  \n- Euro weakness supports exporters; strength acts as earnings headwind.  \n- German manufacturing PMIs signal contraction; energy costs remain elevated.  \n\n**Risk/Reward:** Tactical trading range; no clear trend. Watch ECB/Fed divergence and auto sector health.",
        "source_articles": [
            {
                "title": "DAX 40: Hidden Time Bomb or Once-in-a-Decade Opportunity for Global Traders? - AD HOC NEWS",
                "source": "AD HOC NEWS",
                "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/dax-40-hidden-time-bomb-or-once-in-a-decade-opportunity-for-global/68574456",
                "body": "DAX 40: Hidden Time Bomb or Once-in-a-Decade Opportunity for Global Traders?\n12.02.2026 - 06:48:12Get the professional edge. Since 2005, the 'trading-notes' market letter has delivered reliable trading recommendations – three times a week, directly to your inbox. 100% free. 100% expert knowledge. Simply enter your email address and never miss a top opportunity again. Sign up for free now\nVibe Check: The DAX 40 is locked in a tense, emotional phase – not a euphoric melt-up, not a full-blown panic crash, but a nervous, choppy battlefield where every macro headline from Frankfurt or Berlin triggers sharp intraday swings. German blue chips are trading in a wide, volatile range, with recurring spikes of profit taking followed by aggressive dip-buying from global funds that still see Europe as a discounted play versus the U.S.\nWant to see what people are saying? Check out real opinions here:\n- Watch deep-dive DAX 40 technical breakdowns on YouTube\n- Scroll Instagram visuals of Germany's blue-chip stock trends\n- Tap into viral TikTok clips on live DAX trading setups\nThe Story: The DAX 40 right now is where global macro, central bank drama, and sector rotation collide. To understand the opportunity and the risk, you need to zoom out beyond the candles and look at the big levers: the ECB, the euro, German industry, and institutional flows.\n1. ECB Policy: Why Christine Lagarde is basically your 41st DAX stock\nThe European Central Bank is the dominant narrative driver for the DAX. Every sentence from Christine Lagarde and her colleagues is currently interpreted through one question: will Europe stay in a prolonged stagnation zone, or is a monetary-policy-backed rebound brewing?\nThe ECB has already shifted from ultra-aggressive inflation fighting to a more cautious, data-dependent stance. Markets are constantly repricing how many cuts are coming and how fast. That repricing is what you see in the DAX: when traders think the ECB will ease sooner, German exporters and rate-sensitive cyclicals catch a strong bid; when the tone sounds more hawkish, the index quickly slides as recession worries resurface.\nThe euro / USD correlation amplifies this. When the euro weakens versus the dollar, German exporters look relatively more attractive because their products become more competitive abroad and foreign revenues translate into more euros. That tends to support the DAX, especially its industrial, chemical, and auto heavyweights. When the euro strengthens on hopes of a more robust European recovery or a less aggressive Fed, the DAX can face short-term pressure as the currency headwind bites, especially if global risk appetite is already shaky.\nSo the game plan many institutions are playing is simple:\n- If ECB guidance tilts toward looser policy while the Fed stays cautious, euro softness plus cheaper money in Europe can create a powerful backdrop for a German equity rebound.\n- If the ECB stays nervous about inflation and delays cuts while growth data stays weak, the DAX remains in a vulnerable, headline-driven chop zone where rallies are sold and dip-buying is more tactical than long term.\nThis is why you cannot trade the DAX as a closed German story. You are trading the spread between ECB and Fed expectations, plus the euro FX chart, every single day.\n2. Sector Check: German Autos vs. Tech and Industrials – the internal tug-of-war\nThe next big piece of the puzzle is the internal sector rotation within the DAX. On one side you have the classic German auto giants and old-economy exporters. On the other, more scalable, higher-margin players like SAP and industrial tech champions such as Siemens.\nAutos: VW, BMW, Mercedes – from national pride to macro headache\nThe German auto industry is under enormous structural and cyclical pressure:\n- EV transition: Legacy internal combustion businesses are still significant cash cows, but EV competition from the U.S. and especially China is brutal. Margin pressure is intense, and markets are questioning long-term "
            },
            {
                "title": "DAX 40: Hidden Opportunity or Stealth Risk Trap for Global Bulls Right Now? - AD HOC NEWS",
                "source": "AD HOC NEWS",
                "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/dax-40-hidden-opportunity-or-stealth-risk-trap-for-global-bulls-right/68574045",
                "body": "DAX 40: Hidden Opportunity or Stealth Risk Trap for Global Bulls Right Now?\n12.02.2026 - 03:14:36Get the professional edge. Since 2005, the 'trading-notes' market letter has delivered reliable trading recommendations – three times a week, directly to your inbox. 100% free. 100% expert knowledge. Simply enter your email address and never miss a top opportunity again. Sign up for free now\nVibe Check: The DAX 40 is in a tense, relatively elevated zone, grinding near important resistance with a mix of cautious optimism and under-the-surface nerves. Not a euphoric melt-up, not a panic crash—more like a mature, tactical market where every dip and every spike is getting faded fast by pros.\nWant to see what people are saying? Check out real opinions here:\n- Watch in-depth YouTube breakdowns of the latest DAX 40 setups\n- Scroll Instagram for fresh German stock market mood and chart posts\n- Binge viral TikTok clips on live DAX trading strategies\nThe Story: The DAX 40 right now is a classic push-and-pull battlefield: macro headwinds from the ECB and weak German manufacturing versus structural strength from global champions like SAP and Siemens, plus global flows quietly rotating back into Europe.\nOn the macro level, the European Central Bank under Christine Lagarde is the main puppet master. Inflation in the euro area has cooled from the extreme levels of the energy crisis, but it has not disappeared. That keeps the ECB in this awkward middle lane: they cannot slash rates aggressively like traders would love, but they also cannot stay ultra-hawkish without choking an already fragile German economy.\nThe key for DAX traders: every hint from Lagarde about future rate paths can become a catalyst. When the ECB sounds slightly more dovish—talking about softening inflation trends or acknowledging weak growth—German equities tend to catch a bid, because lower yields boost valuations and soften the pressure on cyclical sectors like autos and industrials. When the language tilts more hawkish—focused on persistent inflation or warning about premature easing—the DAX tends to wobble as bond yields rise and risk appetite cools.\nThen there is the Euro vs. US Dollar. This FX pair is absolutely crucial. A softer euro usually helps the DAX because so many German giants are export machines. A weaker euro makes their products cheaper abroad and inflates their foreign earnings when converted back into euros. Conversely, a strong euro is basically a hidden tax on exporters and a headwind for profit margins. Recently, the euro has been moving in a choppy sideways-to-soft pattern against the dollar, reflecting uncertainty about who cuts rates faster: the ECB or the Fed.\nThat tug-of-war creates a weird but tradeable environment for the DAX: not a screaming bull trend based on massive stimulus, but a rolling, tactical market where each macro data point (inflation prints, PMI data, Fed speeches, ECB minutes) can flip the short-term direction. Add in the fact that US markets still dominate global sentiment: if the S&P 500 wobbles, the DAX often reacts immediately, regardless of domestic German news.\nOn CNBC Europe and across financial media, the narrative right now is dominated by three themes that DAX traders simply cannot ignore:\n- Lingering recession fears in Germany and the eurozone, with growth indicators showing fatigue rather than acceleration.\n- Persistent weakness in German manufacturing PMIs, signaling contraction or at best stagnation in the industrial backbone of Europe.\n- Energy prices that have come down from crisis peaks, but remain structurally elevated and volatile compared to the pre-2020 era, especially for heavy industry.\nThis mix leads to a market that is not priced for disaster but also not fully buying a strong recovery story. In other words: the perfect playground for active traders.\nDeep Dive Analysis: Let's talk about the elephant in the German room: the automotive sector. The classic DAX story used to be straightforward—own Volkswagen, BM"
            },
            {
                "title": "DAX 40: Hidden Opportunity Or Macro Trap Waiting To Smash Late Bulls? - AD HOC NEWS",
                "source": "AD HOC NEWS",
                "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/dax-40-hidden-opportunity-or-macro-trap-waiting-to-smash-late-bulls/68573938",
                "body": "DAX 40: Hidden Opportunity Or Macro Trap Waiting To Smash Late Bulls?\n12.02.2026 - 01:18:22Get the professional edge. Since 2005, the 'trading-notes' market letter has delivered reliable trading recommendations – three times a week, directly to your inbox. 100% free. 100% expert knowledge. Simply enter your email address and never miss a top opportunity again. Sign up for free now\nVibe Check: The DAX 40 is in a tense, psychological battleground right now. No clean moonshot, no catastrophic collapse—just a nervous, choppy range where every rally feels suspicious and every dip gets hunted by aggressive dip-buyers. German blue chips are trading like they are testing important zones, with price action swinging between cautious optimism and sudden risk-off waves.\nWant to see what people are saying? Check out real opinions here:\n- Watch fresh DAX breakdowns from top YouTube traders\n- Scroll the latest German stock market mood on Instagram\n- Binge fast-paced DAX trading strategies on TikTok\nThe Story: What is actually driving this weird, fragile DAX environment? Let’s unpack the real macro story behind German stocks, because this is not just a chart game—this is ECB policy, energy prices, global flows, and an industrial model under pressure.\n1. ECB Policy – Christine Lagarde vs. Reality\nThe European Central Bank is walking a tightrope. Inflation in the eurozone has been easing, but it is still sticky enough to keep the ECB in a cautious stance. That means: no wild dovish pivot, but also no appetite to crush the economy further. Lagarde is basically trying to look tough on inflation while quietly praying that growth does not fall off a cliff.\nFor the DAX 40, this is critical. When traders see a central bank in this kind of \"wait and see\" mode, two things happen:\n- Rate cut expectations get traded aggressively in advance.\n- Every ECB press conference becomes a volatility event for German equities.\nEuro vs. USD – The Currency Cheat Code\nThe euro vs. the US dollar is another hidden driver. When the euro weakens against the dollar, German exporters suddenly look more competitive on the global stage. Their products become cheaper in dollar terms, which can support earnings for the big industrials and automakers. That’s why a softer euro often lines up with supportive underlying flows into the DAX—even if headlines are pessimistic.\nBut this cuts both ways. A stronger euro, triggered by expectations that the ECB will stay tighter for longer than the Fed, can act like a headwind for earnings. In that environment, the DAX can look fragile even if the charts still show a grinding uptrend. Right now, traders are stuck in this push-pull environment: central-bank watchers vs. macro bears vs. earnings optimists.\n2. Sector Check – Autos Under Pressure, Tech and Industrials Holding the Line\nThe DAX is not the S&P 500. It is not a pure tech index. It is old-school Europe: autos, industry, chemicals, financials—with a few modern heavyweights like SAP trying to drag it into the digital age.\nGerman Auto Industry: From Superstar to Problem Child\nVolkswagen, BMW, Mercedes-Benz Group and their extended ecosystem used to be the unstoppable engine of the DAX. Now, they sit at the center of every structural risk narrative:\n- China dependence: German automakers are deeply exposed to China, a market where local EV makers are stepping up with cheaper, aggressively subsidized, tech-savvy models.\n- EV transition: Legacy combustion platforms, huge capex for EVs, and brutal competition from Tesla and Chinese brands create margin pressure and execution risk.\n- Regulation and climate policy: European emissions rules are constantly tightening, forcing more investment into new drivetrains and tech, squeezing profitability.\n- Consumer sentiment: With weak German and European growth, big-ticket car purchases can be delayed—bad news for order books.\nThis cocktail leaves the auto segment in the DAX looking vulnerable. Whenever macro news turns sour or China headlines worsen,"
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "405.870",
            "open": "25,177.150",
            "close": "25,191.070",
            "high": "25,378.650",
            "low": "24,972.780"
        },
        "market_summary": "### NDX100 Market Briefing\n* **Key Drivers:** Strong January jobs report (**130,000** nonfarm payrolls) complicates Fed's rate path; focus shifts to Friday's CPI data.\n* **Price Action:** Nasdaq 100 futures climbed **0.1%**; major indexes ended **little changed** amid mixed signals.\n* **Technical Outlook:** Support levels under scrutiny as AI and chip stocks rally; Cisco down **7%** post-earnings miss.\n---\n**Overall Sentiment:** Neutral ⚖️\n\n**Earnings Highlights:**\n- **Coinbase (COIN), Applied Materials (AMAT), Rivian (RIVN)** report before weekend.\n- **Cisco (CSCO)** tumbles **7%** after missing profit expectations.\n- **McDonald's (MCD)** slips despite topping earnings estimates.\n\n**Market Context:**\n- Resilient labor market paired with sticky inflation reduces likelihood of near-term Fed rate cuts.\n- Over **40%** of traders now expect Fed to hold rates steady through June.\n- AI and chip stocks show strong buying interest, lifting Nasdaq-100.\n\n**Upcoming Catalyst:**\n- Friday's **Consumer Price Index (CPI)** report as Fed's preferred inflation gauge.",
        "source_articles": [
            {
                "title": "Stock market today: Dow, S&P 500, Nasdaq futures steady after jobs surprise puts focus back on Fed's rate path - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-climb-after-jobs-surprise-puts-focus-back-on-feds-rate-path-233948599.html",
                "body": "Stock market today: Dow, S&P 500, Nasdaq futures climb after jobs surprise puts focus back on Fed's rate path\nUS stock futures made gains Thursday morning after the Dow snapped a three-session winning streak, as investors adapted to a stronger-than-expected January jobs report.\nFutures tied to the Dow Jones Industrial Average (YM=F) and S&P 500 (ES=F) rose around 0.2% while Nasdaq 100 futures (NQ=F) climbed 0.1%. The muted futures action followed a choppy session on Wall Street, as all of the major indexes ended little changed.\n(ES=F)\nIn after-hours trading, Cisco Systems (CSCO) tumbled roughly 7% after missing profit expectations. McDonald’s (MCD) slipped modestly despite topping earnings estimates.\nMarkets initially climbed following the highly anticipated reveal of the January jobs report. Nonfarm payrolls increased by 130,000 last month, trouncing analyst forecasts, even as end-of-year reports for 2025 were revised to show a significantly slower pace of job growth last year.\nHowever, the strength in hiring at the start of the year complicates expectations for Federal Reserve policy. A resilient labor market, paired with sticky inflation, could reduce the likelihood of near-term rate cuts, a key driver behind recent equity gains.\nAttention now turns to Friday’s Consumer Price Index report, the Fed's preferred measure of inflation. A softer reading will build hopes that price pressures are easing even as economic growth remains intact.\nOn the earnings front, Coinbase (COIN), Applied Materials (AMAT), and Rivian (RIVN) are highlights from the reports scheduled before the weekend.\nLIVE 2 updates"
            },
            {
                "title": "Stock Market Today: Vertiv Sparks Strong Buying In AI, Chip Stocks; Nasdaq-100 Rallies, Dow Cools (Live Coverage) - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-sp500-nasdaq-jobs-report-astera-robinhood/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #652ed0fc-07df-11f1-ad92-cc5e37d81b6a"
            },
            {
                "title": "Stock market today: Dow, S&P 500, Nasdaq end little changed as strong jobs report complicates Fed's rate path - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-end-little-changed-as-strong-jobs-report-complicates-feds-rate-path-210046056.html",
                "body": "Stock market today: Dow, S&P 500, Nasdaq end little changed as strong jobs report complicates Fed's rate path\nUS stocks were little changed on Wednesday, as investors digested a January jobs report that blew past expectations on a monthly basis. The report signaled a resilience in the labor market despite showing a heavily revised picture for last year, but it also bolstered the case for interest rates to stay on hold for the foreseeable future.\nThe blue chip-focused Dow Jones Industrial Average (^DJI) fell 0.1% to retreat from its record high, while the S&P 500 (^GSPC) slipped below the flatline. The tech-heavy Nasdaq Composite (^IXIC) fell 0.1%.\n(^DJI)\nAfter a bruising recent run of labor market data, the unexpectedly strong \"Super Bowl of jobs reports\" showed the US economy added 130,000 positions in January, Bureau of Labor Statistics data showed on Wednesday. The unemployment rate ticked down slightly to 4.3% from 4.4%.\nHowever, the bullish monthly data was counterbalanced by heavy revisions to 2025 numbers, which brought the year's payrolls growth at 181,000, down from the previously reported 584,000 additions. That represents the weakest annual job growth since 2003, outside of a recession.\nWednesday's surprise is feeding into bets on Federal Reserve rate cuts, which had been bolstered by soft December retail data that revealed fresh signs of weakness in the economy. Markets are now pricing in a bigger possibility that the Fed will hold rates steady in the coming months, with over 40% expecting the central bank to now stand pat through June. Most traders are still pricing in two cuts by the end of the year.\nEarnings season could provide further insight into the American consumer as well as Corporate America, with McDonald's (MCD) reporting after the bell, while Kraft Heinz (KHC) said in its earnings release Tuesday morning that it would pause its spin-off plans.\nAfter the market close, Cisco's (CSCO) quarterly report comes as the tech stalwart takes on Nvidia (NVDA) for Big Tech spending with a new AI networking chip.\nLIVE 20 updatesModerna stock plunges after FDA refuses to review influenza vaccine application\nReuters reports:"
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "79.490",
            "open": "6,953.160",
            "close": "6,943.820",
            "high": "6,992.070",
            "low": "6,912.580"
        },
        "market_summary": "### SPX500 Market Briefing\n* **Key Drivers:** No relevant financial or economic news identified.\n* **Price Action:** No market data available.\n* **Technical Outlook:** No technical analysis applicable.\n\n**Overall Sentiment:** Neutral ⚖️",
        "source_articles": [
            {
                "title": "Dr. James Record to step down as dean of the Elson S. Floyd College of Medicine - WSU Insider",
                "source": "WSU Insider",
                "url": "https://news.wsu.edu/news/2026/02/11/dr-james-record-to-step-down-as-dean-of-the-elson-s-floyd-college-of-medicine/",
                "body": "Dr. James Record has announced his intention to step down as dean of Washington State University’s Elson S. Floyd College of Medicine and return to a faculty role within the Department of Medical Education and Clinical Sciences. He will continue serving as dean until a permanent successor is named. The Provost’s Office will launch a national search in the coming weeks.\n“I am incredibly grateful for Jim’s leadership, his deep commitment to our students, and his community-focused mindset,” said Provost and Executive Vice President Chris Riley-Tillman. “When Jim shared his desire to return to a faculty role, I was fully supportive, though quickly shared how much I will miss him as a strategic thought partner. Throughout his tenure, he has been an exceptional leader, committed to advancing our health sciences enterprise. I’m thankful that he will continue contributing his expertise, and I look forward to our ongoing collaboration.”\nRecord joined the Elson S. Floyd College of Medicine in 2021 as vice dean for Graduate Medical Education, Continuing Medical Education, and Partnerships, while also serving as a clinical professor in the Department of Medical Education and Clinical Sciences. He stepped into the role of interim dean in 2022 and was appointed permanently in 2023.\nI am incredibly grateful for Jim’s leadership, his deep commitment to our students, and his community-focused mindset.\nChris Riley-Tillman\nProvost and Executive Vice President\nWashington State University\nAs dean, Record oversaw the college’s successful application for continued full accreditation, guided a comprehensive curriculum review, led the development of the college’s strategic plan, and was instrumental in the creation of WSU Health. He championed the creation of a pathway enabling alumni to transition directly into community faculty roles after completing their training — an initiative that has already added 17 new educators to support the next generation of Coug physicians. Record also oversaw the development of the college’s sponsored pediatrics residency; the continued expansion of the Internal Medicine Residency in Everett at Providence Regional Medical Center; the Family Medicine Residency at Pullman Regional Hospital; and the launch of a new critical care medicine fellowship.\n“It has been an indescribable honor to serve both WSU and the communities of Washington,” said Record. “Community-based healthcare is a critical need here and across the country. The opportunity to help our amazing team build a college rooted in service to our most deserving and under-resourced communities has been the most meaningful work of my professional life. Our community partners are incredibly collaborative, and the partnerships we have created are changing lives in Washington and beyond. I am committed to Coug Nation and excited to continue to partner with Provost Riley-Tillman and the health sciences leadership team as we shape the future of medical education and clinical care at WSU. I am proud to remain a Coug and excited to continue teaching the next generation of Coug doctors.”\nBefore joining WSU, Record served as provost and chief academic officer at Ross University School of Medicine and as dean of the Chicago Medical School. He earned a bachelor’s degree with high honors in biochemistry and sociology from Bowdoin College, an MD from the University of Massachusetts Medical School, and completed his residency in general internal medicine at Brown University School of Medicine—Rhode Island Hospital. He also holds a JD from Rutgers University School of Law.\nAdditional information about the search for Record’s successor will be shared in the coming weeks."
            },
            {
                "title": "D.C.’s Hottest New Sushi Place Debuts in a Familiar Space - Eater DC",
                "source": "Eater DC",
                "url": "https://dc.eater.com/openings/166745/katsumi-logan-circle-dc-restaurant-openings",
                "body": "The party-starting team behind D.C.’s popular Bar Chinois gave its younger Logan Circle sibling a big glow-up this winter. Katsumi is set to open for dinner on Thursday, February 12, replacing its short-lived predecessor Bar Japonais (1520 14th Street NW).\nD.C.’s Hottest New Sushi Place Debuts in a Familiar Space\nMeet Katsumi, the restaurant formerly known as Bar Japonais\nThe Rhythm & Eats team quietly closed its “neo-fusion” izakaya Bar Japonais along the tony nightlife corridor in late 2025 to figure out what they wanted for the space. For its new life as Katsumi, there’s a laser-lens focus on Japanese food in a more intimate atmosphere that includes half the seat count (65, down from over 100) and DJ vibes on weekends.\n“When we opened Japonais as a French-Japanese concept, we only had a little bit of sushi,” partner Dean Mosones tells Eater. “We are now focused on just being a Japanese restaurant.”\nKatsumi fills somewhat of a raw-fish void left behind on the strip when celebrity chef Michael Schlow’s Nama Ko flopped fast in 2024.\nAt its core, the rebrand capitalizes on the stellar slice skills of its executive chef, Masaaki “Uchi” Uchino, who came on board a year ago with credentials at Michelin-starred places like Sushi Nakazawa (first in New York, then in D.C.).\nDespite his classical training, the Fukuoka-born chef’s not afraid to stray away from tradition. Toro caviar sashimi with cucumber, and teriyaki, for instance, arrives with truffle oil — a somewhat unconventional ingredient in Japanese cuisine. Saba (mackerel), uni (sea urchin), and hotate (scallop) make cameos in nigiri and sashimi when the season is right.\n“We upped the game — a lot of new items are traditional, modern, but unexpected,” says Mosones, pointing to A5 beef carpaccio as a solid new starter.\nMeanwhile, maki options include a sour cream-and-onion roll with osetra caviar, black porgy, and potato.\nHot dishes — partitioned into meat, seafood, and vegetarian sections – include pork katsu senbei with panko, shichimi, and tonkatsu; lobster tail koganeyaki with chives and spicy aioli; gyoza with beef and cabbage; and a five-mushroom medley sauteed in teriyaki.\nAt Bar Japonais 2.0 (Katsumi), the group netted a big fish as its general manager: Andra “AJ” Johnson, a hospitality vet and 2025 James Beard semifinalist (for Outstanding Cocktail Service), who more recently led the bar at Serenata.\nThe bar program also dials into more Japanese ingredients and influences. The multi-toned Matcha Mood, for instance, is a yuzu-vodka drink layered with strawberry.\nOther drinks include the Nitoro Kohi, a Japanese take on the espresso martini with vodka, nitro cold brew, shochu, Okinawan sugar, and Benedictine; and the Anko-Iada, a blend of rum, mango, pineapple, adzuki bean, and coconut milk.\nThere’s also an expansive sake list that includes rarities by the bottle. Bar Japonais’s minimalist look of matte-black surfaces and a stark central bar composed of cement provided a ready-to-wear canvas for Katsumi. “We wanted to give the restaurant some personality to reflect the new menu,” he says.\nSee: lots of neon-lit signage inside spilling into the street, moody murals, and pops of color throughout.\nKatsumi will be the place to see and be seen come Friday and Saturday nights, when the front half flips into a music-oriented venture outfitted with plush new lounge seating.\nBar Chinois, the team’s original spot that started it all in Mt. Vernon Triangle, continues to enjoy a devoted following for its dumplings, Frenchified cocktails, and small plates from happy hour until late. A second Bar Chinois popped across the Potomac last year in Arlington."
            },
            {
                "title": "Heather S. Browning Obituary February 9, 2026 - mercerfuneralhomes.com",
                "source": "mercerfuneralhomes.com",
                "url": "https://www.mercerfuneralhomes.com/obituaries/heather-browning",
                "body": "Invite friends and family to read the obituary and add memories.\nWe'll notify you when service details or new memories are added.\nYou're now following this obituary\nWe'll email you when there are updates.\nPlease select what you would like included for printing:\nInvite friends and family to read the obituary and add memories.\nWe'll notify you when service details or new memories are added.\nYou're now following this obituary\nWe'll email you when there are updates.\nPlease select what you would like included for printing:\nHeather Sierra Browning, 18, of Circleville, KS, passed away as the result of a vehicle accident on Monday, February 9, 2026 near Netawaka, KS. She was born October 31, 2007 in Topeka, KS, the daughter of Denny Lee Ken Browning and Jackie R. Whiting.\nHeather was a Senior at Jackson Heights High School and was attending Washburn Tech for welding. She had participated in track, volleyball, shooting sports and FFA. Heather was best known as a Social Bug. She had a love for sunflowers, sunsets and art.\nShe worked as a waitress for Sportsman Grill in Onaga and Mercer Que in Soldier.\nSurvivors include her father, Denny Browning (Patricia Anderson) of Circleville, KS; mother, Jackie Browning of Blue Rapids, KS; sister, Deanna Browning of Kansas City, KS; brothers, Keaton DeWalt (Kendal) of Wamego, KS and Drayton Browning of the home; grandparents, Steve Browning (Kelly) of Emmett, KS and Annetta Browning of Circleville, KS; great-grandparents, Ron and Margie Browning of Topeka, KS; uncles, Matt Browning (Lisa) of Circleville, KS, Eric Gudenkauf of Havensville, KS and Adam Gudenkauf of Emmett, KS; aunts, Rochelle Browning of Circleville, KS and Jennifer Marten (Tim) of Onaga, KS; nephew Walker DeWalt; bonus brothers, Jakeb and Nethan Cauthon; bonus sister, Brylee Cauthon; bonus mom, Alida Andreasen; bonus brothers, Colby, Logan and Wyatt Cannon and Baily Meredith.\nHeather will lie in state from 11:00 a.m. – 7:00 p.m. Monday, February 16, 2026 at the Mercer Funeral Home in Holton. Celebration of Life will be 9:30 a.m. Tuesday, February 17, 2026 at the funeral home with visitation to follow until 11:30 a.m. Private Family Burial will be Tuesday at Ontario Cemetery. Memorials in memory of Heather may be given to Denny Browning to be designated at a later date c/o Mercer Funeral Home, P.O. Box 270, Holton, KS 66436.\nMercer Funeral Home - Holton\nMercer Funeral Home - Holton\nMercer Funeral Home - Holton\nA beautifully bound keepsake book filled with memories and condolences from family and friends.\nContribute your memory to the online guestbook to be featured in this unique keepsake book.\nVisits: 6009\nThis site is protected by reCAPTCHA and the\nGoogle Privacy Policy and Terms of Service apply.\nService map data © OpenStreetMap contributors"
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "780.000",
            "open": "57,821.610",
            "close": "58,120.900",
            "high": "58,501.610",
            "low": "57,721.610"
        },
        "market_summary": "### JPN225 Market Briefing  \n* **Key Drivers:** Post-election rally fueled by \"Takaichi trade\" and economic policy optimism.  \n* **Price Action:** Breached **58,000** for the first time, but momentum lacks follow-through.  \n* **Technical Outlook:** Overstretched near-term, profit-taking likely.  \n\n---\n**Overall Sentiment:** Mixed ⚖️  \n\n**Key Insights:**  \n- **Nikkei 225** hit a record **58,000** but quickly pared gains, signaling potential overheating.  \n- **Yen strength** emerges as a counterbalance, with officials warning against volatility.  \n- **Political stability** under PM Takaichi boosts investor confidence, but intervention risks loom if yen approaches **160/USD**.  \n- **Corporate earnings** and AI investment updates from SoftBank Group are in focus.  \n\n**Market Context:**  \n- **JGB yields** fell to **2.217%**, reflecting bond market optimism.  \n- **Asia-Pacific markets** mixed: Kospi surged to record highs, while HSI and CSI 300 traded flat.  \n- **US jobs data** dampened Fed rate cut expectations, pressuring global equities.  \n\n**Risks:**  \n- **Profit-taking** as gains appear overextended.  \n- **Yen intervention** risks if volatility persists.  \n- **Tariff-related legal challenges** could impact global trade sentiment.  \n\n**Next Catalysts:**  \n- **January CPI data** (tomorrow) for inflation trends.  \n- **SoftBank Group earnings** for AI investment details.  \n- **Yen dynamics** as officials monitor currency volatility.",
        "source_articles": [
            {
                "title": "Yen Reversal Case Builds as Nikkei Rally Looks Overextended - Action Forex",
                "source": "Action Forex",
                "url": "https://www.actionforex.com/action-insight/market-overview/629230-yen-reversal-case-builds-as-nikkei-rally-looks-overextended/",
                "body": "Risk sentiment was mixed in Asia today as Japan returned from holiday with Nikkei extending its post-election surge and briefly breaching the 58,000 mark for the first time on record. The breakout, however, lacked follow-through, with the index quickly trimming gains and hinting that near-term momentum may be stretched. Elsewhere in the region, trading was subdued. Broader Asian markets mirrored the near-flat close in the US overnight.\nIn currency markets, Yen remains the standout performer, extending its rally. The move partly reflects repeated official vigilance over currency volatility. Japan’s top currency diplomat, Atsushi Mimura, issued fresh warnings today. While declining to comment on speculation over rate checks following US employment data, he stressed that authorities are maintaining a “high sense of urgency” and have “not lowered our guard at all.” Mimura also confirmed that Tokyo remains in close contact with US authorities, reinforcing the perception that officials are prepared to act jointly if volatility becomes excessive.\nTechnically, the breach of near-term Fibonacci support in both EUR/JPY and GBP/JPY suggests that Yen’s reversal may be gaining traction. However, confirmation would require USD/JPY to break corresponding support levels to solidify the broader trend shift.\nFor Dollar, the boost from stronger-than-expected US payrolls proved short-lived. While the report effectively cemented expectations that the Fed will hold rates steady in March, it did little to firm up pricing for June. Attention now turns to January CPI data due tomorrow. A single inflation print may trigger volatility, but unless it materially shifts the inflation outlook, it is unlikely to establish a durable trend in Fed expectations.\nIn the US fiscal backdrop, January’s deficit narrowed compared to a year earlier as tariff collections surged. Customs duties reached USD30 billion for the month, lifting fiscal year-to-date revenue to USD124 billion — more than triple the level seen over the same period in 2025.\nHowever, legal and political risks around tariffs remain elevated. The Supreme Court has yet to rule on challenges to the legal basis for the measures, keeping concerns that an adverse decision could force reimbursement of collected duties. Meanwhile, the House narrowly passed a resolution opposing tariffs on Canada, though any legislative reversal is unlikely given the high bar required to override a presidential veto.\nOn performance, Dollar remains the weakest currency of the week so far, followed by Sterling, which is awaiting UK GDP data. Euro is the third-worst performer. Yen leads gains, followed by Aussie and Loonie, while Swiss Franc and Kiwi trade mid-pack.\nIn Asia, at the time of writing, Nikkei is up 0.24%. Hong Kong HSI is down -0.89%. China Shanghai SSE is up 0.12%. Singapore Strait Times is up 0.63%. Japan 10-year JGB yield is down -0.02 at 2.217. Overnight, DOW fell -0.13% S&P fell -0.00%. NASDAQ fell -0.16%. 10-year yield rose 0.025 to 4.172.\nJapan PPI eases to 2.3%, but import costs accelerate\nJapan’s producer price index slowed slightly to 2.3% year-on-year in January from 2.4%, matching expectations and suggesting pipeline price pressures are stabilizing. The moderation came despite sharp divergences across components.\nFuel prices dropped -12.9% yoy, providing a significant drag on overall wholesale inflation. In contrast, nonferrous metal prices surged 33%, while agricultural goods rose 22.4%. Food and beverage prices also remained elevated, increasing 4.7% from a year earlier, highlighting persistent cost pressures in parts of the supply chain.\nMeanwhile, Yen-based import prices climbed 0.5% yoy, up from a 0.2% gain in December. Despite a recent rebound in the currency, Yen’s broader weakness over recent months has raised the cost of imported energy and raw materials.\nRBA’s Bullock says inflation above 3% “unacceptable,” keeps door open to more hikes\nRBA Governor Michele Bullock reinforced the hawkish stance"
            },
            {
                "title": "Japan stocks extend post-election rally with Nikkei 225 breaching 58,000 for the first time - CNBC",
                "source": "CNBC",
                "url": "https://www.cnbc.com/2026/02/12/asia-pacific-markets-nikkei-225-kospi-hang-seng-index.html",
                "body": "Japan's Nikkei 225 on Thursday hit 58,000 for the first time in history, extending its post-election rally to fresh highs, fueled by renewed confidence in domestic politics and the ruling administration's economic agenda.\nThe benchmark index subsequently pared gains and was trading marginally higher at 57,663. The broader Topix advanced 0.68%.\nJapanese stocks have notched several fresh highs in recent days, fueled by the so-called \"Takaichi trade,\" following Prime Minister Sanae Takaichi's landslide victory in the Lower House, said market watchers.\nGlobal investment firm GMO noted that Takaichi's snap-election landslide gives her an unusually strong, multi-year mandate to execute policy, which they view as broadly supportive for Japan's markets and corporate sector.\nWhile equities have rallied and bond investors appear reassured, GMO notes intervention risks could rise if the yen approaches 160 against the greenback.\nOther markets in Asia also shrugged off a stronger-than-expected U.S. payrolls data that has dampened expectations for Federal Reserve rate cuts and sent U.S. stocks lower overnight.\nSouth Korea's Kospi jumped as much as 2.1% to a record high of 5,466.9 points, before paring gains to trade 1.82% higher. The small-cap Kosdaq traded relatively flat.\nSingapore's benchmark index crossed 5,000 for the first time.\nAustralia's S&P/ASX 200 was up 0.42% in early trade.\nHong Kong's Hang Seng Index lost 0.23%, while mainland China's CSI 300 added 0.12%.\nOvernight in the U.S., the Dow Jones Industrial Average snapped a three-day win streak after a better-than-expected January jobs report.\nThe blue-chip index lost 66.74 points, or 0.13%, and closed at 50,121.40. The S&P 500 was nearly flat at 6,941.47. The Nasdaq Composite dropped 0.16% to end at 23,066.47.\nThe Bureau of Labor Statistics' January nonfarm payrolls report showed job growth of 130,000 in January. Economists polled by Dow Jones had estimated gains at 55,000. Jobs growth in December was downwardly revised to 48,000.\nStrong labor market has reduced the odds for interest rate cuts by the Federal Reserve.\nThe jobs report follows weaker-than-expected consumer data released on Tuesday. That report showed that consumer spending in December was flat, missing the 0.4% monthly gain expected from economists polled by Dow Jones.\n—CNBC's Sean Conlon and Liz Napolitano contributed to this report."
            },
            {
                "title": "Global Markets: Japan's Nikkei hits 58,000 as yen, JGBs rally on election fallout - The Economic Times",
                "source": "The Economic Times",
                "url": "https://economictimes.indiatimes.com/markets/us-stocks/news/global-markets-japans-nikkei-hits-58000-as-yen-jgbs-rally-on-election-fallout/articleshow/128241055.cms?from=mdr",
                "body": "The earnings season is underway in the world's fourth-largest economy, and domestic share markets have been buoyed by bets that a decisive showing by Takaichi's Liberal Democratic Party in Sunday's national election will enable her to push through spending and tax-relief measures. Since Takaichi began her ascent to become Japan's first female premier in October, the \"Takaichi trade\" has pushed domestic shares to successive record highs while spurring declines in JGBs and the yen. Takaichi reiterated on Monday that she was committed to \"responsible, proactive fiscal policy.\"\n\"Following recent strong earnings results and the LDP's landslide victory under the Takaichi administration, the market has been on a significant upward trend,\" Wataru Akiyama, a strategist at Nomura Securities, said about domestic shares. \"The sense of overheating seems to be intensifying, so profit-taking movements could emerge from here on.\" Takaichi is sensitive to how markets react to her decisions, particularly yen and JGB yield moves, two sources told Reuters. The yen rallied on Thursday after top currency diplomat Atsushi Mimura issued a fresh warning against currency volatility, and mentioned speculation about rate checks, a typical precursor to actual market intervention.\nLong-dated securities led a rally in JGBs on Thursday, while the yen touched a two-week high of 152.28 per dollar.\nThe yen's surprising strength has sprung out of Takaichi's ability to secure a solid majority in the lower house and end concerns about political instability that had lingered since July last year, said Hirofumi Suzuki, chief foreign-exchange strategist at SMBC.\n\"This suggests that short positions in the yen have been unwound,\" Suzuki added. There were 150 advancers on the Nikkei index against 74 decliners. Honda Motor was among the bigger losers, slumping 3.3% after the automaker posted a 61% drop in third-quarter profit after market hours on Tuesday.\nResults from SoftBank Group after the bell on Thursday will be closely watched for details on how it will fund its massive investments in AI.\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\nSubscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today.\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price"
            }
        ]
    }
]