[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "78.530",
            "open": "3,832.420",
            "close": "3,858.570",
            "high": "3,871.740",
            "low": "3,793.210"
        },
        "market_summary": "Gold is experiencing a historic rally, reaching unprecedented highs driven by a combination of a weakening US dollar, expectations of Federal Reserve rate cuts, and strong safe-haven demand. This demand is fueled by persistent inflation concerns, geopolitical tensions, and fears of a potential US government shutdown. The rally is unusual as it is occurring alongside record-breaking stock market performance, suggesting investors are seeking gold as a hedge against currency debasement and broader economic instability rather than just as a traditional safe-haven asset.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Gold and stocks are setting records at the same time. Here's why that's unusual and what it means. - Business Insider",
                "source": "Business Insider",
                "url": "https://www.businessinsider.com/gold-price-stock-rally-unusual-explained-inflation-unrest-ai-debt-2025-9",
                "body": "- Gold prices have surged 46% in 2025 alongside strong stock market performance.\n- That's unusual given that gold and stocks aren't often correlated.\n- Market pros say inflation concerns — and even a fraying of the social fabric — could be fueling gold's rally.\nWhen stocks hit trouble, investors usually run to gold. So with stocks at new highs, fresh off a 33% rally since April, investors are…still running to gold?\nThe precious metal is at an all-time high, up 43% this year and a whopping 84% since the start of 2024. At the same time, the stock market is hovering at record highs, with the S&P 500 up 13% in 2025.\nSince gold tends to do best when stocks and the economy are flailing and investors are seeking safety, its recent rally is out of the ordinary, considering how strong the stock market has been amid the continued AI frenzy.\nWhat gives?\nIn addition to risks like geopolitical uncertainty, maybe the most straightforward explanation is that inflation has remained sticky, and investors see both stocks and gold as a more stable store of value.\nInflation has remained well above the Federal Reserve's 2% target, hitting 2.9% in August. Historically high tariffs threaten to push prices up further, and predictions for the Fed to loosen monetary policy have compounded forecasts for another bout of inflation.\n\"I think the reason you see the simultaneous rally is it's not a safe haven trade right now,\" said David Miller, CIO at Catalyst Funds. \"It's more of an inflation and a currency debasement question that's driving both stocks and gold.\"\n\"You think of it the same way with real estate, for example,\" Miller added. \"Who would ever think housing prices would be up dramatically from where they were in 2021 in spite of interest rates going substantially higher.\"\nBen McMillan, CIO at IDX advisors, said you might view the gold rally as another sort of iteration of the bond-vigilante trade, where investors express their discontent with their dollars as inflation erodes the value of fiat currency.\n\"This is concern about inflation, fiat stability, and just too much debt in the system,\" McMillan said. He added that it's \"definitely a warning signal\" for a stagflationary environment ahead.\nOf course, there doesn't necessarily need to be a tidy explanation for the simultaneous stock and gold surge. Equity investors may simply be bullish on AI — after all, the earnings that top tech firms are bringing in are impressive, to say the least.\nAt the same time, the inflation fears mentioned above, along with factors like China's plan to host more gold reserves, could be fueling the rise in the precious metal.\nBut if you were looking for a more dire explanation — about how the soaring value of gold reflects fears of a wider societal reckoning — those exist, too.\nViktor Shvets, global strategist at Macquarie Capital, tied gold's rally to the growing prevalance to AI — as evident in the surge in AI-stock prices — and the havoc he thinks it will wreak on the world.\n\"As technology destroys while giving birth to a new world, chaos and polarization will likely get worse, potentially leading to civil, cold, and hot wars. This is where gold comes in: it is no longer simply a hedge against inflation but a hedge against destruction,\" Shvets wrote in a client note.\n\"Societal polarization leads to a political polarization which in turn further aggravates frictions and reduces policymaking competence, leading to high volatility of economic and inflationary outcomes,\" he continued. \"This is what we have been describing as an 'Insanity Premium.'\"\nHow's that for something to chew on for a Tuesday morning? That's not all, though. Adding to the uncertainty—and helping gold extend its gains this week—is a looming government shutdown. The federal government is set to shut down at midnight on Wednesday, barring a last-minute deal between lawmakers."
            },
            {
                "title": "Australian Stocks Stall As Gold Shines And Miners Dip - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/australian-stocks-stall-as-gold-shines-and-miners-dip",
                "body": "The ASX 200 stayed flat as rising gold stocks and rate stability were offset by weakness in mining, energy, and banks, while investors wait for key inflation data.\nabout 4 hours ago • 2 mins\nJoin the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nAustralian stocks barely budged on Tuesday, with the S&P/ASX 200 stuck at 8,849.10 as investors weighed record gold gains against drops in mining, energy, and banking shares ahead of crucial inflation data.\nWhat does this mean?\nMomentum faded as the ASX 200 kicked off the quarter on cautious footing, ending its five-month winning run. Gold stocks were the clear winners, rising 1.2% to fresh highs as bullion prices surged, helped by strong moves in Genesis Minerals and St Barbara. But gains there were offset by a 0.5% slip in major resource shares—BHP, for instance, dropped almost 2% after China’s state iron ore buyer paused cargo purchases. Energy stocks slid 0.4% and banks cooled as rate-sensitive names reacted to the Reserve Bank of Australia holding rates steady at 3.6%. With rate cuts now unlikely until mid-2026, investors are watching for clues in the upcoming consumer inflation print.\nWhy should I care?\nFor markets: Caution rules the ASX.\nThe sector split highlights how investors are hedging their bets. Gold’s strong run usually points to rising caution, with higher prices signaling concerns about global uncertainty and inflation. Meanwhile, miners like BHP and energy names such as Woodside Energy are feeling the pinch from China’s shifting demand and weaker commodity prices, while banks are stuck in neutral as traders track interest rate moves. All of this suggests the ASX 200 could stay rangebound until there’s more clarity from upcoming economic data.\nThe bigger picture: Inflation keeps policymakers and markets guessing.\nThe Reserve Bank of Australia’s vigilance mirrors what’s happening at other central banks as they try to tamp down stubborn inflation. With hopes for quick rate cuts now pushed into the distance, investors are closely watching late October’s inflation figures for a sense of next steps. Meanwhile, global shifts—like China pausing iron ore purchases—show how quickly international forces can reshape Australia’s outlook. Until there’s more direction, defensive plays like gold could continue to shine.\nDiscover the Upside… Daily.\nOver one million readers — from portfolio managers to everyday investors — start their mornings with The Daily Upside.\nNo wonder: the newsletter brings you sharp takes on markets, business, and the economy, written by former bankers and veteran journalists who cut straight to what matters.\nAll action, no filler: sign up today to stay ahead.\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nResearch\nStéphane Renevier, CFA • about 14 hours ago\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies.\nGet the two biggest stories in finance, and the reasons why you should care, delivered to your inbox every day."
            },
            {
                "title": "Gold Shatters Records: Weak Dollar and Safe-Haven Rush Propel Prices to Unprecedented Heights - FinancialContent",
                "source": "FinancialContent",
                "url": "https://markets.financialcontent.com/wral/article/marketminute-2025-9-30-gold-shatters-records-weak-dollar-and-safe-haven-rush-propel-prices-to-unprecedented-heights",
                "body": "Gold has once again cemented its status as the ultimate safe haven, surging to an astonishing new record high around September 30, 2025. Spot gold prices soared, trading between approximately $3,842.76 and $3,866.90 per ounce, while December gold futures touched an even more remarkable $3,895.22 per ounce. This monumental rally marks gold's best monthly performance in over a decade, with gains exceeding 11% in September and an impressive 45% since the start of 2025, signaling profound shifts in global financial markets.\nThe unprecedented ascent is primarily attributed to a confluence of powerful macroeconomic forces: a persistently weakening U.S. dollar and a dramatic increase in investor demand for traditional safe havens amidst escalating global uncertainties. As the dollar's strength wanes, gold becomes more attractive to international buyers, while mounting geopolitical tensions, persistent inflation concerns, and the looming specter of a U.S. government shutdown are driving a widespread flight to quality, positioning gold as a cornerstone of diversified investment portfolios.\nThe Golden Surge: A Deep Dive into Market Dynamics\nThe recent surge saw gold futures reaching nearly $3,900 per ounce, a level many analysts had previously deemed aspirational for years to come. This robust performance is a culmination of several intertwined events and market sentiments. The U.S. dollar index (DXY) has been in a sustained downtrend, making dollar-denominated assets like gold more appealing to holders of other currencies. This currency depreciation has been exacerbated by growing expectations of U.S. Federal Reserve interest rate cuts, with markets pricing in a high probability (around 89-97%) of a 25-basis-point reduction at the next Fed meeting. Lower interest rates diminish the opportunity cost of holding non-yielding assets like gold, further boosting its attractiveness.\nThe timeline leading to this moment has been characterized by increasing global instability. Throughout 2025, geopolitical tensions, particularly those involving Russia and NATO, have intensified, creating a pervasive sense of unease in financial markets. Simultaneously, fears of a potential U.S. government shutdown due to political deadlock over funding have added another layer of uncertainty, prompting investors to seek refuge in tangible assets. These factors, combined with persistent inflation concerns globally, have created a perfect storm, solidifying gold's role as a hedge against economic volatility and currency debasement.\nKey players driving this demand include central banks, notably those in China and Russia, which have been aggressively increasing their gold reserves to diversify away from the U.S. dollar. Institutional investors have also poured significant capital into gold-backed Exchange Traded Funds (ETFs), with holdings reaching their highest levels since July 2022 and attracting approximately $10.5 billion in September alone. This widespread institutional and sovereign buying underscores a fundamental shift in asset allocation strategies, reinforcing gold's position as a critical component of national and private wealth preservation strategies. Initial market reactions have been overwhelmingly positive for gold, with analysts now widely anticipating the rally to continue, with some major banks forecasting prices to reach $4,000 per ounce by late 2025 or mid-2026. This surge is also broadening to other precious metals, with silver and platinum also reaching multi-year highs, indicating a broader shift towards hard assets.\nCorporate Fortunes in the Golden Glow\nThe unprecedented rise in gold prices creates a clear set of winners and losers within the public company landscape, primarily impacting the mining sector and, by extension, broader economic sectors. Gold mining companies stand to be the most immediate beneficiaries, seeing significant boosts to their revenues and profitability. Companies like Newmont Corporation (NYSE: NEM), the world's lar"
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.190",
            "open": "67.125",
            "close": "66.468",
            "high": "67.240",
            "low": "66.050"
        },
        "market_summary": "Oil prices are under pressure as OPEC+ considers accelerating production increases, adding supply to a market that major forecasters predict will be in surplus. This bearish fundamental outlook is partially countered by falling US crude inventories, indicating a tighter domestic market, and geopolitical risks from Russian export bans. Prices remain range-bound as these competing forces of increased supply and supportive inventory data create uncertainty.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Oil steadies as investors weigh OPEC+ output hike against US crude inventories - Yahoo",
                "source": "Yahoo",
                "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_328f107d-90c6-4631-9a47-470334c01485",
                "body": "Yahoo is part of the Yahoo family of brands.\nWhen you use our sites and apps, we use cookies to:\n- provide our sites and apps to you\n- authenticate users, apply security measures, and prevent spam and abuse, and\n- measure your use of our sites and apps\nIf you click '\nAccept all', we and\nour partners, including 238 who are part of the IAB Transparency & Consent Framework, will also store and/or access information on a device (in other words, use cookies) and use precise geolocation data and other personal data such as IP address and browsing and search data, for analytics, personalised advertising and content, advertising and content measurement, and audience research and services development.\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\nIf you would like to customise your choices, click 'Manage privacy settings'.\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy & cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our privacy policy and cookie policy."
            },
            {
                "title": "Oil Slips as OPEC+ Weighs Faster Output Hikes - Rigzone",
                "source": "Rigzone",
                "url": "https://www.rigzone.com/news/wire/oil_slips_as_opec_weighs_faster_output_hikes-30-sep-2025-181960-article/",
                "body": "Oil Slips as OPEC+ Weighs Faster Output Hikes\nOil slipped in a choppy day of trading as OPEC+ considers boosting the pace of future output hikes.\nWest Texas Intermediate fell 1.7% to settle near $62 a barrel. The OPEC+ alliance meets on Sunday and is considering stepping up supply increases. The group will discuss potentially lifting output by 500,000 barrels a day per month over a three-month period, a delegate said.\nOPEC+ would be adding barrels to a market that major forecasters say doesn't need them. The International Energy Agency says global oil markets are set for a record oversupply next year, while French oil giant TotalEnergies SE published figures on Monday that showed a significant crude surplus in the first quarter of next year.\nAdding to the bearish sentiment, US crude oil production surpassed 13.6 million barrels a day for the first time ever in July, higher than previously expected.\n\"Our balance sheet clearly suggests additional supply isn't needed,\" ING Groep NV analysts including Warren Patterson wrote in a note. \"We expect the market to move into a large surplus in the fourth quarter and remain in surplus through 2026.\"\nStill, some investors are skeptical that the prospective OPEC+ hike will materialize and that the amount that ultimately reaches the global market will be equivalent to the headline figure of its output plan.\n\"Once the market digests that, it may view this as a clearing event — there are no unwinds after this,\" said Rebecca Babin, a senior energy trader at CIBC Private Wealth Group. \"My sense is this ties into the ongoing quota discussions within OPEC, with countries pushing for increases while Saudi Arabia remains reluctant given capacity and investment constraints.\"\nFurther limiting the slide, Russia banned diesel exports for some companies and extended restrictions for gasoline sales abroad as Ukrainian drone strikes disrupt nation's refinery runs. The ban was only marginally bullish, though, having been well-telegraphed by the Kremlin and limited in scope, with only resellers — companies that buy diesel inside Russia and then ship it abroad — impacted.\nWith WTI buffeted by the competing forces of geopolitical risks and bearish fundamentals, prices have been stuck in a band between roughly $62 and $67 a barrel since early August.\n\"Ultimately, we believe some combination of lower prices (slowing non-OPEC supply), supply disruptions, OPEC policy changes, and time (allowing demand growth to chew into oversupply) will be required to return this market to balance,\" Vikas Dwivedi, Macquarie's global oil and gas strategist, wrote in a note.\nOil Prices\n- WTI for November delivery dropped 1.7% to settle at $62.37 a barrel in New York.\n- Brent for November settlement, which expires on Tuesday, fell 1.4% to settle at $67.02 a barrel.\n- The more-active December contract slid 1.6% to settle at $66.03 a barrel.\nWhat do you think? We’d love to hear from you, join the conversation on the\nRigzone Energy Network.\nThe Rigzone Energy Network is a new social experience created for you and all energy professionals to Speak Up about our industry, share knowledge, connect with peers and industry insiders and engage in a professional community that will empower your career in energy."
            },
            {
                "title": "Crude Oil Inventories Continue to Fall - Crude Oil Prices Today | OilPrice.com",
                "source": "Crude Oil Prices Today | OilPrice.com",
                "url": "https://oilprice.com/Latest-Energy-News/World-News/Crude-Oil-Inventories-Continue-to-Fall.html",
                "body": "Advertising and marketing firms are…\n\"It's most important 8 minute read of my week…\"\nThe American Petroleum Institute (API) estimated that crude oil inventories in the United States fell by another 3.674 million barrels in the week ending September 30. This is on top of last week’s 3.821 million barrel draw.\nSo far this year, net crude oil inventories are have swung to a loss this week of 2.22 million barrels, according to Oilprice calculations of API data.\nEarlier this week, the Department of Energy (DoE) reported that crude oil inventories in the Strategic Petroleum Reserve (SPR) rose by 700,000 barrels to 406.7 million barrels in the week ending September 26.\nAdding to the data picture, the U.S. Energy Information Administration’s latest monthly report showed July total liquids production revised sharply higher to 21.218 million barrels per day, nearly half a million bpd above its weekly estimates. Demand was also stronger than implied by the weeklies, with total product supplied at 20.984 million bpd. Both sides of the ledger were hotter than expected, underscoring a tighter U.S. oil market than traders had been pricing in.\nAt 3:17 pm ET, Brent crude was trading down $0.95 (-1.40%) on the day, reaching $67.02. The figure is down $0.90 per barrel from this time last week. WTI was also trading down on the day, by $0.87 (-1.37%) at $62.58—a more than $1 per barrel drop week over week.\nGasoline inventories rose by 1.3 million barrels in the week ending September 26, after falling by 1.046 million barrels in the week prior. As of last week, gasoline inventories were already 2% below the five-year average for this time of year, according to the latest EIA data.\nDistillate inventories rose again this week, adding another 3.003 million barrels, following the week prior’s 518,000-barrel gain. Distillate inventories were 8% below the five-year average as of the week ending September 19, the latest EIA data shows.\nCushing inventories fell by 693,000 barrels in the week, after adding 72,000 barrels in the week prior.\nBy Julianne Geiger for Oilprice.com\nMore Top Reads From Oilprice.com\nADVERTISEMENT\nJulianne Geiger is a veteran editor, writer and researcher for Oilprice.com, and a member of the Creative Professionals Networking Group."
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.210",
            "open": "63.386",
            "close": "62.676",
            "high": "63.491",
            "low": "62.281"
        },
        "market_summary": "Oil prices are stabilizing after recent losses as the market balances opposing forces. Declining U.S. crude inventories and a tighter-than-expected physical market provide support, while the potential for a significant OPEC+ output hike and concerns over global economic demand create downward pressure. Geopolitical risks and a looming U.S. government shutdown add further uncertainty to the outlook.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Oil steadies as investors weigh OPEC+ output hike against US crude inventories - Yahoo",
                "source": "Yahoo",
                "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_67c83139-1964-419a-8676-209c729ac77a",
                "body": "Yahoo is part of the Yahoo family of brands.\nWhen you use our sites and apps, we use cookies to:\n- provide our sites and apps to you\n- authenticate users, apply security measures, and prevent spam and abuse, and\n- measure your use of our sites and apps\nIf you click '\nAccept all', we and\nour partners, including 238 who are part of the IAB Transparency & Consent Framework, will also store and/or access information on a device (in other words, use cookies) and use precise geolocation data and other personal data such as IP address and browsing and search data, for analytics, personalised advertising and content, advertising and content measurement, and audience research and services development.\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\nIf you would like to customise your choices, click 'Manage privacy settings'.\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy & cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our privacy policy and cookie policy."
            },
            {
                "title": "Crude oil prices climb to $66.25 as market weighs OPEC+ plans against declining U.S. inventories - Economy Middle East",
                "source": "Economy Middle East",
                "url": "https://economymiddleeast.com/news/crude-oil-prices-climb-to-66-25-as-market-weighs-opec-plans-against-declining-u-s-inventories/",
                "body": "Oil prices steadied in early trading on Wednesday after experiencing two consecutive days of losses. Investors are weighing the potential plans from OPEC+ for a larger output increase next month against the likelihood of declining inventories in the U.S.\nBrent crude futures for December delivery rose by 22 cents to $66.25 a barrel, while U.S. West Texas Intermediate crude climbed by 19 cents to $62.56 a barrel.\nOn Monday, both Brent and WTI settled more than 3 percent lower, marking their sharpest daily declines since August 1. On Tuesday, they each experienced additional drops of at least 1.5 percent.\nThe expectation of dwindling U.S. crude oil inventories has helped prevent prices from falling further. According to market sources citing estimates from the American Petroleum Institute on Tuesday, U.S. crude stocks decreased by 3.67 million barrels in the week ending September 26.\nGasoline inventories rose by 1.3 million barrels, while distillate inventories increased by 3 million barrels from the previous week, the sources reported.\nRead more: Crude oil prices decline to $66.68 as market braces for OPEC+ output rise\nOPEC’s clarification on output plans\nOPEC+ may agree to boost oil production by up to 500,000 barrels per day (bpd) in November, which would be three times the increase made for October, as Saudi Arabia aims to reclaim market share, according to three sources familiar with the discussions.\nEight members of the group, responsible for producing about half of the world’s oil, are considering a hike ranging from 274,000 to 411,000 bpd, two of the sources indicated. A third source mentioned that the increase could potentially reach 500,000 bpd. OPEC stated in a post on X that media reports suggesting plans to raise output by 500,000 bpd were misleading.\nMarket caution amid supply expansions\nDespite these potential supply-side expansions, the market remains cautious due to ongoing geopolitical risks, particularly those related to the conflict in Ukraine. Moscow faces pressure from drone attacks on its refineries, which could limit its refining capacity and affect diesel exports. Additionally, Russia is reportedly contemplating partial bans on diesel exports until the end of 2025 to manage domestic supply shortages caused by sanctions and operational disruptions. These factors contribute to the uncertainty surrounding the actual flow of Russian oil products and overall market tightness in specific segments.\nLooming U.S. government shutdown\nOn the demand side, concerns persist that global economic growth may not be robust enough to absorb the increasing supplies. The potential U.S. government shutdown looms as Democrats and Republicans clash over budget issues, threatening to disrupt government operations and delay the release of key economic data, including the highly anticipated nonfarm payrolls report scheduled for this Friday. This report is crucial for Federal Reserve officials as they assess the health of the U.S. labor market and their policy stance. Market participants are closely monitoring this data to gauge economic momentum and future energy demand."
            },
            {
                "title": "Crude Oil Inventories Continue to Fall - Crude Oil Prices Today | OilPrice.com",
                "source": "Crude Oil Prices Today | OilPrice.com",
                "url": "https://oilprice.com/Latest-Energy-News/World-News/Crude-Oil-Inventories-Continue-to-Fall.html",
                "body": "Wood Mackenzie warns of a…\n\"It's most important 8 minute read of my week…\"\nThe American Petroleum Institute (API) estimated that crude oil inventories in the United States fell by another 3.674 million barrels in the week ending September 30. This is on top of last week’s 3.821 million barrel draw.\nSo far this year, net crude oil inventories are have swung to a loss this week of 2.22 million barrels, according to Oilprice calculations of API data.\nEarlier this week, the Department of Energy (DoE) reported that crude oil inventories in the Strategic Petroleum Reserve (SPR) rose by 700,000 barrels to 406.7 million barrels in the week ending September 26.\nAdding to the data picture, the U.S. Energy Information Administration’s latest monthly report showed July total liquids production revised sharply higher to 21.218 million barrels per day, nearly half a million bpd above its weekly estimates. Demand was also stronger than implied by the weeklies, with total product supplied at 20.984 million bpd. Both sides of the ledger were hotter than expected, underscoring a tighter U.S. oil market than traders had been pricing in.\nAt 3:17 pm ET, Brent crude was trading down $0.95 (-1.40%) on the day, reaching $67.02. The figure is down $0.90 per barrel from this time last week. WTI was also trading down on the day, by $0.87 (-1.37%) at $62.58—a more than $1 per barrel drop week over week.\nGasoline inventories rose by 1.3 million barrels in the week ending September 26, after falling by 1.046 million barrels in the week prior. As of last week, gasoline inventories were already 2% below the five-year average for this time of year, according to the latest EIA data.\nDistillate inventories rose again this week, adding another 3.003 million barrels, following the week prior’s 518,000-barrel gain. Distillate inventories were 8% below the five-year average as of the week ending September 19, the latest EIA data shows.\nCushing inventories fell by 693,000 barrels in the week, after adding 72,000 barrels in the week prior.\nBy Julianne Geiger for Oilprice.com\nMore Top Reads From Oilprice.com\nADVERTISEMENT\nJulianne Geiger is a veteran editor, writer and researcher for Oilprice.com, and a member of the Creative Professionals Networking Group."
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0049",
            "open": "1.1723",
            "close": "1.1732",
            "high": "1.1761",
            "low": "1.1712"
        },
        "market_summary": "The EUR/USD is trading near 1.1750, supported primarily by a weakening U.S. dollar. The dollar is under pressure from heightened expectations of Federal Reserve rate cuts in October and December, coupled with political uncertainty from a potential U.S. government shutdown. While the euro is gaining, its strength is more a function of dollar weakness than robust Eurozone fundamentals, as domestic data remains mixed and the European Central Bank maintains a steady, data-dependent policy stance.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "EUR/USD Price Forecast - Euro To Dollar Holds 1.1753 as Dollar Index Drops to 97.73, Shutdown Risks Mount, and Fed Cut Odds Hit 90% - TradingNEWS",
                "source": "TradingNEWS",
                "url": "https://www.tradingnews.com/news/eur-usd-price-forecast-euro-to-dollar-climbs-to",
                "body": "EUR/USD Price Forecast - Euro To Dollar Climbs to 1.1753 as Dollar Weakens on Shutdown Fears and Fed Easing Bets\nEuro gains momentum despite weak German data, with DXY sliding to 97.73, traders eyeing resistance at 1.1770–1.1820; Fed cut probabilities hit 90% for October while ECB holds steady with 2025 inflation at 2.4% | That's TradingNEWS\nEUR/USD Holds 1.1750 as Shutdown Risk and Fed Bets Undermine the Dollar\nThe EUR/USD pair is trading near 1.1753, its highest levels in four days, after recovering from last week’s low of 1.1660. The rebound has been powered primarily by U.S. dollar weakness, as investors priced in growing political turmoil over the looming government shutdown and higher chances of additional Federal Reserve rate cuts before year-end. Treasury yields have been slipping across maturities, further softening the dollar’s yield advantage and providing fuel for the euro’s advance. The backdrop of tariffs and trade tensions is amplifying uncertainty, creating an environment where the euro is regaining ground despite weaker domestic data.\nFederal Reserve Rate Path and Dollar Fragility\nOn September 17, the Fed cut interest rates by 25 basis points, lowering its policy rate to a median projection of 3.6% for 2025. The updated dot plot implies another 50 bps of easing by year-end, with smaller reductions stretching into 2026 and 2027. Inflation remains sticky at 2.7% headline PCE and 2.9% core, with Powell noting that tariffs are keeping goods prices elevated while services inflation shows early signs of easing. He acknowledged the challenge of balancing a cooling labor market with persistent price pressures, describing risks as “more balanced.” Markets, however, are leaning dovish: CME FedWatch data shows a 90% probability of a rate cut in October and about 70% odds of another in December. This aggressive repricing has dragged the Dollar Index (DXY) down to 97.73, its third consecutive session of losses, and opened the door for EUR/USD to reclaim momentum.\nECB Steady While Eurozone Data Stumbles\nThe European Central Bank has maintained its wait-and-see stance, keeping rates unchanged while projecting core inflation at 2.4% in 2025, cooling toward 1.9% in 2026 and 1.8% in 2027. President Christine Lagarde stressed policy is in a “good place” and reiterated that decisions will remain data-dependent. Yet Eurozone macro figures have been disappointing. German Retail Sales fell 0.2% in August, following July’s 0.5% decline, while import prices dropped 0.5% month-on-month and -1.5% year-on-year. Confidence indicators are mixed, with Consumer Confidence improving slightly to -14.9, but industrial and services sentiment declining. Without stronger domestic support, the euro’s strength hinges more on dollar weakness than fundamental Eurozone demand.\nTrade Tariffs and Political Backdrop Pressuring USD\nFresh trade tensions are compounding dollar weakness. Former President Trump’s proclamation of new tariffs, effective October 14, included a 10% levy on lumber imports and 25% duties on vanities, cabinetry, and upholstered furniture, alongside earlier tariffs on heavy trucks and pharmaceuticals. The measures raise inflation risks while threatening supply chains, reinforcing expectations of Fed easing to cushion growth. The unresolved government funding bill has added political risk: VP JD Vance warned a shutdown was “highly likely,” and that federal job cuts could follow, while data releases such as Friday’s Nonfarm Payrolls may be delayed. Such developments deprive the Fed of key inputs and keep pressure on the greenback.\nMarket Positioning and Futures Data on EUR/USD\nSpeculators have started trimming bullish euro bets. CFTC data for the week ending September 23 showed net longs in EUR shrinking to 114.3K contracts, the lowest since July, while institutional net shorts narrowed to 165.8K contracts. Open interest climbed to 859.2K, a two-week high, suggesting cautious positioning as volatility builds. This indicates traders are "
            },
            {
                "title": "Navigating the Storm: Fed Rate Cut Hopes and Shutdown Fears Shape EUR/USD Outlook - FinancialContent",
                "source": "FinancialContent",
                "url": "https://markets.financialcontent.com/stocks/article/marketminute-2025-9-30-navigating-the-storm-fed-rate-cut-hopes-and-shutdown-fears-shape-eurusd-outlook",
                "body": "The financial markets are currently gripped by a potent mix of anticipation and apprehension as the Federal Reserve's dovish pivot takes center stage. With the odds of a further Fed interest rate cut in October reaching as high as 90%, following an initial 25-basis-point reduction in September 2025, the U.S. dollar is facing significant downward pressure. This diminished yield advantage for the greenback is providing a tailwind for the Euro (EUR), pushing the EUR/USD exchange rate higher. Compounding this monetary policy shift are persistent U.S. government shutdown risks, injecting political uncertainty and economic instability, which further erode confidence in the dollar and underscore the complex environment facing investors and businesses alike.\nThe Fed's Dovish Shift: A Timeline of Easing Expectations\nThe journey to the current high probability of Fed rate cuts has been a carefully watched saga, unfolding over the latter half of 2025. This significant shift from a restrictive monetary policy to an easing cycle was primarily driven by a confluence of softening inflation data, a cooling labor market, and explicit communications from Federal Reserve officials.\nThe Fed had maintained a restrictive stance, with the federal funds rate at a 23-year high of 5.25% to 5.50% from July 2023 to September 2024, to combat surging inflation. However, December 2024 marked the first rate cut, bringing the target range down to 4.25%-4.50%. By the July 2025 Federal Open Market Committee (FOMC) meeting, while rates remained unchanged, the committee softened its language on inflation and began emphasizing its \"dual mandate\" of stable prices and maximum employment. This subtle but crucial pivot signaled a greater willingness to consider easing, with market expectations for a September cut already at 90%.\nEarly August 2025 saw market probabilities for a September rate cut surge, peaking at 94% according to the CME FedWatch Tool. Even a core Consumer Price Index (CPI) reading of 3.1% year-over-year on August 13, though slightly above consensus, was perceived as \"not worse than feared,\" further solidifying expectations. Leading up to the September 2025 FOMC meeting, the probability of a cut consistently remained over 90%, fueled by weakening job data, growing political pressure, and the Fed's own signals. Economic forecasts indicated a significant slowdown in GDP growth during the first half of 2025, and the labor market showed clear signs of cooling.\nOn September 17, 2025, the Federal Reserve acted, delivering a 25-basis-point rate cut, bringing the federal funds rate to 4.00%–4.25%. Fed Chair Jerome Powell characterized this as a \"risk management cut,\" aimed at preventing further deceleration in the labor market. In the days following this cut, as of late September 2025, market attention has shifted to further easing, with futures markets pricing in a 90% chance of another rate cut in October and approximately a 65% probability of an additional move in December, especially as core Personal Consumption Expenditures (PCE) inflation remained under 3%.\nKey players in this narrative include Fed Chair Jerome Powell, whose cautious yet open rhetoric has been closely scrutinized. Other Fed officials like Mary Daly (President of the Federal Reserve Bank of San Francisco), Michelle Bowman (Fed Governor), and Thomas Barkin (President of the Federal Reserve Bank of Richmond) have also offered dovish commentary, highlighting labor market fragility. Notably, newly appointed Governor Stephen Miran cast a dissenting vote in September, advocating for a larger 50-basis-point cut, underscoring the strong dovish sentiment within some Fed circles. Economic indicators like inflation data (CPI and PCE), labor market reports, and GDP growth figures have been the primary drivers of policy shifts. Political pressure, particularly from President Donald Trump, also played a role in advocating for rate cuts.\nInitial market reactions to the increasing probability of rate cu"
            },
            {
                "title": "EUR/USD stays near 1.1750 ahead of potential US government shutdown, HICP inflation - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/eur-usd-stays-near-11750-ahead-of-potential-us-government-shutdown-hicp-inflation-202510010353",
                "body": "- EUR/USD remains steady as traders adopt caution ahead of the Eurozone Harmonized Index of Consumer Prices.\n- US federal government funding is set to expire at 04:00 GMT on Wednesday, potentially triggering a shutdown.\n- The US Dollar faces challenges as recent US jobs data boosted expectations of further Fed rate cuts.\nEUR/USD moves little after three days of gains, trading around 1.1730 during the Asian hours on Wednesday. The pair remains steady ahead of the preliminary Eurozone Harmonized Index of Consumer Prices (HICP) due later in the day.\nEurozone HICP is expected to rise 2.2% year-over-year in September, following a 2.0% increase in August. Meanwhile, the annual core HICP inflation is anticipated to remain consistent at 2.3% in the same month. The monthly inflation and core inflation were at 0.1% and 0.3%, respectively, in August.\nUS federal government funding is set to expire at 04:00 GMT on Wednesday, leading to a government shutdown. Around 750,000 federal employees are facing furlough after Congress failed to pass funding bills. The US Labor Department said Monday that its statistics agency would suspend data releases, including Friday’s closely watched monthly jobs report, if a partial shutdown occurs,\" per Reuters.\nThe EUR/USD pair may further appreciate as the US Dollar (USD) struggles after soft US jobs data increased the odds of Federal Reserve (Fed) rate cuts. The CME FedWatch Tool suggests that markets are now pricing in nearly a 97% chance of a Fed rate cut in October and a 76% possibility of another reduction in December.\nThe latest Job Openings showed the labor market is slowing, yet vacancies rose from 7.21 million to 7.23 million in August. Meanwhile, the hiring rate edged down to 3.2%, the lowest level since June 2024, while layoffs remained at a low level.\nEuro FAQs\nThe Euro is the currency for the 19 European Union countries that belong to the Eurozone. It is the second most heavily traded currency in the world behind the US Dollar. In 2022, it accounted for 31% of all foreign exchange transactions, with an average daily turnover of over $2.2 trillion a day. EUR/USD is the most heavily traded currency pair in the world, accounting for an estimated 30% off all transactions, followed by EUR/JPY (4%), EUR/GBP (3%) and EUR/AUD (2%).\nThe European Central Bank (ECB) in Frankfurt, Germany, is the reserve bank for the Eurozone. The ECB sets interest rates and manages monetary policy. The ECB’s primary mandate is to maintain price stability, which means either controlling inflation or stimulating growth. Its primary tool is the raising or lowering of interest rates. Relatively high interest rates – or the expectation of higher rates – will usually benefit the Euro and vice versa. The ECB Governing Council makes monetary policy decisions at meetings held eight times a year. Decisions are made by heads of the Eurozone national banks and six permanent members, including the President of the ECB, Christine Lagarde.\nEurozone inflation data, measured by the Harmonized Index of Consumer Prices (HICP), is an important econometric for the Euro. If inflation rises more than expected, especially if above the ECB’s 2% target, it obliges the ECB to raise interest rates to bring it back under control. Relatively high interest rates compared to its counterparts will usually benefit the Euro, as it makes the region more attractive as a place for global investors to park their money.\nData releases gauge the health of the economy and can impact on the Euro. Indicators such as GDP, Manufacturing and Services PMIs, employment, and consumer sentiment surveys can all influence the direction of the single currency. A strong economy is good for the Euro. Not only does it attract more foreign investment but it may encourage the ECB to put up interest rates, which will directly strengthen the Euro. Otherwise, if economic data is weak, the Euro is likely to fall. Economic data for the four largest economies in the euro area (Germany, "
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0054",
            "open": "1.3423",
            "close": "1.3442",
            "high": "1.3467",
            "low": "1.3413"
        },
        "market_summary": "The GBP/USD pair is gaining ground, trading near 1.3460, driven by a combination of US Dollar weakness and Sterling strength. The Dollar is under pressure from rising expectations of Fed rate cuts, a potential government shutdown delaying key economic data, and soft labor market indicators. The Pound is being supported by a better-than-expected UK Q2 GDP growth figure of 1.4% YoY, though this is tempered by dovish comments from a BoE official advocating for a rate cut.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "GBP/USD rises above 1.3450 on rising odds of further Fed rate cuts - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-usd-rises-above-13450-on-rising-odds-of-further-fed-rate-cuts-202510010522",
                "body": "- GBP/USD gains ground as the US Dollar weakens due to the increasing likelihood of more Fed rate cuts in 2025.\n- The CME FedWatch Tool indicates the pricing in a 97% chance of a Fed rate cut in October.\n- The Pound Sterling gains ground as the UK economy rose in the second quarter.\nGBP/USD extends its winning streak for the fourth successive session, trading around 1.3460 during the Asian hours on Wednesday. The pair may further appreciate as the US Dollar (USD) faces challenges after soft US jobs data increased the odds of Federal Reserve (Fed) rate cuts. The CME FedWatch Tool suggests that markets are now pricing in nearly a 97% chance of a Fed rate cut in October and a 76% possibility of another reduction in December.\nThe recent US Job Openings showed the labor market is slowing, yet vacancies rose from 7.21 million to 7.23 million in August. Meanwhile, the hiring rate edged down to 3.2%, the lowest level since June 2024, while layoffs remained at a low level. Traders are likely to await the release of September’s US ADP Employment Change and ISM Manufacturing PMI data, which could be affected due to the government shutdown.\nThe US government has shut down, with around 750,000 federal employees facing furloughs after Congress failed to pass funding bills. The US Labor Department said Monday that its statistics agency would suspend data releases, including Friday’s closely watched monthly jobs report, if a partial shutdown occurs.\nThe GBP/USD pair gained ground as the Pound Sterling (GBP) received support after the stronger United Kingdom (UK) Gross Domestic Product (GDP) data for the second quarter was released on Tuesday. The figures showed that the UK economy rose by 1.4% YoY, faster than the preliminary release of 1.2%. Quarter-on-quarter GDP growth remained in line with flash estimates of 0.3%.\nHowever, the British pound could come under pressure as Bank of England (BoE) Deputy Governor Dave Ramsden has advocated for a rate cut amid mounting concerns in the UK labor market. Ramsden also expressed confidence that inflationary pressures will ease, noting that current interest rates remain restrictive.\nPound Sterling FAQs\nThe Pound Sterling (GBP) is the oldest currency in the world (886 AD) and the official currency of the United Kingdom. It is the fourth most traded unit for foreign exchange (FX) in the world, accounting for 12% of all transactions, averaging $630 billion a day, according to 2022 data. Its key trading pairs are GBP/USD, also known as ‘Cable’, which accounts for 11% of FX, GBP/JPY, or the ‘Dragon’ as it is known by traders (3%), and EUR/GBP (2%). The Pound Sterling is issued by the Bank of England (BoE).\nThe single most important factor influencing the value of the Pound Sterling is monetary policy decided by the Bank of England. The BoE bases its decisions on whether it has achieved its primary goal of “price stability” – a steady inflation rate of around 2%. Its primary tool for achieving this is the adjustment of interest rates. When inflation is too high, the BoE will try to rein it in by raising interest rates, making it more expensive for people and businesses to access credit. This is generally positive for GBP, as higher interest rates make the UK a more attractive place for global investors to park their money. When inflation falls too low it is a sign economic growth is slowing. In this scenario, the BoE will consider lowering interest rates to cheapen credit so businesses will borrow more to invest in growth-generating projects.\nData releases gauge the health of the economy and can impact the value of the Pound Sterling. Indicators such as GDP, Manufacturing and Services PMIs, and employment can all influence the direction of the GBP. A strong economy is good for Sterling. Not only does it attract more foreign investment but it may encourage the BoE to put up interest rates, which will directly strengthen GBP. Otherwise, if economic data is weak, the Pound Sterling is likely to fall.\nAnother si"
            },
            {
                "title": "GBP/USD Price Forecast - Pound to Dollar at 1.3461 as U.K. GDP Beats 1.4% YoY, U.S. Confidence Falls to 94.2, and Shutdown Risks Hit Dollar - TradingNEWS",
                "source": "TradingNEWS",
                "url": "https://www.tradingnews.com/news/gbp-usd-price-forecasst-pound-to-dollar-stabilizes-at-13461-as-uk-growth-beats-forecasts",
                "body": "GBP/USD Price Forecast - Pound to Dollar Stabilizes at 1.3461 as U.K. Growth Beats Forecasts and U.S. Shutdown Fears Pressure Dollar\nThe pound gains after Q2 GDP expands 1.4% YoY, while the dollar weakens on shutdown risk and confidence drop to 94.2; GBP/USD trades inside 1.3300–1.3500 band with resistance at 1.3500 and support at 1.3330 ahead of crucial U.S. jobs report | That's TradingNEWS\nGBP/USD Extends Gains as Shutdown Fears Pressure Dollar and Sterling Holds 1.3461\nThe British pound has extended its advance against the U.S. dollar for a third consecutive session, with GBP/USD trading at 1.3461, up 0.20% on the day, as political dysfunction in Washington drives investors to sell the greenback. The looming U.S. government shutdown has weakened demand for the dollar, raising fears that critical economic releases such as Friday’s Nonfarm Payrolls may be delayed. This comes as the U.K. delivered an upside surprise in growth, with Q2 GDP expanding 1.4% year-on-year, beating expectations of 1.2%. The combination of dollar weakness and U.K. resilience has kept sterling firm, even though the pair is still poised to close the month down 0.40% overall.\nLabour Market Data and Fed Policy Expectations Remain Central for GBP/USD\nThe U.S. labor market remains the defining factor for near-term dollar momentum. Job openings rose modestly from 7.208 million in July to 7.227 million in August, beating estimates but signaling only gradual demand for workers. At the same time, Conference Board Consumer Confidence plunged from 97.8 to 94.2, missing forecasts of 96.0 and marking the ninth straight decline in perceptions of job availability. The divergence between employment growth and consumer outlook has put the Federal Reserve in a difficult position. Markets now price in another two basis points of easing by year-end, with cumulative cuts totaling 104 basis points through 2026. A stronger Nonfarm Payrolls release could halt GBP/USD’s rally by reviving hawkish Fed bets, while a weak print could open the path toward 1.35–1.36.\nTechnical Picture: 1.3300 Holds as Support, Resistance Builds at 1.3450–1.3500\nGBP/USD has recovered from September lows near 1.3230, a level that aligned with the ascending trendline from July. Momentum carried the pair back to test the 1.3450 resistance zone, a confluence of the 50-day, 100-day, and 20-day simple moving averages at 1.3463, 1.3488, and 1.3504 respectively. The relative strength index (RSI) is still below neutral but is trending higher, suggesting that buying pressure is gathering pace. If GBP/USD breaks above 1.3500, the next resistance lies at 1.3550, followed by 1.3600 and 1.3700. On the downside, failure to defend 1.3400 could push the pair back toward 1.3330, with further losses risking a return to the 1.3300 support floor.\nPolitical Risks on Both Sides of the Atlantic Shape Sterling Outlook\nWhile the U.S. shutdown drama dominates headlines, domestic U.K. politics remain a secondary but important driver for sterling. The Labour Party conference in Liverpool has investors cautious about fiscal positioning, with concerns that aggressive spending promises could stoke gilt volatility. Bank of England rhetoric offers a counterbalance, with hawkish commentary from Governor Andrew Bailey expected later this week. If Bailey signals that rates will remain restrictive despite slowing growth, sterling could gain an additional layer of support. On the U.S. side, President Trump’s negotiations with Congress remain a flashpoint: even a short-lived shutdown could weaken the dollar further, giving GBP/USD room to extend higher.\nRead More\n-\nEtsy Stock Price Forecast - ETSY Stock Drops to $66.39 After $75.77 High as NYSE Listing and OpenAI Integration Fuel Wild Swings\n30.09.2025 · TradingNEWS ArchiveStocks\n-\nXRP Price Forecast: XRP-USD $2.85 Support, $340M Whale Buys, and October Ripple ETF Decisions Set Stage for Breakout\n30.09.2025 · TradingNEWS ArchiveCrypto\n-\nOil Price Forecast - Oil Drops, WTI at $62.53 and Bre"
            },
            {
                "title": "US Dollar Forecast: Tariffs and Fed Easing Pressure Greenback, GBP/USD and EUR/USD - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/us-dollar-forecast-tariffs-and-fed-easing-pressure-greenback-gbp-usd-and-eur-usd-1551709",
                "body": "The U.S. Dollar Index (DXY) held weak around 97.73 on Tuesday, marking its third consecutive session of losses. The cautious tone reflects investor hesitation ahead of critical U.S. labor market releases, which are expected to shape both economic outlook and Federal Reserve policy.\nAdded to this, political uncertainty surrounding a potential government shutdown continues to weigh on sentiment.\nMarkets are focused on September’s Nonfarm Payrolls, job openings, private payrolls, and the ISM manufacturing PMI. However, a possible shutdown could delay these reports, leaving traders without crucial guidance.\nPolitical risks have intensified after warnings that federal job cuts could follow if lawmakers fail to approve a funding bill, keeping pressure on the dollar as investors await clarity.\nTrade risks are also in focus. Reuters reported that former President Donald Trump signed a proclamation imposing tariffs of 10% on lumber imports and 25% on vanities, cabinets, and upholstered wooden products. Effective October 14, the measures raise concerns over inflationary pressures and potential supply chain disruptions.\nMonetary policy expectations reinforce the dollar’s weakness. CME FedWatch shows nearly a 90% probability of a rate cut in October and 70% odds of another in December. Rising bets on Fed easing continue to pressure Treasury yields and cap the dollar’s recovery.\nThe U.S. Dollar Index is trading at 97.73 after slipping below the 50-EMA (97.93) and the 200-EMA (97.74), turning both into immediate resistance. Price broke down from its rising channel, confirming weaker momentum.\nThe RSI is at 35, showing the index is close to oversold levels but not yet at extremes. Support sits at 97.20 and then 96.83, while a deeper move could test 96.23.\nOn the upside, a rebound above 97.90 would be needed to shift momentum back toward 98.20–98.56. For now, sellers hold control, and the focus remains on whether support levels can stabilize the index or if further downside develops.\nThe GBP/USD is trading around $1.3447, consolidating near the $1.3467 resistance zone. Price is testing a descending trendline, while the 50-EMA at $1.3432 acts as immediate support. The 200-EMA at $1.3486 remains a stronger resistance barrier.\nA clear breakout above $1.3467 could open the way toward $1.3537, while failure here risks a pullback toward $1.3386 and $1.3328. The RSI at 58 shows improving momentum but not yet overextended, suggesting room for further upside if bulls maintain pressure.\nThe EUR/USD is trading near $1.1753 after breaking above its descending channel, signaling improving momentum. Price is now holding above the 200-EMA at $1.1736 and testing the 50-EMA at $1.1727, turning them into short-term support.\nThe RSI at 64 shows strengthening momentum, but not yet overbought. Key resistance sits at $1.1820 and $1.1871, while support lies at $1.1661 if buyers lose control.\nA sustained close above $1.1770 would reinforce bullish momentum toward $1.1820, while failure to hold above $1.1730 could bring the pair back into consolidation. For now, the bias leans upward, with traders watching U.S. data for confirmation.\nArslan is a finance MBA and also holds an MPhil degree in behavioral finance. An expert in financial analysis and investor psychology, Arslan uses his academic background to bring valuable insights about market sentiment and whether instruments are likely to be overbought or oversold."
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0058",
            "open": "0.6570",
            "close": "0.6611",
            "high": "0.6628",
            "low": "0.6570"
        },
        "market_summary": "The Australian Dollar strengthened significantly following the RBA's decision to hold rates, with a more hawkish-than-expected tone that priced out near-term rate cuts. This was driven by warnings of upside inflation risks and stronger-than-anticipated private demand, causing AUD/USD to break key technical resistance levels. The pair's rally was further supported by a weakening US Dollar, which faced pressure from the threat of a US government shutdown.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Australian Dollar Price Action Setups: AUD/USD, AUD/JPY, GBP/AUD - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/australian-dollar-price-action-setups-aud-usd-aud-jpy-gbp-aud/?amp=true",
                "body": "Australian Dollar Price Action Setups: AUD/USD, AUD/JPY, GBP/AUD\nThe RBA’s decision to hold the cash rate at 3.65% came as no surprise, though the tone was a touch more hawkish than some expected. The opening paragraph of the statement acknowledged that early reads of inflation suggest CPI could come in hotter for Q3 than assumed in the August Statement on Monetary Policy (SOMP). Policymakers also noted that private demand — most notably household consumption — remains a key driver of growth. These are not the words one expects from a central bank preparing to cut rates. As a result, the Australian dollar (AUD) was the strongest FX major on Tuesday, with shorts scrambling to cover as bond yields tracked higher.\nView related analysis:\n- ASX 200 Morning Market Outlook: ASX Snaps 5-Month Winning Streak\n- AUD/USD, AUD/JPY: Australian Dollar Diverges Against US Dollar and Yen\n- Japanese Yen Price Action Setups: USD/JPY, AUD/JPY, GBP/JPY\nAUD/USD Technical Analysis: Australian Dollar vs US Dollar\nWith the RBA’s next rate cut being priced out, the swing low on AUD/USD may have arrived earlier than expected. The Australian dollar has now posted three consecutive daily gains, each marked by increasing bullish volatility.\nThat said, it’s uncertain whether AUD/USD can immediately break to fresh cycle highs. The US dollar index remains prone to short covering, while the resistance cluster around the September high — which also aligns with the November high and two 200-day moving averages — could prove difficult for bulls to clear.\nWith prices hovering just beneath the July high, some mean reversion on lower timeframes may be due before a sustained breakout higher.\nChart analysis by Matt Simpson - data source: TradingView AUD/USD\nAUD/JPY Technical Analysis: Australian Dollar vs Japanese Yen\nWhile momentum has yet to turn decisively higher on AUD/JPY, my bullish bias from last week remains intact. The pair has held a steady bullish structure since the August low, with price consolidating above the July high and the 97.24 high-volume node (HVN).\nTuesday’s long-legged doji formed a higher low above last week’s morning star reversal, reinforcing evidence of underlying demand. Dips within Tuesday’s range may offer opportunities for bulls anticipating further gains. The 99 handle near the year-to-date high remains the first upside target, with a break above bringing the 100 handle into focus.\nChart analysis by Matt Simpson - data source: TradingView AUD/JPY\nGBP/AUD Technical Analysis: British Pound vs Australian Dollar\nGBP/AUD Technical Analysis: Monthly Chart\nPrice action on the monthly GBP/AUD chart suggests a major cycle high may have formed in April. A shooting star candle marked the end of the rally from the 2022 low, while September’s bearish engulfing pattern signals momentum has shifted against the bulls.\nChart analysis by Matt Simpson - data source: TradingView GBP/AUD\nGBP/AUD Technical Analysis: Daily Chart\nThe Australian dollar has been trending lower against the British pound since the August high six weeks ago. Over this period, GBP/AUD has seen little in the way of a pullback, and momentum has turned lower again after a two-week consolidation around the 200-day SMA. That moving average has since acted as resistance, and GBP/AUD is now on the verge of breaking beneath the December high. Given the strength of the bearish trend, a move below the February high also looks likely.\nShould GBP/AUD bears prevail, a retest of the 2.00 handle or the February VPOC (1.9794) could be on the cards.\nChart analysis by Matt Simpson - data source: TradingView GBP/AUD\nKey Economic Events for Traders (AEST / GMT+10)\n09:50 JPY Tankan Index (Q3) (USD/JPY, EUR/JPY, Nikkei 225)\n10:30 JPY au Jibun Bank Manufacturing PMI (Sep) (USD/JPY, EUR/JPY, Nikkei 225)\n11:30 AUD RBA Chart Pack Release (AUD/USD, AUD/JPY, AUD/NZD)\n16:00 GBP Nationwide HPI (Sep) (GBP/USD, EUR/GBP, FTSE 100)\n16:30 CHF Retail Sales (Aug) (USD/CHF, EUR/CHF, CHF/JPY)\n16:30 AUD Commodity Prices "
            },
            {
                "title": "AUD/USD Forecast: Are Fresh Highs Incoming After RBA Rate Hold? - marketpulse.com",
                "source": "marketpulse.com",
                "url": "https://www.marketpulse.com/markets/audusd-forecast-are-fresh-highs-incoming-after-rba-rate-hold/",
                "body": "Most Read: Taking a step back – key long-term market charts and levels\nAUD/USD has risen 0.6% from its Tuesday low of 0.6572 as the US Dollar continued its slide. The Dollar struggle is partly linked to a potential US Government shutdown with Congress needing to agree to temporary funding before 04h00 GMT on Wednesday.\nRBA Rate Hold Boosts Aussie Dollar\nThe Reserve Bank of Australia (RBA) decided to keep its main interest rate, known as the cash rate, unchanged at 3.6%. This decision was expected by the markets and indicates a more cautious approach by the central bank.\nThis careful stance is due to concerns that overall inflation is starting to creep up toward the top of the RBA's target range of 2% to 3%. Because of this decision, the chances of the RBA cutting rates at its next meeting in November are now much lower, which is helping to keep the Australian dollar strong.\nAccording to LSEG data, markets are now pricing in a 60% probability of a rate hold from the RBA at the November meeting.\nSource: LSEG\nThe recent rise in annual CPI inflation to 3% is causing uncertainty about whether it is just a temporary spike or a sign of deeper, lasting inflation problems.\nSpecifically, prices for housing-related items, like rent and new homes, showed renewed strength, which might suggest the housing market is reacting to the RBA's earlier rate cuts.\nFurthermore, the sharp increase in prices for services, such as holidays, travel, and insurance, points to a rebound in consumer spending.\nAs things stand, the RBA would like to see inflation pushing lower toward the 2.5% mark and sustainably so. If this happens, there is a chance that a rate cut in November could yet materialize.\nIn the interim though, the Aussie Dollar should get a boost from the RBA decision and rhetoric.\nUS Data and Government Shutdown Now in Focus\nThe rest of the week will see attention shift to the US Dollar and its reaction to a potential US Government shutdown. A shutdown could lead to the NFP data release being delayed and that could bring about some form of volatility.\nIf temporary funding is agreed, then attention will immediately shift to NFP and jobs data from the US. A weaker NFP print could aid the AUD/USD to rise further and test the YTD high.\nFor all market-moving economic releases and events, see the MarketPulse Economic Calendar. (click to enlarge)\nTechnical Analysis - AUD/USD\nFrom a technical point of view, AUD/USD is on a three day winning streak after bouncing off support at the 100-day MA.\nStructure has been broken with Tuesday's daily candle closing above the recent swing high at 0.6600.\nFurther strengthening the case for further upside, is the bull flag breakout which occurred on Tuesday as well.\nImmediate resistance rests at 0.6684 before the 0.6750 and 0.7000 psychological level comes into focus.\nIf AUD/USD pushes lower from here, immediate support rests at 0.6542, 0.6522 and 0.6500. A break below 0.6500 could open up a retest of the 200-day MA, which rests at the 0.6408 handle.\nAUD/USD Daily Chart, September 30, 2025\nSource: TradingView.com\nFollow Zain on Twitter/X for Additional Market News and Insights @zvawda\nOpinions are the authors'; not necessarily that of OANDA Business Information & Services, Inc. or any of its affiliates, subsidiaries, officers or directors. The provided publication is for informational and educational purposes only.\nIf you would like to reproduce or redistribute any of the content found on MarketPulse, an award winning forex, commodities and global indices analysis and news site service produced by OANDA Business Information & Services, Inc., please refer to the MarketPulse Terms of Use.\nVisit https://www.marketpulse.com/ to find out more about the beat of the global markets.\n© 2025 OANDA Business Information & Services Inc."
            },
            {
                "title": "AUD/USD surges above 0.6600 as RBA warns of upside inflation risks - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/aud-usd-surges-above-06600-as-rba-warns-of-upside-inflation-risks-202509300837",
                "body": "- AUD/USD advances above 0.6600 as RBA seems unlikely to cut interest rates in the near term.\n- The RBA held its OCR steady at 3.6%, as expected, and warns of upside inflation risks.\n- Investors await US JOLTS Job Openings data for August.\nThe AUD/USD pair jumps to near 0.6600 during the European trading session on Tuesday. The Aussie pair has been trading strongly as the Australian Dollar (AUD) outperforms its peers, following the monetary policy announcement by the Reserve Bank of Australia (RBA).\nAustralian Dollar Price Today\nThe table below shows the percentage change of Australian Dollar (AUD) against listed major currencies today. Australian Dollar was the strongest against the US Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Australian Dollar from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent AUD (base)/USD (quote).\nEarlier in the day, the RBA held its Official Cash Rate (OCR) steady at 3.6%, as expected, and remained uncertain over interest rate cuts in the near-term amid upside inflation risks.\n“Components of monthly Consumer Price Index (CPI) are little higher than expected, inflation is not running away,” RBA Governor Michelle Bullock said.\nThe RBA has also signaled that inflation in the third quarter is expected to come in higher than what ad anticipated in August.\nMeanwhile, the US Dollar (USD) faces selling pressure due to mounting risks of potential United States (US) government shutdown as Republicans struggle to persuade Democrats to support stopgap bill before the Tuesday midnight deadline.\nThe US Dollar Index (DXY), which tracks the Greenback’s value against six major currencies, trades marginally lower around 97.80.\nIn Tuesday’s session, investors will focus on US JOLTS Job Openings data for August, which will be published at 14:00 GMT. The report is expected to show that US employers posted fresh 7.1 million jobs, in line with the prior reading of 7.18 million.\nEconomic Indicator\nRBA Interest Rate Decision\nThe Reserve Bank of Australia (RBA) announces its interest rate decision at the end of its eight scheduled meetings per year. If the RBA is hawkish about the inflationary outlook of the economy and raises interest rates it is usually bullish for the Australian Dollar (AUD). Likewise, if the RBA has a dovish view on the Australian economy and keeps interest rates unchanged, or cuts them, it is seen as bearish for AUD.\nRead more.Last release: Tue Sep 30, 2025 04:30\nFrequency: Irregular\nActual: 3.6%\nConsensus: 3.6%\nPrevious: 3.6%\nSource: Reserve Bank of Australia\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock m"
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "0.7630",
            "open": "147.8050",
            "close": "147.5430",
            "high": "148.2200",
            "low": "147.4570"
        },
        "market_summary": "The USD/JPY pair is experiencing downward pressure, trading near 148.00, as markets digest a mix of fundamental factors. Hawkish expectations for the Bank of Japan (BoJ) to normalize policy, reinforced by its September meeting summary, are providing support for the Yen. This is compounded by a weaker US Dollar, which is being undermined by bets on Federal Reserve rate cuts and the risk of a US government shutdown, leading to a narrowing of the US-Japan rate differential.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "USD/JPY steadies near 148.00 as BoJ hawkish stance caps gains - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-jpy-holds-steady-near-14800-mark-upside-potential-seems-limited-202510010153",
                "body": "- Japanese Yen attracts some sellers during the Asian session on Wednesday, though it lacks follow-through.\n- Hawkish BoJ expectations and sustained safe-haven buying help limit any meaningful downside for the JPY.\n- Fed rate cut bets keep the USD bulls on the defensive and further act as a headwind for the USD/JPY pair.\nThe Japanese Yen (JPY) trades with a negative bias during the Asian session on Wednesday, though the lack of follow-through selling warrants some for bearish traders amid hawkish Bank of Japan (BoJ) expectations. In fact, the Summary of Opinions from the BoJ's September meeting reaffirmed expectations that the central bank will stick to its policy normalization path. This, along with rising geopolitical tensions and concerns about the US government shutdown, acts as a tailwind for the safe-haven JPY.\nMeanwhile, bets for an imminent BoJ rate hike mark a significant divergence in comparison to expectations that the US Federal Reserve (Fed) will lower borrowing costs twice this year. The latter undermines the US Dollar (USD) and the resultant narrowing of the US-Japan rate differential could benefit the lower-yielding JPY. This warrants caution before confirming that the USD/JPY pair's corrective slide from the 150.000 psychological mark, or the highest level since August 1, touched last week, has run its course.\nJapanese Yen benefits from divergent BoJ-Fed outlooks and flight to safety\n- Japan’s Manufacturing PMI for September was finalized at 48.5, down from 49.7 in the previous month and marking the fastest pace of contraction in six months. That said, the Bank of Japan's Tankan survey signaled a slight improvement in business sentiment among large Japanese manufacturers for the second consecutive quarter. In fact, the Tankan Large Manufacturers' Index increased from 13 to 14 during the July-September period.\n- This comes on top of the BoJ Summary of Opinions from the September meeting released on Tuesday, indicating increasing pressure from hawks to normalise policy, and keeps the door open for an imminent rate hike. Traders are still pricing in the possibility of a 25-basis-point rate hike by the BoJ in October, which continues to act as a tailwind for the Japanese Yen and limits the downtick witnessed during the Asian session on Wednesday.\n- Meanwhile, a Republican spending bill failed to pass through the Senate on Tuesday, leading to a partial US government shutdown starting midnight. A prolonged shutdown could have an adverse effect on economic performance and set the stage for a more aggressive policy easing by the US Federal Reserve. According to the CME Group's FedWatch Tool, traders are pricing in a greater chance of two Fed rate cuts in October and December.\n- On the economic data front, the US Bureau of Labor Statistics (BLS) reported in the Job Openings and Labor Turnover Survey (JOLTS) on Tuesday that the number of job openings on the last business day of August stood at 7.22 million. The reading was slightly above the 7.2 million estimated, though it does little to impress the US Dollar bulls or assist the USD/JPY pair to build on its modest intraday move up to the 148.20-148.25 region.\n- Traders now look forward to Wednesday's US economic docket – featuring the release of the ADP report on private-sector employment and the ISM Manufacturing PMI. The US Labor Department said Monday its statistics agency would halt data releases - including Friday's closely-watched Nonfarm Payrolls (NFP) report - if a partial government shutdown occurs, leaving the USD at the mercy of comments from influential FOMC members.\nUSD/JPY could accelerate decline below 147.00\nFrom a technical perspective, the USD/JPY pair's intraday uptick on Wednesday falters ahead of the 200-day Simple Moving Average (SMA). Some follow-through selling below the overnight swing low, around the 147.65 region, could pave the way for deeper losses and drag spot prices to the 147.20-147.15 zone. This is followed by the 147.00 mark, which, i"
            },
            {
                "title": "USD/JPY Under Pressure: All Eyes on Bank of Japan Rhetoric - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/analysis/usdjpy-under-pressure-all-eyes-on-bank-of-japan-rhetoric-200667721",
                "body": "US government shutdown begins after GOP funding bill fails in Senate\nThe USD/JPY pair fell to 148.49, marking a third consecutive day of declines as markets digest mixed signals from the Bank of Japan.\nThe recently published summary of opinions from the September meeting revealed a divided policy committee. Some members advocated for further rate hikes, assuming current growth and inflation forecasts hold. Others, however, argued for maintaining low rates to help cushion the economy from the impact of new US tariffs.\nFurther highlighting the internal debate, one board member emphasised a wait-and-see approach, stressing the need to monitor global trade policy, the yen’s exchange rate, and domestic price and wage dynamics. In contrast, another member noted that with over six months having passed since the last policy shift, it was time to consider another increase.\nWeakening Japanese economic data added to the downward pressure. August retail sales fell 1.1%, missing forecasts for 1.0% growth and marking the first decline since February 2022. Industrial production figures also came in worse than expected.\nTechnical Analysis: USD/JPY\nH4 Chart:\nOn the H4 chart, USD/JPY formed a tight consolidation range around 148.80. Today’s downside breakout has extended the correction, with the next target at 147.72. Upon reaching this level, we anticipate a potential new growth wave towards 149.95. This scenario is technically confirmed by the MACD indicator, whose signal line is above zero but pointing firmly downward.\nH1 Chart:\nThe H1 chart shows the pair completed a decline to 148.80 and consolidated around this level. The subsequent downside breakout has confirmed the continuation of the bearish wave structure towards 147.72. The Stochastic oscillator supports this view, with its signal line below 50 and falling sharply towards 20.\nConclusion\nUSD/JPY remains under pressure amid divergent signals from the BoJ and soft domestic data. While the near-term technical bias is bearish, the current decline is viewed as a correction within a broader uptrend, with the potential for a renewed upward move upon completion of the current wave.\nBy RoboForex Analytical Department\nDisclaimer:\nAny forecasts contained herein are based on the author’s particular opinion. This analysis may not be treated as trading advice. RoboForex bears no responsibility for trading results based on trading recommendations and reviews contained herein.\nWhich stocks should you consider in your very next trade?\nThe best opportunities often hide in plain sight—buried among thousands of stocks you'd never have time to research individually.\nThat's why smart investors use our Stock Screener with 50+ predefined screens and 160+ customizable filters to surface hidden gems instantly.\nFor example, the Piotroski's Picks method averages 23% annual returns by focusing on financial strength, and you can get it as a standalone screen. Momentum Masters catches stocks gaining serious traction, while Blue-Chip Bargains finds undervalued giants.\nWith screens for dividends, growth, value, and more, you'll discover opportunities others miss. Our current favorite screen is Under $10/share, which is great for discovering stocks trading under $10 with recent price momentum showing some very impressive returns!"
            },
            {
                "title": "Japanese Yen and Aussie Dollar Forecasts: USD/JPY Holds Gains as Tankan Misses - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/japanese-yen-and-aussie-dollar-forecasts-usd-jpy-holds-gains-as-tankan-misses-1552002",
                "body": "The Japanese economy and USD/JPY are in the spotlight, with third-quarter Tankan numbers challenging bets on an October Bank of Japan rate hike.\nThe Tankan Large Manufacturers Index increased from 13 in the second quarter to 14 in the third quarter (forecast: 15). The uptick signaled a slight improvement in business sentiment among large manufacturers. The US-Japan trade agreement likely lifted sentiment. Nevertheless, the upswing may not be enough to convince policymakers to lift rates.\nThird-quarter trends faced more scrutiny, given that policymakers’ concerns about US tariffs impacting the economy despite levies dropping to 15%. In the BoJ’s Summary of Opinions for September, one policymaker referred to the Tankan surveys, stating:\n“An examination of the Tankan (Short-Term Economic Survey of Enterprises in Japan) and anecdotal information from firms is required to determine whether firms have maintained their active business stance.”\nAnother called for a further assessment of upcoming economic data, including the results of the Tankan, before deciding on further policy adjustments.\nMeanwhile, the Tankan Large Non-Manufacturing Index remained at 34 in the third quarter, in line with forecasts.\nThe USD/JPY pair rose from 147.924 to 148.073 after the release of the data, which failed to lift October rate hike bets.\nLater Wednesday, the ADP’s employment change figures will influence the Fed rate path and US dollar demand. Economists forecast nonfarm payrolls to rise by 50k in September after increasing 54k in August.\nA larger-than-expected increase could indicate a resilient labor market and temper expectations of multiple Fed rate cuts in the fourth quarter. A less dovish Fed policy stance may send USD/JPY toward the 149.358 resistance level. A sustained move through 149.358 could bring the August high of 150.917 into play.\nConversely, a lower reading may push the pair toward the 200-day and the 50-day Exponential Moving Averages (EMAs). If breached, 146.5 would be the next key support level.\nUSD/JPY Scenarios: Hawkish BoJ vs. Dovish Fed Risks\nRead the full USD/JPY forecast, including chart setups and trade ideas.\nAs traders consider the BoJ’s views on the Tankan survey, attention is also turning to the AUD/USD as Aussie inflation and labor market data cloud the RBA’s policy outlook.\nTurning focus to the AUD/USD pair, the Ai Group Industry Index fell from -13.9 in August to -16.0 in September, weighing on the Aussie dollar.\nThe Index provides insights into the economic outlook as survey respondents across the private sector answer questions about employment, new orders, and production.\nA softer number could signal weaker demand and a cooling labor market. Rising unemployment may soften wage growth, curbing consumer spending. A pullback in spending may dampen inflation, supporting the case for an RBA rate cut in November.\nThe AUD/USD pair briefly climbed to $0.66183 before falling to $0.66042 after the softer data.\nAUD/USD: Key Scenarios to Watch\nSee our full AUD/USD analysis for detailed trends and trade setups.\nAmid rising uncertainty about a November RBA rate cut, US labor market data could provide greater clarity on Fed policy this week.\nA marked increase in nonfarm payrolls may temper bets on an October Fed rate cut. A more hawkish Fed rate path could widen the US-Aussie interest rate differential, favoring the US dollar and pushing AUD/USD toward the 50-day EMA ($0.65556).\nOn the other hand, a lower print may fuel speculation about multiple Fed rate cuts in the fourth quarter, narrowing the rate differential. A more dovish Fed policy stance could send AUD/USD toward $0.665.\nFor more in-depth analysis, review today’s USD/JPY and AUD/USD trading setups in our latest reports and consult the economic calendar.\nWith over 28 years of experience in the financial industry, Bob has worked with various global rating agencies and multinational banks. Currently he is covering currencies, commodities, alternative asset classes and glo"
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0040",
            "open": "1.3909",
            "close": "1.3917",
            "high": "1.3935",
            "low": "1.3896"
        },
        "market_summary": "The USD/CAD is consolidating just above the 1.3900 level, caught between opposing forces. The Canadian Dollar is being undermined by falling Oil prices and a dovish outlook from the Bank of Canada, which is expected to cut rates further. However, the US Dollar's strength is being capped by its own set of headwinds, including expectations for Federal Reserve rate cuts and the risk of a US government shutdown.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "USD/CAD steadies above 1.3900 as weak Oil and BoC stance lend support - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-cad-consolidates-above-13900-weaker-oil-prices-and-dovish-boc-lend-support-202510010229",
                "body": "- USD/CAD oscillates in a range for the second straight day amid mixed fundamental cues.\n- Bearish Oil prices and BoC’s dovish outlook undermine the Loonie and support the major.\n- Fed rate cut bets and the US government shutdown weigh on the USD and cap the upside.\nThe USD/CAD pair extends its sideways consolidative price move for the second straight day and trades above the 1.3900 mark during the Asian session on Wednesday. Meanwhile, the fundamental backdrop seems tilted in favor of bulls and suggests that the path of least resistance for spot prices is to the upside.\nCrude Oil prices struggle to attract any meaningful buyers and remain close to a multi-month trough set in September amid the prospect for a larger output hike by OPEC+ next month. Apart from this, expectations for additional interest rate cuts by the Bank of Canada (BoC) contribute to the Canadian Dollar's (CAD) relative underperformance and continue to act as a tailwind for the USD/CAD pair.\nBoC Governor Tiff Macklem said last Tuesday that the central bank will support economic growth while ensuring inflation remains well controlled. Meanwhile, traders have been pricing in the possibility that the US Federal Reserve (Fed) would lower borrowing costs twice this year. This, along with the looming US government shutdown, keeps the US Dollar (USD) depressed and caps the USD/CAD pair.\nMoving ahead, market participants now look forward to the release of the US ADP report on private-sector employment and the US ISM Manufacturing PMI, which would drive the USD demand later during the North American session. Apart from this, Oil price dynamics could influence the commodity-linked Loonie and produce short-term trading opportunities around the USD/CAD pair.\nCanadian Dollar FAQs\nThe key factors driving the Canadian Dollar (CAD) are the level of interest rates set by the Bank of Canada (BoC), the price of Oil, Canada’s largest export, the health of its economy, inflation and the Trade Balance, which is the difference between the value of Canada’s exports versus its imports. Other factors include market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – with risk-on being CAD-positive. As its largest trading partner, the health of the US economy is also a key factor influencing the Canadian Dollar.\nThe Bank of Canada (BoC) has a significant influence on the Canadian Dollar by setting the level of interest rates that banks can lend to one another. This influences the level of interest rates for everyone. The main goal of the BoC is to maintain inflation at 1-3% by adjusting interest rates up or down. Relatively higher interest rates tend to be positive for the CAD. The Bank of Canada can also use quantitative easing and tightening to influence credit conditions, with the former CAD-negative and the latter CAD-positive.\nThe price of Oil is a key factor impacting the value of the Canadian Dollar. Petroleum is Canada’s biggest export, so Oil price tends to have an immediate impact on the CAD value. Generally, if Oil price rises CAD also goes up, as aggregate demand for the currency increases. The opposite is the case if the price of Oil falls. Higher Oil prices also tend to result in a greater likelihood of a positive Trade Balance, which is also supportive of the CAD.\nWhile inflation had always traditionally been thought of as a negative factor for a currency since it lowers the value of money, the opposite has actually been the case in modern times with the relaxation of cross-border capital controls. Higher inflation tends to lead central banks to put up interest rates which attracts more capital inflows from global investors seeking a lucrative place to keep their money. This increases demand for the local currency, which in Canada’s case is the Canadian Dollar.\nMacroeconomic data releases gauge the health of the economy and can have an impact on the Canadian Dollar. Indicators such as GDP, Manufacturing and Service"
            },
            {
                "title": "USD/CAD Outlook: CAD Weakening Amid Looming BoC Cuts - Forex Crunch",
                "source": "Forex Crunch",
                "url": "https://www.forexcrunch.com/blog/2025/09/30/usd-cad-outlook-cad-weakening-amid-looming-boc-cuts/",
                "body": "- The USD/CAD outlook remains slightly negative despite a looming BOC rate cut.\n- The US government shutdown poses a significant risk for dollar depreciation.\n- Markets now closely watch the JOLTS job openings report, along with the Fed’s speech, for further guidance.\nThe USD/CAD outlook remains steady above 1.3900 on Tuesday, following a softer start to the week amid mixed domestic data and expectations for the Bank of Canada’s policy. Although the pair remains underpinned due to broad dollar flows, the looming risk of a potential US government shutdown, along with Canada’s upbeat GDP and stability around tariffs, offers the loonie a degree of resilience.\n–Are you interested to learn more about ECN brokers? Check our detailed guide-\nAccording to Statistics Canada, a 0.2% expansion in July shows the first sign of growth in the last four months. Goods-producing industries, including durable manufacturing and oil and gas, contributed to the gains, while the services sector continued to lag. Yet the momentum could be short-lived, as early August estimates showed no growth with weakening signs in the mining, energy, and transport sectors. Economists warn that Canada’s Q3 performance still risks underperforming compared to the BOC’s projections.\nThe Bank of Canada cut its policy rate by 25 basis points to 2.5% earlier in September, marking its first easing since March, while markets are convinced of another cut in October as well. According to TD Bank economists, two additional rate cuts are needed to offset weak investment and a soft labor market. Meanwhile, slower inflation over the past three months has given policymakers room to act without pressure.\nOn the other hand, the US dollar remains subdued due to ongoing political wrangling in Washington, which raises the odds of a potential US government shutdown that could delay the release of US data. Although past shutdowns have had a limited economic impact, this one could erode dollar sentiment, as the Fed is already prepared for more cuts this year.\nUSD/CAD Key Events Ahead\nThe significant event scheduled for today is the JOLTS job opening data from the US, especially since the ADP and NFP data may be delayed due to a potential government shutdown. Moreover, Fed’s Goolsbee will deliver a speech that can provide insights into the Fed’s next step.\nUSD/CAD Technical Outlook: Bulls Lacking Follow-through Momentum\nThe USD/CAD formed a top at 1.3960 on Friday, consolidating under the 20-period MA around 1.3900. The pair lacks bullish conviction after forming a peak, looking for more cues to initiate a bearish trend. The next key support for the pair emerges at 1.3860 around the 50-period MA ahead of the 100- and 200-period MA confluence around 1.3830.\n–Are you interested to learn more about making money in forex? Check our detailed guide-\nOn the upside, the pair could test the 1.3960 top if the price recaptures the 20-period MA. The next resistance could be the May highs near 1.4020.\nLooking to trade forex now? Invest at eToro!\n67% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money."
            },
            {
                "title": "USD/CAD Forecast: Pair Holds 1.3923 as Traders Weigh Tariffs, Oil, and GDP - FX Leaders",
                "source": "FX Leaders",
                "url": "https://www.fxleaders.com/news/2025/09/30/usd-cad-forecast-pair-holds-1-3923-as-traders-weigh-tariffs-oil-and-gdp/",
                "body": "USD/CAD Forecast: Pair Holds 1.3923 as Traders Weigh Tariffs, Oil, and GDP\nUSD/CAD is trading near 1.3923 in the European session with traders cautious as several macro factors weigh on sentiment.\nQuick overview\n- USD/CAD is trading near 1.3923 as traders remain cautious due to macroeconomic factors, including the risk of a US government shutdown.\n- Former President Trump has threatened significant tariffs on various imports, raising inflation concerns and boosting demand for the US Dollar.\n- Canada's economic data is mixed, with flat growth in August and revised GDP figures, while falling oil prices are negatively impacting the CAD.\n- Technically, USD/CAD shows short-term bullish momentum with key support at 1.3919 and resistance at 1.3957.\nUSD/CAD is trading near 1.3923 in the European session with traders cautious as several macro factors weigh on sentiment. The US government shutdown risk is front and center with labor data releases (Nonfarm Payrolls and ISM PMI) potentially delayed if Congress can’t pass a funding bill.\nFormer President Donald Trump escalated trade tensions by threatening tariffs including 100% on patented pharmaceutical imports, 50% on cabinets and vanities and 25% on trucks. This has inflation and supply chain stress fears and is boosting safe-haven demand for the US Dollar.\nCanada’s Mixed Data and Oil Weakness\nCanada’s data was mixed. Statistics Canada revised July GDP to 0.2% but reported flat growth in August. So resilience but not much momentum. The data provided some support for the CAD but broader global factors are the key.\nMeanwhile oil prices weighed on the CAD as prices fell over 3% after Iraq’s Kurdistan region restarted exports of nearly 190,000 barrels per day to Turkey. The additional supply is raising oversupply fears and is weighing on commodity linked currencies.\nUSD/CAD Forecast: Trendline is Key\nTechnically USD/CAD is trading near 1.3923 above the 50-SMA at 1.3919 and trendline support so short term momentum is intact. Resistance is at 1.3957 with higher targets at 1.3976 and 1.3997 if bulls push through. Below 1.3919 exposes 1.3884 and the 100-SMA at 1.3852. RSI is 53 so momentum is balanced.\nPrice action is consolidating after last week’s rally with buyers defending 1.3919-1.3907. If that zone fails then focus will be back on 1.3861. For now USD/CAD is cautiously bullish with trendline support and safe-haven flows.\n- Check out our free forex signals\n- Follow the top economic events on FX Leaders economic calendar\n- Trade better, discover more Forex Trading Strategies\n- Open a FREE Trading Account"
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "1.1910",
            "open": "199.4470",
            "close": "198.8500",
            "high": "199.7650",
            "low": "198.5740"
        },
        "market_summary": "The GBP/JPY is facing near-term downward pressure as technical analysis points to a potential short-term top forming at 201.24, with a break below key support levels targeting a deeper fall. This weakness occurs against a backdrop of a stronger Australian dollar, driven by a hawkish RBA, and a generally softer US dollar. While the long-term uptrend from the 2020 low remains intact, the pair is currently in a corrective phase.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "Australian Dollar Price Action Setups: AUD/USD, AUD/JPY, GBP/AUD - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/australian-dollar-price-action-setups-aud-usd-aud-jpy-gbp-aud/",
                "body": "The RBA’s decision to hold the cash rate at 3.65% came as no surprise, though the tone was a touch more hawkish than some expected. The opening paragraph of the statement acknowledged that early reads of inflation suggest CPI could come in hotter for Q3 than assumed in the August Statement on Monetary Policy (SOMP). Policymakers also noted that private demand — most notably household consumption — remains a key driver of growth. These are not the words one expects from a central bank preparing to cut rates. As a result, the Australian dollar (AUD) was the strongest FX major on Tuesday, with shorts scrambling to cover as bond yields tracked higher.\nView related analysis:\n- ASX 200 Morning Market Outlook: ASX Snaps 5-Month Winning Streak\n- AUD/USD, AUD/JPY: Australian Dollar Diverges Against US Dollar and Yen\n- Japanese Yen Price Action Setups: USD/JPY, AUD/JPY, GBP/JPY\nAUD/USD Technical Analysis: Australian Dollar vs US Dollar\nWith the RBA’s next rate cut being priced out, the swing low on AUD/USD may have arrived earlier than expected. The Australian dollar has now posted three consecutive daily gains, each marked by increasing bullish volatility.\nThat said, it’s uncertain whether AUD/USD can immediately break to fresh cycle highs. The US dollar index remains prone to short covering, while the resistance cluster around the September high — which also aligns with the November high and two 200-day moving averages — could prove difficult for bulls to clear.\nWith prices hovering just beneath the July high, some mean reversion on lower timeframes may be due before a sustained breakout higher.\nChart analysis by Matt Simpson - data source: TradingView AUD/USD\nAUD/JPY Technical Analysis: Australian Dollar vs Japanese Yen\nWhile momentum has yet to turn decisively higher on AUD/JPY, my bullish bias from last week remains intact. The pair has held a steady bullish structure since the August low, with price consolidating above the July high and the 97.24 high-volume node (HVN).\nTuesday’s long-legged doji formed a higher low above last week’s morning star reversal, reinforcing evidence of underlying demand. Dips within Tuesday’s range may offer opportunities for bulls anticipating further gains. The 99 handle near the year-to-date high remains the first upside target, with a break above bringing the 100 handle into focus.\nChart analysis by Matt Simpson - data source: TradingView AUD/JPY\nGBP/AUD Technical Analysis: British Pound vs Australian Dollar\nGBP/AUD Technical Analysis: Monthly Chart\nPrice action on the monthly GBP/AUD chart suggests a major cycle high may have formed in April. A shooting star candle marked the end of the rally from the 2022 low, while September’s bearish engulfing pattern signals momentum has shifted against the bulls.\nChart analysis by Matt Simpson - data source: TradingView GBP/AUD\nGBP/AUD Technical Analysis: Daily Chart\nThe Australian dollar has been trending lower against the British pound since the August high six weeks ago. Over this period, GBP/AUD has seen little in the way of a pullback, and momentum has turned lower again after a two-week consolidation around the 200-day SMA. That moving average has since acted as resistance, and GBP/AUD is now on the verge of breaking beneath the December high. Given the strength of the bearish trend, a move below the February high also looks likely.\nShould GBP/AUD bears prevail, a retest of the 2.00 handle or the February VPOC (1.9794) could be on the cards.\nChart analysis by Matt Simpson - data source: TradingView GBP/AUD\nKey Economic Events for Traders (AEST / GMT+10)\n09:50 JPY Tankan Index (Q3) (USD/JPY, EUR/JPY, Nikkei 225)\n10:30 JPY au Jibun Bank Manufacturing PMI (Sep) (USD/JPY, EUR/JPY, Nikkei 225)\n11:30 AUD RBA Chart Pack Release (AUD/USD, AUD/JPY, AUD/NZD)\n16:00 GBP Nationwide HPI (Sep) (GBP/USD, EUR/GBP, FTSE 100)\n16:30 CHF Retail Sales (Aug) (USD/CHF, EUR/CHF, CHF/JPY)\n16:30 AUD Commodity Prices (Sep) (AUD/USD, AUD/JPY, AUD/NZD)\n17:30 EUR ECB's Elderson Speaks"
            },
            {
                "title": "GBP/JPY Mid-Day Outlook - Action Forex",
                "source": "Action Forex",
                "url": "https://www.actionforex.com/technical-outlook/gbpjpy-outlook/613843-gbp-jpy-mid-day-outlook-125/?amp",
                "body": "Daily Pivots: (S1) 199.10; (P) 199.82; (R1) 200.30; More…\nIntraday bias in GBP/JPY is back on the downside with break of 198.99. A short term top should be formed at 201.24, on bearish divergence condition in 4H MACD. Deeper fall should be seen to 197.93 support first. Firm break there will argue that whole rise from 184.35 has completed too and target 195.01 support next. For now, risk will stay on the downside as long as 200.49 support holds, in case of recovery.\nIn the bigger picture, price actions from 208.09 (2024 high) are seen as a correction to rally from 123.94 (2020 low). The pattern might still extend with another falling leg. But in that case, strong support should be seen from 38.2% retracement of 123.94 to 208.09 at 175.94 to contain downside. Meanwhile, decisive break of 208.09 will confirm long term up trend resumption."
            },
            {
                "title": "The US dollar is lower versus EUR, GBP & JPY. The AUDUSD is higher after a 'hawkish' RBA - investingLive",
                "source": "investingLive",
                "url": "https://investinglive.com/technical-analysis/the-us-dollar-is-lower-versus-eur-gbp-jpy-the-audusd-is-higher-after-a-hawkish-rba-20250930/",
                "body": "The USD is mixed to start the day with the AUDUSD the biggest mover with a gain of 0.55% (lower USD). The RBA held its cash rate at 3.60 % in its September decision, as expected. The board adopted a cautious stance, citing lingering inflation risk and uncertainty about the economic outlook. Going forward, the RBA will remain data-dependent, explicitly tying any change in November to upcoming inflation, labour market, and broader economic indicators.\nRBA Governor Michele Bullock said the board views the risks as broadly balanced: inflation remains within the target range, but recent data suggest slightly stronger-than-expected pressure. She noted the labour market is holding up, and emphasized that policy decisions will be made meeting by meeting, with November’s setting dependent on upcoming data.\nOn market expectations, Bullock said the RBA is looking at the same data the markets are but will not say whether market pricing is right or wrong. She stressed the RBA has no fixed bias in policy, and that its stance will continue to depend on evolving economic outlook and data.\nThe comments were viewed as more hawkish sending the AUDUSD higher.\nThe EURUSD is higher (lower dollar) by 0.12%, the USDJPY is down -0.38% and the GBPUSD is up marginally by 0.04% at the tart of the US session. In the video above I take a technical look at the 3-major currency pairs.\nIN other overnight news:\nFederal Reserve Vice Chair Philip Jefferson warned that the U.S. labor market is softening and could face stress without adequate support. He noted that slower labor force growth may weigh on potential GDP and widen the output gap. While he expects inflation to resume its downtrend after this year, he acknowledged high uncertainty around the neutral rate and whether policy is currently restrictive or accommodative. He stressed that further labor market weakness is not needed for policy adjustment and that decisions should be made deliberately given the uncertain backdrop.\nSNB Chairman Martin Schlegel said that inflation is expected to rise slightly in the coming quarters. He noted that uncertainty remains high and that the SNB is closely monitoring conditions. Economic indicators suggest a stable environment and moderate growth, though downside risks have increased slightly, partly due to U.S. pharmaceutical tariffs. He implied that a change in policy is not imminent, as the current stance is already priced in.\nECB Vice President Luis de Guindos stated that the current level of interest rates is adequate. He emphasized that the ECB will make decisions meeting by meeting rather than following a predetermined path. He also pointed out that many policymakers consider small deviations from the 2 % inflation target alone to be insufficient to trigger policy changes.\nIn political news, the US is heading toward a shut down at the end of the day. That will impact economic data coming out if there is no solution/extension including the US jobs report on Friday.\nThe economic data in Europe today showed:\nGerman Import Prices m/m: -0.5% (weaker vs -0.2% expected)\nGerman Retail Sales m/m: -0.2% (weaker vs +0.6% expected)\nUK Current Account: -28.9B (weaker vs -24.8B expected)\nUK Final GDP q/q: +0.3% (in line with +0.3% expected)\nUK Revised Business Investment q/q: -1.1% (stronger vs -4.0% expected)\nGerman Prelim CPI m/m: +0.2% (slightly stronger vs +0.1% expected). YoY was higher at 2.4% vs 2.3%.\nFrench Consumer Spending m/m: +0.1% (weaker vs +0.3% expected)\nFrench Prelim CPI m/m: -1.0% (weaker vs -0.9% expected)\nSwiss KOF Economic Barometer: 98.0 (stronger vs 97.1 expected)\nGerman Unemployment Change: +14K (weaker vs +8K expected)\nItalian Prelim CPI m/m: -0.2% (weaker vs -0.1% expected)\nOn the economic and event calendar today:\n9:00am ET – US HPI m/m: -0.2% exp (prev -0.2%).\n9:00am ET – US S&P/Case-Shiller 20-city HPI y/y: 1.7% exp (prev 2.1%).\n9:45am ET – US Chicago PMI: 43.4 exp (prev 41.5).\n10:00am ET – US JOLTS job openings: 7.19M exp (prev 7.18M).\n10:00am ET – "
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "2,177.5000",
            "open": "114,245.7900",
            "close": "114,637.5000",
            "high": "114,867.0000",
            "low": "112,689.5000"
        },
        "market_summary": "The market is poised for a significant influx of institutional capital, driven by the imminent approval of 16 spot crypto ETFs, which is now considered a certainty by analysts. This expansion is further supported by a landmark shift in regulatory cooperation, as the SEC and CFTC plan to harmonize their oversight, promising greater clarity for the crypto industry. Additionally, the SEC's exploration of allowing tokenized stock trading on crypto exchanges signals a major convergence of traditional finance and blockchain technology, potentially unlocking new efficiencies and investor access.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "SEC’s Approval Odds for 16 Spot Crypto ETFs Now 100% — Eric Balchunas - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/sec-approval-odds-16-spot-122402326.html",
                "body": "Key Takeaways\n-\nSixteen spot crypto ETF applications await final approval from the SEC in October.\n-\nThe SEC has asked issuers to withdraw 19b-4 filings after adopting new generic standards.\n-\nBloomberg’s Eric Balchunas says approval odds are “100%.”\nThe U.S. Securities and Exchange Commission (SEC) is on the verge of approving a wave of new spot crypto exchange-traded funds (ETFs).\nSixteen funds—covering Solana (SOL), XRP, Litecoin (LTC), Cardano (ADA), Dogecoin (DOGE), and others—are queued up for review, with analysts predicting a green light as early as this month.\nThe approvals would mark the SEC’s most significant embrace of crypto products since signing off on spot Bitcoin (BTC) and Ethereum (ETH) ETFs in 2024.\nThose launches shattered trading records and opened the floodgates to more than 90 additional applications now awaiting regulatory clearance.\nA Shift in SEC Process\nIn mid-September, the SEC approved proposed rule changes from Nasdaq, NYSE Arca, and Cboe BZX to adopt generic listing standards for commodity-based trust shares.\nThe new standard eliminates the need for individualized reviews under Section 19(b) of the Securities Exchange Act of 1934, streamlining the approval process for ETFs backed by spot commodities—including crypto tokens.\nAs part of this shift, the SEC has instructed issuers of SOL, XRP, ADA, LTC, and DOGE ETFs to withdraw their 19b-4 filings.\nUnder the new system, an S-1 filing is sufficient for approval, allowing the agency to act at any time without waiting for formal deadlines.\n“This change essentially makes the 19b-4 process meaningless,” Bloomberg ETF analyst Eric Balchunas said in an X post. “All that’s left is Corp Finance signing off on the S-1s. The baby could come any day.”\nAnalysts Expect Swift Approval\nBalchunas, who has tracked the ETF race closely, says he now sees a 100% probability of approval for all 16 pending applications.\nThe SEC’s adoption of generic standards, coupled with repeated amendments from issuers like Solana’s ETF (which has filed four times), signals that final clearance is a matter of timing rather than substance.\nFox Business reporter Eleanor Terrett echoed the sentiment, noting that the new framework gives the SEC flexibility to approve products in batches—or all at once.\n“As long as the tokens meet the criteria, the SEC can approve at any time,” she said.\nA Broader ETF Pipeline\nBeyond the 16 funds at the front of the line, nearly 80 additional crypto ETF applications remain in the pipeline.\nAnalysts say this week’s approvals could set the precedent for dozens more, accelerating Wall Street’s adoption of digital assets beyond Bitcoin and Ethereum."
            },
            {
                "title": "SEC and CFTC Plan to Work Together on Crypto Oversight - 99Bitcoins",
                "source": "99Bitcoins",
                "url": "https://99bitcoins.com/news/bitcoin-btc/sec-and-cftc-plan-to-work-together-on-crypto-oversight/",
                "body": "The SEC and CFTC have finally agreed on something: they need to work together. After years of clashing over who should regulate what in the crypto space, both agencies are now aiming for better coordination. They say the confusion around who’s in charge has gone on for too long and it’s time to bring some order to the chaos.\nA Joint Roundtable as Starting Point\nThis fresh approach came out of a joint roundtable in Washington, where both sides sat down to talk openly about the mess. SEC Chair Paul Atkins said it’s no longer acceptable for each agency to go off and do its own thing.\nRegulatory clarity is key to making the U.S. the crypto capital of the world.\nSEC Chairman Paul Atkins: “It is a new day at the SEC and CFTC… The age of harmonized, innovation-friendly oversight is here.”\nWelcome to the golden age of digital assets. pic.twitter.com/rjpe1SDdt2\n— Ondo Finance (@OndoFinance) September 29, 2025\nHe pointed out how the lack of coordination causes delays, piles on costs, and makes life harder for both businesses and everyday users. Acting CFTC Chair Caroline Pham backed him up, saying the turf war between the two regulators needs to end if there’s going to be any real progress.\nWhy Harmonization, Not Merger\nSome people have wondered if the answer is to just combine the two agencies into one. But Atkins made it clear that’s not on the table. The idea isn’t to create a single mega-regulator, but to make sure both sides are playing from the same playbook. That’s especially important when crypto products don’t fit neatly into existing categories. One token might act like a security, another might behave more like a commodity, and many sit somewhere in between. With clearer coordination, both agencies can stay separate but work more smoothly.\nDISCOVER: Best New Cryptocurrencies to Invest in 2025\nWhat They Hope to Coordinate\nSo what does coordination actually mean in practice? The goal is to start aligning definitions for trading platforms and products, so they’re not talking past each other. They also want to clean up how data is reported, make sure margin rules don’t clash, and possibly allow more breathing room for innovation.\nOne idea floated during the roundtable was creating special carveouts that let new crypto products launch without tripping over conflicting rules. Commissioner Mark Uyeda also flagged how some of the older regulatory frameworks simply don’t work for what today’s markets look like, which adds another layer of confusion.\nWhat This Signals for Crypto Markets\nFor crypto companies and traders, this new tone could be a big deal. Until now, many firms have had to guess which rules apply, or follow both just to be safe. That’s not just stressful, it’s expensive. If the SEC and CFTC can pull this off, it might finally bring some clarity. But they’ll still need help from Congress to really clean up the legal boundaries. Right now, each agency is limited in what it can do without new laws. The hope is that working together can fill the gaps, at least for now.\nDISCOVER: 20+ Next Crypto to Explode in 2025\nWhat to Watch Next\nThis won’t be solved overnight. The real test is whether the two agencies stick to the plan. Will they actually align their definitions and reporting rules? Will they respond in a coordinated way when crypto companies start pushing limits? And will lawmakers step in to set clearer rules of the road? These are the things that will decide if this turns into lasting reform or just another press release. For now, at least, the SEC and CFTC are finally talking, and that alone feels like a change.\nDISCOVER: 20+ Next Crypto to Explode in 2025\nJoin The 99Bitcoins News Discord Here For The Latest Market Updates\nKey Takeaways\n- The SEC and CFTC have agreed to coordinate their efforts after years of confusion around crypto regulation.\n- A joint roundtable marked the start of this new approach, with both agencies calling for clearer roles and communication.\n- They plan to harmonize definitions, reporting stan"
            },
            {
                "title": "SEC Moves Toward Tokenized Stock Trading on Crypto Exchanges - livebitcoinnews.com",
                "source": "livebitcoinnews.com",
                "url": "https://www.livebitcoinnews.com/sec-moves-toward-tokenized-stock-trading-on-crypto-exchanges/",
                "body": "SEC explores tokenized stock trading on crypto exchanges, signaling a major step toward merging blockchain technology with traditional financial markets.\nThe US Securities and Exchange Commission is reportedly preparing to allow blockchain-based versions of stocks to trade. According to The Information, the proposal would allow for the listing of tokenized equities on approved cryptocurrency platforms. If adopted, this plan would be a historic milestone towards the convergence of digital assets with mainstream finance.\nNasdaq and Companies Push Tokenized Stock Adoption\nAt an early stage, the SEC proposal envisions stock tokens to represent shares in public companies. They could be purchased and sold directly on regulated crypto exchanges. Nasdaq has already filed a rule change to allow for tokenized stock trading on its platform. The exchange aims to bring order to trading and settlement by mirroring traditional securities, to foster trust and reliability.\nA number of companies are already testing out tokenization. Galaxy Digital is the first Nasdaq-listed company to tokenize its stock on Solana. Forward Industries quickly followed suit by announcing its intention to tokenize its FORD shares on the same blockchain\nRelated Reading: SBI Ripple Asia Partners with Tobu Top Tours for Tokenized Payment System | Live Bitcoin News\nMeanwhile, SharpLink announced plans to tokenize SBET stock on the Ethereum network, becoming the first firm to do so on the latter network. These moves demonstrate that tokenization is being viewed as a forward-looking financial innovation by businesses.\nTop crypto exchanges are pushing for quicker approval. Coinbase and Robinhood have provided plans for adding tokenized equity trading to their platforms. Robinhood has already started tokenizing equities and offering them to European customers. Likewise, a synthetic stock token has been trialed in foreign markets by the company Kraken. These early adoptions are a sign of increasing confidence in the practicability of blockchain-based securities.\nTokenized Equities Could Cut Costs and Risks\nTokenizing is picking up pace as an institutional trend. As evidence of the mainstream interest in blockchain technology, earlier this year, BlackRock announced the formation of a dedicated tokenization division. Analysts point out that this acceptance provides a boost in the confidence of conventional financial institutions. There are real-world assets worth more than $31 billion tokenized in different blockchains, as per data. However, equities currently account for a very small part of that total.\nDespite the momentum, there are still concerns. Citadel Securities has filed a letter to regulators cautioning blockchain settlement systems about possible vulnerabilities. The company called for the SEC to ensure that tokenization is genuinely efficient, rather than just an excuse to bypass compliance. This conservative stance is a product of the challenges of bringing disruptive technologies into highly regulated markets. Yet the pendulum is slowly swinging toward tokenization.\nThere are a number of potential advantages of tokenized equities, which observers have pointed out. Transactions could be settled more quickly, and counterparty risks would be minimized. Investors can also access new markets across the globe and have the ability to overcome such limitations. In addition, tokenization helps achieve greater transparency by offering an immutable record of data on public blockchains. The features are part of the SEC’s larger goal of modernizing market infrastructure.\nIf the proposal goes through, tokenized stock trading would be a watershed moment for financial markets. It would integrate traditional securities and blockchain with each other in a regulated setting. Experts believe that integration would reduce costs, improve efficiency, and appeal to new classes of investors. As a result, tokenization is becoming widely regarded as the next frontier of financial innovati"
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "155.4800",
            "open": "4,227.5900",
            "close": "4,194.5300",
            "high": "4,246.6300",
            "low": "4,091.1500"
        },
        "market_summary": "The approval of spot Ethereum ETFs by the SEC is a monumental event, validating ETH as a mainstream asset class and opening the door for significant institutional capital inflows. This bullish catalyst is occurring alongside a period of technical weakness for ETH, which is struggling to hold the key $4,000 support level. Concurrently, the broader DeFi ecosystem is seeing the rise of new projects like PayDax and Mutuum Finance, which are being promoted as innovative alternatives to established protocols, indicating a vibrant and evolving market.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "The Ethereum ETF green light: Bob’s deep dive into the SEC’s pivotal approval - bobsguide.com",
                "source": "bobsguide.com",
                "url": "https://www.bobsguide.com/the-ethereum-etf-green-light-the-secs-pivotal-approval/",
                "body": "The SEC’s pivotal approval of spot Ethereum ETFs is a tectonic regulatory shift. This decision validates Ethereum as a ‘blue chip’ asset, accelerating the merge of TradFi and DeFi and demanding immediate strategic re-evaluation from financial CISOs regarding custody, infrastructure, and compliance risk.\nThe US Securities and Exchange Commission (SEC) has just sent shockwaves through the financial world, approving spot Ethereum Exchange-Traded Funds (ETFs) from major players like BlackRock, Fidelity, and Grayscale. This decision, following closely on the heels of the Bitcoin ETF approvals, marks a monumental shift in how mainstream finance interacts with digital assets.\nFor our expert, Bob, this isn’t just about another set of ETFs hitting the market; it’s a profound validation of Ethereum as a legitimate, investable asset class and a clear signal of the irreversible institutionalization of the broader crypto ecosystem.\nAs Bob, our quiet genius, puts it: “This isn’t merely an incremental step; it’s a giant leap. The SEC’s approval of spot Ethereum ETFs solidifies crypto’s place in regulated capital markets, opening the floodgates for a new wave of institutional capital and fundamentally altering how traditional finance views and accesses digital assets.”\nThe approval of Ethereum ETFs carries implications that extend far beyond Bitcoin, pointing to a more diverse and mature digital asset landscape. Bob has identified three critical shifts that every fintech leader, investor, and financial institution needs to understand.\nFor years, Bitcoin has often been seen as the sole ‘safe’ or ‘blue-chip’ crypto asset by many traditional investors. The SEC’s green light for Ethereum ETFs elevates ETH to a similar, if not equivalent, status in the eyes of regulated markets.\nWith both Bitcoin and Ethereum now accessible via spot ETFs, investors—both retail and institutional—gain significantly more sophisticated tools for building diversified digital asset portfolios within traditional brokerage accounts. This move transforms crypto investment from a niche activity into a standard allocation strategy.\nThe approval of Ethereum ETFs will inevitably draw more traditional financial players into the Ethereum ecosystem. This could bridge the gap between TradFi and DeFi, as institutions seek to understand and leverage the underlying utility of Ethereum beyond its price.\nThe immediate impact will be felt in market liquidity and investor access, but the long-term implications are far more profound, reshaping several facets of the financial ecosystem:\nEnhanced Regulatory Clarity (Eventually): While the SEC’s decision on ETH ETFs offers a form of regulatory clarity for investable products, it doesn’t fully clarify the underlying asset’s status (e.g., whether ETH itself is a security). However, the approval for ETFs hints at a growing acceptance and understanding within regulatory bodies, which could eventually lead to more comprehensive guidance for blockchain technology and other digital assets. This step creates a precedent that other crypto assets, particularly those with strong utility and decentralization, will undoubtedly pursue.\nA New Race for Custody and Infrastructure: The demand for secure custody solutions for underlying ETH will skyrocket, benefiting institutional-grade custodians. This will also drive further development in secure blockchain infrastructure, as the scale of institutional involvement demands enterprise-level reliability and compliance. New technologies around zero-knowledge proofs and secure multi-party computation could see accelerated adoption to meet these stringent requirements.\nGlobal Impact and Regulatory Harmonization: The US’s stance on digital asset ETFs often influences global markets. This approval could spur other jurisdictions, particularly those that have been hesitant, to accelerate their own frameworks for spot crypto ETFs. This could lead to a more harmonized global approach to digital asset investment products"
            },
            {
                "title": "PayDax Protocol (PDP) to Surpass Ethereum DeFi Kings Aave and MakerDAO, Here’s Why - CoinCentral",
                "source": "CoinCentral",
                "url": "https://coincentral.com/paydax-protocol-pdp-to-surpass-ethereum-defi-kings-aave-and-makerdao-heres-why/",
                "body": "For years, the Ethereum DeFi ecosystem has been defined by two giants: Aave and MakerDAO. Aave pioneered decentralized lending and borrowing, while MakerDAO became the backbone of stablecoins with DAI. Together, they set the standard for what decentralized finance could achieve.\nBut after years at the top, both projects are showing cracks. High fees, rigid structures, and governance struggles have left users searching for the next leap forward. That leap, according to analysts, could be PayDax Protocol (PDP).\nMore than just another DeFi project, PayDax is emerging as a serious contender to not only rival Aave and MakerDAO but surpass them altogether. With its unique mix of lending, borrowing, and built-in insurance, the PDP presale is already attracting attention as a chance to get in on Ethereum’s next big challenger for gains upwards of 2,000%.\nThe Limits of Aave and MakerDAO\nAave remains one of Ethereum’s crown jewels, yet its structure is locked around collateralized lending with diminishing yields. MakerDAO, while critical to DeFi, has been slowed by governance bottlenecks and rigid collateral requirements.\nBoth projects also remain tied to Ethereum’s notorious gas fees, creating friction for everyday users. These limitations haven’t killed their dominance, but they have created a ceiling. And where Aave and MakerDAO have plateaued, PayDax Protocol (PDP) is breaking through.\nPayDax Protocol (PDP): A Redesign of Lending and Borrowing\nOn PayDax Protocol (PDP), the traditional bank spread no longer exists. Instead, users capture the value directly. Take Jane, for example. If she deposits $5,000 at her bank, she might earn just 1% interest while the bank loans it out at 15%. On PayDax, Jane becomes the bank. She lends directly to borrowers and earns up to 15.2% APY herself.\nBorrowers also benefit immensely. Unlike traditional systems that reject millions for poor credit scores or unconventional collateral, PayDax redefines what collateral can be. Alice can use her Bitcoin (BTC) to get loans in stablecoins (USDT/USDC), unlocking instant liquidity without selling her position.\nJohn can tokenize his jewelry, verified by Sotheby’s and custodied by Brinks, then borrow against it with a 50%, 75%, 90% or 97% LTV (Loan To Value), without giving up his prized asset. It’s a level of flexibility neither Aave nor MakerDAO currently offers.\nInsurance: PayDax’s Edge Over the DeFi Kings\nOne of PDP’s most disruptive features is its Redemption Pool. In today’s DeFi, lenders are exposed to risk with few protections. Aave and MakerDAO have no built-in safety net, at least not on the level of the PayDax Protocol (PDP) solution.\nImagine Bob lends Alice $10,000. Jack joins as an insurer, underwriting the loan for an attractive premium. If Alice repays, Jack keeps the premium. If she defaults, Bob’s losses are covered by the Redemption Pool, and stakers like Jack earn up to 20% APY.\nThis creates a sustainable triangle where lenders, borrowers, and insurers all win. It’s a piece of the puzzle missing from even the most established DeFi protocols.\nWhy Investors Are Backing PDP\nThe fully-doxxed PayDax Protocol (PDP) team, led by CEO Werner Van Staden and CTO Maksim Petrukhov, has undergone full KYC verification, making them legally accountable. It’s a level of trust that 90% of top crypto presales do not offer, further setting PDP as one of the best altcoins to buy now.\nSmart contracts have also been audited by Assure DeFi, adding another layer of protection. This transparency translates to partnerships with VCs, collaborations, integrations with other DeFi, and an easier pathway to listings. According to experts, PayDax is well positioned to attract institutional backers, which is a strong signal to investors for a healthy ICO.\nThe PDP Presale Window: A Rare 2,000% ROI Opportunity\nAt the center of the PayDax ecosystem is its native token, priced at just $0.015 in Round 1 of the PDP presale. Analysts project up to a 2,000% ROI this quarter, making ear"
            },
            {
                "title": "Can Ethereum (ETH) Bulls Defend $4,000? Market Weakness Targets ETH, But 1 DeFi Altcoin Could Save Portfolios - Mitrade",
                "source": "Mitrade",
                "url": "https://www.mitrade.com/insights/news/live-news/article-3-1158908-20250930",
                "body": "With Ethereum (ETH) facing pressure at the $4,000 level, investors are holding their breath to see if bulls can keep holding on against mounting market vulnerability. While ETH remains the pillar of the crypto market, shrewd traders are looking at alternatives to save and build up their portfolios. One top choice is Mutuum Finance (MUTM), a fast-rising DeFi altcoin that costs only $0.035. The project is still in presale phase 6 which is over 50% sold out.\nIt has already raised over $16.52 million in presale, with over 16,640 holders. With its dual lending system, staking rewards that can be adjusted, and real-world utility of decentralized borrowing and lending, Mutuum Finance offers both stability and the opportunity for high growth, which makes it a strategic holding asset for diversification and consolidation of crypto assets during turbulent times.\nEthereum (ETH) fell below $4,060, with fear of the bulls being able to maintain the crucial $4,000 support. A bear cross is bright warning lights, the analysts eyeing $3,750 as the next important support, and a potential fall to $3,350 should that be broken. But with the asset appearing oversold, a strong bounce can be in the cards if buying momentum is re-established. While investors weigh the pro and con of the next ETH move, others are also starting to explore newer possibilities in decentralized finance that can add to their strategies, with one such newer project, Mutuum Finance, gaining increasing interest.\nMUTM tokens are currently valued at $0.035 in presale phase 6, a 16.17% raise from the previous round. Interest among investors remains remarkably robust with more than 16,640 investors pumping in more than $16.52 million of invested capital thus far.\nTo enhance the security of the platform even more, Mutuum Finance has introduced a $50,000 USDT Bug Bounty Program where they invite white-hat researchers and developers to identify bugs. These will be categorized into four levels of severity, i.e., critical, major, minor, and low, for sensitive identification and immediate patching of possible vulnerabilities.\nMutuum protocol is founded on good collateral management as a measure to protect the users and the ecosystem. Some of the most important safety features include infinite collateral ratios, loan limits, and deposit limits. Undercollateralized positions are quickly closed, and penalties and remediation fees stabilize the platform and minimize systemic risk.\nThe most important concept at Mutuum Finance is efficiency. Through the optimization of Loan-to-Value (LTV) ratios and, in particular, overcollateralized positions, the protocol makes the most out of capital while providing great protection. Reserve requirements act as a market shock absorber, and excess reserves can be invested profitably in riskier assets to hedge volatility.\nMutuum Finance seeks to redefine DeFi in three dimensions: long-term viability, trustworthiness, and usability. Through a scalable and secure borrowing and lending platform, the platform is democratizing decentralized finance for retail and institutional customers.\nAs an appreciation for its growing community, the team has also started a $100,000 giveaway where 10 winners will receive $10,000 worth of MUTM tokens. The action is one of the means of showing that Mutuum values rewarding the project’s first adopters and raising awareness about the cause.\nEthereum’s inability to hold above the $4,000 level is an indication of the angst which has the broader crypto universe in its thrall but also the rising trend towards diversification into high-growth DeFi plays. Mutuum Finance (MUTM) is fast emerging as one of the most promising alternatives, with strong security, good collateral management, and real-world practical utility to provide impressive growth potential. At over $16.52 million raised, with over 16,640 investors participating, and tokens yet available for purchase at a cheap rate of $0.035, momentum is clearly building. The moment to in"
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "10.4000",
            "open": "214.3100",
            "close": "209.7400",
            "high": "214.6000",
            "low": "204.2000"
        },
        "market_summary": "The Solana ecosystem is experiencing significant growth and institutional adoption, driven by strategic partnerships and major capital inflows. Key developments include a new alliance between Crypto.com and Sharps Technology to manage a large SOL treasury, Anchorage Digital's integration of Jupiter to simplify institutional DeFi access, and the launch of Keel with a $2.5 billion roadmap to boost DeFi and RWAs on Solana. These moves highlight increasing corporate and institutional interest, bolstering SOL's position as a scalable, efficient blockchain for next-generation financial applications.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Solana Ecosystem To Gain Boost With New Alliance Between Crypto.com And Sharps Technology – Details - Mitrade",
                "source": "Mitrade",
                "url": "https://www.mitrade.com/insights/news/live-news/article-3-1162344-20251001",
                "body": "The Solana blockchain is definitely in the spotlight now as new developments unfold that could bolster and enhance the network’s adoption and recognition in the dynamic financial world. A recent report outlined a new strategic union between two prominent companies that would foster this advancement in the SOL ecosystem.\nIn the ongoing bull market cycle, several key moves are continuously being carried out that reflect the growing scalability and efficiency of the Solana blockchain and its thriving ecosystem. One of the latest moves is the strategic partnership between Crypto.com and Sharps Technology, an emerging leader in digital asset treasury management.\nOn Monday, these two financial behemoths announced their union, which is aimed at strengthening the SOL ecosystem. This alliance signifies yet another important turning point in the leading blockchain’s explosive growth and recognition.\nBy expanding its digital asset treasury strategy with Crypto.com services for its holdings, Sharps Technology’s bold vision is to align traditional finance with the SOL ecosystem. “Partnering with Crypto.com, a platform with over 150 million users, provides us with the institutional-grade tools and liquidity access to responsibly manage one of the largest Solana treasuries, while also directly contributing to the growth of the Solana ecosystem,” James Zhang, Strategic Advisor to Sharps.\nThe announcement underscores the robust conviction and interest of Sharps Technology toward Solana’s long-term value and potential, having acquired over 2 million SOL in its treasury. With SOL trading above the $200 price level, the company’s SOL holding is currently valued at almost $400 million.\nOverall, the action demonstrates increasing corporate and institutional interest in building and expanding on the Solana blockchain. Furthermore, with this move, SOL’s position as a blockchain created for scalability, efficiency, and next-generation financial applications is further strengthened.\nWhile strategic moves are made to boost its ecosystem, Solana is actively demonstrating its growing dominance in the blockchain sector. According to a report from Solana Daily on X, the leading blockchain has experienced a substantial surge in active developer activity.\nFollowing the surge, SOL has now emerged as the clear leader in total active developers. Data shared by the platform shows that SOL is ranked no.1, surpassing all other chains with more builders contributing to its thriving ecosystem.\nInterestingly, the blockchain saw nearly 2x more developers than Ethereum. Known for its speed, scalability, and low-cost transactions, this rise in devs underscores SOL’s rising role as a magnet for innovation, putting it at the forefront of blockchain development.\nAt the time of writing, SOL’s price has reclaimed above the $209 level, demonstrating a slight increase of 0.15% in the last 24 hours. Despite the weakening upward movement, bullish sentiment still lingers around the altcoin as evidenced by a more than 42% rise in its trading volume in the past day."
            },
            {
                "title": "Anchorage Digital Deepens Solana DeFi Push Through Jupiter Partnership - CoinLaw",
                "source": "CoinLaw",
                "url": "https://coinlaw.io/anchorage-solana-jupiter-defi-integration/",
                "body": "Anchorage Digital has integrated Solana-based DEX aggregator Jupiter into its institutional-grade Porto wallet, aiming to simplify secure DeFi access for traditional finance clients.\nKey Takeaways\n- Anchorage Digital has integrated Jupiter into its Porto wallet, enabling institutional investors to directly access Solana’s DeFi ecosystem.\n- The move improves Solana liquidity and trade execution while reducing reliance on third-party platforms for decentralized swaps.\n- Jupiter dominates Solana’s DEX market, offering advanced features like lending, portfolio management, and token launches.\n- Solana DeFi is gaining institutional traction, with nearly $1.9 billion in ETP inflows this year and ETF approvals likely on the horizon.\nWhat Happened?\nAnchorage Digital announced it has added native support for Jupiter, a major decentralized exchange and liquidity aggregator on Solana, to its Porto self-custody wallet. This development is part of Anchorage’s ongoing mission to build secure and compliant infrastructure that supports institutional involvement in decentralized finance (DeFi).\nThe integration will allow Anchorage clients to perform crypto-to-crypto swaps directly through Porto’s interface without needing to rely on external apps. This is expected to streamline user experience and significantly reduce trade slippage.\nNew! @JupiterExchange, Solana’s leading swap and liquidity aggregator, is now directly integrated with Porto, Anchorage Digital’s institutional-grade self-custody wallet. pic.twitter.com/qarCClubY0\n— Anchorage Digital @ TOKEN2049 (@Anchorage) September 30, 2025\nAnchorage Doubles Down on DeFi Infrastructure\nAnchorage Digital, a federally chartered crypto bank, continues to expand its footprint in institutional DeFi by rolling out foundational tools that meet strict compliance and security standards. By integrating Jupiter directly into Porto, Anchorage is helping institutions overcome common challenges tied to decentralized applications, including third-party risk and operational complexity.\nNathan McCauley, CEO and co-founder of Anchorage, stated:\nThis partnership comes at a time when institutional appetite for Solana-based investments is on the rise. Data from CoinShares shows that Solana exchange-traded products (ETPs) attracted nearly $300 million in inflows just last week, and nearly $1.9 billion year-to-date, trailing only Bitcoin and Ethereum. Analysts expect that Solana ETFs from firms like Fidelity, VanEck, and Franklin Templeton may soon launch, pending U.S. SEC approvals.\nJupiter’s Expanding DeFi Ecosystem\nJupiter is a leading decentralized liquidity aggregator in the Solana ecosystem. Beyond swaps, the platform provides features like lending, perpetuals, mobile trading, and portfolio management. Jupiter Lend, recently launched in public beta, offers high loan-to-value ratios, low liquidation penalties, and competitive APYs for institutional and retail users alike.\nKash Dhanda, COO of Jupiter, emphasized the strategic importance of this partnership:\nAccording to DeFiLlama, Solana protocols currently hold over $29 billion in total value locked (TVL), with Jupiter alone contributing more than $3.86 billion to that figure. These numbers reflect the growing appeal of Solana’s network performance, low fees, and robust ecosystem, especially as institutions look for scalable DeFi solutions.\nRegulatory and Strategic Momentum for Anchorage\nAnchorage has been on a positive trajectory throughout the year. In August, the U.S. Office of the Comptroller of the Currency lifted a cease-and-desist order against the bank, citing improved operational soundness. Just one month earlier, Anchorage had partnered with Ethena Labs to support the $1.8 billion USDtb stablecoin using its platform.\nThe company also secured a BitLicense in New York in December, granting it the ability to serve institutions in one of the world’s key financial centers. The Porto wallet, introduced in early 2024, continues to evolve as Anchorage adds new"
            },
            {
                "title": "Keel Debuts as Sky's Solana-Focused 'Star' With a $2.5B Roadmap to Boost RWAs and DeFi - CoinDesk",
                "source": "CoinDesk",
                "url": "https://www.coindesk.com/business/2025/09/29/keel-debuts-as-sky-s-solana-focused-star-with-a-usd2-5b-roadmap-to-boost-rwas-and-defi",
                "body": "- Back to menuPrices\n- Back to menuResearch\n- Back to menu\n- Back to menu\n- Back to menu\n- Back to menuWebinars\nKeel Debuts as Sky's Solana-Focused 'Star' With a $2.5B Roadmap to Boost RWAs and DeFi\nThe new protocol will channel USDS stablecoin reserves into Solana-based lending markets and real-world asset strategies.\nWhat to know:\n- Keel debuts on Solana with a roadmap to deploy as much as $2.5 billion into DeFi and RWA markets.\n- The new protocol will receive an allocation from Sky’s USDS stablecoin reserves to deploy to Solana-based DeFi apps such as Kamino, Jupiter and Raydium.\n- Keel joins Spark and Grove as the third autonomous unit, or \"star,\" of the Sky ecosystem, formerly known as MakerDAO.\nKeel, a new Solana-native capital allocator, debuted on Tuesday with a roadmap to channel up to $2.5 billion across decentralized finance (DeFi) and tokenized asset markets in the Solana\nKeel is structured as being part of the Sky ecosystem, the long-running DeFi protocol formerly known as MakerDAO, as one of its autonomous units called \"stars.\" That's part of Sky's major overhaul dubbed Endgame that includes creating smaller units, each of which is responsible for its own governance and innovation at the edge of the ecosystem. Sky is centered around issuing the USDS (USDS) and\nSpark, the first of Sky's stars, has grown to more than $10 billion in total value locked (TVL) on Ethereum while allocating funds to over $1 billion in tokenized assets. Grove, the second unit launched earlier this year, is focused on collateralized loan obligations.\nKeel's mandate is acting as an on-chain capital allocator that sits between Solana DeFi protocols and the broader stablecoin economy. It receives a dedicated balance sheet from the USDS stablecoin reserves to deploy and support Solana-native protocols to generate yield. Early integrations include Kamino, Jupiter and Raydium, Solana-hosted marketplaces where liquidity can serve as a foundation for lending markets, routing and liquidity pools.\n\"Keel was founded on the belief that the next phase of on-chain finance growth needs more than new assets alone; it needs liquidity that can be accessed at speed and scale,\" said Cian Breathnach, CEO of Matariki Labs and a contributor to Keel. \"Keel is the first to provide these enablers on Solana, delivering the capital and catalyzing force for the next stage of growth in on-chain lending, borrowing, tokenization and more.\"\nKeel's plan could also help attract more tokenized real-world assets (RWA) to the Solana space, a fast-growing sector that aims to use blockchain rails to move and settle traditional financial assets like bonds, commodities and stocks.\nLily Liu, president of the Solana Foundation, called Keel \"a key step\" in positioning the blockchain as a leading marketplace for internet-scale capital markets. Rune Christensen, co-founder of Sky, added that Keel is set to become the largest capital allocator on Solana and will play a key role in shaping the DeFi and RWA landscape.\nRead more: Blockchain-Based RWA Specialists Bring $50M to Apollo's Tokenized Credit Strategy\nMore For You\nMEXC Ventures Raises Ethena Investment to $66M\nThe new investment builds on previous purchases of ENA and USDe, its synthetic stablecoin that tracks the value of the dollar without traditional reserves.\nWhat to know:\n- MEXC Ventures has now invested $66 million in the Ethena ecosystem, including a $30 million investment in ENA, the governance token of the Ethena protocol.\n- The new investment builds on previous purchases of ENA and USDe, Ethena's synthetic stablecoin that tracks the value of the dollar without traditional reserves.\n- MEXC Ventures has invested over $100 million in 40 projects and aims to be an ecosystem builder rather than a passive investor, it said."
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "327.500",
            "open": "46,320.790",
            "close": "46,326.420",
            "high": "46,445.640",
            "low": "46,118.140"
        },
        "market_summary": "Major US indices, including the Dow Jones (US30), are experiencing minor declines as investors adopt a cautious stance due to the high likelihood of a US government shutdown. The primary concern is that a shutdown would delay crucial economic data, such as the jobs report, leaving the Federal Reserve without key information for its interest rate decisions. While corporate earnings like Nike's are in focus, the overarching market theme is one of uncertainty and a defensive \"wait-and-see\" approach.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "Nike Posts Revenue Beat, Turnaround Efforts Show Improvement - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/news/nike-stock-earnings-q1-2026-dow-jones-tariffs-nke-stock/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #0e1296d4-9e8a-11f0-8ced-5eebe4b8f544"
            },
            {
                "title": "US stock market today: Dow Jones, S&P 500, and Nasdaq fall as investors take “wait-and-see” approach amid - The Economic Times",
                "source": "The Economic Times",
                "url": "https://m.economictimes.com/news/international/us/us-stock-market-today-dow-jones-sp-500-and-nasdaq-fall-as-investors-take-wait-and-see-approach-amid-government-shutdown-fears/amp_articleshow/124238078.cms",
                "body": "US stock market today: Dow Jones, S&P 500, and Nasdaq fall as investors take “wait-and-see” approach amid government shutdown fears\nSynopsis\nU.S. stocks fell slightly today as worries over a possible government shutdown grew. Investors are concerned that the shutdown could delay important economic data, including jobs and inflation reports. These reports are crucial for the Federal Reserve to decide on interest rate changes. The Dow Jones, S&P 500, and Nasdaq all showed minor losses. Traders adopted a cautious “wait-and-see” approach, uncertain about how long a shutdown could last and its impact on the economy.\nThe Dow Jones dropped about 0.4%, while the S&P 500 and Nasdaq each slipped around 0.3%. Investors are concerned that the shutdown could delay important economic reports, including the September jobs report, which the Federal Reserve uses to guide interest rate decisions.\nThe S&P 500 ETF (SPY) traded at $662.48, down 0.18%. Intraday prices ranged between $661.71 and $663.60, with a volume of over 19.8 million shares.\nThe threat of a shutdown is high, with about an 85% chance it will happen. Talks between President Trump and congressional leaders failed to produce a funding deal, making a government halt likely. Vice President JD Vance said after a meeting that \"we're headed to a shutdown.\" If no compromise is reached by midnight on September 30, non-essential government operations will stop, likely affecting key data releases.\nMany investors are looking at defensive sectors, such as healthcare and consumer staples, which tend to perform well during periods of uncertainty. These sectors have seen modest gains, offering some stability amid market fluctuations.\nCorporate earnings remain a central focus. Major technology companies, including Nvidia and Intel, are scheduled to release results soon. Traders are carefully analyzing earnings forecasts, as strong performance could offset some of the political and economic worries.\nTrade tensions continue to influence market sentiment. Announcements of tariffs and trade negotiations, both domestic and international, are keeping investors alert. Companies with heavy international exposure are particularly sensitive to these developments.\nEconomic reports that could be delayed include the monthly jobs report from the Bureau of Labor Statistics, the consumer price index, inflation data, and other vital economic indicators. The Labor Department has said the Bureau of Labor Statistics would stop work during a shutdown, pushing back data needed by markets and policymakers. This lack of data adds uncertainty just before the Federal Reserve’s October meeting.\nMarkets are reacting with caution. The U.S. dollar has weakened, and gold prices soared to record highs before pulling back. Sectors dependent on federal contracts or government funding could see mixed impacts. Federal and defense contractors, healthcare firms involved with government programs, and tech companies with government contracts may face payment delays or uncertainty.\nHistorically, government shutdowns cause short-term market volatility but usually have little lasting impact. The length of the shutdown matters; longer shutdowns increase uncertainty and delays in data. Market experts warn this shutdown could be more disruptive because the economy is weaker than usual, and investors rely heavily on economic data to decide on interest rates.\nDespite risks, stocks showed resilience earlier in September, but now investors remain cautious. The shutdown may postpone some key reports, including September payrolls and mid-October inflation data, which could slow the flow of crucial market information.\nMajor U.S. Stock Indices Today\n- S&P 500 (SPY): $662.72, down 0.15%\n- Dow Jones Industrial Average (DJIA): $462.79, down 0.05%\n- Nasdaq-100 (QQQ): $597.25, down 0.25%\nU.S. stock indices are seeing mild declines today, despite strong gains over the past several months. The S&P 500 is down around 0.15%, the Dow Jones Industrial Average "
            },
            {
                "title": "Dow Jones Forecast: DJIA falls as shutdown worries rise - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-ca/news-and-analysis/dow-jones-forecast-djia-falls-as-shutdown-worries-rise/",
                "body": "US futures\nDow futures -0.14%, S&P futures -0.12% & Nasdaq futures -0.07%\nIn Europe\nFTSE 0.36% & DAX 0.11%\n- US stocks slip on government shutdown worries\n- JOLTS job openings data due\n- Nike reports after the close\n- Oil extends losses on OPEC+ supply worries\nStocks struggle ahead of JOLTS job openings\nUS stocks are set to open lower on Tuesday in a cautious mood as the market awaits a key U.S. jobs report, as well as a potential looming US government shutdown.\nThe risk-off mode follows gains from yesterday as the market frets over the possibility of a US government shutdown, as Trump and the Democrats ended a meeting yesterday without a deal to finance the Federal government.\nPrevious shutdowns have had a limited impact on the market, as they tend to be temporary disruptions rather than permanent drags. However, these shutdowns can impact the collection and release of important economic data, particularly at a time when the economy is at a crucial juncture regarding the labour market and inflation.\nThe Fed is very data-dependent, as it weighs up whether to cut rates again given the current picture of a weakening labour market and sticky inflation. The current data points are needed to sustain rate cut expectations and support the ongoing rally.\nIf the government shuts down, Friday's nonfarm payroll report may not be released, which would put more emphasis on today's JOLTS job openings data for August.\nAs well as data, traders will also be looking to a busy session of Fed speakers, including Boston Fed's season Collins, Chicago Fed's Austin Goolsbee, and Dallas Fed's Lorie Logan.\nCorporate news\nNike will report earnings after the market close, which will offer further insights into consumer demand and margin trends. Expectations are for EPS of $0.27, marking a sharp decline from $0.70 in the same quarter last year. Revenue is expected to come in at $10.99 billion, marking a 5% year-over-year decline amid slowing consumer demand, inventory challenges, and currency headwinds.\nDow Jones forecast – technical analysis\nThe Dow Jones encountered resistance at its record high of 46,719 before easing lower. The price continues to hover around the multi-month rising trendline, although the RSI bearish divergence is a reason for caution. Buyers will look to extend gains above 46,719 to fresh record highs, with 47,000 the next logical target. Support can be seen at 45,700, last week’s low, and August’s high. A break below 45,000 negates the uptrend.\nFX markets – USD falls, GBP/USD rises\nThe USD is falling further due to the looming U.S. government shutdown, which could leave the Federal Reserve operating in the dark, as Friday's nonfarm payroll report would not be released under such circumstances.\nEUR/USD is benefiting from a weaker U.S. dollar and from hotter-than-expected eurozone inflation figures. The German CPI rose to 2.4% year-over-year in September, up from 2.2% in August and ahead of expectations of 2.3%. The data support the view that the ECB is unlikely to be cutting interest rates again anytime soon, after the central bank cut rates eight times, taking the deposit rate to 2%.\nThe GBP/USD is rising amid a weaker U.S. dollar and following a modest upward revision to the Q2 GDP. While GDP remained unrevised at 0.3% quarter-on-quarter, the annualized reading was lifted to 1.4% from 1.2%. However, upon closer examination of the data, this is primarily due to government investment, as consumption and business investment were relatively weak.\nOil drops further on oil supply worries\nOil prices extended their declines on Tuesday, trading 5% lower so far this week as supply concerns rattled the market.\nInvestors are concerned about another potential production increase by OPEC+ at a time when oil exports from Kurdistan are also resuming.\nOPEC+ will meet on Sunday, and is widely expected to approve another oil production increase of at least 137,000 barrels per day. The market is taking little relief from the fact that OPEC output is a"
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "114.000",
            "open": "9,306.310",
            "close": "9,382.260",
            "high": "9,386.510",
            "low": "9,272.510"
        },
        "market_summary": "The FTSE 100 is poised for its strongest quarterly performance in nearly two years, buoyed by an upward revision of UK GDP growth which indicates a resilient economy. However, this strength is tempered by significant headwinds, including a surging pound that pressures major exporters and a concerning acceleration in retail inflation to a 19-month high. While the index shows robust quarterly gains, it continues to underperform major global peers like the S&P 500.\n\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "​​FTSE 100 Rallies As UK Economy Shows Strength​ - ig.com",
                "source": "ig.com",
                "url": "https://www.ig.com/uk/news-and-trade-ideas/ftse-100-powers-ahead-as-uk-growth-revised-higher-250930",
                "body": "FTSE 100 powers ahead as UK growth revised higher\nThe FTSE 100 is on course for its strongest quarterly performance since late 2022, whilst sterling's surge weighs on exporters.\nFTSE 100 set for strongest quarter in nearly two years\nThe UK's benchmark index is poised to deliver its best three-month performance since the final quarter of 2022. With gains of approximately 6% over the period, it has outpaced the Euro Stoxx 50's more modest 3.8% advance.\nHowever, the FTSE 100 continues to trail the S&P 500, highlighting the divergence between UK and US equity markets. The underperformance reflects both structural differences in sector composition and the ongoing challenges facing UK-listed companies.\nThe index's strength comes despite headwinds from a rising pound and falling oil prices. Both factors have weighed on some of the market's largest constituents, particularly multinationals and energy giants.\nUK economy shows resilience with upgraded growth figures\nBritain's economic performance in the second quarter (Q2) proved stronger than initially thought, with annual gross domestic product (GDP) growth revised upward to 1.4% from 1.2%. The quarterly growth rate held steady at 0.3%, suggesting a modest but consistent expansion.\nThe construction and services sectors led the way, demonstrating the economy's shifting composition. This broad-based growth provides some reassurance that the recovery is not overly dependent on any single sector.\nThese revised figures come as welcome news for policymakers grappling with persistent inflation concerns. The data suggests the economy is weathering higher interest rates better than some had feared.\nHowever, questions remain about sustainability. With consumer confidence still fragile and business investment subdued, the path ahead remains uncertain despite these positive revisions.\nSterling strength creates headwinds for exporters\nThe British pound has climbed above $1.34, reaching levels not seen for some time. This appreciation in sterling has created challenges for major exporters with significant overseas earnings.\nCompanies like AstraZeneca, Unilever and BAE Systems have felt the pressure, as their foreign currency revenues translate into fewer pounds. This currency headwind has offset some of the operational gains these firms have achieved.\nThe stronger pound reflects growing confidence in the UK economy and expectations around interest rate policy. However, for FTSE 100 companies deriving substantial income from abroad, it presents a significant challenge to earnings growth.\nRetail inflation accelerates to 19-month high\nShop price inflation surged to 1.4% in September, marking its highest level in 19 months. The acceleration was driven primarily by DIY and gardening goods, suggesting seasonal factors may be at play.\nThe British Retail Consortium has warned that new packaging taxes could keep prices elevated. This regulatory change threatens to maintain upward pressure on consumer prices even as other inflationary pressures ease.\nFor retailers already operating on thin margins, this presents a delicate balancing act. They must decide whether to absorb these costs or pass them on to increasingly price-sensitive consumers.\nThe inflation data adds complexity to the Bank of England's (BoE) policy decisions. With services inflation proving sticky, policymakers face difficult choices about the appropriate path for interest rates.\nIndividual stock movers dominate trading activity\nASOS shares tumbled 13% after the online fashion retailer guided earnings to the lower end of market forecasts. The warning highlighted ongoing challenges in the fast-fashion sector, where competition remains intense.\nClose Brothers experienced sharp declines following the announcement of unexpected costs. The financial services firm's troubles underscore the importance of rigorous risk management in uncertain markets.\nOn the positive side, PayPoint surged over 5% after announcing a strategic deal with IDS. The partner"
            },
            {
                "title": "Older people living on their own could be due annual State Pension boost of £4,300 - Yahoo Life UK",
                "source": "Yahoo Life UK",
                "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_5bc3aacc-79a4-4f72-aaef-b7bf54bcb7c2",
                "body": "Yahoo is part of the Yahoo family of brands.\nWhen you use our sites and apps, we use cookies to:\n- provide our sites and apps to you\n- authenticate users, apply security measures, and prevent spam and abuse, and\n- measure your use of our sites and apps\nIf you click '\nAccept all', we and\nour partners, including 238 who are part of the IAB Transparency & Consent Framework, will also store and/or access information on a device (in other words, use cookies) and use precise geolocation data and other personal data such as IP address and browsing and search data, for analytics, personalised advertising and content, advertising and content measurement, and audience research and services development.\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\nIf you would like to customise your choices, click 'Manage privacy settings'.\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy & cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our privacy policy and cookie policy."
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "282.350",
            "open": "23,771.240",
            "close": "23,944.240",
            "high": "23,964.340",
            "low": "23,681.990"
        },
        "market_summary": "The GER40 (DAX) is experiencing cautious trading and underperformance relative to global peers, pressured by concerns over a potential US government shutdown, weaker-than-expected German retail sales, and domestic economic stagnation. The index is caught in a technical consolidation phase, with traders awaiting a breakout from its current range. Key focus is on upcoming German and Eurozone inflation data and ECB commentary for direction on monetary policy.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "DAX, GBP/USD Forecast: Two trades to watch - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/dax-gbp-usd-forecast-two-trades-to-watch-09-30-25/?amp=true",
                "body": "DAX, GBP/USD Forecast: Two trades to watch\nDAX slips on US government shutdown caution and & German retail sales fall\n- US government shutdown worries cool sentiment\n- German retail sales fall -0.2% MoM vs 0.6% rise expected\n- DAX trades in a holding pattern\nThe DAX is trading modestly lower on Tuesday in line with broader European markets amid a cautious mood over the possibility of a U.S. government shutdown and after German retail sales came in below expectations.\nYesterday, Vice President JD Vance stated that a government shutdown was likely due to stalled budget talks with Democrats. A closure could delay job data due on Friday, a key indicator not only for the health of the US labor market but also for the Federal Reserve when deciding on monetary policy. While this doesn't directly affect Europe, it's a sentiment play creating a cautious mood.\nElsewhere, on the data front, German retail sales fell 0.2% month-over-month after declining 0.5% in July. Expectations had been for a 0.6% rise in sales. The data suggest that the buying mood in Germany cooled significantly over the summer. Concerns over the economic picture are weighing on purchasing confidence.\nLooking ahead, attention turns to German inflation data, which is expected to show that the CPI ticked up to 2.3% year-over-year in September, up from 2.2%. ECB president Christine Lagarde is also due to speak. The markets are only pricing in a 35% probability that the ECB will cut rates again. In the middle of next year.\nDAX forecast – technical analysis\nDAX broke below its multi-month rising trendline, finding support at 23,400, the August low. The price has consolidated in a range of 23,800 – 23,400 over the past month. The RSI is neutral. This setup lends itself to a breakout trade. The price trades towards the upper end of the holding pattern.\nBuyers will look to break above 23,800 and 24,000, the 50 SMA to bring 24,600 and fresh record highs into play.\nSellers will look to break below 23,400 to create a lower low and bring 23,000 into focus.\nGBP/USD rises as US government shutdown looms\n- US government shutdown worries hurt USD\n- GBP gains could be limited by UK fiscal worries\n- GBP/USD tests the falling trendline resistance\nThe GBP USD is edging higher amid a softer U.S. dollar, driven by concerns over the U.S. government shutdown.\nThe US dollar is under pressure again on Tuesday as investors braced for a possible US government shutdown, a move that would delay the release of key jobs data this week. The data is key for Federal Reserve decision-making and could leave the central bank flying blind on the labour market.\nSeveral policymakers have highlighted weakness in the labour market as the driving force behind a decision to cut rates in the most recent policy meeting.\nTraders are currently pricing affords two basis points of Fed easing by the end of this year and 104 basis points by the end of 2026. 25 basis points less than seen earlier this month.\nMeanwhile, the pound is benefiting from the weekend's U.S. dollar, but gains could be limited if the market becomes concerned about Labour’s fiscal policy as the Labour Party conference continues.\nMarkets are currently uneasy regarding the UK's fiscal outlook, and negative headlines could quickly trigger sell-offs in base gilts and sterling.\nUK GDP came in line with forecasts at 0.3% QoQ, down from 0.7% in Q1 as the pull forward from Trump’s tariffs faded.\nGBP/USD forecast – technical analysis\nGBP/USD recovered from the 1.3230 low in September, rising off the ascending trendline. The price is testing resistance at 1.3450, the falling trendline, the horizontal resistance, and the 50 SMA.\nBuyers need to retake this level to extend gains towards 1.36, the August high, and 1.37.\nFailure to rise above the 1.3450 level could result in the price falling to retest support at 1.3330. A break below here creates a lower.\nBy Fiona Cincotta\nThe information on this web site is not targeted at the general public of any particular c"
            },
            {
                "title": "DAX Lags As European Markets Await ECB Insights - Menafn.com",
                "source": "Menafn.com",
                "url": "https://menafn.com/1110128787/DAX-Lags-As-European-Markets-Await-ECB-Insights",
                "body": "DAX Lags As European Markets Await ECB Insights\nEuropean equity markets finished cautiously higher overnight ahead of a busy week featuring key economic data and central bank speeches, including one from European Central Bank (ECB) President Christine Lagarde tonight.\nWith one trading session left, the Germany 40 (DAX 40) has underperformed its global peers this month and quarter.\n- In Germany, the DAX has fallen 0.26% month-to-date (MTD) and is down 0.64% quarter-to-date (QTD)\n- In the United Kingdom (UK), theFTSE 100 is up 1.22% MTD and 6.15% QTD\n- In the United States (US), the US 500 (S&P 500) is up 3.11% MTD and 7.35% QTD\n- In Japan, the Japan 225 (Nikkei 225) is up 5.44% MTD and 11.25% QTD.\nThe DAX's underperformance likely reflects a combination of seasonal weakness, as September is historically the DAX's weakest month, and Germany's economic stagnation, marked by sluggish manufacturing, consumer spending, and persistent inflation .\nAdditional headwinds include the ongoing war in Ukraine, which appears to be escalating, the end of ECB rate cuts, and a recent DAX rebalancing that saw key stocks like Porsche AG demoted, triggering selling pressure.\nWith these factors in mind, attention turns to tomorrow night's Euro Area (EA) inflation update previewed below.\nEuro Area: inflationDate: Wednesday, 1 October at 7.00pm AEST\nLast month, in August, headline inflation in the Euro Area remained at 2% for a third straight month. Core inflation, which strips out food and energy, also held steady at 2.3% for a fourth consecutive month.\nEarlier this month, the ECB kept its three key interest rates on hold as widely expected. This decision followed eight interest rate cuts by the ECB totalling 175 basis points (bp) between June 2024 and June 2025. With inflation at the ECB's 2% medium-term target and the Eurozone economy showing resilience, no changes were made.\nThis month, the preliminary expectation is for headline inflation to rise to 2.2% year-on-year (YoY) in September and for the core measure to remain at 2.3%. Such an outcome would likely reinforce expectations for the ECB to remain on hold until the middle of 2026.\nThe European interest rate market is pricing in only a slim 10% chance of another ECB 25 bp rate cut before year-end and only a modest 33% chance of a 25 bp rate cut by the middle of 2026.\nEA headline inflation rate chart Source: TradingEconomics Source: TradingEconomics FTSE 100 technical analysisLate last month, in August, the FTSE 100 hit a fresh record high of 9357, which it retested again overnight, falling just 3 points short. A sustained break above the 9357 record high would indicate the correction is complete and the uptrend has resumed, with scope towards 9500.\nHowever, as long as the FTSE 100 remains below the 9357 record high, there is potential for a dip back to 9100 as part of a sideways correction. If the support at 9100 fails, it could pave the way for a deeper decline towards the psychologically important 9000 support level .\nFTSE 100 daily chart Source: TradingView Source: TradingView DAX 40 technical analysisAfter a strong rally from the April low of 18,489 to the July high of 24,639, the DAX has spent the past two and a half months consolidating those gains.\nIf the DAX achieves a sustained break above initial resistance at 24,000 and then above trendline resistance at around 24,425, it would suggest the correction is complete and the uptrend has resumed toward 25,000.\nUntil then, the expectation is for the DAX to continue consolidating the gains made between April and July. As part of this, a dip back to trendline support at 23,300 is possible.\nDAX 40 daily chart Source: TradingView Source: TradingView- Source: TradingView. The figures stated are as of 30 September 2025 . Past performance is not a reliable indicator of future performance. This report does not contain and is not to be taken as containing any financial product advice or financial product recommendation.\nThis information has been pr"
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "190.500",
            "open": "24,608.560",
            "close": "24,627.850",
            "high": "24,704.180",
            "low": "24,513.680"
        },
        "market_summary": "The Nasdaq 100 faces mixed pressures from individual stock performance and broader macroeconomic concerns. While some components like First Business Financial Services show steady growth, others like Nvni Group are battling significant financial headwinds and a sharp loss of investor confidence. The broader index is also contending with potential volatility due to the threat of a U.S. government shutdown, which could delay critical economic data and complicate the Federal Reserve's policy decisions.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "First Business Financial Services (NASDAQ:FBIZ) Ticks All The Boxes When It Comes To Earnings Growth - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/first-business-financial-services-nasdaq-120346080.html",
                "body": "First Business Financial Services (NASDAQ:FBIZ) Ticks All The Boxes When It Comes To Earnings Growth\nThe excitement of investing in a company that can reverse its fortunes is a big draw for some speculators, so even companies that have no revenue, no profit, and a record of falling short, can manage to find investors. But the reality is that when a company loses money each year, for long enough, its investors will usually take their share of those losses. A loss-making company is yet to prove itself with profit, and eventually the inflow of external capital may dry up.\nIf this kind of company isn't your style, you like companies that generate revenue, and even earn profits, then you may well be interested in First Business Financial Services (NASDAQ:FBIZ). Even if this company is fairly valued by the market, investors would agree that generating consistent profits will continue to provide First Business Financial Services with the means to add long-term value to shareholders.\nHow Fast Is First Business Financial Services Growing?\nIf you believe that markets are even vaguely efficient, then over the long term you'd expect a company's share price to follow its earnings per share (EPS) outcomes. That makes EPS growth an attractive quality for any company. Over the last three years, First Business Financial Services has grown EPS by 7.6% per year. While that sort of growth rate isn't anything to write home about, it does show the business is growing.\nTop-line growth is a great indicator that growth is sustainable, and combined with a high earnings before interest and taxation (EBIT) margin, it's a great way for a company to maintain a competitive advantage in the market. Not all of First Business Financial Services' revenue this year is revenue from operations, so keep in mind the revenue and margin numbers used in this article might not be the best representation of the underlying business. First Business Financial Services maintained stable EBIT margins over the last year, all while growing revenue 8.2% to US$151m. That's a real positive.\nThe chart below shows how the company's bottom and top lines have progressed over time. Click on the chart to see the exact numbers.\nSee our latest analysis for First Business Financial Services\nWhile we live in the present moment, there's little doubt that the future matters most in the investment decision process. So why not check this interactive chart depicting future EPS estimates, for First Business Financial Services?\nAre First Business Financial Services Insiders Aligned With All Shareholders?\nIt's pleasing to see company leaders with putting their money on the line, so to speak, because it increases alignment of incentives between the people running the business, and its true owners. So it is good to see that First Business Financial Services insiders have a significant amount of capital invested in the stock. Indeed, they hold US$27m worth of its stock. That's a lot of money, and no small incentive to work hard. Those holdings account for over 6.2% of the company; visible skin in the game."
            },
            {
                "title": "Nvni Group (NASDAQ: NVNI) Battles Financial Headwinds Amidst Q2 2024 Earnings Release - FinancialContent",
                "source": "FinancialContent",
                "url": "https://markets.financialcontent.com/stocks/article/marketminute-2025-9-30-nvni-group-nasdaq-nvni-battles-financial-headwinds-amidst-q2-2024-earnings-release",
                "body": "Nvni Group (NASDAQ: NVNI) found itself in the spotlight following its Q2 2024 earnings release, which painted a complex picture of a company navigating growth alongside significant financial challenges. The report, covering the six-month period ending June 30, 2025, revealed an increase in net operating revenue but was overshadowed by a notable decline in Adjusted EBITDA and persistent concerns regarding the company's overall financial stability. Investors reacted swiftly and negatively, sending the stock tumbling and underscoring the market's apprehension about Nvni's path to sustainable profitability.\nThe immediate implications of the Q2 report are clear: Nvni Group is at a critical juncture. While demonstrating operational improvements in customer retention and top-line revenue growth, the underlying financial health, particularly its shareholders' deficit and cash flow from operations, remains a significant hurdle. The market's sharp downturn post-earnings reflects a loss of investor confidence, demanding a clearer strategy for overcoming these financial impediments, even as the company sets its sights on ambitious AI transformation goals in Latin America.\nQ2 2024: A Quarter of Mixed Signals and Market Discontent\nNvni Group's Q2 2024 earnings report, released on September 30, 2025, detailed a period of both progress and pronounced financial distress. The company reported a net operating revenue of 98,176 thousand Brazilian reais (R$), equivalent to $98.2 million, marking a 6.5% increase compared to the first half of 2024. This revenue growth was coupled with an impressive gross profit margin of 63.4% and a 16% growth in operating free cash flow. Furthermore, Nvni Group showed improvements in operational efficiency, with customer churn improving by 14% to 2.4%, and revenue recurrence remaining strong at 92.2%.\nHowever, these positive metrics were overshadowed by several alarming financial indicators. Adjusted EBITDA saw a significant 20% year-over-year decline, reaching $21 million, highlighting struggles in maintaining profitability. More critically, the company reported a net cash outflow of $32.3 million from operating activities, signaling a drain on its liquidity. Analysts have consistently pointed to Nvni's shareholders' deficit, where total liabilities exceed assets, as a major red flag indicating fundamental financial instability. Negative net income and deteriorating equity have also been recurring concerns.\nThe market's reaction was immediate and severe. Nvni Group's stock plunged by 24.47% in regular trading following the announcement, closing at $1.39, with an additional 2.19% drop in pre-market trading. This sharp decline reflects investor unease, particularly after earlier reports in May 2025 where TipRanks' analysis rated Nvni Group as \"Underperform\" for the full year 2024 due to significant financial distress. The consistent negative sentiment underscores the urgent need for Nvni to address its core profitability and balance sheet issues.\nImplications for Nvni Group and the Competitive Landscape\nFor Nvni Group (NASDAQ: NVNI) itself, the Q2 2024 earnings report reinforces the urgent need for strategic recalibration. While the company is actively pursuing an ambitious vision to become a leader in AI transformation within Latin America, planning further acquisitions and aiming for substantial top-line and EBITDA growth, its current financial standing poses significant questions about the feasibility and funding of these plans. The stated intention to finance future acquisitions through debt, specifically to avoid shareholder dilution, adds another layer of financial risk, particularly given the existing shareholders' deficit and cash outflow. The positive \"GREAT\" Financial Health Score of 3.38 from InvestingPro, suggesting strong fundamental positioning, presents a contrasting view to the immediate market reaction and highlights the complexity of Nvni's current situation. The company must demonstrate a clear pa"
            },
            {
                "title": "Nasdaq: Fed Data Blackout and Shutdown Threat Fuel Stock Market Volatility - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/nasdaq-fed-data-blackout-and-shutdown-threat-fuel-stock-market-volatility-1551926",
                "body": "The Nasdaq and S&P 500 is under pressure shortly before the mid-session on Tuesday as traders eyed the rising odds of a U.S. government shutdown, which added to concerns around weakening consumer sentiment and delayed economic data.\nThe benchmark index fell 0.2%, the Dow lost 168 points, or 0.4%, and the Nasdaq eased 0.1%. Despite the dip, all three major indexes remain on track for strong September gains, a rare feat during what’s typically a challenging month for equities.\nInvestor caution rose following remarks from House Speaker Mike Johnson, who expressed doubt about a shutdown deal before the looming deadline. The impasse raises fears that key economic releases—including the pivotal September jobs report—could be delayed, potentially leaving the Federal Reserve without fresh labor market data ahead of its next policy decision.\nThe Labor Department has already confirmed the nonfarm payrolls report won’t be released if the government shuts down. That would deprive the Fed of critical insight into employment conditions, at a time when policymakers are watching for signs of labor market cooling and inflation stickiness.\nConsumer confidence also missed expectations, with the Conference Board’s index falling to 94.2—its lowest since April. The “present situation” sub-index touched a one-year low, underlining a fragile consumer outlook that could feed into slower economic growth. As data disruptions loom, strategists warn of a possible uptick in market volatility.\nEnergy and financials led the losers, falling 1.55% and 1.01% respectively. Communication services and consumer discretionary sectors also underperformed.\nIn contrast, healthcare climbed 0.71%, with Merck and Pfizer up over 2% following news that Pfizer struck a pricing deal with the White House. Nvidia gained 2.5% after CoreWeave, which it backs, secured a $14.2 billion cloud infrastructure contract with Meta.\nTop decliners included Albemarle (-7.6%), Capital One (-5.4%), and Paycom (-4.8%). On the upside, Lamb Weston surged over 5%, and Interpublic Group gained more than 4%.\nHistorically weak in September, the S&P 500 is now up 3% for the month, while the Nasdaq has climbed 5%, and the Dow is higher by 1%. For the quarter, the S&P is tracking a 7% gain, with the Nasdaq up 10% and the Dow on pace for its fifth straight positive quarter.\nA protracted shutdown could alter the tone on Wall Street, especially if it delays key inflation and labor data. While most traders expect a resolution within two weeks, uncertainty alone could weigh on sentiment.\nWith Fed policy increasingly data-dependent, any blackout in economic releases may reduce market conviction and fuel near-term volatility.\nTraders should monitor developments from Washington closely, along with scheduled remarks from Fed officials for clues on the path ahead.\nMore Information in our Economic Calendar.\nJames Hyerczyk is a U.S. based seasoned technical analyst and educator with over 40 years of experience in market analysis and trading, specializing in chart patterns and price movement. He is the author of two books on technical analysis and has a background in both futures and stock markets."
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "50.250",
            "open": "6,660.230",
            "close": "6,674.510",
            "high": "6,694.020",
            "low": "6,643.770"
        },
        "market_summary": "The provided articles are unrelated to the SPX500 index. Two articles are automotive reviews of the new Aston Martin DBX S luxury SUV, focusing on its performance upgrades and market positioning. The third article is a news piece about the Colorado Bureau of Investigation reopening the case into author Hunter S. Thompson's 2005 death. There is no information provided about stock market performance, economic data, or corporate earnings that would allow for a market summary.\nSENTIMENT: Neutral\n\n**Overall Market Sentiment:** Neutral",
        "source_articles": [
            {
                "title": "We cross Mallorca in the Aston Martin DBX S, a new flagship model for the brand’s luxury SUV - wallpaper.com",
                "source": "wallpaper.com",
                "url": "https://www.wallpaper.com/transportation/we-cross-mallorca-in-the-aston-martin-dbx-s-a-new-flagship-model-for-the-brands-luxury-suv",
                "body": "We cross Mallorca in the Aston Martin DBX S, a new flagship model for the brand’s luxury SUV\nThe Aston Martin DBX S brings back Aston Martin’s sporting ‘S’ badge and provides an option list with greater scope than ever before\nAston Martin chose the smooth switchbacks of Mallorca as the launch destination for the latest variant of its ‘supercar SUV’, the DBX S. Graced with the ‘S’ suffix that has denoted lightly fettled and lightened sporting Astons since the turn of the century, DBX S becomes the brand’s new flagship performance SUV, and has a credible claim to being one of the best luxury SUVs on the market.\nLetting this big beast loose in a relatively small landscape is a bit of a gamble, given Mallorca’s popularity with the cycling community and the island’s remarkably regular bus service. Across twisting roads in the foothills of the island’s northerly mountain range, the Serra de Tramuntana, the DBX S demonstrated a gravity defying ability to go, turn and stop – the latter being especially handy when local delivery lorries show no sign of giving way.\nDBX S’s headline specs are all about power hikes and weight saving, both of which ultimately feel like a bit of a drop in the ocean given a car as big and powerful as the DBX. There are also some mild aesthetic upgrades, most of which align with the stated aim of stripping out a bit of the big SUV’s mass. These include a carbon fibre roof panel – the largest such carbon element ever fitted to an Aston Martin – and a new, ultra-lightweight grille.\nIn all, the maximum weight you can strip out of the hefty DBX S is 47kg, a not insignificant amount made more pertinent by a corresponding lowering of the centre of gravity. You will definitely pay the price, however, because carbon fibre options – whether they’re for the wing mirrors, side strakes, lower door sill or roof – are usually extremely expensive. An even more eye-watering option are the 23” magnesium wheels; using this superlight metal removes unsprung mass yet heaven help you if you kerb them.\nThis approach to elaborate options is not unique to Aston Martin, but it’s one surefire way of extracting maximum profit out of a model. Since debuting in 2020, DBX has done wonders for Aston Martin’s bottom line, even though the company is not quite out of the woods in a world riven with uncertainty and pugnacious approaches to global trade (one of the car’s biggest markets is the US).\nDBX S joins the relatively recently updated DBX707 to double the available models in the DBX line-up. That’s all part of an ongoing strategy to expand and extend the product line, creating enough variants and options to ensure that the average Aston customer never finds themselves without a shiny new toy to try.\nOne thing that has remained constant is the engine, a twin-turbo V8 that also does duty in the Aston Martin Vantage and DB12. By redesigning the turbos, Aston Martin has eked out the extra power, partly due to design innovations developed for the forthcoming Valhalla. More power goes hand in hand with handling tweaks, sharper steering and more responsive suspension.\nReceive our daily digest of inspiration, escapism and design stories from around the world direct to your inbox.\nThere’s also the not insignificant matter of bragging rights to retain. The DBX S boasts a power output of 727PS, which is not coincidentally slightly more than the Ferrari Purosangue (725PS). The Lamborghini Urus Performante has a devilish 666PS, while the Bentley Bentayga Speed brings up the rear with 650PS. None of these cars are slow. All are arguably way too quick, given their 2-tonne mass and usual quotidian use case.\nFrom the outset, what’s struck me most about the DBX is the way the car embodies the character of the brand. There may well be some remaining purists who maintain that Aston Martin should have never built an SUV, but without it, survival looks even more perilous. Even McLaren, the last hold-out amongst the big sporting marques, has a rumoured four-se"
            },
            {
                "title": "Aston Martin DBX S review: yet more power... and CarPlay Ultra Reviews 2025 - Top Gear",
                "source": "Top Gear",
                "url": "https://www.topgear.com/car-reviews/aston-martin/dbx-estate-2024/v8-dbx-s-5dr-touchtronic/first-drive",
                "body": "Aston Martin DBX S review: yet more power... and CarPlay Ultra\n£210,000 when new\nSPEC HIGHLIGHTS\n- BHP\n717.4bhp\n- 0-62\n3.3s\n- Max Speed\n193Mph\nAnother Aston Martin DBX?\nWell, yes. There are power games going on in the uppermost echelons of the SUV world. We’re not sure how much it really matters, but in becoming the DBX S, Aston Martin’s, erm, off-roader gets a hike from 697 to 717bhp. That’s enough to eclipse the Ferrari Purosangue – by 2bhp – although both the Lamborghini Urus SE and Porsche Cayenne Turbo e-Hybrid are more powerful still (789bhp and 729bhp respectively). But they’re electrified and the Aston is merely turbocharged.\nOld school vibes.\nThere is no hybrid option here. If you want your SUV to do an accomplished impression of a pretty serious sports car, look no further. Plus, it uses a bespoke bonded aluminium platform, which has given the engineering team a latitude denied to the Audi Q8, Bentley Bentayga, Lamborghini Urus, or Porsche Cayenne (all rely on the same VW group components matrix). Aston shifts around 3,000 DBXs per year, so this refresh is important to the bottom line. Prices start at £210,000, a five grand uplift on the 707.\nMore power is good. But the DBX 707 wasn’t actually a shrinking violet, was it?\nIndeed not. The S – and we love the old-school simplicity of the badge, first deployed by Aston Martin on the Vanquish in 2004 – is also notably lighter. That said, you actually have to pay more for some of the weight-saving stuff, principally the carbon fibre roof (an additional £5k) which also bins off the roof rails. It’s an impressive expanse, and at almost three metres square is the biggest carbon element ever fitted to an Aston.\nRemind me of the benefit of that…\nIt saves 18kg, and because it’s at the top of the car, it helps reduce the overall centre of gravity. Also on the menu are 23in magnesium wheels, which save 19kg in unsprung mass compared to the regular aluminium ones. Those of a metallurgical bent might like to know that magnesium is 75 per cent lighter than steel, and half the weight of titanium. A DBX S shod thusly is not a car in which to play fast and loose with kerbs. These bad boys cost £15k. With all the lightweight options fitted, Aston says the DBX S now weighs 2,198kg. Which, in this era of elephantine EVs, is actually pretty good.\nAny visual changes?\nThe car’s mighty maw now features a black vaned grille, although the options list tempts prospective owners again with a lightweight polycarbonate grille. Its honeycomb design mirrors that used on the Aston Martin DBS 770 Ultimate. May as well as buy one of those as well, eh?\nThere’s also a new front splitter and diffuser, new sills with air splitters, and red ‘S’ badges on the wings. The biggest visual change is at the rear, where the quad exhaust outlets now sit vertically rather than horizontally, and come in gloss or matt finishes. The rear bumper and diffuser have also been redesigned, and configurator junkies can go wild adding carbon fibre all over the shop. There’s a lower body go-faster stripe, too; choose between red, silver or green. The DBX has always been a strong piece of work with some clever graphic flourishes, and the S secures its position as a desirable and prestigious consumer good. Although that upswept rear duck tail/arse remains divisive.\nHit me up with some driving impressions.\nThe DBX S builds out on the changes made on the 707. Which is to say this is an SUV dragster of palpable character and bandwidth. We noted when we drove the 707 that the chassis could handle more power, so the additional 20bhp is welcome if not exactly transformative (torque remains unchanged at 664lb ft). The more complex engines become, the more its Mercedes-sourced 4.0-litre biturbo ‘hot V’ V8 feels like an outlier. It’s a fabulously woofly sounding thing under load, impressively restrained the rest of the time.\nWe know that EVs can be massively rampant, but the DBX S is a reminder of how addictive thumping mid-range torque can "
            },
            {
                "title": "Colorado Bureau of Investigation is reviewing Hunter S. Thompson’s 2005 death - Colorado Public Radio",
                "source": "Colorado Public Radio",
                "url": "https://www.cpr.org/2025/09/30/cbi-reviewing-hunter-s-thompson-death/",
                "body": "The Colorado Bureau of Investigation will review the death of renowned journalist and author Hunter S. Thompson.\nThe move comes more than 20 years after he was found dead at his home in Woody Creek, Colo., on Feb. 20, 2005, from an alleged self-inflicted gunshot wound at the age of 67.\nHe is best known for his works \"Fear and Loathing in Las Vegas,\" \"The Rum Diary\" and \"Hell’s Angels: A Strange and Terrible Saga,\" for which he spent time embedded with the notorious motorcycle gang documenting their lives.\nHe is also recognized for pioneering gonzo journalism, a first-person style of reporting, which discards traditional journalistic style and centers the reporter as a character in the story they’re telling.\nWhile there is no new evidence suggesting foul play, CBI is taking the case back up at the suggestion of the Pitkin County Sheriff’s Office following a request from his widow, Anita Thompson.\n“We understand the profound impact Hunter S. Thompson had on this community and beyond,” said Sheriff Michael Buglione in a press release. “By bringing in an outside agency for a fresh look, we hope to provide a definitive and transparent review that may offer peace of mind to his family and the public.”\nThe author famously ran to become the Pitkin County Sheriff in 1970 as a candidate for the “Freak Power” movement. His platform was documented in a Rolling Stone article titled “The Battle for Aspen,” in which he suggested the town be renamed “Fat City” to discourage developers from building there.\nCBI told CPR News it will not provide interviews until the investigation is complete, but there is no firm deadline for when that might be.\nIf you need help, dial 988 to reach the Suicide and Crisis Lifeline. You can also reach the Colorado Crisis Services hotline at 1-844-493-8255 or text “TALK” to 38255 to speak with a trained counselor or professional. Counselors are also available at walk-in locations or online to chat."
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "560.000",
            "open": "45,079.330",
            "close": "44,813.620",
            "high": "45,124.330",
            "low": "44,564.330"
        },
        "market_summary": "The Nikkei 225 fell sharply, dropping over 1% due to significant negative contributions from major stocks like SoftBank Group and Tokyo Electron. The decline was influenced by a strengthening yen and political uncertainty from an impending leadership change. Furthermore, an improved Tankan survey heightened expectations of a near-term interest rate hike from the Bank of Japan, adding to market pressures.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "The Nikkei average fell by approximately 560 yen, with major negative contributors including SoftBank Group, Tokyo Electron, and TDK. - 富途牛牛",
                "source": "富途牛牛",
                "url": "https://news.futunn.com/en/post/62832955/the-nikkei-average-fell-by-approximately-560-yen-with-major",
                "body": "As of shortly after 12:46 PM on the 1st, the Nikkei Stock Average was trading around 44,370 yen, approximately 560 yen lower compared to the previous day. The afternoon session began near the closing level of the morning session, and subsequently, a wait-and-see stance seems to have strengthened, leading to minor fluctuations. The foreign exchange market is experiencing a tug-of-war around 148 yen to the dollar.\nAmong the contributing stocks in the Nikkei Average, SoftBank Group <9984.T>, Tokyo Electron <8035.T>, and TDK <6762.T> ranked at the top of the negative contributors. On the other hand, Advantest <6857.T>, Chugai Pharmaceutical <4519.T>, and Otsuka Holdings <4578.T> were among the top positive contributors.\nAs of 12:45 PM, trading volume on the Prime Market reached 1.23926 billion shares, with a total trading value of 2.9114 trillion yen.\nProvided by: Wealth Advisor Co."
            },
            {
                "title": "BC-Nikkei 225 Futures - WKYC",
                "source": "WKYC",
                "url": "https://www.wkyc.com/article/syndication/associatedpress/bc-nikkei-225-futures/616-c7b6a117-c5ed-4eae-aa5c-d835dd6397c4",
                "body": "NEW YORK\n(AP) — Prices as of 5:30:00 PM Tuesday, September 30.\nNikkei 225 (Yen) (CME)\n500 yen x Nikkei 225 YEN futures price.\nEstimated volume: 17,930\nTuesday's volume: 17,930\nOpen Interest: 82,230\nOpen Interest Change: -51051\nCopyright 2025 Associated Press. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed."
            },
            {
                "title": "Asian shares are mixed as markets shrug off a likely US government shutdown - ABC27",
                "source": "ABC27",
                "url": "https://www.abc27.com/news/us-world/business/ap-asian-shares-are-mixed-as-markets-shrug-off-a-likely-us-government-shutdown/amp/",
                "body": "Shares were mixed in Asia on Wednesday, with Chinese markets closed for a weeklong holiday, as a U.S. government shutdown loomed.\nJapan’s Nikkei 225 index shed 1.2% to 44,411.26 after the Bank of Japan reported a slight improvement in business sentiment among major manufacturers.\nThe BOJ’s quarterly tankan adds to the likelihood the central bank will raise its key interest rate soon, to counter inflation that has topped its target range of about 2% for some time.\nPolitical uncertainty is also looming over Japan’s markets, with the ruling Liberal Democratic Party due to chose a new leader and prime minister later this week to replace embattled Prime Minister Shigeru Ishiba.\nAlthough markets and offices in mainland China are closed Oct. 1-8 for the National Day holiday, China’s central bank said it plans a 1.1 trillion yuan ($160 billion) reverse repo operation on Oct. 9, to increase the amount of cash in circulation and stimulate consumer spending and business investment.\nElsewhere in Asia, South Korea’s Kospi gained 0.8% to 3,450.62, while Taiwan’s Taiex added 1.3% on heavy buying of semiconductor-related shares.\nAustralia’s S&P/ASX 200 slipped 0.4% to 8,812.90.\nMarkets appeared to be taking a potential shutdown of the U.S. government in stride ahead of a midnight U.S. Eastern time deadline. Past U.S. government shutdowns have had a limited impact on the economy and stock market, and many investors expect something similar this time around.\nMany economists and professional investors expect something similar this time around.\nThe S&P 500 rose 0.4% to 6,688.46 to close out its fifth straight winning month after setting a record last week. The Dow Jones Industrial Average gained 0.2%, to set its own all-time high at 46,397.89.\nThe Nasdaq composite ticked 0.3% higher to 22,660.01.\nThis shutdown could be different, with the White House prone to push for large-scale firings of federal workers.\nThe broad stock market has been on a nearly relentless run since hitting a low in April on expectations that President Donald Trump’s tariffs won’t derail global trade and that the Federal Reserve will cut interest rates several times to boost the slowing job market.\nTreasury yields wavered in the bond market but ultimately held relatively steady following mixed reports on the U.S. economy. One said consumers are feeling less confident than economists expected, with many respondents in the Conference Board’s survey pointing to the job market and to inflation that has remained higher than anyone would like.\nA second report suggested the job market may be remaining in its “low-hire, low-fire” state. U.S. employers were advertising roughly the same number of job openings at the end of August as the month before. The hope on Wall Street had been for a number that’s neither too high nor too low, one balanced enough to keep the Fed on track to continue cutting interest rates.\nThe Fed just delivered its first cut of the year, and officials have penciled in more to give the job market a boost.\nWhen Wall Street will get the next data reports on the job market is uncertain, since a government shutdown would cause delays for several important reports, including Friday’s on how many jobs U.S. employers created and destroyed in September.\nThe Department of Labor has said that the Bureau of Labor Statistics will completely cease operations if there’s a lapse. The agency already was strained by Trump’s firing of Erika McEntarfer as BLS commissioner on Aug. 1 after the July jobs report showed a rapid slowdown in hiring, with job gains in May and June revised much lower than initially estimated.\nLate Tuesday, the White House was withdrawing the nomination of E.J. Antoni to lead the bureau, according to an AP source who spoke on the condition of anonymity to discuss a White House action that hadn’t been publicly announced.\nOil-related companies weighed on the market as the price of crude fell again as traders see too much oil washing around the world. Baker Hug"
            }
        ]
    }
]