[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "44.980",
            "open": "3,658.470",
            "close": "3,644.530",
            "high": "3,672.970",
            "low": "3,627.990"
        },
        "market_summary": "Gold prices are declining despite the Federal Reserve's recent 25 basis point rate cut, as the move was perceived as less dovish than some investors had hoped. The strength of the U.S. Dollar and profit-taking activity after gold reached record highs are applying additional downward pressure. However, these losses are tempered by ongoing geopolitical tensions which continue to provide underlying safe-haven support for the precious metal.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Gold Futures extend decline following Federal Reserve rate decision - KITCO",
                "source": "KITCO",
                "url": "https://www.kitco.com/opinion/2025-09-18/gold-futures-extend-decline-following-federal-reserve-rate-decision",
                "body": "Gold futures continued their downward trajectory on September 18, surrendering gains despite the Federal Reserve's decision to reduce its benchmark interest rate by 25 basis points. The precious metal's decline suggests that investors may be engaging in profit-taking activities after gold reached elevated price levels in recent sessions.\nDecember gold contracts settled $16.40 lower, representing a 0.44% decline to $3,678.20 on Thursday's trading session. Silver futures similarly retreated, closing lower by $0.03 or 0.08% at $42.12. Both precious metals encountered resistance from U.S. dollar strength that has persisted over the past two trading sessions.\nMarket analysts attribute gold's recent weakness to investor disappointment over the Federal Reserve's measured approach to monetary easing. The central bank's quarter-point rate reduction fell short of some market participants' expectations for a more aggressive half-point cut, leading to a reassessment of the Fed's dovish stance.\nThe economic backdrop presents a mixed picture for precious metals. Recent unemployment data revealed a sharp decline in initial jobless claims, indicating some resilience in the labor market. However, broader employment trends paint a more concerning picture, with the U.S. economy adding fewer than 30,000 jobs per month on average over the past quarter—a significant deceleration from the robust pace of over 100,000 monthly additions observed earlier this year.\nGold experienced intraday volatility, falling more than 1% during the session as market participants interpreted the Federal Reserve's policy communications as less accommodative than previously anticipated. This reaction occurred despite the rate cut and the central bank's signals indicating potential for additional monetary easing in future meetings.\nThe precious metal's performance reflects the complex interplay between monetary policy expectations, currency dynamics, and investor sentiment in the current market environment. As gold traditionally benefits from lower interest rates and currency debasement concerns, the measured pace of Federal Reserve easing has prompted investors to reassess their positions in the safe-haven asset.\nFor those that would like more information about our services click here\nWishing you as always good trading,"
            },
            {
                "title": "Why Investors Can’t Seem to Get Enough of Gold - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/articles/2025-09-18/gold-price-record-how-tariffs-inflation-us-rate-cut-are-fueling-bullion-rally",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            },
            {
                "title": "Gold Price Forecast: XAU/USD edges lower below $3,650 on stronger US Dollar, profit-taking - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gold-price-forecast-xau-usd-edges-lower-below-3-650-on-stronger-us-dollar-profit-taking-202509190009",
                "body": "- The Gold price drifts lower to around $3,640 in Friday’s early Asian session.\n- Fed decided to cut rates by 25 bps while signaling two more reductions this year.\n- Rising geopolitical tensions in the Middle East could boost the safe-haven flows, supporting the Gold price.\nThe Gold price (XAU/USD) trades in negative territory for the second consecutive day near $3,640 during the early Asian session on Friday. The precious metal edges lower after reaching a record high in the previous session due to some profit-taking and a firmer US Dollar (USD).\nOn Wednesday, the US Federal Reserve (Fed) cut the interest rates by 25 basis points (bps) and signaled two more reductions by the end of this year. This is the Fed's first reduction this year and puts the target range for its main lending rate at 4.0% - 4.25%.\nFed Chair Jerome Powell indicated that the latest move to lower interest rates was a risk management cut and added that he doesn't feel the need to move quickly on rates. A less dovish stance from the US central bank provides some support to the Greenback and weighs on the USD-denominated commodity price in the near term.\n\"Investors judged the Fed's guidance less dovish than anticipated,\" said MUFG analyst Soojin Kim. \"Chair Powell highlighted tariff-driven inflation risks and stressed a 'meeting-by-meeting' approach to further cuts, sending the dollar higher,\" Kim added.\nOn the other hand, escalating geopolitical tensions in the Middle East could boost the yellow metal, a traditional safe-haven asset. Israeli media reports indicated the military is preparing for a major ground incursion into Gaza City. For weeks, Israel has been laying the groundwork for such an operation, urging civilians to evacuate to designated humanitarian areas like Al-Mawasi.\nGold FAQs\nGold has played a key role in human’s history as it has been widely used as a store of value and medium of exchange. Currently, apart from its shine and usage for jewelry, the precious metal is widely seen as a safe-haven asset, meaning that it is considered a good investment during turbulent times. Gold is also widely seen as a hedge against inflation and against depreciating currencies as it doesn’t rely on any specific issuer or government.\nCentral banks are the biggest Gold holders. In their aim to support their currencies in turbulent times, central banks tend to diversify their reserves and buy Gold to improve the perceived strength of the economy and the currency. High Gold reserves can be a source of trust for a country’s solvency. Central banks added 1,136 tonnes of Gold worth around $70 billion to their reserves in 2022, according to data from the World Gold Council. This is the highest yearly purchase since records began. Central banks from emerging economies such as China, India and Turkey are quickly increasing their Gold reserves.\nGold has an inverse correlation with the US Dollar and US Treasuries, which are both major reserve and safe-haven assets. When the Dollar depreciates, Gold tends to rise, enabling investors and central banks to diversify their assets in turbulent times. Gold is also inversely correlated with risk assets. A rally in the stock market tends to weaken Gold price, while sell-offs in riskier markets tend to favor the precious metal.\nThe price can move due to a wide range of factors. Geopolitical instability or fears of a deep recession can quickly make Gold price escalate due to its safe-haven status. As a yield-less asset, Gold tends to rise with lower interest rates, while higher cost of money usually weighs down on the yellow metal. Still, most moves depend on how the US Dollar (USD) behaves as the asset is priced in dollars (XAU/USD). A strong Dollar tends to keep the price of Gold controlled, whereas a weaker Dollar is likely to push Gold prices up.\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only an"
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.185",
            "open": "68.104",
            "close": "67.577",
            "high": "68.484",
            "low": "67.299"
        },
        "market_summary": "Saudi Arabia is increasing crude oil supply to China in October through price cuts, aiming to reclaim market share following an OPEC+ decision to raise production. Concurrently, Brazil's oil output has surged to record highs due to new FPSO deployments, adding significant non-OPEC supply. While global refinery throughput is increasing, indicating robust demand, OECD commercial inventories remain below historical averages, pointing to a relatively tight physical market.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Saudi Crude Oil Supply to China Set to Surge in October, Trade Sources Say - EnergyNow.com",
                "source": "EnergyNow.com",
                "url": "https://energynow.com/2025/09/saudi-crude-oil-supply-to-china-set-to-surge-in-october-trade-sources-say/",
                "body": "(Reuters) – Saudi Arabia’s crude oil exports to China are set to surge in October after a deep cut in prices, several trade sources said on Thursday.\nState oil company Saudi Aramco will ship about 51 million barrels to China in October, about 1.65 million barrels per day (bpd), a tally of allocations to Chinese refiners showed.\nThe October plan compares with 1.43 million bpd allocated in September and matches the volume in August which was the highest since April 2023.\nCompanies which planned to increase Saudi crude liftings next month were Asia’s top refiner Sinopec , Hengli Petrochemical and Shenghong Petrochemical, the sources said.\nAramco did not immediately respond to a request for comment about its October allocation to China.\nEarlier Reuters reported that Aramco spoke to Asian buyers on the sidelines of this week’s APPEC conference in Singapore, nudging them to lift more crude in October as it seeks to reclaim market share.\nThe state producer set the October price for its flagship Arab Light crude to Asia at $2.20 a barrel above the Oman/Dubai average, down $1 per barrel from a five-month high in September.\nThe price cut followed a weekend decision by the Organization of the Petroleum Exporting Countries and allies led by Russia, known as OPEC+, to raise production by 137,000 barrels per day in October.\nThe group, which is led by Saudi Aramco and pumps about half of the world’s oil, has already boosted production targets by 2.5 million bpd since April, equivalent to about 2.4% of global demand.\nReporting by Siyi Liu in Singapore Editing by David Goodman, Elaine Hardcastle"
            },
            {
                "title": "Brazil oil supply returns to record high volumes - Oil & Gas Journal",
                "source": "Oil & Gas Journal",
                "url": "https://www.ogj.com/general-interest/economics-markets/news/55317595/brazil-oil-supply-revives-to-record-high",
                "body": "Brazil oil supply returns to record high volumes\nKey Highlights\n- Brazil's oil production decreased in 2024 but has since entered an upward phase with record-high outputs.\n- The launch of new FPSOs and increased utilization rates are central to Petrobras' multi-year expansion strategy.\n- The IEA projects Brazil's oil output to rise by an average of 400,000 b/d in 2025, with further gains expected in 2026.\n- The deployment of eight FPSOs from 2024 to 2026 will add over 1.3 million b/d capacity, boosting Brazil's offshore production capabilities.\nBrazil's oil sector is undergoing a significant revival after 2024 results showed oil production unexpectedly decrease by 50,000 b/d compared with the previous year.\nGrowth in 2024 was hindered by regulatory labor issues and several months of unplanned downtime. However, production has entered a robust upward phase this year due to the ramp-up of offshore installations and the launch of new projects.\nPreliminary data for July from the Agencia Nacional do Petroleo (ANP) revealed a notable upward revision, showing oil production rising by 200,000 b/d month-on-month to reach a record high of 4 million b/d, an increase of 720,000 b/d year-on-year. Preliminary ANP figures for August indicate a slight decline of 50,000 b/d, primarily due to operational issues at the Petrobras-operated Mero 2 and Equinor Energy-operated Peregrino projects.\nThe International Energy Agency (IEA) projects Brazil’s overall production to rise by an unprecedented average of 400,000 b/d this year, reaching 3.8 million b/d, with an additional gain of 180,000 b/d anticipated in 2026.\nThis robust growth is a key component of Petrobras' ambitious multi-year plan to deploy floating production storage and offloading (FPSO) vessels in a systematic manner. In addition to the five FPSOs launched in 2023, another six are expected to be operational by mid-2025, with one more anticipated later this year and an additional one next year.\nCollectively, the eight FPSOs being put into service from 2024 to 2026 will have a combined capacity of just over 1.3 million b/d, nearly double that of current UK production. For the FPSOs currently in operation, utilization rates have recently surged to nearly 75%, a significant increase from 63% in second-quarter 2025 and substantially higher than last year's average of 45%."
            },
            {
                "title": "OPEC Update, September 2025 - Peak Oil Barrel",
                "source": "Peak Oil Barrel",
                "url": "https://peakoilbarrel.com/opec-update-september-2025/",
                "body": "The OPEC Monthly Oil Market Report (MOMR) for August 2025 was published recently. The last month reported in most of the OPEC charts that follow is July 2025 and output reported for OPEC nations is crude oil output in thousands of barrels per day (kb/d). In the OPEC charts below the blue line with markers is monthly output and the thin red line is the centered twelve month average (CTMA) output.\nOPEC 12 output for July 2025 was revised down by 73 kb/d and June 2025 output was revised higher by 5 kb/d compared to last month’s report. OPEC 12 output increased by 478 kb/d with the largest increases from Saudi Arabia (258 kb/d), Iraq (122 kb/d), UAE (87 kb/d) and Kuwait (40 kb/d). Iran (27 kb/d) saw decreased crude output. All other OPEC members had small increases or decreases of 13 kb/d or less (net decrease for all other OPEC members of 1 kb/d).\nThe chart above shows output from the Big 4 OPEC producers that are subject to output quotas (Saudi Arabia, UAE, Iraq, and Kuwait.) After the pandemic, Big 4 average output peaked in 2022 at a centered 12 month average (CTMA) of 20849 kb/d, crude output has been cut by 1378 kb/d relative to the 2022 CTMA peak to 19471 kb/d in August 2025. The Big 4 may have about 1378 kb/d of spare capacity when World demand calls for an increase in output. Since April 2025 the OPEC Big 4 have increased output from 18346 kb/d to 19471 kb/d, and increase of 1125 kb/d in just 4 months (an average monthly increase of 281 kb/d.) Also the increase in Big 4 output over the past 4 months is 13 kb/d more than the OPEC 12 increase.\nThe chart above shows the most recent 36 month average annual increase of 134 kb/d for the Other 6 OPEC group which excludes the Big 4 and Iran and Venezuela. Iran and Venezuela have seen their output rise over the past 3 years at an annual rate of 405 kb/d which I believe will fall to zero in the near future. The chart below shows the long term trend for the OPEC Other 6 which is roughly flat (a small average annual rate of decrease of 8 kb/d over the past 11 years.) I expect the Other 6 will see their output return to this flat trend in the next few years.\nNo changes in the supply and demand forecast compared to last month’s report.\nRefinery crude throughput is a measure of World demand for C+C (though imperfect because some crude is burned directly in power plants in the middle east.) OPEC data shows the peak was 81.68 Mb/d in 2018. For the most recent 4 quarters the average World refinery throughput was 81.52 Mb/d, the previous 4 quarters had average refinery throughput at 81.09 Mb/d and 2024 had refinery throughput at 81.03 Mb/d. If the recent rate of increase continues (490 kb/d in 9 months) we may see a new peak in annual average World refinery throughput in 2025 or 2026.\nPreliminary July 2025 data show that OECD commercial inventories stood at 2,761 Mb, a build of\n2.4 Mb from the previous month. At this level, OECD commercial stocks were 66.5 Mb less than the same time last year, 128.5 Mb lower than the latest five-year average, and 208.6 Mb below the 2015–2019 average.\nOPEC has again revised its estimate of US tight oil output lower compared to the previous month. The 2024 estimate is 10 kb/d lower. 2025 is 20 kb/d lower and 2026 is also 20 kb/d lower than the August 2025 estimate.\nPeak US C+C output may be 2025 based on the OPEC estimate through 2026, US total liquids continues to increase after 2025 due to increased NGL, biofuel, and other liquids output (210 kb/d)\nNovi labs had an interesting Webinar on Permian well inventory entitled Permian Staying Power: Inventory Now and Through the 2040s, though a bit on the optimistic side I used information on expected tier 1 to tier 4 inventory through the 2040s from the presentation to create low, medium and high oil price scenarios for the Permian. Low price is $70/bo, medium is $85/bo and high is $100/bo in 2025 US$ with natural gas assumed to be $3/MCF in 2025$ and NGL at 30% of the crude oil price.\nThe low oil price scenario h"
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.180",
            "open": "64.078",
            "close": "63.778",
            "high": "64.658",
            "low": "63.478"
        },
        "market_summary": "Saudi Arabia is cutting prices and increasing supply to China in October to reclaim market share, following OPEC+'s decision to raise production. Meanwhile, OPEC reports that major producers have been steadily increasing output and that global inventories are tightening, falling below the five-year average. This increase in supply from key OPEC members and non-OPEC producers like Brazil, which is hitting record production volumes, is set to add significant volumes to the global market.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Saudi Crude Oil Supply to China Set to Surge in October, Trade Sources Say - EnergyNow.com",
                "source": "EnergyNow.com",
                "url": "https://energynow.com/2025/09/saudi-crude-oil-supply-to-china-set-to-surge-in-october-trade-sources-say/",
                "body": "(Reuters) – Saudi Arabia’s crude oil exports to China are set to surge in October after a deep cut in prices, several trade sources said on Thursday.\nState oil company Saudi Aramco will ship about 51 million barrels to China in October, about 1.65 million barrels per day (bpd), a tally of allocations to Chinese refiners showed.\nThe October plan compares with 1.43 million bpd allocated in September and matches the volume in August which was the highest since April 2023.\nCompanies which planned to increase Saudi crude liftings next month were Asia’s top refiner Sinopec , Hengli Petrochemical and Shenghong Petrochemical, the sources said.\nAramco did not immediately respond to a request for comment about its October allocation to China.\nEarlier Reuters reported that Aramco spoke to Asian buyers on the sidelines of this week’s APPEC conference in Singapore, nudging them to lift more crude in October as it seeks to reclaim market share.\nThe state producer set the October price for its flagship Arab Light crude to Asia at $2.20 a barrel above the Oman/Dubai average, down $1 per barrel from a five-month high in September.\nThe price cut followed a weekend decision by the Organization of the Petroleum Exporting Countries and allies led by Russia, known as OPEC+, to raise production by 137,000 barrels per day in October.\nThe group, which is led by Saudi Aramco and pumps about half of the world’s oil, has already boosted production targets by 2.5 million bpd since April, equivalent to about 2.4% of global demand.\nReporting by Siyi Liu in Singapore Editing by David Goodman, Elaine Hardcastle"
            },
            {
                "title": "OPEC Update, September 2025 - Peak Oil Barrel",
                "source": "Peak Oil Barrel",
                "url": "https://peakoilbarrel.com/opec-update-september-2025/",
                "body": "The OPEC Monthly Oil Market Report (MOMR) for August 2025 was published recently. The last month reported in most of the OPEC charts that follow is July 2025 and output reported for OPEC nations is crude oil output in thousands of barrels per day (kb/d). In the OPEC charts below the blue line with markers is monthly output and the thin red line is the centered twelve month average (CTMA) output.\nOPEC 12 output for July 2025 was revised down by 73 kb/d and June 2025 output was revised higher by 5 kb/d compared to last month’s report. OPEC 12 output increased by 478 kb/d with the largest increases from Saudi Arabia (258 kb/d), Iraq (122 kb/d), UAE (87 kb/d) and Kuwait (40 kb/d). Iran (27 kb/d) saw decreased crude output. All other OPEC members had small increases or decreases of 13 kb/d or less (net decrease for all other OPEC members of 1 kb/d).\nThe chart above shows output from the Big 4 OPEC producers that are subject to output quotas (Saudi Arabia, UAE, Iraq, and Kuwait.) After the pandemic, Big 4 average output peaked in 2022 at a centered 12 month average (CTMA) of 20849 kb/d, crude output has been cut by 1378 kb/d relative to the 2022 CTMA peak to 19471 kb/d in August 2025. The Big 4 may have about 1378 kb/d of spare capacity when World demand calls for an increase in output. Since April 2025 the OPEC Big 4 have increased output from 18346 kb/d to 19471 kb/d, and increase of 1125 kb/d in just 4 months (an average monthly increase of 281 kb/d.) Also the increase in Big 4 output over the past 4 months is 13 kb/d more than the OPEC 12 increase.\nThe chart above shows the most recent 36 month average annual increase of 134 kb/d for the Other 6 OPEC group which excludes the Big 4 and Iran and Venezuela. Iran and Venezuela have seen their output rise over the past 3 years at an annual rate of 405 kb/d which I believe will fall to zero in the near future. The chart below shows the long term trend for the OPEC Other 6 which is roughly flat (a small average annual rate of decrease of 8 kb/d over the past 11 years.) I expect the Other 6 will see their output return to this flat trend in the next few years.\nNo changes in the supply and demand forecast compared to last month’s report.\nRefinery crude throughput is a measure of World demand for C+C (though imperfect because some crude is burned directly in power plants in the middle east.) OPEC data shows the peak was 81.68 Mb/d in 2018. For the most recent 4 quarters the average World refinery throughput was 81.52 Mb/d, the previous 4 quarters had average refinery throughput at 81.09 Mb/d and 2024 had refinery throughput at 81.03 Mb/d. If the recent rate of increase continues (490 kb/d in 9 months) we may see a new peak in annual average World refinery throughput in 2025 or 2026.\nPreliminary July 2025 data show that OECD commercial inventories stood at 2,761 Mb, a build of\n2.4 Mb from the previous month. At this level, OECD commercial stocks were 66.5 Mb less than the same time last year, 128.5 Mb lower than the latest five-year average, and 208.6 Mb below the 2015–2019 average.\nOPEC has again revised its estimate of US tight oil output lower compared to the previous month. The 2024 estimate is 10 kb/d lower. 2025 is 20 kb/d lower and 2026 is also 20 kb/d lower than the August 2025 estimate.\nPeak US C+C output may be 2025 based on the OPEC estimate through 2026, US total liquids continues to increase after 2025 due to increased NGL, biofuel, and other liquids output (210 kb/d)\nNovi labs had an interesting Webinar on Permian well inventory entitled Permian Staying Power: Inventory Now and Through the 2040s, though a bit on the optimistic side I used information on expected tier 1 to tier 4 inventory through the 2040s from the presentation to create low, medium and high oil price scenarios for the Permian. Low price is $70/bo, medium is $85/bo and high is $100/bo in 2025 US$ with natural gas assumed to be $3/MCF in 2025$ and NGL at 30% of the crude oil price.\nThe low oil price scenario h"
            },
            {
                "title": "Brazil oil supply returns to record high volumes - Oil & Gas Journal",
                "source": "Oil & Gas Journal",
                "url": "https://www.ogj.com/general-interest/economics-markets/news/55317595/brazil-oil-supply-revives-to-record-high",
                "body": "Brazil oil supply returns to record high volumes\nKey Highlights\n- Brazil's oil production decreased in 2024 but has since entered an upward phase with record-high outputs.\n- The launch of new FPSOs and increased utilization rates are central to Petrobras' multi-year expansion strategy.\n- The IEA projects Brazil's oil output to rise by an average of 400,000 b/d in 2025, with further gains expected in 2026.\n- The deployment of eight FPSOs from 2024 to 2026 will add over 1.3 million b/d capacity, boosting Brazil's offshore production capabilities.\nBrazil's oil sector is undergoing a significant revival after 2024 results showed oil production unexpectedly decrease by 50,000 b/d compared with the previous year.\nGrowth in 2024 was hindered by regulatory labor issues and several months of unplanned downtime. However, production has entered a robust upward phase this year due to the ramp-up of offshore installations and the launch of new projects.\nPreliminary data for July from the Agencia Nacional do Petroleo (ANP) revealed a notable upward revision, showing oil production rising by 200,000 b/d month-on-month to reach a record high of 4 million b/d, an increase of 720,000 b/d year-on-year. Preliminary ANP figures for August indicate a slight decline of 50,000 b/d, primarily due to operational issues at the Petrobras-operated Mero 2 and Equinor Energy-operated Peregrino projects.\nThe International Energy Agency (IEA) projects Brazil’s overall production to rise by an unprecedented average of 400,000 b/d this year, reaching 3.8 million b/d, with an additional gain of 180,000 b/d anticipated in 2026.\nThis robust growth is a key component of Petrobras' ambitious multi-year plan to deploy floating production storage and offloading (FPSO) vessels in a systematic manner. In addition to the five FPSOs launched in 2023, another six are expected to be operational by mid-2025, with one more anticipated later this year and an additional one next year.\nCollectively, the eight FPSOs being put into service from 2024 to 2026 will have a combined capacity of just over 1.3 million b/d, nearly double that of current UK production. For the FPSOs currently in operation, utilization rates have recently surged to nearly 75%, a significant increase from 63% in second-quarter 2025 and substantially higher than last year's average of 45%."
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0098",
            "open": "1.1810",
            "close": "1.1785",
            "high": "1.1848",
            "low": "1.1750"
        },
        "market_summary": "The EUR/USD is consolidating within a range, retreating from highs near 1.1878 after the Federal Reserve's expected 25bps rate cut. The Fed's less dovish-than-anticipated stance, with Chair Powell highlighting persistent inflation risks, has bolstered the US Dollar and capped the pair's upside. While the Euro finds some underlying support from expectations the ECB may be done cutting rates, it remains pressured by a stronger Dollar and upcoming data releases.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "EUR/USD Price Slips to 1.1820 After 1.1878 High; Fed Cut, Jobs Data in Focus - tradingnews.com",
                "source": "tradingnews.com",
                "url": "https://www.tradingnews.com/news/eur-usd-price-holds-11820-after-feds-25-bps-cut",
                "body": "EUR/USD Price Holds 1.1820 After Fed’s 25bps Cut, Traders Eye 1.1730–1.1900 Range\nEuro stalls below 1.1878 as Powell warns on inflation; U.S. jobless claims and Philly Fed index set to test dollar rebound while 1.1730 support anchors outlook | That's TradingNEWS\nEUR/USD Struggles to Extend Gains After Fed’s 25bps Cut\nThe EUR/USD exchange rate is trading around 1.1820, unable to sustain momentum above the 1.1850 resistance after a sharp rally earlier in the week. The Federal Reserve delivered a widely expected 25 basis point rate cut, lowering its target range to 4.0%–4.25%, while its projections signal another 50bps of easing before year-end. The decision initially pushed the euro as high as 1.1878, its strongest since September 2021, but profit-taking and a rebound in the U.S. dollar capped the move.\nLabor Market Data and Philly Fed Index Take Center Stage\nTraders are shifting focus toward upcoming U.S. jobless claims and the Philadelphia Fed manufacturing survey, which could define the next directional move in EUR/USD. Jobless claims are expected at 240K, down from 263K the prior week, while continuing claims are projected to edge higher to 1.95 million. A stronger labor print would lend support to the dollar, while weak data could allow the euro to retest 1.1870–1.1900. The Philly Fed index, seen rebounding to 2.3 in September from -0.3 in August, could add further volatility to intraday trading.\nPowell Balances Dovish Shift With Inflation Concerns\nFed Chair Jerome Powell described the rate reduction as a “risk management cut,” stressing that inflation risks remain elevated into 2026. While the dot plot median reflects two additional cuts in 2025 and another in 2026, dissent was evident. Newly appointed governor Stephen Miran favored a more aggressive 50bps cut, while hawkish members leaned toward keeping rates closer to 4.4% into year-end. This divergence explains why the dollar regained strength after Powell’s press conference, tempering EUR/USD’s advance.\nEurozone Inflation Eases While ECB Holds Firm\nData from Europe showed the HICP inflation index rising just 0.1% in August, with the annual pace cooling to 2.0%, below expectations. Core inflation held steady at 3.1% year-on-year, leaving the European Central Bank with little urgency to tighten further. ECB Vice President Luis de Guindos suggested policy remains “appropriate” and emphasized the need to tolerate small deviations from the inflation target. The euro briefly ticked higher during his comments, though gains proved short-lived.\nRead More\n-\nSCHD ETF Analysis: $27.45 Price, 3.73% Yield, Dividend Growth Outlook\n18.09.2025 · TradingNEWS ArchiveStocks\n-\nBitcoin ETFs Fuel $117,000 BTC-USD Surge as Fed Cuts Rates\n18.09.2025 · TradingNEWS ArchiveCrypto\n-\nCopper Price at $9,943: Fed Cut, Dollar Rebound, and 880k Tons Lost Supply Shape Market\n18.09.2025 · TradingNEWS ArchiveCommodities\n-\nUSD/JPY Price at 146.80: Fed Cuts Rates, BoJ Holds at 0.5%, Traders Watch 145–150 Range\n18.09.2025 · TradingNEWS ArchiveForex\nTechnical Landscape: 1.1800 as Key Support, 1.1900 as Resistance\nPrice action shows EUR/USD consolidating within a well-defined channel. The pair has tested support at 1.1800 multiple times, with additional downside protection seen at 1.1755 and the 1.1730 trendline from late August. A sustained close below 1.1730 would shift sentiment bearish, opening the door toward 1.1700 and 1.1650. On the upside, the immediate barrier remains 1.1878, followed by 1.1935 based on Fibonacci retracements, before the critical 1.2000 psychological level. The 14-day RSI near 60 supports a cautiously bullish bias, while the MACD on the 4-hour chart is signaling a potential correction.\nDollar Index Correlation Keeps Pressure on the Euro\nThe U.S. Dollar Index (DXY) is hovering around 96.90, retreating from 97.25 resistance but still holding above 96.60 support. This range-bound behavior keeps the euro capped, as a dollar recovery above 97.70 would likely drag EUR/USD back toward 1.1750"
            },
            {
                "title": "EUR/USD holds losses below 1.1800 ahead of German PPI data - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/eur-usd-holds-losses-below-11800-ahead-of-german-ppi-data-202509190512",
                "body": "- EUR/USD depreciates as the US Dollar advances on a steady Fed policy outlook.\n- The US central bank indicated no rush to lower interest rates anytime soon.\n- The Euro may find support as traders price in an end to ECB policy easing.\nEUR/USD extends its losing streak for the third successive session, trading around 1.1770 during the Asian hours on Friday. The pair faces challenges as the US Dollar (USD) continues to attract buyers following the release of the United States (US) Weekly Initial Jobless Claims on Thursday. Traders await the German Producer Price Index (PPI) data for August due later in the day.\nThe US Department of Labour (DOL) released on Thursday, the number of US citizens submitting new applications for unemployment insurance declined to 231K for the week ending September 13. The latest print came in short of initial estimates of 240K and was lower than the previous week’s 264K (revised from 263K). Meanwhile, Continuing Jobless Claims shrank by 7K to 1.920M for the week ending September 6.\nThe US Dollar remains stronger after the Federal Reserve (Fed) delivered an expected rate cut on Wednesday but signaled no rush to lower borrowing costs quickly in the coming months. Fed Chair Jerome Powell pointed to growing signs of weakness in the labor market to explain why officials decided it was time to cut rates after holding them steady since December amid concerns over tariff-driven inflation.\nThe downside of the EUR/USD pair could be restrained as the Euro (EUR) may receive support from rising expectations of the European Central Bank (ECB) ending the rate cut cycle following the latest inflation figures.\nECB Vice President Luis de Guindos said that the central bank should follow a \"very prudent\" approach given the high uncertainty. Guindos added that the current rate is appropriate given inflation trends and the transmission of monetary policy. ECB Governing Council members Martins Kazaks and Gediminas Simkus said earlier this week that interest rates do not need further cuts at the moment, though they did not rule out a potential move in the future.\nEuro FAQs\nThe Euro is the currency for the 19 European Union countries that belong to the Eurozone. It is the second most heavily traded currency in the world behind the US Dollar. In 2022, it accounted for 31% of all foreign exchange transactions, with an average daily turnover of over $2.2 trillion a day. EUR/USD is the most heavily traded currency pair in the world, accounting for an estimated 30% off all transactions, followed by EUR/JPY (4%), EUR/GBP (3%) and EUR/AUD (2%).\nThe European Central Bank (ECB) in Frankfurt, Germany, is the reserve bank for the Eurozone. The ECB sets interest rates and manages monetary policy. The ECB’s primary mandate is to maintain price stability, which means either controlling inflation or stimulating growth. Its primary tool is the raising or lowering of interest rates. Relatively high interest rates – or the expectation of higher rates – will usually benefit the Euro and vice versa. The ECB Governing Council makes monetary policy decisions at meetings held eight times a year. Decisions are made by heads of the Eurozone national banks and six permanent members, including the President of the ECB, Christine Lagarde.\nEurozone inflation data, measured by the Harmonized Index of Consumer Prices (HICP), is an important econometric for the Euro. If inflation rises more than expected, especially if above the ECB’s 2% target, it obliges the ECB to raise interest rates to bring it back under control. Relatively high interest rates compared to its counterparts will usually benefit the Euro, as it makes the region more attractive as a place for global investors to park their money.\nData releases gauge the health of the economy and can impact on the Euro. Indicators such as GDP, Manufacturing and Services PMIs, employment, and consumer sentiment surveys can all influence the direction of the single currency. A strong economy is good for the "
            },
            {
                "title": "USD/JPY, EUR/JPY Outlook: BOJ Caution and Fed Signals Keep Yen Under Pressure - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/usd-jpy-eur-jpy-outlook-boj-caution-and-fed-signals-keep-yen-under-pressure/?amp=true",
                "body": "USD/JPY, EUR/JPY Outlook: BOJ Caution and Fed Signals Keep Yen Under Pressure\nThe US dollar index rallied for a second day after the Federal Reserve (Fed) delivered a less-dovish-than-expected 25bp cut. Powell’s pushback against a larger 50bp cut wrongfooted traders who had pre-emptively positioned for a jumbo-sized move, which is usually reserved for times of crisis.\nThe Bank of Japan (BOJ) is expected to hold interest rates at 0.5% today while presenting a cautiously optimistic outlook. Traders will be watching for any hints of an October hike, which an ex-BOJ official believes is likely, even if ultra-dovish Sanae Takaichi wins the election. Strong corporate profits and steady wage hikes are seen as sufficient justification for the BOJ to act in Q4.\nHowever, with no “sources” in the media leaking clues ahead of today’s meeting, it seems unlikely the BOJ will commit to signalling a move now. That could allow the Japanese yen to weaken further in line with recent momentum – a scenario that would continue to support USD/JPY and EUR/JPY bulls.\nView related analysis:\n- USD/JPY, EUR/JPY, AUD/JPY Outlook: Dollar, Yen Weakness Into FOMC, BOJ\n- EUR/GBP Outlook: Euro Favoured as Dollar Declines, British Pound Lags\n- EUR/USD, USD/JPY, VIX, Gold, Crude oil: COT Report Analysis\nChart prepared by Matt Simpson - data source: LSEG\nUSD/JPY and EUR/JPY Technical Outlook Ahead of BOJ Decision\nUSD/JPY Technical Analysis: US Dollar vs Japanese Yen\nThe US dollar’s rebound and low expectations of a BOJ hike has meant that USD/JPY has failed to break materially lower from its range once again. That said, I have finally removed the lower VPOC in light Wednesday’s false breakout for bears. But Wednesday’s lower tail does reveal a false break and sharp reversal around the July 20 low (145.76).\nMomentum for USD/JPY is pointing firmly higher within its range, and the day closed above its 200-day EMA. A strong directional rally can be seen on the 1-hour chart.\nA move up to the top of range and potential retest of the 200-day EMA (147.80) could be on the cards. Bulls could seek pullbacks to the monthly pivot point (147.50) and target the monthly S1 pivot around the 200-day SMA.\nChart analysis by Matt Simpson - data source: TradingView USD/JPY\nEUR/JPY Technical Analysis: Euro vs Japanese Yen\nThe euro (EUR) has broken higher against the Japanese yen (JPY), with EUR/JPY now trading at its strongest level since July 2025. This bullish breakout could open the path towards retesting the 2025 highs. With the daily trend structure firmly intact, traders may look for continuation signals on intraday charts or pullbacks into support zones.\nShould a retracement unfold on the daily timeframe, key support levels include the monthly S1 pivot at 173.30, the 20-day EMA at 172.65, and the rising bullish trendline from the August low. Given the momentum, a retest – or even a potential breakout – of the 2025 high remains a realistic target for euro bulls.\nNear-term resistance sits at the high-volume node (HVN) at 174.26 and the monthly R2 pivot at 174.75, which could temporarily cap upside and prompt a minor pullback.\nChart analysis by Matt Simpson - data source: TradingView EUR/JPY\nKey Economic Events for Traders (AEST / GMT+10)\n07:00 NZD Westpac Consumer Sentiment (NZD/USD, AUD/NZD, NZD/JPY)\n08:45 NZD Exports, Imports, Trade Balance (Aug) (NZD/USD, AUD/NZD, NZD/JPY)\n09:01 GBP GfK Consumer Confidence (Sep) (GBP/USD, EUR/GBP, GBP/JPY)\n09:30 JPY CPI, National CPI, National Core CPI (Aug) (USD/JPY, EUR/JPY, Nikkei 225)\n09:50 JPY Foreign Bonds Buying, Foreign Investments in Japanese Stocks (USD/JPY, EUR/JPY, Nikkei 225)\n12:30 JPY BoJ Monetary Policy Statement (USD/JPY, EUR/JPY, Nikkei 225)\n13:00 JPY BoJ Interest Rate Decision (USD/JPY, EUR/JPY, Nikkei 225)\n13:00 NZD Credit Card Spending (Aug) (NZD/USD, AUD/NZD, NZD/JPY)\n16:00 GBP Retail Sales, Core Retail Sales, Public Sector Borrowing, Public Sector Net Cash Requirement (Aug) (GBP/USD, EUR/GBP, FTSE 100)\n16:30 JPY BoJ Press "
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0126",
            "open": "1.3623",
            "close": "1.3551",
            "high": "1.3660",
            "low": "1.3534"
        },
        "market_summary": "The GBP/USD is consolidating below 1.3645 after the Bank of England held interest rates steady and slowed its quantitative tightening program, while the US Federal Reserve began its easing cycle. This policy divergence led to a firmer US Dollar, causing the pair to retreat from recent highs and test support near the 1.3550 level. The pair's broader uptrend from early September remains intact as long as it holds above the key 1.3500 support area.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "GBP/USD Consolidates Below 1.3645 as BoE Hold Meets Fed Cut - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/analysis/gbpusd-consolidates-below-13645-as-boe-hold-meets-fed-cut-200667159",
                "body": "Bank of Japan keeps interest rates unchanged; outlines ETF sale plans\nSterling slipped after the BoE left Bank Rate at 4% and slowed the pace of QT, while the dollar firmed post-Fed cut. GBP/USD is consolidating below recent highs near 1.3645. The broader advance from early September remains intact while the pair holds 1.3550/1.3500. A sustained push back above 1.3610 would re-open 1.3645 and the 1.3680 extension; failure to hold 1.3500 risks a deeper pullback to 1.3460.\nKey Takeaways\nBias: Constructive above 1.3500; buy-the-dip 1.3550/1.3500 with tight risk control.\nLevels: Support 1.3550 · 1.3500 · 1.3460. Resistance 1.3610 · 1.3645 · 1.3680.\nCatalysts (ET): BoE held at 4% and slowed QT today; 08:30 US Claims printed 231k.\nMacro Drivers\nBoE: 7–2 vote to hold at 4%; annual gilt-sale target cut to £70bn and skewed away from long-dated paper to ease gilt-market stress.\nFed: 25 bp cut with guidance for more easing; USD firmness capped cable near the top of its recent range.\nRates & Risk: If US yields soften and UK curves stabilise on slower QT, pullbacks in sterling may attract buyers.\nTechnical Outlook\nDaily:\nTrend up while above 1.3500, with higher lows since early September. 1.3460 marks deeper support from the prior base.\nH4/H1:\nConsolidation under 1.3610. Acceptance above 1.3610 opens 1.3645; momentum through there targets 1.3680. Losing 1.3500 invites a push toward 1.3460 before buyers likely re-establish control.\nScenarios & Invalidation (Not Advice)\nBase Case: Finds support 1.3550/1.3500 and rotates higher. Break/hold above 1.3610 unlocks 1.3645, then 1.3680.\nInvalidation: Hourly close below 1.3500 increases risk of a slide to 1.3460.\nAlternative: USD bid persists; cable loses 1.3500, extends toward 1.3460. A daily close below 1.3460 argues for broader consolidation.\nEvent Watch (ET)\nThu 07:00 — BoE decision (hold; QT slowed)\nThu 08:30 — US Initial Jobless Claims (231k)\nOne-Chart Summary\nGBP/USD Fibonacci (1.3430 → 1.3645)\nGBP/USD Key Levels Map\nLast/Next 48h (ET): FOMC cut, BoE hold/QT slowdown, US claims\n***\nDisclosure: This article reflects the author’s opinions at publication and is provided for informational purposes only. It is not investment advice.\nWhich stocks should you consider in your very next trade?\nThe best opportunities often hide in plain sight—buried among thousands of stocks you'd never have time to research individually.\nThat's why smart investors use our Stock Screener with 50+ predefined screens and 160+ customizable filters to surface hidden gems instantly.\nFor example, the Piotroski's Picks method averages 23% annual returns by focusing on financial strength, and you can get it as a standalone screen. Momentum Masters catches stocks gaining serious traction, while Blue-Chip Bargains finds undervalued giants.\nWith screens for dividends, growth, value, and more, you'll discover opportunities others miss. Our current favorite screen is Under $10/share, which is great for discovering stocks trading under $10 with recent price momentum showing some very impressive returns!"
            },
            {
                "title": "GBP/USD falls to 1.3550 as BoE holds rates, trims QT - Mitrade",
                "source": "Mitrade",
                "url": "https://www.mitrade.com/insights/news/live-news/article-1-1134427-20250918",
                "body": "The British Pound reversed its course, drops over 0.51% following the Bank of England’s decision to hold rates unchanged, after the Fed began its 2025 easing cycle. The GBP/USD trades at 1.3551 after hitting a daily high of 1.3660.\nThe economic schedule on both sides of the Atlantic has been busy. Initial Jobless Claims for the week ending September 13 came at 231K, below forecasts of 240K and the previous week upward revised 264K. Continuing Claims dipped from 1.939 million to 1.92 million\nAlthough the data was positive, hiring has slowed as most economists blamed tariffs. The Fed Chair Jerome Powell mentioned that the lack of immigration is another reason weighing on the labor market.\nEarlier, the Bank of England maintained the Bank Rate at 4% as expected, on a 7-2 vote split and reduced the Quantitative Tightening (QT) from £100 billion to £70 billion. Worth noting, in the previous meeting the BoE reduced rates even though inflation in the UK is almost twice the bank’s 2% target.\nBoE Governor Andrew Bailey said that there will be more rate cuts, though added that the timing and scale is uncertain.\nAhead, the UK economic docket will feature Retail Sales data. In the US, the calendar is empty, though traders should be aware that the Fed blackout period ended and that some officials could cross the newswires.\nThe GBP/USD shifted from being upward biased, to consolidate within the 1.3500 – 1.3650 area as an “evening star” emerges. If bears would like to push the exchange rate lower, they must clear the 20-day SMA at 1.3521, followed by the September 11 swing low of 1.3491. Once cleared, the next area of interest would be the confluence of the 100 and 50-day SMAs at around 1.3475/62.\nOn the flip side, a GBP/USD daily close above 1.3600, could cement the case for another attempt to challenge the yearly peak at 1.3788.\nThe Pound Sterling (GBP) is the oldest currency in the world (886 AD) and the official currency of the United Kingdom. It is the fourth most traded unit for foreign exchange (FX) in the world, accounting for 12% of all transactions, averaging $630 billion a day, according to 2022 data. Its key trading pairs are GBP/USD, also known as ‘Cable’, which accounts for 11% of FX, GBP/JPY, or the ‘Dragon’ as it is known by traders (3%), and EUR/GBP (2%). The Pound Sterling is issued by the Bank of England (BoE).\nThe single most important factor influencing the value of the Pound Sterling is monetary policy decided by the Bank of England. The BoE bases its decisions on whether it has achieved its primary goal of “price stability” – a steady inflation rate of around 2%. Its primary tool for achieving this is the adjustment of interest rates. When inflation is too high, the BoE will try to rein it in by raising interest rates, making it more expensive for people and businesses to access credit. This is generally positive for GBP, as higher interest rates make the UK a more attractive place for global investors to park their money. When inflation falls too low it is a sign economic growth is slowing. In this scenario, the BoE will consider lowering interest rates to cheapen credit so businesses will borrow more to invest in growth-generating projects.\nData releases gauge the health of the economy and can impact the value of the Pound Sterling. Indicators such as GDP, Manufacturing and Services PMIs, and employment can all influence the direction of the GBP. A strong economy is good for Sterling. Not only does it attract more foreign investment but it may encourage the BoE to put up interest rates, which will directly strengthen GBP. Otherwise, if economic data is weak, the Pound Sterling is likely to fall.\nAnother significant data release for the Pound Sterling is the Trade Balance. This indicator measures the difference between what a country earns from its exports and what it spends on imports over a given period. If a country produces highly sought-after exports, its currency will benefit purely from the extra demand created "
            },
            {
                "title": "GBP/USD sinks after BoE holds rates steady, UK Retail Sales in the barrel - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-usd-sinks-after-boe-holds-rates-steady-uk-retail-sales-in-the-barrel-202509182329",
                "body": "- GBP/USD backslid over 0.5% on Thursday after the BoE stubbornly held rates steady.\n- UK inflation continues to be an overarching problem limiting the BoE’s policy toolkit.\n- With the BoE hamstrung, inflation and slowing economic activity pose a double-sided issue for the UK.\nGBP/USD tumbled backwards on Thursday, falling a little over one-half of one percent and pushing the Pound Sterling (GBP) back below the key 1.3600 handle against the US Dollar (USD) after a brief spat above the major technical level.\nThe Bank of England (BoE) held interest rates flat in a 7-to-2 vote, and a general uptick in market unease helped keep the Greenback well-bid across the board.\nCentral bank dust settles, UK Retail Sales up next\nUK Retail Sales for August are due on Friday, but the headline figure will provide a mixed bag at best for data watchers. Retail Sales data is not typically adjusted by total sales volume, and high inflation can skew the sales figures to the upside.\nFunctionally, Retail Sales cannot differentiate between consumers struggling to pay for the same amount of goods with a larger proportion of their paycheque, and consumers properly injecting wage gains into the domestic economy.\nGBP/USD daily chart\nPound Sterling FAQs\nThe Pound Sterling (GBP) is the oldest currency in the world (886 AD) and the official currency of the United Kingdom. It is the fourth most traded unit for foreign exchange (FX) in the world, accounting for 12% of all transactions, averaging $630 billion a day, according to 2022 data. Its key trading pairs are GBP/USD, also known as ‘Cable’, which accounts for 11% of FX, GBP/JPY, or the ‘Dragon’ as it is known by traders (3%), and EUR/GBP (2%). The Pound Sterling is issued by the Bank of England (BoE).\nThe single most important factor influencing the value of the Pound Sterling is monetary policy decided by the Bank of England. The BoE bases its decisions on whether it has achieved its primary goal of “price stability” – a steady inflation rate of around 2%. Its primary tool for achieving this is the adjustment of interest rates. When inflation is too high, the BoE will try to rein it in by raising interest rates, making it more expensive for people and businesses to access credit. This is generally positive for GBP, as higher interest rates make the UK a more attractive place for global investors to park their money. When inflation falls too low it is a sign economic growth is slowing. In this scenario, the BoE will consider lowering interest rates to cheapen credit so businesses will borrow more to invest in growth-generating projects.\nData releases gauge the health of the economy and can impact the value of the Pound Sterling. Indicators such as GDP, Manufacturing and Services PMIs, and employment can all influence the direction of the GBP. A strong economy is good for Sterling. Not only does it attract more foreign investment but it may encourage the BoE to put up interest rates, which will directly strengthen GBP. Otherwise, if economic data is weak, the Pound Sterling is likely to fall.\nAnother significant data release for the Pound Sterling is the Trade Balance. This indicator measures the difference between what a country earns from its exports and what it spends on imports over a given period. If a country produces highly sought-after exports, its currency will benefit purely from the extra demand created from foreign buyers seeking to purchase these goods. Therefore, a positive net Trade Balance strengthens a currency and vice versa for a negative balance.\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or "
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0053",
            "open": "0.6639",
            "close": "0.6611",
            "high": "0.6659",
            "low": "0.6606"
        },
        "market_summary": "The Australian Dollar is weakening against the US Dollar, retreating from recent highs due to a surprisingly soft domestic jobs report that showed a loss of employment. While this data reinforces expectations for a future RBA rate cut, likely in November, immediate policy action is seen as unlikely. The USD is finding strength from a less dovish-than-anticipated Fed and solid US jobless claims data, adding downward pressure on the AUD/USD pair.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "AUD/USD Outlook: RBA in Spotlight After Soft Jobs Data - Forex Crunch",
                "source": "Forex Crunch",
                "url": "https://www.forexcrunch.com/blog/2025/09/18/aud-usd-outlook-rba-in-spotlight-after-soft-jobs-data/",
                "body": "- The AUD/USD outlook points to further weakness in Australia’s labor market.\n- Australia’s economy lost 5,400 jobs compared to the forecast of an addition of 21,200.\n- The dollar gained after the Fed cut rates as expected on Wednesday.\nThe AUD/USD outlook points to further weakness in Australia’s labor market that could increase pressure on the RBA to lower borrowing costs. However, traders still expect the central bank to hold this month. Meanwhile, the dollar gained after the Fed cut rates as expected.\n–Are you interested in learning more about ETF brokers? Check our detailed guide-\nData on Thursday revealed that Australia’s economy lost 5,400 jobs compared to the forecast of an addition of 21,200. The downbeat data highlighted weakness in the labor market. However, it was not enough to significantly shift the outlook for rate cuts. Traders are still expecting the RBA to hold rates this month. As a result, the Australian dollar recovered after an initial fall.\n“Employment growth is running out of steam, with headcount little changed from four months ago,” said Sean Langcake, head of Macroeconomic Forecasting for Oxford Economics Australia.\n“We don’t think these data are bad enough to spur the RBA into action this month. But another cut in November is expected.”\nMeanwhile, the dollar gained after the Fed cut rates as expected on Wednesday. Nevertheless, the outlook remains dim for the currency as the central bank intends to continue easing borrowing costs this year.\nAUD/USD key events today\n- US unemployment claims\nAUD/USD technical outlook: Bears and bulls battle around 30-SMA\nOn the technical side, the AUD/USD price has recovered to retest the 30-SMA after a recent break below the line. The break had indicated a momentary shift in sentiment to bearish. However, to maintain the new bias, the price must remain below the SMA and the RSI under 50.\n–Are you interested in learning more about Canada forex brokers? Check our detailed guide-\nBefore the sentiment shift, AUD/USD was trading in a steep bullish trend, keeping above the 30-SMA. At the same time, it was making higher highs and lows until it got to the 0.6700 key resistance level. Here, the price formed a large top wick on a bearish candle, showing a rejection of higher prices. As a result, the price broke below the SMA.\nIf the SMA holds as resistance, bears will get a chance to target the 0.6550 support level. At the same time, the price might start making lower highs and lows. On the other hand, if bulls break back above the SMA, the price will likely challenge the 0.6700 resistance for a new high.\nLooking to trade forex now? Invest at eToro!\n68% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money."
            },
            {
                "title": "Australian Dollar extends losses as US Dollar gains on steady Fed outlook - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/australian-dollar-extends-losses-as-us-dollar-gains-on-steady-fed-outlook-202509190150",
                "body": "- Australian Dollar stays muted after softer-than-expected domestic jobs data for August.\n- The AUD may regain its ground as markets now price just a 20% chance of an RBA rate cut in September.\n- The US Dollar continues to gain after the release of Weekly Initial Jobless Claims.\nThe Australian Dollar (AUD) edges lower against the US Dollar (USD) on Friday, extending its losses for the third successive session. The AUD/USD pair remains subdued as the US Dollar gains support after the release of the United States (US) Weekly Initial Jobless Claims on Thursday.\nThe AUD also struggled after a weaker-than-expected jobs report, which showed that Australia’s seasonally adjusted Employment Change arrived at -5.4K in August from 26.5K in July (revised from 24.5K), compared with the consensus forecast of 22K. Meanwhile, the Unemployment Rate steadied at 4.2% in August, as expected.\nThe Aussie Dollar found support on the fading likelihood of further Reserve Bank of Australia (RBA) rate cuts. Markets now price just a 20% chance of a September cut, while odds for November stand at 70%, with above-target inflation keeping policymakers cautious.\nUS President Donald Trump said that he could further extend his trade truce with Chinese President Xi Jinping when the leaders speak on Friday, in addition to brokering a sale for TikTok’s US operations, Bloomberg reported late Thursday.\nAustralian Dollar gains as US Dollar advances after softer Initial Jobless Claims\n- The US Dollar Index (DXY), which measures the value of the US Dollar against six major currencies, is gaining ground and trading around 97.40 at the time of writing.\n- The US Department of Labour (DOL) released on Thursday, the Initial Jobless Claims went down to 231K for the week ending September 13. The latest print came in short of initial estimates of 240K and was lower than the previous week’s 264K (revised from 263K). Meanwhile, Continuing Jobless Claims shrank by 7K to 1.920M for the week ending September 6.\n- The Federal Reserve (Fed) lowered the funds rate by 25 basis points (bps), marking the first cut of the year, and signaled a further 50 bps of easing before year-end, slightly above its June projections.\n- Fed Chair Jerome Powell pointed to growing signs of weakness in the labor market to explain why officials decided it was time to cut rates after holding them steady since December amid concerns over tariff-driven inflation.\n- The National Bureau of Statistics (NBS) showed on Monday that China’s Retail Sales rose 3.4% year-over-year (YoY) in August vs. 3.8% expected and 3.7% in July. Chinese Industrial Production increased 5.2% YoY in the same period, compared to the 5.8% forecast and 5.7% seen previously.\n- The NBS said during its press conference on Monday that economic operation was generally steady in August, but domestic demand will expand and promote a rebound in prices. Some firms are having difficulties in operations as the external environment is very severe, NBS added.\n- Reserve Bank of Australia (RBA) Assistant Governor Sarah Hunter said on Tuesday that the central bank is “close to getting inflation to target.” Hunter noted that risks to the outlook are balanced and emphasized the need for a forward-looking approach given the delayed impact of monetary policy. She added that the RBA is closely monitoring the underlying strength of consumer spending and aims to keep the economy near full employment.\nAustralian Dollar falls to near 0.6600 after breaking below nine-day EMA\nThe AUD/USD pair is trading around 0.6610 on Friday. Technical analysis on the daily chart indicates that the pair is remaining within an ascending channel, strengthening the bullish bias. However, short-term price momentum turned weaker, with the price moving below the nine-day Exponential Moving Average (EMA).\nThe AUD/USD pair may find its initial support at the ascending channel’s lower boundary around 0.6600. A break below the channel would weaken the bullish bias and lead the AUD/USD pair"
            },
            {
                "title": "Aussie Dollar Declines for 3rd Session - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/te_news:486457:0-aussie-dollar-declines-for-3rd-session/",
                "body": "Aussie Dollar Declines for 3rd Session\nThe Australian dollar slipped to around $0.660 on Friday, its third straight decline to pull back from an eleven-month peak reached mid-week.\nThe Aussie is also set for its first weekly loss in four weeks, pressured by a weaker-than-expected August jobs report that showed a surprise drop in employment, reinforcing bets of an RBA rate cut later this year.\nMarkets currently price only a 20% chance of a September move and a 70% chance in November.\nThe Q3 inflation print due in October will be pivotal, with the central bank noting that monthly figures are less reliable.\nInvestors also await next week’s PMI data to gauge the country’s economic health.\nAdding pressure, the US dollar gained support from a less dovish policy stance from the Federal Reserve.\nChair Powell framed the quarter-point cut as a risk-management step amid a softening labor market, stressing there was no need to rush easing.\nThe greenback also found support as new jobless claims fell, reversing the prior week’s spike."
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "1.4980",
            "open": "146.9270",
            "close": "147.9710",
            "high": "148.2630",
            "low": "146.7650"
        },
        "market_summary": "The USD/JPY pair is trading near multi-month highs, buoyed by a less dovish-than-expected Federal Reserve rate cut and a cautious Bank of Japan that is widely anticipated to hold rates steady. The Fed's signal for only two more cuts this year, coupled with the BOJ's lack of immediate tightening signals, has maintained the interest rate differential that supports the US dollar. This dynamic has kept the pair entrenched within a key technical range between 145.00 and 150.00, with current momentum pointing to a test of the range's upper bounds.\n\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "USD/JPY, EUR/JPY Outlook: BOJ Caution and Fed Signals Keep Yen Under Pressure - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/usd-jpy-eur-jpy-outlook-boj-caution-and-fed-signals-keep-yen-under-pressure/",
                "body": "The US dollar index rallied for a second day after the Federal Reserve (Fed) delivered a less-dovish-than-expected 25bp cut. Powell’s pushback against a larger 50bp cut wrongfooted traders who had pre-emptively positioned for a jumbo-sized move, which is usually reserved for times of crisis.\nThe Bank of Japan (BOJ) is expected to hold interest rates at 0.5% today while presenting a cautiously optimistic outlook. Traders will be watching for any hints of an October hike, which an ex-BOJ official believes is likely, even if ultra-dovish Sanae Takaichi wins the election. Strong corporate profits and steady wage hikes are seen as sufficient justification for the BOJ to act in Q4.\nHowever, with no “sources” in the media leaking clues ahead of today’s meeting, it seems unlikely the BOJ will commit to signalling a move now. That could allow the Japanese yen to weaken further in line with recent momentum – a scenario that would continue to support USD/JPY and EUR/JPY bulls.\nView related analysis:\n- USD/JPY, EUR/JPY, AUD/JPY Outlook: Dollar, Yen Weakness Into FOMC, BOJ\n- EUR/GBP Outlook: Euro Favoured as Dollar Declines, British Pound Lags\n- EUR/USD, USD/JPY, VIX, Gold, Crude oil: COT Report Analysis\nChart prepared by Matt Simpson - data source: LSEG\nUSD/JPY and EUR/JPY Technical Outlook Ahead of BOJ Decision\nUSD/JPY Technical Analysis: US Dollar vs Japanese Yen\nThe US dollar’s rebound and low expectations of a BOJ hike has meant that USD/JPY has failed to break materially lower from its range once again. That said, I have finally removed the lower VPOC in light Wednesday’s false breakout for bears. But Wednesday’s lower tail does reveal a false break and sharp reversal around the July 20 low (145.76).\nMomentum for USD/JPY is pointing firmly higher within its range, and the day closed above its 200-day EMA. A strong directional rally can be seen on the 1-hour chart.\nA move up to the top of range and potential retest of the 200-day EMA (147.80) could be on the cards. Bulls could seek pullbacks to the monthly pivot point (147.50) and target the monthly S1 pivot around the 200-day SMA.\nChart analysis by Matt Simpson - data source: TradingView USD/JPY\nEUR/JPY Technical Analysis: Euro vs Japanese Yen\nThe euro (EUR) has broken higher against the Japanese yen (JPY), with EUR/JPY now trading at its strongest level since July 2025. This bullish breakout could open the path towards retesting the 2025 highs. With the daily trend structure firmly intact, traders may look for continuation signals on intraday charts or pullbacks into support zones.\nShould a retracement unfold on the daily timeframe, key support levels include the monthly S1 pivot at 173.30, the 20-day EMA at 172.65, and the rising bullish trendline from the August low. Given the momentum, a retest – or even a potential breakout – of the 2025 high remains a realistic target for euro bulls.\nNear-term resistance sits at the high-volume node (HVN) at 174.26 and the monthly R2 pivot at 174.75, which could temporarily cap upside and prompt a minor pullback.\nChart analysis by Matt Simpson - data source: TradingView EUR/JPY\nKey Economic Events for Traders (AEST / GMT+10)\n07:00 NZD Westpac Consumer Sentiment (NZD/USD, AUD/NZD, NZD/JPY)\n08:45 NZD Exports, Imports, Trade Balance (Aug) (NZD/USD, AUD/NZD, NZD/JPY)\n09:01 GBP GfK Consumer Confidence (Sep) (GBP/USD, EUR/GBP, GBP/JPY)\n09:30 JPY CPI, National CPI, National Core CPI (Aug) (USD/JPY, EUR/JPY, Nikkei 225)\n09:50 JPY Foreign Bonds Buying, Foreign Investments in Japanese Stocks (USD/JPY, EUR/JPY, Nikkei 225)\n12:30 JPY BoJ Monetary Policy Statement (USD/JPY, EUR/JPY, Nikkei 225)\n13:00 JPY BoJ Interest Rate Decision (USD/JPY, EUR/JPY, Nikkei 225)\n13:00 NZD Credit Card Spending (Aug) (NZD/USD, AUD/NZD, NZD/JPY)\n16:00 GBP Retail Sales, Core Retail Sales, Public Sector Borrowing, Public Sector Net Cash Requirement (Aug) (GBP/USD, EUR/GBP, FTSE 100)\n16:30 JPY BoJ Press Conference (USD/JPY, EUR/JPY, Nikkei 225)\n17:00 EUR German PPI (Aug) (EUR/USD,"
            },
            {
                "title": "USD/JPY Price at 146.80 After Fed Cut and Ahead of BoJ — Range Between 145–150 in Focus - tradingnews.com",
                "source": "tradingnews.com",
                "url": "https://www.tradingnews.com/news/usd-jpy-price-at-146-fed-cut-rates-boj-holds-at-0-5-percent",
                "body": "USD/JPY Price at 146.80: Fed Cuts Rates, BoJ Holds at 0.5%, Traders Watch 145–150 Range\nWith the Fed signaling more cuts and the BoJ facing political pressure, USD/JPY stays trapped between 145.00 and 150.00 as traders prepare for volatility | That's TradingNEWS\nUSD/JPY Reacts to Fed Cut and BoJ Status Quo\nThe USD/JPY pair trades around 146.80 after a volatile week dominated by the Federal Reserve’s 25 bps rate cut and anticipation of the Bank of Japan’s policy stance. The Fed lowered rates to 4.00%–4.25% and signaled two more cuts before year-end, with Chair Powell emphasizing labor market weakness but leaving inflation forecasts at 3.1% for 2025. The dollar briefly spiked before settling, as investors recalibrated expectations. Across the Pacific, the BoJ is expected to leave rates unchanged at 0.50%, holding its cautious line despite inflation still running above wage growth. The divergence between the Fed’s easing path and Japan’s tentative tightening outlook has kept the pair in a narrow but tense trading band.\nPolitical Instability and Trade Deals Shape Yen Outlook\nJapan’s political backdrop adds complexity, with the Prime Minister stepping down and elections set for October 4. This leadership vacuum discourages aggressive BoJ action. At the same time, a new U.S.-Japan trade deal reassures policymakers that tariffs won’t immediately push Japan into recession, giving the BoJ more room to wait. Market pricing reflects this: traders assign roughly 50% odds of a 25 bps hike by March 2026, with gradual tightening expected over the next 18 months. For now, Governor Ueda’s communication is the swing factor—any hint of a shift could spark outsized yen strength.\nUSD/JPY Technical Battleground Between 145 and 150\nTechnically, USD/JPY remains locked between 145.00 support and 150.00 resistance. The 146.25 level has been tested repeatedly, with sellers pressing for a break lower. A decisive close under this level would expose 145.00 and then 143.30 as downside targets. On the upside, the 50-day moving average at 147.67 and the 200-day at 148.62 cap near-term rallies. A breakout above 148.60 would re-open the path toward 150.00 and possibly 150.77, the summer high. The pair’s inability to escape this band despite Fed easing underscores the market’s sensitivity to both central banks’ forward guidance.\nRead More\n-\nSCHD ETF Analysis: $27.45 Price, 3.73% Yield, Dividend Growth Outlook\n18.09.2025 · TradingNEWS ArchiveStocks\n-\nBitcoin ETFs Fuel $117,000 BTC-USD Surge as Fed Cuts Rates\n18.09.2025 · TradingNEWS ArchiveCrypto\n-\nCopper Price at $9,943: Fed Cut, Dollar Rebound, and 880k Tons Lost Supply Shape Market\n18.09.2025 · TradingNEWS ArchiveCommodities\n-\nGBP/USD Price Slips to 1.3550 as BoE Holds 4% and Fed Signals More Cuts\n18.09.2025 · TradingNEWS ArchiveForex\nFed-Boj Divergence Drives Carry Dynamics\nThe rate differential remains the central driver of USD/JPY. With the Fed signaling 50 bps of cuts by December and the BoJ likely holding or hiking modestly, medium-term pressures tilt against the dollar. That said, the yen’s traditional safe-haven status has been muted by Japan’s ultra-low yields and ongoing QE unwind. Hedge funds remain net long USD/JPY, reflecting carry trade support, but positioning leaves the market vulnerable to sharp reversals if U.S. data underperforms.\nMarket Positioning and Short-Term Catalysts\nSpeculators remain cautious, with many betting that USD/JPY holds within 146.30–147.35 near term. U.S. jobless claims, upcoming Japanese CPI data, and Ueda’s press conference will dictate direction. Should U.S. labor softness accelerate, the dollar leg of the pair weakens. Conversely, any delay in BoJ hikes prolongs yen underperformance, encouraging a retest of 148.60–150.00.\nVerdict on USD/JPY\nAt current levels near 146.80, USD/JPY is range-bound but leaning toward a bearish bias over the next 3–6 months. The combination of Fed easing and possible BoJ tightening by early 2026 suggests the yen will gradually strengthen. Fo"
            },
            {
                "title": "Japanese Yen weakens to near 148.00 ahead of BoJ rate decision - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-jpy-strengthens-to-near-14800-ahead-of-boj-rate-decision-202509182307",
                "body": "- USD/JPY edges higher to around 147.95 in Friday’s early Asian session.\n- Fed lowered its benchmark rate by 25 basis points, bringing overnight funds rate in a range between 4.00%-4.25%.\n- The BoJ is expected to keep its interest rate steady at 0.50% later on Friday.\nThe USD/JPY pair gains traction near 147.95 during the early Asian session on Friday. The US Dollar (USD) strengthens against the Japanese Yen (JPY) after the Federal Reserve (Fed) delivered an expected rate cut but signaled no rush to lower borrowing costs quickly in the coming months. The Bank of Japan (BoJ) interest rate decision will take center stage later on Friday.\nThe US central bank on Wednesday decided to cut the interest rate by a quarter-point and signaled that two more reductions are on the way before the end of the year as worries intensified over the US labor market, even as inflation is still in the air. The decision puts the overnight funds rate in a range between 4.00%-4.25%.\n“A majority of the FOMC is now targeting two further cuts this year, indicating that the doves on the committee are now in the driver’s seat,” said Simon Dangoor, head of fixed income macro strategies at Goldman Sachs Asset Management.\nThe BoJ is broadly anticipated to leave its benchmark interest rate unchanged at around 0.50% at a two-day meeting ending on Friday. The Japanese central bank has kept rates on hold for the fourth consecutive meeting, citing uncertainty about how US import tariffs will affect Japan's economy.\nTraders will take more cues from the speech from the BoJ Governor Ueda Kazuo after the policy meeting, which might offer some hints about the economic outlook for Japan. Any hawkish remarks from the BoJ policymakers could lift the JPY and create a headwind for the pair. According to a Reuters poll, a majority of economists expect another 25 basis points (bps) hike by year-end. But those surveyed were split on the timing, with bets centring on October and January.\nBank of Japan FAQs\nThe Bank of Japan (BoJ) is the Japanese central bank, which sets monetary policy in the country. Its mandate is to issue banknotes and carry out currency and monetary control to ensure price stability, which means an inflation target of around 2%.\nThe Bank of Japan embarked in an ultra-loose monetary policy in 2013 in order to stimulate the economy and fuel inflation amid a low-inflationary environment. The bank’s policy is based on Quantitative and Qualitative Easing (QQE), or printing notes to buy assets such as government or corporate bonds to provide liquidity. In 2016, the bank doubled down on its strategy and further loosened policy by first introducing negative interest rates and then directly controlling the yield of its 10-year government bonds. In March 2024, the BoJ lifted interest rates, effectively retreating from the ultra-loose monetary policy stance.\nThe Bank’s massive stimulus caused the Yen to depreciate against its main currency peers. This process exacerbated in 2022 and 2023 due to an increasing policy divergence between the Bank of Japan and other main central banks, which opted to increase interest rates sharply to fight decades-high levels of inflation. The BoJ’s policy led to a widening differential with other currencies, dragging down the value of the Yen. This trend partly reversed in 2024, when the BoJ decided to abandon its ultra-loose policy stance.\nA weaker Yen and the spike in global energy prices led to an increase in Japanese inflation, which exceeded the BoJ’s 2% target. The prospect of rising salaries in the country – a key element fuelling inflation – also contributed to the move.\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet doe"
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0048",
            "open": "1.3773",
            "close": "1.3793",
            "high": "1.3809",
            "low": "1.3761"
        },
        "market_summary": "USD/CAD has rallied from key support near 1.3750 following the Fed and BoC rate cuts. The Fed's less dovish-than-expected stance, projecting fewer cuts for next year, has fueled broad USD strength. This has overshadowed the BoC's cut and signals for further easing, setting up a near-term bullish structure for the pair as it approaches resistance at 1.3900.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Canadian Dollar Forecast: USD/CAD Rallies on Fed, BoC Rate Cuts - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/canadian-dollar-forecast-usd-cad-usdcad-rallies-on-fed-boc-rate-cuts/",
                "body": "Canadian Dollar, USD/CAD Talking Points:\n- USD/CAD has bounced from the support zone of 1.3750, keeping the door open for bulls and as looked at in the Tuesday webinar, the pair can remain an attractive point for traders looking at larger themes of USD-strength.\n- Both the Fed and BoC cut rates yesterday but perhaps more impactful was the Fed’s projections, which were less dovish for next year than what markets were looking for ahead of the announcement. That’s helped to bring on USD-strength in the aftermath of the rate decision, with a continuation of the rally in DXY showing after release of this morning’s jobless claims data.\n- I’ll be looking into USD/CAD in the weekly webinar, and you’re welcome to join the next. Click here to register.\nIt’s been a bullish reaction in the USD to yesterday’s rate cut from the Fed, and this bears some resemblance to last year, when the currency initially pressed into a fresh yearly low on news of the cut, only to rally during the press conference. For last year’s scenario, however, the currency remained near those lows for about two weeks before ultimately reversing and that USD rally ran through Q4 trade and into the 2025 open.\nFor the current instance, USD-strength has shown a bit more prominently with another push-higher this morning after the release of jobless claims data. And this has helped to further the recovery in USD/CAD following the pullback that ran into the start of this week.\nI looked into the pair in the Tuesday webinar, highlighting that support test as it was taking place at a key zone. The 1.3750 area was resistance in June and July after showing as support in May; and more recently, it’s been in as support following the break of an ascending triangle formation. The item focused on was where exactly bulls would show up to hold the lows, and whether that took place above the prior higher-low that had printed in late-August of 1.3626(7). Well, so far that higher low has held at 1.3626(8), or one-tenth of a pip above the prior higher-low, which shows some element of bullish anticipation remaining in the pair that has, so far, led to a rally back above the bigger picture support zone.\nUSD/CAD Four-Hour Chart\nChart prepared by James Stanley; data derived from Tradingview\nUSD/CAD Structure\nDespite the fresh three-year-low that printed in the USD briefly after the announcement of yesterday’s rate cut, USD/CAD continues to hold bullish structure as shown from the support zone taken from prior resistance, along with the shorter-term observation above of a higher-low holding above the prior test of that support zone.\nThis sets USD/CAD up as one of the more attractive major pairs for traders looking for USD-strength, and conversely, for those trying to avoid the USD, the Canadian Dollar weakness shown over the past couple of months could potentially be used elsewhere, in a pair with a relatively strong currency such as EUR/CAD or GBP/CAD.\nIn USD/CAD, the spot that bulls need to take out to illustrate greater control than simply a stall in the broader sell-off is the 1.3900 zone, which has held resistance twice over the past month, most recently last Thursday. Above that is a contentious zone, the same that was setting resistance back in May at the 1.4000 handle.\nUSD/CAD Daily Chart\nChart prepared by James Stanley; data derived from Tradingview\nUSD/CAD Bigger Picture\nI think the bigger picture look in USD/CAD is worth of mention here, as it helps to highlight where exactly the pair is in terms of the broader sell-off that took over in the first half of this year. At this point, the 23.% retracement of that move has continued to show as short-term resistance, and this highlights how a larger move of USD-strength could carry significant potential should the recovery in the pair continue.\nThe 38.2% retracement of that move aligns with the swing-high from May, which is also around that 1.4000 spot that saw ardent defense from sellers. And then above that, the 50% mark of this year’s se"
            },
            {
                "title": "USD / CAD - Canadian dollar looking for direction - Baystreet.ca",
                "source": "Baystreet.ca",
                "url": "https://www.baystreet.ca/articles/forex_trader.aspx",
                "body": "- BoC and Fed rate cuts met with a shrug\n- BoE leaves rates unchanged\n- US dollar trading indecisively\nUSDCAD open 1.3775, overnight range 1.3766-1.3801, close, 1.3775, WTI 63.5, Gold 3671.61\nThe Canadian dollar barely reacted to the Bank of Canada’s first rate cut in half a year, a move that had already been priced in after a string of soft economic releases. Policymakers signaled they were open to easing further, noting that inflationary pressure had eased to a degree.\nThe bigger jolt came from the Fed. A 25 bp rate cut knocked USDCAD down to 1.3727, but the dip didn’t last—within moments it was back near 1.3765 as traders realized the Fed wasn’t nearly dovish as they had hoped.\nWTI crude churned sideways between 63.45 and 64.26, with the latest Fed move keeping a lid on gains. Prices look locked in a broader 62.00–66.00 corridor, where worries about war-related supply shocks are balanced by rising Opec output.\nThe Fed didn’t live up to the hype. Instead of a sweeping dovish turn, it offered what Powell called a “risk management cut,” stressing that any further moves would be made one meeting at a time. Nine of nineteen policymakers still pencil in two more rate cuts this year, but the mixed message didn’t inspire markets. The initial knee-jerk dovish reaction evaporated, leaving Wall Street flat, the US dollar uneven, and 10-year Treasury yields bouncing back to 4.096% from a dip to 3.99%.\nAsian trading was a choppy affair. Japan’s Topix managed a 0.41% gain, while Australia’s ASX 200 slid 0.83% on the back of weak jobs data. Hong Kong’s Hang Seng dropped 1.35%. European bourses were more upbeat by early New York hours, with the DAX up 1.16%, the CAC 40 climbing 1.10%, and the FTSE 100 eking out a 0.17% rise.\nUS futures found some fuel, advancing 0.77% on optimism after Nvidia pledged a $5 billion investment in Intel. The dollar index sat at 96.91, gold traded at 3667.96, and 10-year Treasury yields hovered near 4.052%.\nEURUSD chopped between 1.1780 and 1.1849 overnight and is testing the top of that range as New York gets underway. The gains come despite labour unrest in France where teachers, health workers, and rail staff are striking against austerity measures.\nGBPUSD pushed up from 1.3586 in Asia to 1.3661 in New York before easing to 1.3646 after the Bank of England left rates unchanged at 4.0% and slowed the pace of its balance-sheet reduction.\nUSDJPY climbed within a 146.77-147.53 range, clawing back most of the week’s earlier losses. Yesterday’s dip to 145.50 was quickly reversed in a classic “sell the rumour, buy the fact” move after the Fed failed to deliver a dovish surprise. Weaker August Machinery Orders added no help. Traders now wait for the Bank of Japan’s decision tomorrow.\nAUDUSD dropped after soft employment data, sliding to 0.6616 from 0.6605, but the dip was short-lived and the pair rebounded to 0.6659 in New York. Australia shed 5,400 jobs, though the unemployment rate held steady at 4.2%.\nToday’s US releases feature weekly jobless claims, expected at 240,000 after last week’s 263,000, and the Philadelphia Fed Manufacturing Survey, forecast at 2.3 after printing –0.3 in August."
            },
            {
                "title": "Canadian Dollar holds steady above 1.3800, Canadian Retail Sales data looms - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-cad-holds-steady-above-13800-canadian-retail-sales-data-looms-202509190433",
                "body": "- USD/CAD flat lines near 1.3800 in Friday’s early European session.\n- The Fed cut the rates but signaled little urgency to lower borrowing costs quickly in the coming months.\n- The Canadian July Retail Sales report will be in the spotlight later on Friday.\nThe USD/CAD pair trades on a flat note around 1.3800 during the early European trading hours on Friday. The US Dollar (USD) might receive some support from a less dovish than expected stance from the US Federal Reserve (Fed). Traders await the Canadian Retail Sales data for July for fresh impetus, which is due later on Friday.\nThe Fed decided to cut the interest rates by 25 basis points (bps) and signaled two more reductions by the end of this year at its September meeting. This is the Fed's first reduction this year and puts the target range for its main lending rate at 4.0% - 4.25%.\nFed Chair Jerome Powell indicated that the latest move to lower interest rates was a risk management cut, adding that he doesn't feel the need to move quickly on rates. A less dovish stance from the US central bank provides some support to the Greenback in the near term.\nThe Bank of Canada (BoC) surprised markets by cutting its key rate to a three-year low of 2.5% at its meeting on Wednesday, while signaling it could ease further if needed. The divergence in interest rate paths from the BoC and the US Fed could exert some selling pressure on the Loonie as the US central bank offered a far less dovish message after its first rate cut of the year.\nMeanwhile, a rise in crude oil prices might lift the commodity-linked Loonie and create a headwind for the pair. It’s worth noting that Canada is the largest oil exporter to the US, and higher crude oil prices tend to have a positive impact on the CAD value.\nCanadian Dollar FAQs\nThe key factors driving the Canadian Dollar (CAD) are the level of interest rates set by the Bank of Canada (BoC), the price of Oil, Canada’s largest export, the health of its economy, inflation and the Trade Balance, which is the difference between the value of Canada’s exports versus its imports. Other factors include market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – with risk-on being CAD-positive. As its largest trading partner, the health of the US economy is also a key factor influencing the Canadian Dollar.\nThe Bank of Canada (BoC) has a significant influence on the Canadian Dollar by setting the level of interest rates that banks can lend to one another. This influences the level of interest rates for everyone. The main goal of the BoC is to maintain inflation at 1-3% by adjusting interest rates up or down. Relatively higher interest rates tend to be positive for the CAD. The Bank of Canada can also use quantitative easing and tightening to influence credit conditions, with the former CAD-negative and the latter CAD-positive.\nThe price of Oil is a key factor impacting the value of the Canadian Dollar. Petroleum is Canada’s biggest export, so Oil price tends to have an immediate impact on the CAD value. Generally, if Oil price rises CAD also goes up, as aggregate demand for the currency increases. The opposite is the case if the price of Oil falls. Higher Oil prices also tend to result in a greater likelihood of a positive Trade Balance, which is also supportive of the CAD.\nWhile inflation had always traditionally been thought of as a negative factor for a currency since it lowers the value of money, the opposite has actually been the case in modern times with the relaxation of cross-border capital controls. Higher inflation tends to lead central banks to put up interest rates which attracts more capital inflows from global investors seeking a lucrative place to keep their money. This increases demand for the local currency, which in Canada’s case is the Canadian Dollar.\nMacroeconomic data releases gauge the health of the economy and can have an impact on the Canadian Dollar. Indicators such as GDP, Manufac"
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "1.2240",
            "open": "200.1060",
            "close": "200.5400",
            "high": "201.2560",
            "low": "200.0320"
        },
        "market_summary": "The GBP/JPY is retreating sharply from a yearly high above 201.00 following a hawkish hold from the Bank of Japan (BoJ), which featured dissents calling for a rate hike and fueled JPY strength. This movement is exacerbated by a dovish outlook from the Bank of England (BoE), creating a policy divergence that weighs on the pair. Traders are now focused on upcoming comments from BoJ Governor Ueda for further direction, while the pair consolidates near key technical support.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "GBP/JPY retreats from YTD peak, hits 199.50 as JPY rallies post-BoJ - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-retreats-further-from-ytd-peak-dives-to-19950-amid-post-boj-jpy-strength-202509190444",
                "body": "- GBP/JPY attracts heavy selling on Friday as the JPY rallies after BoJ’s hawkish on-hold decision.\n- The BoE’s dovish outlook also contributes to the GBP’s underperformance against a firmer JPY.\n- Traders now look to BoJ Governor Ueda's comments at the press conference for a fresh impetus.\nThe GBP/JPY cross extends the previous day's retracement slide from the 201.25 area, or the highest level since July 2024, and attracts heavy selling during the session on Friday. The downward trajectory drags spot prices to the lower end of the weekly range, around the 199.50 area, and is exclusively sponsored by a strong pickup in demand for the Japanese Yen (JPY).\nAs was anticipated, the Bank of Japan (BoJ) decided to leave the short-term interest rate target unchanged in the range of 0.4%- 0.5% at the conclusion of a two-day monetary policy review meeting this Friday. However, there were two dissents to the on-hold decision, both wanting a rate hike, which, in turn, provides a goodish intraday boost to the JPY and exerts downward pressure on the GBP/JPY cross.\nFurthermore, investors have been pricing in the possibility of a 25-basis-point (bps) BoJ rate hike move in October amid signs of economic resilience. This marks a big divergence in comparison to the Bank of England's (BoE) dovish signal that there will be further reductions in the bank rate, which contributes to the JPY's outperformance against its British counterpart and weighs on the GBP/JPY cross.\nThe JPY bulls, however, might refrain from placing aggressive bets amid concerns that domestic political uncertainty could give BoJ reasons to further delay rate hikes. Adding to this, data released earlier today showed that Japan's core consumer prices rose at the slowest pace in nine months during August. Hence, BoJ Governor Kazuo Ueda's remarks should provide a fresh impetus to the GBP/JPY cross.\nEconomic Indicator\nBoJ Press Conference\nThe Bank of Japan (BoJ) holds a press conference at the end of each one of its eight scheduled policy meetings. At the press conference the Governor of the BoJ communicates with media representatives and investors regarding monetary policy. The Governor talks about the factors that affect the most recent interest rate decision, the overall economic outlook, inflation, and clues regarding future monetary policy. Hawkish comments tend to boost the Japanese Yen (JPY), while a dovish message tends to weaken it.\nRead more.Next release: Fri Sep 19, 2025 06:30\nFrequency: Irregular\nConsensus: -\nPrevious: -\nSource: Bank of Japan\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\nFXStreet and the author do not provide personalized recommendat"
            },
            {
                "title": "Japanese Yen Price Action Setups: USD/JPY, EUR/JPY, GBP/JPY - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en/news-and-analysis/japanese-yen-price-action-setups-usdjpy-usd-jpy-eurjpy-eur-jpy-gbpjpy-gbp-jpy/?amp=true",
                "body": "Japanese Yen Price Action Setups: USD/JPY, EUR/JPY, GBP/JPY\nJapanese Yen Talking Points:\n- USD/JPY set a fresh low after the announcement of the Fed’s cut yesterday, but along with USD has rallied in the aftermath as the bank’s projections weren’t as dovish as what markets were looking for.\n- Tonight brings the Bank of Japan rate decision and USD/JPY still holds within a range formation, while EUR/JPY has recently broken out from an ascending triangle and GBP/JPY remains near a recently-established yearly high.\n- I look into all three pairs during each weekly webinar, and you’re welcome to join the next. Click here to register.\nThe Fed cut rates and warned of another 50 bps of cuts for this year and another 25 for next year, yet the US Dollar has rallied over the past two days and is now threatening a larger reversal formation on the weekly chart. DXY is holding resistance at a big spot, from the longer-term trendline that’s held support for the past month; but if we do see USD bulls push into the end of the week, forming a hammer on the weekly chart, the premise of bullish reversals will start to look much more attractive. Key for whether this happens will be the Bank of Japan meeting later tonight.\nUS Dollar Weekly Chart\nChart prepared by James Stanley; data derived from Tradingview\nUSD/JPY\nWhile the USD touched a fresh three-year low at yesterday’s rate decision before beginning the rally, USD/JPY has largely held well-above its April low of 140 and July low just inside of 142. Support yesterday showed right around the bullish trendline produced by this year’s higher-lows which is confluent with the 145.86 level looked at in the Tuesday webinar.\nThe fact that USD/JPY has been largely flat over the past six weeks even as DXY has melted down elsewhere, against the Euro and British Pound, highlights the deduction of Yen-weakness, which has been more attractive elsewhere in pairs such as EUR/JPY and GBP/JPY. That may remain the case as of right now, although if we get a similar reaction in USD/JPY as what showed around the last BoJ meeting, that could begin to shift.\nIt was the FOMC and BoJ meetings in late-July that led into breakout in USD/JPY. With rate cut bets being priced-out after the Fed, USD/JPY shorts were squeezed, with another gust of rally showing around the Bank of Japan meeting later that night. This allowed for a break of 150.00 in USD/JPY, and eventually a resistance test at 150.77 which was looked at in these articles. As I warned then, this was a tough move to chase and that proved to be the case when we saw a vicious reversal on that Fridy after the release of Non-farm Payrolls.\nAs we traded into August, with the USD continuing to head lower on the back of weakness in the labor market, USD/JPY held a flat, horizontal range, and this again illustrates that deduction of Yen-weakness.\nIn USD/JPY, there’s now an open door for bulls and if they do push through, which could allow for the bullish scenario in USD to brighten, opening the door to larger reversal potential in DXY. But, until that breakout shows, JPY-weakness may simply be more attractive elsewhere, as we’ve seen over the past few months.\nUSD/JPY Daily Chart\nChart prepared by James Stanley; data derived from Tradingview\nEUR/JPY\nThe main complication with EUR/JPY is historical in nature, and that’s a dearth of history above the 175.00 level. To this point there has been one single daily close in the pair above that price – and it was the day before the pair went into a 2000 pip reversal.\nAs chronicled in these pieces even going back to the July BoJ meeting, bulls have very much remained in control here and there’s still no evidence of that changing. But – the episode at 170.00 also highlights how impactful these round levels can be and if we do see buyers stretch up for a test of 175.00 before pulling back, there could be a case to be made for short-term reversal setups.\nAs for trends, bulls are still in order and the ascending triangle that’s built ove"
            },
            {
                "title": "GBP/JPY price forecast: Consolidates near 201.00 ahead of BoJ decision - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/amp/news/gbp-jpy-price-forecast-steadies-near-20100-as-traders-await-bojs-meeting-202509182239",
                "body": "GBP/JPY Price Forecast: Steadies near 201.00, as traders await BoJ’s meeting\n|- Pound capped by Bailey’s dovish remarks after BoE keeps Bank Rate at 4% amid inflation concerns.\n- BoJ expected to hold rates steady after data showed slower growth, though GDP figures confirm ongoing expansion.\n- Technicals point to consolidation, with key resistance at 201.50 and support seen around 199.50–198.90 levels.\nThe GBP/JPY prints back-to-back bullish candles, posting solid gains of 0.11% on Thursday, though it remains shy of re-testing the current year-to-date (YTD) high of 201.72.\nTraders digested the Bank of England’s decision to hold rates, though a dovish tilt by the BoE’s Governor Andrew Bailey, capped the British Pound advance.\nConversely, the Bank of Japan is expected to hold rates on today’s meeting, as the bank’s paused its hiking cycle as data revealed that growth slowed. Nonetheless, recent GDP figures showed that the economy continues to grow.\nGBP/JPY Price Forecast: To consolidate, within a 130-pip range\nFrom a technical perspective, the GBP/JPY remains poised to extend its gains, but in the short term it could consolidate within the 200.04-201.30 range. The Relative Strength Index (RSI) is bullish, but it has turned flattish. This indicates that neither buyers nor sellers have the upper hand.\nIf GBP/JPY climbs above 201.00, the next resistance would be 201.50 before challenging the yearly high at 201.72. On further strength, the next area of interest would be 204.23, July 24, 2024, peak.\nConversely if the cross-pair slumps below 200.00, the first support would be the 20-day SMA at 199.49, before testing the 50-day SMA at 198.91. A breach of the latter will expose the August 29 low of 197.94.\nGBP/JPY Price Chart – Daily\nPound Sterling Price This week\nThe table below shows the percentage change of British Pound (GBP) against listed major currencies this week. British Pound was the strongest against the New Zealand Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the British Pound from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent GBP (base)/USD (quote).\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers."
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "2,787.0000",
            "open": "115,608.9700",
            "close": "117,557.5000",
            "high": "117,971.5000",
            "low": "115,184.5000"
        },
        "market_summary": "The SEC has approved new generic listing standards that will streamline the process for launching crypto ETFs, potentially leading to a rapid expansion of available funds beyond just Bitcoin and Ethereum. This regulatory breakthrough has already resulted in the approval of the first multi-crypto asset ETF, the Grayscale Digital Large Cap Fund. The change is viewed as a significant step forward for regulatory clarity and is expected to make a wider range of digital assets accessible to investors through traditional investment vehicles.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Bullish Leads Crypto Exchange Rally After Fed Rate Cut, SEC Rule Change - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/news/bullish-coinbase-gemini-crypto-fed-rate-sec-crypto-etp-rules-bitcoin-blsh-stock-earnings/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #d4a6cfb4-951b-11f0-ba34-fd7ef925f9e0"
            },
            {
                "title": "SEC Approves Standards That Could Lead to a Flurry of New Crypto ETFs - Investopedia",
                "source": "Investopedia",
                "url": "https://www.investopedia.com/sec-approves-standards-that-could-lead-to-a-flurry-of-new-crypto-etfs-11812612",
                "body": "Key Takeaways\n- The SEC has approved general listing standards for crypto ETFs.\n- The new framework is expected to lead to an explosion in crypto ETF listings in the coming weeks and months.\n- Under the new framework, crypto ETFs can be fast-tracked if the underlying crypto asset has had a futures market on a regulated exchange for at least six months and meets other standards.\nThe Securities and Exchange Commission has paved the way for a flurry of new crypto-related exchange-traded funds.\nThe SEC late Wednesday announced that it approved generic listing standards for commodity-based exchange-traded products, fast-tracking the approval for crypto funds.1 By approving the standards across Nasdaq, Cboe BZX, and NYSE Arca, the SEC has eliminated the need for individual approvals under Section 19(b) of the Securities Exchange Act of 1934.\nPrior to the new guidance, spot crypto fund issuers were subject to a lengthy application process that required public comment and SEC review, which is why most of the crypto ETFs that have launched to date covered bitcoin and ether, the two largest cryptocurrencies by market cap.\nThe streamlined approach is expected to shorten launch timelines, cut administrative costs, and and make more cryptocurrencies available to investors in an ETF wrapper. The new standards came with the approval of the first multi-crypto asset ETF in the U.S., the Grayscale Digital Large Cap Fund, or GLDC, which in addition to crypto and ether holds XRP, solana and cardano.2\nWhy This Matters to You\nInvestors will likely see a tidal wave of new crypto ETF launches starting in October, with all manner of digital assets that have never before landed in an investment vehicle. Think memecoin ETFs that hold doge and trump, and multi-crypto asset funds aimed at delivering on a theme like tokenization.\nThe main listing criteria for a crypto ETF will be the existence of a futures market for the underlying asset on a regulated exchange, such as Coinbase, for a period of at least six months, according to Bloomberg analyst James Seyffart.3 Crypto ETF offerings that fall outside the framework can still go through the traditional approval process via individual filings.\nThe latest changes are seen by the crypto industry as a step forward for continued regulatory clarity on crypto from the SEC and the Trump administration. They remove a boundary between firms seeking to put a range of crypto assets into a new product and investors who might be interested in such products.\nThe mass approval of pending crypto ETF applications had been predicted by Seyffart and other experts. \"We're gonna be off to the races in a matter of weeks,\" Seyffart posted on X following the SEC approval of the new framework.4\nRelated Education\nBitwise Chief Investment Officer Matt Hougan noted that there was a massive increase in ETF listings when generic listing standards were created for traditional ETFs in the past. \"The pace of ETF launches rose from ~117/year to ~370/year,\" he posted on X.5\nDigital assets platform and services provider Galaxy says 10 tokens currently meet the criteria for an expedited listing: Bitcoin, Dogecoin, Solana, Litecoin, Chainlink, Stellar, Avalanche, Shiba Inu, Polkadot and Hedera. (A dogecoin ETF launched today.) ADA and XRP will also qualify shortly, according to Galaxy.6 Several applications to launch ETFs holding those coins have already been submitted to the SEC.\nThe SEC approved spot bitcoin ETFs in Jan. 2024, more than 10 years after Tyler and Cameron Winklevoss first submitted an application for one. Ether ETFs were approved that July. Bitcoin ETFs have about $150 billion in assets under management, while ether ETFs have just under $30 billion."
            },
            {
                "title": "SEC Breakthrough Lets Grayscale Launch First Multi-Token ETF - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/articles/2025-09-18/sec-opens-path-for-first-multi-token-crypto-etf-to-start-trading",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "160.7800",
            "open": "4,500.2700",
            "close": "4,604.8700",
            "high": "4,646.2700",
            "low": "4,485.4900"
        },
        "market_summary": "The SEC has approved Grayscale's multi-asset crypto ETP, which includes ETH, marking a significant regulatory shift and streamlining the process for future crypto investment products. This approval, coupled with Grayscale's preparations to stake its massive ETH holdings, indicates growing institutional acceptance and a potential new wave of demand. The developments point to easier access for traditional investors and a more mature market framework for digital assets.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "SEC Approves First Multi-Asset Crypto ETP, Includes Bitcoin and Ethereum - CoinMarketCap",
                "source": "CoinMarketCap",
                "url": "https://coinmarketcap.com/academy/article/sec-approves-first-multi-asset-crypto-etp-bitcoin-ethereum",
                "body": "Grayscale Digital Large Cap Fund received SEC approval as America's first multi-asset cryptocurrency exchange-traded product (ETP). The fund offers exposure to five major digital assets: Bitcoin (BTC), Ethereum (ETH), XRP (XRP), Solana (SOL), and Cardano (ADA) through traditional market channels.\nThe approval utilizes new generic listing standards designed to accelerate crypto exchange-traded fund (ETF) reviews across Nasdaq, NYSE Arca, and Cboe BZX exchanges. This streamlined process eliminates individual application assessments, significantly speeding approval timelines for future products.\nCEO Peter Mintzberg announced the approval, thanking the SEC Crypto Task Force for regulatory clarity efforts.\nThe fund currently holds over $915 million in assets under management with a $57.7 net asset value per share. This substantial size demonstrates existing investor appetite for multi-asset cryptocurrency products within traditional investment frameworks.\nThe Future of Crypto ETFs\nThe SEC Crypto Task Force, established by acting Chair Mark Uyeda under Commissioner Hester Peirce's leadership, represents a significant shift from previous enforcement-heavy approaches. The task force focuses on developing clear regulatory frameworks rather than pursuing litigation strategies.\nBloomberg Senior ETF Analyst Eric Balchunas predicts over 100 crypto ETFs could launch within 12 months following generic listing standards implementation. Previous ETF category implementations showed tripling of product launches, suggesting massive expansion potential.\nThe approval coincides with growing expectations for altseason, where alternative cryptocurrencies outperform BTC. Coinbase predicted full-scale altcoin season beginning in September based on historical chart patterns and market conditions.\nChair Paul Atkins emphasized maximizing investor choice and fostering innovation through streamlined listing processes. The development reduces barriers to digital asset access within America's trusted capital markets, potentially attracting billions in new institutional investment.\nThis article contains links to third-party websites or other content for information purposes only (“Third-Party Sites”). The Third-Party Sites are not under the control of CoinMarketCap, and CoinMarketCap is not responsible for the content of any Third-Party Site, including without limitation any link contained in a Third-Party Site, or any changes or updates to a Third-Party Site. CoinMarketCap is providing these links to you only as a convenience, and the inclusion of any link does not imply endorsement, approval or recommendation by CoinMarketCap of the site or any association with its operators. This article is intended to be used and must be used for informational purposes only. It is important to do your own research and analysis before making any material decisions related to any of the products or services described. This article is not intended as, and shall not be construed as, financial advice. The views and opinions expressed in this article are the author’s [company’s] own and do not necessarily reflect those of CoinMarketCap."
            },
            {
                "title": "Grayscale’s Crypto Large Cap Fund, Including BTC, ETH, XRP, ADA, Gets SEC Approval - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/grayscale-crypto-large-cap-fund-101156032.html",
                "body": "Crypto asset manager Grayscale secured a major victory as the US Securities and Exchange Commission (SEC) approved the crypto large-cap fund (GDLC). This fund will hold the top five digital assets by market cap, such as Bitcoin , Ethereum , XRP , Solana , and Cardano , and shall debut soon on the New York Stock Exchange (NYSE).\nGrayscale’s Crypto Large Cap Fund Makes Way to NYSE\nFollowing the latest SEC approval, the Grayscale GDLC fund will start trading on NYSE Arca. The launch of this fund on Wall Street can lead to strong institutional interest. Speaking on the development, Grayscale CEO Peter Mintberg said:\n“Grayscale Digital Large Cap Fund $GDLC was just approved for trading along with the Generic Listing Standards. The Grayscale team is working expeditiously to bring the *FIRST* multi crypto asset ETP to market with Bitcoin, Ethereum, XRP, Solana, and Cardano.”\nBitcoin accounts for more than 72% of the fund’s portfolio, followed by Ethereum at over 17%. XRP, Solana, and Cardano carry allocations of 5.62%, 4.03%, and 1%, respectively. Grayscale recently trimmed its BTC weighting to boost exposure to the other assets.\nETF specialist Nate Geraci credited Grayscale for paving the way for crypto ETFs through its legal challenge against the SEC. He added that the approval of the large-cap fund GDLC could open the gates for multi-asset crypto ETFs, from other asset managers.\nEarlier this year, in July, the US securities regulator postponed its decision on Grayscale’s proposal to convert the Digital Large Cap Fund (GDLC) from an over-the-counter product into an exchange-listed ETP on NYSE Arca, citing the need for additional review.\nWith the Generic Listing Standards now in place, the process is expected to be more streamlined. It potentially paves the way for additional crypto ETPs.\nGrayscale Pushes for Spot ETFs for LINK, AVAX, ADA\nDigital asset manager Grayscale has been pushing to bring different crypto exchange-traded funds (ETFs). Its recent application targets some of the emerging crypto assets like Chainlink , Avalanche , and Cardano .\nGrayscale has filed a Form S-1 to convert its Chainlink Trust (LINK) into an exchange-traded fund, the Grayscale Chainlink Trust ETF, which is expected to trade on NYSE Arca under the ticker GLNK.\nRead original story Grayscale's Crypto Large Cap Fund, Including BTC, ETH, XRP, ADA, Gets SEC Approval by Bhushan Akolkar at Coinspeaker.com"
            },
            {
                "title": "Grayscale prepares to stake Ether holdings amid shifting SEC stance — Arkham - Cointelegraph",
                "source": "Cointelegraph",
                "url": "https://cointelegraph.com/news/grayscale-prepares-stake-ether-holdings-sec-arkham",
                "body": "Cryptocurrency asset manager Grayscale is preparing to stake part of its massive Ether holdings, a move that could signal confidence that US regulators will soon permit staking within exchange-traded products.\nOnchain data from Arkham Intelligence showed Grayscale transferred more than 40,000 Ether (ETH) on Thursday, activity consistent with positioning for staking rewards. Arkham noted that if confirmed, Grayscale would be the first US Ethereum ETF sponsor to stake its holdings.\nGrayscale’s Ethereum Trust (ETHE) manages more than 1.06 million ETH, valued at over $4.8 billion. The firm launched ETHE in 2017 as a private placement vehicle, and in 2024 rolled out the lower-cost Ethereum Mini Trust (ETH) through a partial spin-off of ETHE’s assets.\nThe development follows the US Securities and Exchange Commission’s (SEC) decision this year to delay rulings on whether Grayscale funds could incorporate ETH staking. Since then, the regualtor has provided additional clarity, indicating that some forms of liquid staking may not fall under its jurisdiction — opening the door to potential adoption by regulated funds.\nAlthough Grayscale has filed proposals to enable staking, the SEC has yet to approve them — indicating the company may be positioning ahead of a ruling. No existing spot Ether ETFs include staking features.\nThe Arkham-tracked transfer came a day after the SEC approved the Grayscale Digital Large Cap Fund — a multi-asset crypto ETP offering exposure to Bitcoin (BTC), Ether, XRP (XRP), Solana (SOL) and Cardano (ADA). The product allows investors to gain diversified crypto exposure without directly purchasing individual tokens.\nRelated: Ethereum unstaking queue goes ‘parabolic’: What does it mean for price?\nETH staking ETF could be a market game-changer, analysts say\nAnalysts have long argued that approval of staking within US spot Ether ETFs could spark a new wave of institutional demand, allowing investors to earn rewards rather than simply hold the asset passively.\n10x Research head Markus Thielen told Cointelegraph in July that staking for Ethereum ETFs could “dramatically reshape the market.”\nThe discussion comes as demand for Ether accelerates. Spot ETF inflows have surged this year, while the amount of ETH held on exchanges fell to a three-year low in early September — a decline attributed to corporate treasuries and ETFs absorbing supply.\nMagazine: Meet the Ethereum and Polkadot co-founder who wasn’t in Time Magazine"
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "17.4600",
            "open": "237.8898",
            "close": "248.2400",
            "high": "253.3900",
            "low": "235.9300"
        },
        "market_summary": "The Solana ecosystem is experiencing significant institutional and developmental momentum. Major investment firms like Galaxy Digital and public companies like DeFi Development Corp are making substantial multi-million dollar purchases of SOL, increasing its institutional holdings and treasury exposure. Concurrently, infrastructure development is advancing, with projects like Zeus Network creating bridges to bring Bitcoin's liquidity and security into Solana's high-speed DeFi ecosystem, unlocking new use cases and driving record levels of BTC on the network.\n\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Zeus Network Builds The Bridge: Connecting Bitcoin And Solana Ecosystems — Here’s How - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/news/feed/17eea-bitcoin-and-solana-connection",
                "body": "Zeus Network Builds The Bridge: Connecting Bitcoin And Solana Ecosystems — Here’s How\nZeus Network is positioning itself at the heart of cross-chain innovation by linking Bitcoin’s unmatched security with Solana’s high-speed infrastructure. If successful, Zeus Network could become a cornerstone of cross-chain adoption, reshaping how value flows between blockchains in the ecosystem.\nUnlocking New Use Cases For Bitcoin In Solana DeFi\nZeus Network is stepping into the spotlight as the project is designed to connect Bitcoin and Solana into one seamless ecosystem, the two most powerful blockchains in the crypto space. SkyeOps, in a post on X, has highlighted the core of Zeus Network’s technology, a decentralized permissionless communication layer that enables interaction between BTC and SOL. This innovative architecture is referred to as Layer 1.5, a hybrid model that leverages BTC security while tapping into SOL performance.\nSkyeOps identifies APOLLO as one of Zeus Network’s flagship products, a decentralized Bitcoin-paged token zBTC, an application that enables operations natively on the Solana blockchain. According to the analyst, this is a revolutionary step because it allows Bitcoin holders to participate and earn yield in Solana’s vibrant DeFi ecosystem without having to surrender custody of their BTC to a centralized third party.\nFurthermore, the network utilizes a novel architecture combining ZeusNode and the Zeus Program Library (ZPL) to facilitate secure cross-chain interactions. The Zeusnode serves as the backbone of the network, with a decentralized system of Guardians who validate and sign cross-chain transactions. Meanwhile, Zeus Program Library (ZPL) provides the essential tools that empower developers to build new applications and services that leverage BTC functionality directly on Solana.\nBitcoin Liquidity On Solana Hits An All-Time High\nThe founder of Sensei Holdings and Namaste group, Solana Sensei, has also pointed out a major milestone, celebrating the fact that the supply of BTC on the Solana network has hit a new all-time high, surpassing $1 billion for the first time.\nAccording to Solana Sensei, bringing the digital gold onto Solana’s high-performance blockchain enables BTC to gain the speed, low fees, composability, and deep liquidity of the most performant L1 in all cryptocurrencies. As a result, Bitcoin can operate at internet scale, enabling instantaneous trading, use as collateral in lending markets, seamless settlement in DeFi applications, and integration with real-world assets.\nThis connection will create a perfect dynamic. Solana supercharges BTC utility, while BTC lends SOL the ultimate credibility and security as the backbone store of value. “Together, they are turning the vision of Web3 into a true global financial layer. My two favorite cryptos are winning,” Solana Sensei noted.\nZeus Network Builds The Bridge: Connecting Bitcoin And Solana Ecosystems — Here’s How\nZeus Network is positioning itself at the heart of cross-chain innovation by linking Bitcoin’s unmatched security with Solana’s high-speed infrastructure. If successful, Zeus Network could become a cornerstone of cross-chain adoption, reshaping how value flows between blockchains in the ecosystem.\nUnlocking New Use Cases For Bitcoin In Solana DeFi\nZeus Network is stepping into the spotlight as the project is designed to connect Bitcoin and Solana into one seamless ecosystem, the two most powerful blockchains in the crypto space. SkyeOps, in a post on X, has highlighted the core of Zeus Network’s technology, a decentralized permissionless communication layer that enables interaction between BTC and SOL. This innovative architecture is referred to as Layer 1.5, a hybrid model that leverages BTC security while tapping into SOL performance.\nSkyeOps identifies APOLLO as one of Zeus Network’s flagship products, a decentralized Bitcoin-paged token zBTC, an application that enables operations natively on the Solana blockchain. According to the"
            },
            {
                "title": "Galaxy Digital Buys $306M in SOL, But Bigger Whales Eye a Hidden DeFi Gem Targeting $2 - BlockchainReporter",
                "source": "BlockchainReporter",
                "url": "https://blockchainreporter.net/galaxy-digital-buys-306m-in-sol-but-bigger-whales-eye-a-hidden-defi-gem-targeting-2/",
                "body": "Galaxy Digital’s $306 million purchase of Solana (SOL) has once again reminded the market that institutions are willing to place large bets on established cryptocurrencies. It demonstrates the trust that big capital has in major assets. But while headlines focus on these giant moves, larger whales often look in another direction for asymmetric upside. Their strategy is diversification into smaller-cap projects with strong mechanics, and this is why Mutuum Finance (MUTM) is quietly becoming a top target. With analysts projecting $2 per token, whales recognize the opportunity for exponential gains compared to the modest upside of major caps like SOL.\nGalaxy Digital Buys $306M in SOL\nGalaxy Digital, a leading digital asset investment firm, purchased $306 million worth of Solana (SOL) in a single day on September 14, 2025, acquiring 1.2 million SOL tokens from exchanges like Binance and Coinbase before transferring them to Fireblocks for custody. This move extends a buying spree that began midweek, totaling over $1.55 billion in SOL acquisitions across 6.5 million tokens in five days.\nThe activity coincides with Galaxy’s partnership with Multicoin Capital and Jump Crypto for a crypto treasury venture, including a $1.65 billion private placement in Forward Industries, which is pivoting to become a major Solana treasury holder. SOL surged 2.3% to ~$200, with a 24-hour trading volume of $6.6 billion. Technical indicators show SOL breaking $188 resistance, with RSI at 66 and support at $185. Social media reflects excitement over institutional adoption, but macro pressures like U.S. tariffs pose risks. Analysts project a $225 target if $211 clears.\nMutuum Finance (MUTM): Why Whales Favor Utility-First Projects\nInstitutional investors and high-net-worth players do not chase trends. Instead, they prioritize risk-managed mechanics and utility that ensure demand will grow. Mutuum Finance (MUTM) has been designed from the ground up with exactly these priorities in mind.\nOne of the first advantages is its structured liquidation system. Mutuum Finance (MUTM)’s rules ensure that when loans fall below safety levels, collateral is liquidated in a liquidity-aware way. This protects the platform against shocks and keeps revenue flowing to the treasury. For whales, such built-in safety nets make MUTM a viable long-term crypto investment rather than a speculative gamble.\nThe protocol also introduces borrowing and deposit caps. By restricting collateral types and setting system-wide limits, the platform reduces systemic risks while keeping borrowing efficient. This makes it attractive for both retail and institutional users who want assurance that runaway activity cannot destabilize the ecosystem.\nReliable oracles further strengthen the protocol. By relying on Chainlink as a primary feed and supplementing with fallback references, MUTM ensures accurate valuations and minimizes manipulation risk. For whales managing large positions, this trust in data feeds is crucial.\nThis combination of liquidation rules, caps, and oracles sets MUTM apart from meme-driven assets and gives it the profile of a project that can sustain high levels of borrowing, lending, and user adoption over time. Investors looking at crypto charts can already see how tokens with utility-first structures tend to outperform those built only on hype.\nThe presale has become the proving ground of this growing attention. Mutuum Finance (MUTM) is now in Phase 6, with $15.90 million raised, more than 16,400 holders onboard, and 42% of tokens sold. The current entry price is $0.035, with Phase 7 coming soon at $0.040, representing a 15% increase. With whale wallets already beginning to accumulate, this window represents the last discounted stage before momentum accelerates. The project’s credibility is further strengthened by its CertiK audit, scoring 90 on Token Scan and 79 on Skynet, offering another layer of trust for serious investors wondering is crypto a good investment in today’s marke"
            },
            {
                "title": "Solana Treasury Play DeFi Development Buys $15M More Tokens - CoinMarketCap",
                "source": "CoinMarketCap",
                "url": "https://coinmarketcap.com/academy/article/solana-treasury-play-defi-development-buys-dollar15m-more-tokens",
                "body": "The acquisition increases the NASDAQ-listed company's SOL per share metric to 0.0816, equivalent to $19.44 per outstanding share.\nDeFi Development Corp purchased 62,745 SOL tokens for $15 million, expanding total holdings to 2,095,748 $SOL valued at approximately $499 million. The acquisition increases the NASDAQ-listed company's SOL per share metric to 0.0816, equivalent to $19.44 per outstanding share.\nThe\ncompany operates as the first public entity with a treasury strategy specifically designed to accumulate and compound\nSolana tokens. Current outstanding shares total 25,670,108, though this figure excludes pre-paid warrants from recent equity financing rounds.\nNewly acquired tokens will undergo long-term staking across various validators, including DeFi Development's proprietary Solana validator infrastructure. This dual approach generates native yield while supporting network decentralization and security through active participation.\nIncluding warrants from equity financing would adjust the total share count to approximately 31.5 million shares. Management expects the SOL per share metric will maintain levels above the pre-financing baseline of 0.0675 even after accounting for full warrant dilution impact.\nBeyond\ntreasury operations, the company runs validator infrastructure, generating\nstaking rewards and delegation fees from network participation. This operational revenue stream complements direct $SOL appreciation exposure for shareholders seeking blockchain ecosystem involvement.\nThe platform serves over 1 million annual web users across commercial real estate sectors through AI-powered data and software subscriptions. DeFi Development connects property owners, developers, and lenders managing billions in financing applications yearly.\nThe company's client base includes more than 10% of American banks alongside credit unions, REITs, debt funds, and government-sponsored enterprise lenders. Its SaaS offerings streamline the complex ecosystem surrounding multifamily and commercial property professional workflows.\nDeFi Development continues exploring innovative approaches to support Solana's expanding application layer development. The treasury strategy provides investors direct economic exposure to $SOL while actively participating in ecosystem growth through strategic\nDeFi opportunities and validator operations.\nThis article contains links to third-party websites or other content for information purposes only (“Third-Party Sites”). The Third-Party Sites are not under the control of CoinMarketCap, and CoinMarketCap is not responsible for the content of any Third-Party Site, including without limitation any link contained in a Third-Party Site, or any changes or updates to a Third-Party Site. CoinMarketCap is providing these links to you only as a convenience, and the inclusion of any link does not imply endorsement, approval or recommendation by CoinMarketCap of the site or any association with its operators. This article is intended to be used and must be used for informational purposes only. It is important to do your own research and analysis before making any material decisions related to any of the products or services described. This article is not intended as, and shall not be construed as, financial advice. The views and opinions expressed in this article are the author’s [company’s] own and do not necessarily reflect those of CoinMarketCap."
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "423.000",
            "open": "46,045.050",
            "close": "46,207.180",
            "high": "46,378.900",
            "low": "45,955.900"
        },
        "market_summary": "Dow Jones expands its energy data portfolio through the acquisition of Eco-Movement, a platform for EV charging station information, signaling strategic growth in its professional information business. This move aligns with the global expansion of the EV market. However, analysis of broader market conditions is limited as two of the provided articles are inaccessible.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Upgrade Points To Revenue Surprise And World Cup Gains For Nike - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/news/nike-stock-upgrade-revenue-recovery-world-cup-dow-jones/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #0fd20f3b-951c-11f0-90c4-539937ec9505"
            },
            {
                "title": "Dow Jones Acquires Eco-Movement - citybiz",
                "source": "citybiz",
                "url": "https://www.citybiz.co/article/747450/dow-jones-acquires-eco-movement/",
                "body": "Dow Jones today announced it has acquired Eco-Movement, a leading global platform for EV charging station data. Eco-Movement will operate as part of OPIS, Dow Jones’s growing energy business.\nHeadquartered in Utrecht, Netherlands, Eco-Movement is a leading charge point data platform. The company collects, optimizes and enriches EV charging station data, and has built an extensive data platform with public and semi-public EV charging points and their real-time availability. Its platform features almost 2 million connectors across more than 80 countries and adds to Dow Jones’s suite of energy products and services available to customers.\nEco-Movement joins Dow Jones at a time of strong growth for its professional information business, which includes an expansive portfolio of products and services across the risk, research and energy sectors. In its latest earnings report, Dow Jones Energy grew 11% over the prior fiscal year, increasing its segment revenue to $278 million and contributing to the company’s record revenues for the full year of $2.33 billion. Eco-Movement strengthens Dow Jones Energy with best-in-class data and analytics, enabling smarter decisions across the energy transition for retailers, fleets, charge point operators, utilities, and financial institutions. It builds on OPIS’s energy transition activity in carbon markets, clean fuels, solar, and hydrogen.\n“Eco-Movement is an incredible addition to our Dow Jones Energy portfolio at a time when we expect the EV market to grow globally. It’s a key element of giving our audience the proprietary data they need to make critical decisions,” said Almar Latour, CEO of Dow Jones and Publisher of The Wall Street Journal. “With this acquisition, our users can now see the entire spectrum of vehicle energy–from fossil fuels to electricity–around the world, and it’s all part of our strategy to enable customers to go deep on the topics they care about.”\nDow Jones was an early stage investor in Eco-Movement, participating in the company’s Series A funding in 2022. Since then, the company has experienced explosive growth, increasing revenue more than 200%.\n“Joining OPIS, part of Dow Jones, marks an exciting new chapter for Eco-Movement. As the leading charge point data platform, our mission has always been to provide EV charging location and pricing data services to empower the entire e-mobility ecosystem. By combining our industry-leading data platform with OPIS’s expertise and network, we can accelerate the transition to sustainable mobility and deliver even greater value to charge point operators, OEMs, navigation and map providers and analysts,” said Roderick van den Berg, Eco-Movement co-founder and CEO.\nThis is the latest in a series of strategic acquisitions and investments aimed at bolstering Dow Jones’s portfolio of specialized news, data, analysis and events for business professionals. Earlier this year, Dow Jones acquired Oxford Analytica and Dragonfly Intelligence to complement the Dow Jones Risk & Compliance product suite with proprietary geopolitical risk and security intelligence.\nAbout Dow Jones\nDow Jones is a global provider of news and business information, delivering content to consumers and organizations around the world across multiple formats, including print, digital, mobile and live events. Dow Jones has produced unrivaled quality content for more than 130 years and today has one of the world’s largest news-gathering operations globally. It is home to leading publications and products including the flagship Wall Street Journal, America’s largest newspaper by paid circulation; Barron’s, MarketWatch, Mansion Global, Financial News, Investor’s Business Daily, Factiva, Dow Jones Risk & Compliance, Dow Jones Newswires, OPIS and Chemical Market Analytics. Dow Jones is a division of News Corp (Nasdaq: NWS, NWSA; ASX: NWS, NWSLV).\nAbout Eco-Movement\nEco-Movement is a leading global platform for EV charge point location and pricing data. Customers of the platform i"
            },
            {
                "title": "Old Time Dow Theory Sees Clues to Stock Market Rally in FedEx Earnings - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/articles/2025-09-18/old-time-dow-theory-sees-clues-to-stock-market-rally-in-fedex-earnings",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "50.950",
            "open": "9,213.940",
            "close": "9,237.190",
            "high": "9,248.390",
            "low": "9,197.440"
        },
        "market_summary": "The UK100 (FTSE 100) showed muted reaction to the Bank of England's decision to hold rates, trading slightly higher. However, the outlook is clouded by persistent inflation concerns and a weakening domestic economic backdrop, described as 'anaemic', which is creating uncertainty around the future path of interest rate cuts. Economists are divided on the timing of future monetary policy easing.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "BOE Rate Path Clouded by Inflation and Budget Uncertainty - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/live-blog/2025-09-18/ftse-100-live-boe-rate-pound-gilts-usd-bonds-trump-uk-what-s-moving-uk-markets-right-now-markets-today",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            },
            {
                "title": "Next warns over UK’s ‘anaemic’ economy after tax raid — as it happened - The Times",
                "source": "The Times",
                "url": "https://www.thetimes.com/business-money/economics/article/live-latest-news-uk-companies-ftse-100-shares-nrw70dqfq",
                "body": "Key moments\nUS stocks still rising on Fed’s rate cut\nUS markets opened higher, still buoyant after the US Fed cut rates yesterday. The S&P 500 was up 27.25 points, or 0.41 per cent, at 6,627.6, the Dow Jones industrial was up 10.44 points, or 0.02 per cent, at 46,028.76 and the Nasdaq Composite was up 170.59 points, or 0.77 per cent, at 22,431.92.\nIntel’s shares were up 23.65 per cent to $30.79 after the news that Nvidia is going to take a $5 billion stake in the company, while Nvidia’s shares were up 2.94 per cent to $175.3.\nMarkets steady after Bank’s rates decision\nBoth the FTSE 100 and the more domestically-focused FTSE 250 remained largely unmoved by the Bank’s well-trailed decision to hold rates. The FTSE 100 was up 14.6 points, or 0.16 per cent, at 9,222.97 while the FTSE 250 was up 48.51 points, or 0.22 per cent, at 21,668.32.\nThe pound slipped against the dollar, falling 0.28 per cent to $1.36.\nEx-IoD boss disqualified for suspected Covid loan abuse\nA former director of the Institute of Directors, who was last year shortlisted for a prestigious businesswoman of the year award, has been disqualified as a company director until 2036 for suspected Covid loan abuse, the Insolvency Service said.\nAnna Daroy, who was interim chief operating officer and later interim director general of the Institute of Directors from October 2018 to November 2019, was banned as a director for 11 years earlier this month.\nDaroy, 61, secured two maximum-value £50,000 Bounce Back Loans (BBLs) from separate banks for her management consultancy Globepoint Associates six months after leaving her role at the IoD. The rules of the scheme meant that companies were only entitled to one loan.\nInterest rate cuts? Soon but not yet\nThe decision by the Bank to hold the base rate at 4 per cent was widely expected, but economists are divided over when they will next be cut.\nYael Selfin, at KPMG UK: “The labour market has continued to cool, but evidence of deterioration has become less apparent, weakening the case for further policy easing. Meanwhile, inflation is set to rise further in the near term. The less favourable backdrop has seen the odds shift against further interest rate cuts this year. But we expect a small majority on the MPC to vote for a cut in November, leaving interest rates at 3.75 per cent by the end of 2025.”\nJanet Mui, at RBC Brewin Dolphin: “Unlike the Fed, which has shifted focus on the labour market, the Bank of England (BoE) does not have the luxury to ease policy in the face of a weakening economy. Even as the UK economy cools, inflation is not backing down as hoped, which leaves the BoE stuck. Ongoing tight monetary conditions may risk deeper economic weakness in 2026 and beyond, which could eventually curb inflation and justify rate cuts, but not yet.”\nPaul Dales, Capital Economics: “We continue to think the Bank won’t cut rates again until February. The repetition of the phrase that ‘a gradual and careful’ approach to rate cuts is appropriate suggests the Bank still thinks interest rates will fall further. But our sense is that the Bank decides it’s safer to slow the pace of rate cuts from 25bps per quarter by keeping rates on hold at the next two meetings (November and December).”\nEd Monk, Fidelity International: “The gilt market is indicating that no further rate cuts are likely this year, with the MPC meeting in March 2026 currently looking most likely to bring the next reduction. That was not part of the plan for households who have been hanging on under the pressure of higher borrowing costs. The Treasury would like monetary policy to be aiding its push for growth but the reality is that it is likely to remain restrictive for some time to come.”\nNvidia takes $5 billion stake in rival Intel\nNvidia has announced it will invest $5 billion in troubled rival US chipmaker Intel, in which the US government recently took a stake.\nThe deal includes a plan for Intel and Nvidia to jointly develop PC and data centre chips, representing "
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "329.700",
            "open": "23,434.390",
            "close": "23,685.790",
            "high": "23,722.490",
            "low": "23,392.790"
        },
        "market_summary": "The GER40 (DAX) experienced its strongest performance in over six weeks, rising 1.35% as traders reacted positively to the U.S. Federal Reserve's decision to cut interest rates and signal further cuts ahead. The rally was broad-based, with significant gains in tech, retail, and pharmaceutical stocks, led by strong corporate performers like SAP and Zalando. While the Bank of England held rates steady, market participants also monitored commentary from ECB officials for future guidance.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "DAX Enjoys Best Day in Over 6 Weeks - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/te_news:486385:0-dax-enjoys-best-day-in-over-6-weeks/",
                "body": "DAX Enjoys Best Day in Over 6 Weeks\nThe DAX in Frankfurt rose about 1.35% up at 23,671 on Thursday, notching its biggest daily gain since August 4 and outperforming its regional peers.\nTraders cheered the Federal Reserve's decision to lower interest rates by 25 basis points, and the hint that two more cuts are likely by the end of the year.\nToday, the Bank of England left interest rates unchanged, as anticipated, while investors eyed remarks from ECB President Lagarde and Executive Board members Guindos and Schnabel.\nOn the corporate front, tech stocks, retailers and pharma companies were the top gainers.\nSAP was the standout performer, adding 5.4%, while Infineon Technologies rose 3.2%.\nZalando surged 5.3% after announcing that major shareholder and supervisory board member Anders Holch Povlsen had purchased shares worth over €6 million."
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "318.750",
            "open": "24,259.010",
            "close": "24,472.430",
            "high": "24,572.510",
            "low": "24,253.760"
        },
        "market_summary": "All three major indices, including the Nasdaq 100 proxy Nasdaq Composite, hit record closing highs driven by a surge in technology stocks. The rally was fueled by Nvidia's significant $5 billion investment in Intel and a positive market reaction to the Federal Reserve's recent interest rate cut. While there are underlying concerns about inflation and labor market stress, the immediate momentum is strong, particularly for risk assets and small-caps.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Stock market today: Dow, S&P 500, Nasdaq hit records as rate-cut relief, Nvidia's Intel bet lift markets - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-hit-records-as-rate-cut-relief-nvidias-intel-bet-lift-markets-200041899.html",
                "body": "Stock market today: Dow, S&P 500, Nasdaq hit records as rate-cut relief, Nvidia's Intel bet lift markets\nUS stocks notched fresh records on Thursday after the Federal Reserve returned to easing interest rates and signaled further cuts are coming. The Nasdaq Composite (^IXIC) led the gains as Nvidia's (NVDA) $5 billion bet on Intel (INTC) boosted spirits.\nThe Nasdaq jumped about 0.9%, while the S&P 500 (^GSPC) added 0.5%. The Dow Jones Industrial Average (^DJI), which includes fewer tech stocks, moved up 0.3%.\nAll three major averages clinched record closes. The small-cap index Russell 2000 (^RUT) also climbed more than 2% to notch a new all-time high close.\n(^GSPC)\nShares in Intel surged 23% as investors welcomed Nvidia's $5 billion investment in the struggling US chipmaker.\nMore broadly, markets are shaking off initial hesitation that dragged on stocks after the Fed reduced rates by a quarter percentage point on Wednesday. While the Fed's \"dot plot\" signaled that two more cuts are likely in 2025, Fed Chair Jerome Powell's comment that high inflation and a weak labor market leave \"no risk-free path\" dented confidence.\nWeekly jobless claims figures out on Thursday showed further signs of labor market stress. On the upside, the number of Americans filing for unemployment dropped, after surging the previous week. But hiring all but stalled as demand for and supply of workers slowed.\nOn the corporate front, FedEx (FDX) will report its quarterly results after the bell. Analysts expect the delivery giant's profit to take a hit from President Trump's decision to end the \"de minimus\" tariff exemption for low-value direct-to-consumer packages from China and Hong Kong.\nRead more: The latest on Trump's tariffs\nTrump is on a state visit to the UK, where he dined with tech and finance executives at Windsor Castle.\nInvestor focus now turns to a highly anticipated call between Trump and Chinese President Xi Jinping slated for Friday. Trump described a deal over TikTok as all but completed and added that he is looking to make progress on broader issues like tariffs.\nLIVE COVERAGE IS OVER 19 updates"
            },
            {
                "title": "Markets News, Sep. 18, 2025: S&P 500, Dow, Nasdaq Hit Record Highs as Tech Stocks Surge; Intel Jumps as Nvidia to Invest $5 Billion - Investopedia",
                "source": "Investopedia",
                "url": "https://www.investopedia.com/dow-jones-today-09182025-11812492",
                "body": "Major indexes posted all-time closing highs Thursday as technology stocks surged following news that Nvidia will invest in embattled chipmaker Intel.\nThe Dow Jones Industrial Average, the benchmark S&P 500, and the tech-heavy Nasdaq advanced 0.3%, 0.5%, and 0.9%, respectively, a day after the indexes ended mixed as investors assessed the Federal Reserve's decision to cut its benchmark interest rate by a quarter percentage point. The small-cap Russell 2000 index recorded its first record close since November 2021 on Thursday.\nThe 10-year Treasury yield, which affects borrowing costs on a variety of consumer and commercial loans, was at 4.11%, up from 4.09% at Wednesday's close.\nGold futures were 1% lower at around $3,680 an ounce at 4 p.m. ET. West Texas Intermediate futures, the U.S. crude oil benchmark, were down 0.6% at roughly $63.70 a barrel. Bitcoin rose about 1.5% to roughly $117,500. The U.S. dollar index, which tracks the value of the greenback against a basket of foreign currencies, rose 0.5% to 97.37 after hitting its lowest level since early 2022 yesterday.\nIntel (INTC) shares soared nearly 23%, pacing the S&P 500 and Nasdaq, after Nvidia (NVDA) said it would invest $5 billion into its struggling rival chipmaker to co-develop data centers and PC products. Nvidia stock gained 3.5% and was one of the top performers in the Dow.\nAlso in corporate news, cybersecurity firm Netskope shares ended 18% higher in their Nasdaq debut, while StubHub (STUB) stock fell a further 7% after dropping more than 6% in their debut yesterday.\nBiggest S&P 500 Movers on Thursday\nAdvancers\n- Nvidia (NVDA) said it would invest $5 billion in semiconductor industry peer Intel (INTC) and that the two companies will collaborate on cutting-edge chips for computers and data centers. The vote of confidence from Nvidia came just a few weeks after Intel agreed to a deal giving the U.S. government a 10% stake in the company. Intel shares skyrocketed 23% on Thursday, outpacing all other stocks in the S&P 500, while Nvidia stock was up 3.5%.\n- Shares of Intel partner Synopsys (SNPS), a provider of electronic design automation software used in the chipmaking process, jumped 13%. The potential for increased demand from a major customer helped Synopsys stock regain some ground after a major move lower last week, when the company reported lower-than-expected revenue and adjusted profit results and slashed its full-year outlook.\n- CrowdStrike (CRWD) shares surged 13% after the cybersecurity firm offered an improved outlook for annual recurring revenue. In the summer of 2024, CrowdStrike stock plunged and sales growth came under pressure in the wake of a widespread technology outage tied to a faulty software update, but the company has staged a recovery over the past year.\nDecliners\n- The steepest decline in the S&P 500 on Thursday belonged to shares of financial data and software provider FactSet Research Systems (FDS), which tumbled more than 10%. The company's quarterly adjusted earnings per share and profit forecast for fiscal 2026 came in below consensus estimates. Increased technology expenses weighed on FactSet's adjusted operating margin, which slipped year-over-year.\n- Darden Restaurants (DRI) also reported lower-than-expected quarterly profits, and its shares lost 7.7%. While same-store sales growth from its Olive Garden and LongHorn Steakhouse helped Darden match revenue estimates, the company reported declines in its fine-dining business. The company cautioned that high food and labor costs could weigh on future earnings as it aims to maintain lower prices.\n- Nucor (NUE) shares fell 6% after the steelmaker provided lower-than-expected profit guidance for the third quarter. The company pointed to pressure in all its key segments, with volume declines affecting its steel mills, increased cost per ton weighing on its steel products business, and profitability issues with scrap operations dragging on the raw materials segment.\nA Wave of Crypto ETFs Are "
            },
            {
                "title": "Stock Market News From Sept. 18, 2025: Dow, S&P 500, Nasdaq Hit New Highs - Barron's",
                "source": "Barron's",
                "url": "https://www.barrons.com/livecoverage/stock-market-news-today-091825",
                "body": "CONCLUDED\nStock Market News From Sept. 18, 2025: Dow, S&P 500, Nasdaq Hit New Highs\nRiskier stocks, momentum, and small-caps led the charge Thursday.\nLast Updated:\nSep. 18, 2025 at 5:32 PM ET\nKey Events\n9 hours ago\n9 hours ago\n10 hours ago\n10 hours ago\n11 hours ago\n11 hours ago\n15 hours ago\nPinned Post\n9 hours ago\nThe stock market was back to its record-setting ways on Thursday as Wall Street digested the latest economic data in the wake of yesterday’s interest-rate cut.\nThe Dow Jones Industrial Average rose 124 points, or 0.3%. The S&P 500 was up 0.5%. The Nasdaq Composite was up 0.9%. All three set fresh record closing highs. The Russell 2000 also set an intraday record and was on track for its first closing high since 2021.\nThe yield on the 2-year Treasury note rose to 3.57%. The 10-year yield was up to 4.1%.\n“Crypto, stocks and risk assets in general are experiencing a nice, delayed reaction to yesterday’s 25bps cut,” writes Mizuho’s Daniel O’Regan “As expected, Small caps are outperforming their large cap peers given their Balance Sheet sensitivity.”\nIndeed, the top trades on the day included risk, small-caps, and momentum, while bond yields ticked higher after falling in the lead up to this week’s quarter-point cut. Consumer staples was among the few laggards.\nYardeni Research’s Ed Yardeni notes initial jobless claims on Thursday also retreated from the prior week’s spike and the Conference Board’s Index of Coincident Economic Indicators also rose 0.2% in August from July.\n“So far, the average of two of the regional business surveys conducted by five of the Fed's regional banks remained in expansion territory during August, suggesting that the national ISM manufacturing purchasing managers index should be doing the same soon,” Yardeni writes. “This morning's financial market action suggests that the latest batch of data is showing economic strength that might once again convince Fed officials that there is no rush to lower the FFR again.”"
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "55.410",
            "open": "6,607.240",
            "close": "6,640.650",
            "high": "6,661.650",
            "low": "6,606.240"
        },
        "market_summary": "The provided articles are unrelated to the SPX500 or financial markets. They cover a theatrical séance event in Los Angeles, an obituary for an individual in Utah, and a roster move by the Jacksonville Jaguars NFL team. There is no information presented regarding stock performance, economic data, or market-moving events.\nSENTIMENT: Neutral\n\n**Overall Market Sentiment:** Neutral",
        "source_articles": [
            {
                "title": "Inside the chilling séance that keeps selling out at L.A.’s Heritage Square - Los Angeles Times",
                "source": "Los Angeles Times",
                "url": "https://www.latimes.com/travel/story/2025-09-18/phasmagorica-heritage-square-seance",
                "body": "- Share via\n- “Phasmagorica” is what its creator describes as “a séance reimagined as art.”\n- The event, staged in a tent inside a home at the Heritage Square Museum, attempts to conjure the feel of a séance in late 1880s America.\nI am sitting in a tent placed inside the parlor of a Victorian-era house. Before me lies a spirit board, a lone tarot card and a black scrying mirror. I am here to commune with the dead.\nThere is no medium. It is only myself and eight other attendees— our guide has left the tent. Though earlier we could hear tension-rattling music setting a cryptic mood, now there is nothing. Lights? Off. The tent has gone pitch black. At this particular moment, there’s only the sound of our breaths, our thoughts and perhaps some new guests.\nWelcome to “Phasmagorica,” what composer-turned-magician-turned-spiritual explorer BC Smith describes as “a séance reimagined as art.” It’s running this month at the Heritage Square Museum, itself a location imbued with history and mystery, the site of the homes of Los Angeles as they existed a century ago.\nI’ll get right to the point: I did not have an encounter with the dead. And yet I left “Phasmagorica” deeply curious. That’s because Smith sets up the evening as an exploration of the modern Western history of communing with the deceased, attempting to conjure the feeling of a séance as it occurred in late 1880s America, albeit with a better sound system and all the Death in the Afternoon cocktails you can consume (note: you should not consume very many).\nThe “experiment” — Smith shirks at the word performance — is designed, he says, for believers and nonbelievers. He himself falls somewhere in the middle.\n“I’m a hopeful skeptic,” Smith says. “If I were a 100% believer, ‘Phasmagorica’ would be a church. I just wanted to create a space that started a conversation for people.”\n“The Cortège,” running this September at the Los Angeles Equestrian Center, revives an ancient art — the procession — turning it into a communal release of grief.\nIt is relevant to point out that Smith is also a magician, a member of the Magic Castle, home itself to a popular séance. While Smith has not conducted a Magic Castle séance, he has — and will — orchestrate what he refers to as a “theatrical séance,” for which he is present as a storyteller. “Phasmagorica” is different, Smith says, and was born out of those more dramatic performances, in part because he kept encountering the unaccountable.\n“It’s highly curated,” Smith says of a core difference between a theatrical séance and “Phasmagorica,” as the former will be tailored specifically to guest needs and requests. “But people were experiencing a lot in those séances that I could not explain,” Smith says. He recites a story that opens “Phasmagorica” of a shadow reaching out and touching someone on a shoulder. Smith says he witnessed this phenomena, and at that point decided to create an event that focused on realism and dispensed with the notion that there could be any illusions or magic.\nI was surprised, for instance, when Smith left the room. At that point, we were with only a television, which narrates a short history of séances in America before instructing us to hold a pendulum over a spirit board. Knowing Smith’s past, I went in expecting more of a show. Instead, we are prodded to examine a tarot card, peer into the scrying mirror and ask questions to our spirit board.\n“It becomes more personal,” Smith says. “Even in my theatrical séances, I’ve had people want to cut me off mid-sentence and say, ‘This just happened to me.’ And they want to spend the next five minutes talking about it. At the end of the day, I think what people like is that this is all about them.”\nAnd still, Smith says, audiences are looking for wizardry. But there’s no tricks of the light, no hidden fans. He stresses multiple times in this interview and at the start of “Phasmagorica” that this is “not theater, not a performance, not a show.”\n“I’ve had people walk out of the r"
            },
            {
                "title": "Benjamin S. Love Obituary September 14, 2025 - Lindquist Mortuary",
                "source": "Lindquist Mortuary",
                "url": "https://www.lindquistmortuary.com/obituaries/benjamin-love",
                "body": "A wonderful son, brother, husband, father, and friend, Benjamin S. Love passed away at home, in Layton, Utah, on September 14, 2025 from pancreatic cancer at the age of 51. He was born May 1, 1974, to Claudia Stromberg and Keith Love. Ben grew up in South Weber, Utah.\nAt a young age he started working at the farm of his grandparents, Ada and Glen Love. He loved farming and it became a lifelong passion. Ben loved farming with family and worked with his Grandpa Glen, his father, Keith, and uncle, Matt, during much of his life. His final eight years he farmed with his wife and children.\nAs a teenager, Ben worked for several years pouring footings and foundations with his uncle, George. Ben loved the outdoors and enjoyed fishing, hunting, hiking, and camping. He graduated from Clearfield High School in Utah in 1992. Three years later he began working at the place he would spend the rest of his career, Weber Basin Water.\nOn April 7, 2006, Ben married his sweetheart, Barbara Shepherd, in the Ogden Temple of the Church of Jesus Christ of Latter-day Saints. They were blessed to have Shanndice sealed to them and had three additional children, Beau, Ike, and Lydia.\nBen enjoyed serving at church as a Primary teacher. It was his favorite calling and the children loved him. He enjoyed making them laugh and getting the kids to think about the messages in the scriptures. Ben believed in Jesus Christ and tried to be like Him by loving and serving others. He loved his family and worked hard to provide for them. Ben will be greatly missed.\nBen is survived by his wife, Barbara; children Shanndice, Beau, Ike, and Lydia; his parents, Keith and Claudia Love; his brothers, Bart (Nancy) Love, Brett Love, Blake (Leigh) Love, sisters Camille (Lonnie) Schow, Amber (Lance) Boyce, Misty (Jolley) Rogers; brothers-in-law Rick (Paula) Shepherd, Mike (Erin) Shepherd, Clint (Brooke) Shepherd, Dave (Jen) Shepherd, Dan (Shannon) Shepherd and many nieces and nephews.\nFuneral services will be held Saturday, September 20, 2025 at 11:00 a.m. at the Eastridge Chapel, 3250 North 1050 East, Layton, Utah. Family and friends may visit Friday, September 19, from 6 to 8 p.m. and Saturday from 9:30 to 10:30 a.m. at the Eastridge Chapel.\nInterment, Lindquist's Memorial Park, 1867 North Fairfield Road, Layton, Utah.\nThe funeral will be live-streamed and may be viewed by scrolling to the bottom of Benjamin’s obituary page at www.lindquistmortuary.com\nServices entrusted to Lindquist’s Layton Mortuary, 1867 N. Fairfield Rd., Layton, Utah.\nEastridge Chapel\nEastridge Chapel\nEastridge Chapel\nVisits: 1443\nThis site is protected by reCAPTCHA and the\nGoogle Privacy Policy and Terms of Service apply.\nService map data © OpenStreetMap contributors"
            },
            {
                "title": "Roster Moves: Jaguars Sign S Kahlef Hailassie - Jaguars.com",
                "source": "Jaguars.com",
                "url": "https://www.jaguars.com/news/k000359-roster-moves-jaguars-sign-s-kahlef-hailassie",
                "body": "JACKSONVILLE – The Jacksonville Jaguars have signed S Kahlef Hailassie, the team announced today.\nHailassie was most recently on the Minnesota Vikings practice squad. He joined the Vikings this offseason after spending his first two NFL seasons with the Cleveland Browns (2023-24). With Cleveland, Hailassie played in 10 games (one start) and recorded six tackles (one for loss) and one pass defensed as well as two special teams tackles. He originally entered the NFL as an undrafted free agent with Kansas City in May of 2023 and spent the offseason with the Chiefs before being waived and joining the Browns.\nThe Elk Grove, Calif. native played collegiately at Western Kentucky University (2021-22) for two seasons after spending time at Independence Community College (2019-20) and the University of Oregon (2018). Hailassie earned All-Conference USA honors in both of his seasons as a Hilltopper and totaled 122 tackles (11 for loss), 19 passes defensed, four interceptions, 3.0 sacks, two forced fumbles and one fumble recovery in 26 games. He played all 13 games as a true freshman at Oregon in 2018."
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "1,135.000",
            "open": "44,854.330",
            "close": "45,838.620",
            "high": "45,939.330",
            "low": "44,804.330"
        },
        "market_summary": "The Bank of Japan's decision to hold rates steady was widely expected, but the announcement of ETF and REIT sales and a split vote was perceived as hawkish, causing the Nikkei 225 to reverse from a record high into losses. The yen firmed and Japanese government bond yields rose significantly in reaction. The market is now focused on Governor Ueda's press conference for further clarity on the central bank's policy trajectory.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Japan's Nikkei flips to losses, yen firms after BOJ decision - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/reuters.com,2025:newsml_L2N3V602M:0-japan-s-nikkei-flips-to-losses-yen-firms-after-boj-decision/",
                "body": "Japan's Nikkei flips to losses, yen firms after BOJ decision\n- Japan's central bank keeps policy steady, but in split vote\n- BOJ announces start of ETF, REIT sales\n- Nikkei falls from record high; JGB yields near 17-year peak\nBy Rocky Swift and Kevin Buckland\nJapan's Nikkei share average flipped to losses on Friday and the yen firmed after the Bank of Japan (BOJ) kept interest rates steady as expected, but in a split decision with two of the nine board members voting for a hike.\nThe central bank also announced it will begin selling its holdings of exchange-traded funds (ETFs) and real-estate investment trusts, amassed over a decade of massive stimulus.\nJapanese government bond futures sank, while the yield on 10-year sovereign debt jumped to a nearly 17-year peak.\n\"It came as a surprise,\" Hirofumi Suzuki, chief currency strategist at SMBC, said about the BOJ's decision.\n\"With the start of ETF sales and two dissenting votes against leaving policy unchanged, i.e., in favour of tightening, the outcome was hawkish despite expectations for a straightforward hold.\"\nThe focus now falls on BOJ Governor Kazuo Ueda's news conference at 0630 GMT.\nThe Nikkei 225 Index NI225 lost 1% to 44,800.40 as of 0410 GMT, not long after the central bank's announcement.\nEarlier, it rose as much as 1.2% to a record high of 45,852.75, driven by a surge in chip-sector stocks following an overnight rally in U.S. peers.\nThe 10-year JGB yield (JP10YTN=JBTC) added four basis points (bps) to 1.635%, just short of this month's high of 1.64%, a level not seen since July 2008.\nBenchmark 10-year JGB futures (2JGBv1) shed 0.4 yen to 136.16 yen.\nBond yields move inversely to prices.\nThe yen strengthened as much as 0.5% to 147.27 per dollar USDJPY, undoing part of the last two sessions' 1% drop."
            },
            {
                "title": "Yen rises, stocks fall after BOJ's policy announcement - Nikkei Asia",
                "source": "Nikkei Asia",
                "url": "https://asia.nikkei.com/business/markets/yen-rises-stocks-fall-after-boj-s-policy-announcement",
                "body": "TOKYO -- The Japanese yen rose on Friday following the Bank of Japan's widely expected decision to leave interest rates unchanged and after the U.S. Federal Reserve opted to cut rates.\nMarkets await Gov. Ueda's news conference for trading clues\nThe yield gap between U.S. Treasurys and Japanese government bonds has long been a weakening factor for the yen, but that trend could be easing. (Photo by Akira Kodaka)\nTOKYO -- The Japanese yen rose on Friday following the Bank of Japan's widely expected decision to leave interest rates unchanged and after the U.S. Federal Reserve opted to cut rates."
            },
            {
                "title": "Japan's Nikkei 225 hits record for second straight day as inflation cools; BOJ rate decision on deck - CNBC",
                "source": "CNBC",
                "url": "https://www.cnbc.com/2025/09/19/asia-pacific-markets-nikkei-225-kospi-bank-of-japan.html",
                "body": "Japan's benchmark Nikkei 225 index rose 1.19% to another fresh record high for a second consecutive day as the Bank of Japan kept its policy rate steady at 0.5%, in line with the forecast from a Reuters poll of economists.\nThe decision to hold comes as Japan's core inflation rate fell to its lowest since November 2024, coming in at 2.7% for August and marking a third straight month of decline.\nThe core inflation figure — which strips out prices of fresh food — was in line with the 2.7% expected by economists polled by Reuters. Headline inflation in the country also dropped to 2.7%, coming down from 3.1% in July and marking a fresh low since November 2024.\n\"The Bank of Japan's decision to hold rates steady underscores its cautious stance amid slowing inflation and global uncertainty – prioritizing stability over premature tightening,\" said Hiroaki Amemiya, investment director at Capital Group. \"By preserving policy optionality, the BoJ is signaling its readiness to respond to external volatility while continuing to assess the strength of Japan's economic recovery.\"\n\"The BoJ's strategy supports the early stages of a reflationary cycle, rather than reversing course,\" Amemiya added.\nYields on Japan's 2-year government bonds rose to 0.885%, marking the highest since June 2008, LSEG data showed.\nMeanwhile, the Topix added 0.84%.\nAustralia's ASX/S&P 200 climbed 0.77%. South Korea's Kospi and small-cap Kosdaq were flat at the open.\nHong Kong's Hang Seng Index slid 0.4%, while the mainland's CSI 300 added 0.13%. Zijin Gold, a subsidiary of China's largest gold miner Zijin Mining, is looking to raise about HK$25 billion ($3.2 billion) in a Hong Kong IPO, a company filing showed Friday.\nThe firm is offering almost 349 million shares at HK$71.59 apiece, with trading scheduled to start Sept. 29.\nIndia's Nifty 50 declined 0.55%. Adani's flagship Adani Enterprises jumped over 4% after India's market watchdog absolved Adani Group and its founder Gautam Adani of certain misconduct allegations made by Hindenburg Research.\nOvernight in the U.S., the major averages closed higher with smaller equities seeing the biggest boost, after the Federal Reserve signaled it was embarking on an easing rate path, reinvigorating investors and raising hopes for a ratcheting up of economic growth.\nThe S&P 500 closed up 0.48% at 6,631.96, while the Nasdaq Composite popped 0.94% to settle at 22,470.73. The Dow Jones Industrial Average added 124 points, or 0.27%, to close at 46,142.42.\nEach of the major U.S. indexes notched a fresh all-time intraday high on Thursday, just a day after stocks had a volatile trading session Wednesday in the wake of the Fed's rate cut.\n— CNBC's Pia Singh and Alex Harring contributed to this report."
            }
        ]
    }
]