[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "168.070",
            "open": "4,833.990",
            "close": "4,936.370",
            "high": "4,940.730",
            "low": "4,772.660"
        },
        "market_summary": "### Gold (XAU/USD) Market Briefing\n* **Key Drivers:** The price of gold has been influenced by various factors including inflation, the performance of other commodities, and geopolitical tensions. The **hawkish** stance of the Federal Reserve, indicated by their management of interest rates, continues to impact the dollar and consequently, gold prices.\n* **Price Action:** Gold prices have shown **bullish momentum**, reaching an all-time high of **$4,930** an ounce, as investors seek safe-haven assets amidst economic uncertainty.\n* **Technical Outlook:** Immediate support for gold is near the **$4,800** level, with resistance at the newly established all-time high of **$4,930**. The ability of gold to hold above **$4,800** indicates a strong **bullish** sentiment.\n\n--- \n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Paraíba tourmaline: the gemstone outpacing gold and inflation - Financial Times",
                "source": "Financial Times",
                "url": "https://www.ft.com/content/b650ec4d-e4c0-4d17-be9c-948096b9f839",
                "body": "Paraíba tourmaline: the gemstone outpacing gold and inflation\nRoula Khalaf, Editor of the FT, selects her favourite stories in this weekly newsletter.\nIt took squatters just three months to wreck the Mozambican mine that Kevin Ferreira’s uncle had spent a decade getting up and running. “Everything has been ruined,” says the 33-year-old gemologist. “They’ve completely destroyed the wash plant. We’ve lost two or three dump trucks, an excavator, two front-loaders.\n“It will take us until at least April or May this year before we’re operational, and even then we’ll probably only be running at about 30 per cent.”\nThe mine, which produces one of the rarest and most expensive gemstones on the planet — Paraíba tourmaline — was the target of a series of land invasions in late 2024 and again in late 2025.\nConcessions across Mozambique have been taken offline during civil unrest that has swept the country since disputed elections in October 2024. It has been a terrible setback for a sector still reeling from Covid lockdowns and the disruption they caused to global supply chains.\nAlthough they have now been removed, nearly 2,000 people had been illegally working the family’s diggings during the first — and largest — invasion in 2024. They had been drawn to the site in search of the neon blue mineral found only in northern Mozambique, Nigeria and Brazil.\nParaíba tourmaline has featured heavily in collections by luxury brands such as Bvlgari and Tiffany & Co since the pandemic. Demi Moore wore a $7.3mn Chopard necklace at 2024’s Cannes Film Festival that featured a giant, 34-carat Paraíba. The likes of Katy Perry, Rihanna, Beyoncé and Zendaya have all been seen wearing Paraíbas, with the latter photographed at the 2025 Golden Globes sporting a 31-carat pendant surrounded by diamonds.\nDemand for Paraíba tourmalines has soared, with prices “doubling or even tripling since lockdowns”, according to Ferreira, who works as a curator for luxury jewellers and wealthy individuals looking to buy premium Paraíbas. “People are willing to pay way more to secure a product given this limit on mining operations.”\nWith the family mine shut down, Ferreira’s uncle made the dramatic decision to buy back his own rough gemstones on the open market — for double the amount he was getting before the mine closure.\n“I watched my uncle pay $25,000, $50,000 per gramme for some special stones,” says Ferreira, who is based in the billionaires’ playground of West Palm Beach, Florida. “Our business model is we want to own the best quality Mozambique material in the world — even if it’s at a higher cost.\n“We had to buy it at that price because if we didn’t, somebody else would.\n“You can still get some stones for around $5,000 a carat, but they have low saturation colour, or they’re very green. With Paraíba, you want that fantastic, majestic, wonderful blue colour that everybody is looking for. Colour is going to dominate whether that stone goes up in value or not.”\nWhat happened to Paraíba production may be unique, but post-pandemic inflation, volatile stock markets and increased demand for tangible stores of value have pushed up the price of many commodities from gold to gemstones in recent years.\nColombian emeralds, for instance, have risen up to “two or three times” in price since the lockdowns, according to Alejandra Velasco, who runs the Cartagena-based Lucy Jewelry. The gemologist — whose customers range from British holidaymakers with $100 budgets to Jeff Bezos and his emerald-enthusiast wife Lauren Sánchez — says she now pays about $5,000 per carat for high-quality cut stones that cost $1,700 before the pandemic.\n“Over the past 10 years, the price of Colombian emeralds has increased by 60 per cent,” she says. “However, top quality stones have gone up by huge amounts. I have a client who came in recently with a piece she bought 15 years ago for $2,300; if that same person wanted to buy the same necklace new in the store today, it’s going to be over $10,000, and maybe "
            },
            {
                "title": "Inflation remains sticky but gold prices hold support above $4,800 - KITCO",
                "source": "KITCO",
                "url": "https://www.kitco.com/news/article/2026-01-22/inflation-remains-sticky-gold-prices-hold-support-above-4800",
                "body": "Neils Christensen\nNeils Christensen has a diploma in journalism from Lethbridge College and has more than a decade of reporting experience working for news organizations throughout Canada. His experiences include covering territorial and federal politics in Nunavut, Canada. He has worked exclusively within the financial sector since 2007, when he started with the Canadian Economic Press. Neils can be contacted at: 1 866 925 4826 ext. 1526 nchristensen at kitco.com @Neils_c"
            },
            {
                "title": "Markets News, Jan. 22, 2026: Stocks Finish Higher for 2nd Straight Day on Eased Greenland Tensions; Gold Sets Fresh All-Time High - Investopedia",
                "source": "Investopedia",
                "url": "https://www.investopedia.com/dow-jones-today-01222026-11890213",
                "body": "Major stock indexes closed sharply higher for a second straight session Thursday after President Donald Trump reduced tensions with European allies by backing off his threat of imposing new tariffs over Greenland.\nThe tech-heavy Nasdaq, blue-chip Dow, and benchmark S&P 500 finished up 0.9%, 0.6%, and 0.6%, respectively, with the Dow adding more than 300 points.\nThe indexes ended up about 1.2% apiece Wednesday—the day after their worst session since Oct. 10—after Trump ruled out military force in Greenland during a speech at the World Economic Forum in Davos, Switzerland, and later wrote on his Truth Social network he \"will not be imposing the Tariffs that were scheduled to go into effect on February 1st\" on eight NATO allies.\nThe delayed Personal Consumption Expenditures price index data came in as expected with a 0.2% month-over-month increase and a 2.8% year-over-year rise. The PCE is the Federal Reserve's favorite measure of inflation, and their next meeting is January 27-28. However, Thursday's report is likely to carry less weight than usual as officials decide whether to adjust the Fed's key interest rate, as the Bureau of Economic Analysis would normally release December data at this time in January.\nThe yield on the 10-year Treasury—which impacts interest rates on a variety of consumer loans including mortgages—was at 4.25% at 4 p.m. ET, little changed from Wednesday's closing level. On Tuesday, the yield hit its highest closing level since Aug. 21 at 4.30%.\nSafe-haven gold futures soared to their latest all-time high Thursday, reaching above $4,930 an ounce.\nBitcoin was trading around $89,500, down slightly on the day. The U.S. dollar index, which tracks the value of the greenback against a basket of global currencies, was 0.5% lower at 98.30. West Texas Intermediate crude futures, the U.S. benchmark, was down more than 2% to $59.35 a barrel.\nChipmaker Intel (INTC), whose shares soared nearly 12% Wednesday, reversed early losses and ticked 0.1% higher ahead of its quarterly results after the close today.\nAll of the Magnificent Seven tech firms' shares ended higher, with Meta Platforms (META) leading the way with a 5.7% advance.\nIn post-earnings moves, shares of Abbott Laboratories (ABT), McCormick (MKC), and GE Aerospace (GE) declined more than 10%, 8%, and 7%, respectively, while Procter & Gamble (PG) rose more than 2.5%.\nIntel Stock Sinks After Disappointing Outlook\nIntel wants to sell more products. Can it keep up?\nShares of the chipmaker slid in extended tradingThursday after Intel's (INTC) outlook missed analysts' projections. Executives in a statement warned that supplies could hit a low in the current quarter.\n\"We expect our available supply to be at its lowest level in Q1 before improving in Q2 and beyond,\" CFO David Zinsner said in an evening statement, as the company contends with industry-wide supply shortages.\nIntel has lately warned of supply issues, but investors reacted particularly strongly to the company's description of its effect on its near-term outlook—perhaps indicating valuation concerns given the shares' recent runup. The stock, which edged higher during the regular session, was recently off more than 12% in late action.\nIntel said it expects breakeven adjusted earnings in the first quarter on revenue of $11.7 billion to $12.7 billion, below analysts' projections as compiled by Visible Alpha.\nFor the fourth quarter, Intel reported adjusted earnings of 15 cents per share on revenue of $13.67 billion, above analysts' estimates.\nCEO Lip-Bu Tan said the results showed progress in the company's \"journey to build a new Intel,\" as it looks to \"capitalize on the vast opportunity AI presents across all of our businesses.\"\nShares of Intel had surged in the weeks leading up to the release. They were up nearly 50% for January so far through Thursday's close amid growing optimism about Intel's AI sales.\nTrump Sues JPMorgan, CEO Dimon for $5B\nPresident Donald Trump on Thursday sued JPMorgan Chase and CEO Jam"
            }
        ]
    },
    {
        "asset_name": "Silver",
        "symbol": "EIGHTCAP:XAGUSD",
        "status": "Success",
        "data": {
            "day_range": "5.802",
            "open": "92.992",
            "close": "96.082",
            "high": "96.586",
            "low": "90.784"
        },
        "market_summary": "### Silver (XAG/USD) Market Briefing\n\n* **Key Drivers:** Weaker **US dollar**, global political uncertainty, and expectations of **US Federal Reserve interest rate cuts** are driving **silver** prices higher, with a potential target of **$100** per ounce.\n* **Price Action:** Currently trading at **$97.01** per ounce, with a record high of **$97.44**, showing significant **bullish momentum**.\n* **Technical Outlook:** Immediate resistance is at **$100**, with support near the **50-day moving average**.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Why is silver price rising again, and will it go further record $97? Silver may touch $100 mark as preciou - The Economic Times",
                "source": "The Economic Times",
                "url": "https://economictimes.indiatimes.com/news/international/us/why-is-silver-price-rising-again-and-will-it-go-further-record-97-precious-metals-rally-continues-and-may-touch-100-mark-heres-what-should-investors-do-now/articleshow/127221454.cms?from=mdr",
                "body": "Listen to this article in summarized format\nWhy is silver price rising again and will it go further record $97? This question is shaping market discussion as silver trades near record levels. Silver is moving with gold and platinum as investors respond to global political developments, economic signals, and currency changes. Uncertainty around international relations has increased demand for metals. A weaker US dollar has also supported prices by improving overseas buying interest. At the same time, expectations of US Federal Reserve interest rate cuts are influencing investment decisions. Silver benefits from both investment demand and industrial use. Market watchers now closely track whether silver can move beyond $97 and approach the $100 level.\nWhy is silver price rising again and will it go further record $97? Metals hit fresh highs\nWhy is silver price rising again and will it go further record $97? Spot silver rose 0.9% to $97.01 per ounce. Prices earlier reached a record $97.44. Market participants now discuss a move toward $100 per ounce. Silver followed gold and platinum in the ongoing rally.\nSpot gold rose 0.5% to $4,961.57 per ounce. It earlier touched a record $4,966.59. US gold futures for February delivery gained 1.1% to $4,964.60. Platinum rose 1.4% to $2,665.85. It earlier hit $2,684.43. Palladium slipped 0.1% to $1,917.50.\nWhy is silver price rising again?\nWhy is silver price rising again and will it go further record $97? Silver prices are rising due to several factors. A weaker US dollar has reduced costs for overseas buyers. Global political uncertainty has increased demand for metals. Expectations of US Federal Reserve interest rate cuts have also supported silver. Silver benefits from investment demand and industrial use. Strong movement in gold and platinum prices has added support. These factors together have pushed silver prices to record levels.\nGlobal political developments support metal prices\nWhy is silver price rising again and will it go further record $97? Political developments added support. EU leaders met in Brussels after US President Donald Trump reversed his Greenland stance. Trump later said the US secured permanent access to Greenland through a NATO deal.\nNATO leadership said allies must strengthen Arctic security due to Russia and China. Denmark stated its sovereignty over Greenland remains unchanged. The lack of clear agreement details kept markets cautious. Investors often turn to metals during uncertainty.\nUS economy signals and dollar weakness influence silver\nWhy is silver price rising again and will it go further record $97? US consumer spending increased in October and November. The economy remains on track for another quarter of growth. The labor market remains stable with limited hiring and layoffs.\nThe dollar index dropped to a two-week low. This made dollar-priced metals cheaper for global buyers. A weaker dollar often supports silver demand in overseas markets.\nRate cut expectations raise silver demand\nWhy is silver price rising again and will it go further record $97? Markets expect the US Federal Reserve to cut rates twice later this year. Each cut is expected to be 25 basis points. Lower rates reduce returns on yield assets. This increases interest in metals such as silver.\nSilver benefits from both investment demand and industrial use. Market watchers now expect silver to test the $100 level if current conditions continue.\nUpcoming economic data to watch\nWhy is silver price rising again and will it go further record $97? Investors will monitor global data. This includes UK retail sales, France and Germany PMI data, EU business surveys, US PMI numbers, US consumer sentiment, and the Japan central bank rate decision.\nSilver may touch $100 mark\nWhy is silver price rising again and will it go further record $97? Market watchers now discuss the $100 level as a possible next target. Continued weakness in the dollar, steady investment demand, and expectations of US interest rat"
            },
            {
                "title": "What is the price of silver today? - CBS News",
                "source": "CBS News",
                "url": "https://www.cbsnews.com/news/what-is-the-price-of-silver-today/",
                "body": "What is the price of silver today?\nIn recent years, with inflation problematic and higher interest rates impacting investors of all types, many turned to gold for protection and portfolio diversification. And the yellow metal subsequently surged in price, surpassing numerous price records on its way toward the $5,000 per ounce mark. But another precious metal has quietly but impressively grown at the same time: silver.\nLong considered the cost-effective precious metal alternative to gold, the price of silver has surged recently and is now up by more than 200% from where it sat in January 2025. And that remarkable growth could easily continue in the weeks and months ahead, especially if certain economic conditions are met. This potential can be both daunting and encouraging for prospective investors – and advantageous for those who are already invested in the metal or considering adding more to their portfolio right now.\nTo better determine the value of investing in silver now, it helps to know where the price currently stands. So, what is the price of silver per ounce now? That's what we'll outline below (and explain why getting invested now could make the most sense).\nProtect your portfolio with gold and silver here now.\nWhat is the price of silver today?\nThe price of silver is $93.64 per ounce as of January 22, 2026, according to American Hartford Gold, a precious metals dealer. That's up from just $71, approximately, at the start of the month, and just $31 for the same amount of metal in January 2025. So the price growth here is unmistakable and, for investors who have been priced out of the gold market entirely, this could be the smart (and affordable) way to get invested in precious metals now.\nWaiting for the price to decline is generally not advisable. While silver prices can be more volatile than gold, over time, they tend to only increase, so waiting for a temporary drop in the price could be an expensive mistake worth avoiding.\nGet started with a silver investment today.\nWhy should you invest in silver now?\nWhile not identical, the benefits of silver investing are similar to those gold offers. Thanks to a consistent price, particularly during inflationary periods, silver can help your portfolio hedge against the corrosive impacts of inflation in a way that other assets cannot. Accordingly, it can help function as a critical diversifier for those whose portfolios are otherwise too heavily made up of stocks, bonds, real estate or other investment types.\nAnd while gold and silver aren't typically considered income-producing assets, a quick glance at the price chart for either over the past year illustrates that, right now at least, both may be able to be sold for a rapid profit. Still, with industrial demand for silver expected to remain powerful, waiting around to invest may not make sense, either. Instead, consider speaking with a financial advisor or precious metal company that can answer any questions you may have and help you determine the exact role silver can play in your portfolio now.\nThe bottom line\nThe price of silver per ounce currently sits just under $95 per ounce. That said, this is the price for the metal before any dealer mark-ups, which can easily cause the price to rise considerably higher. So, if you need the inflation hedge and portfolio diversification the metal represents and don't want to pay the exorbitant price you'd otherwise have to in order to secure the same benefits with gold, it could make sense to get started with the metal this month. Just be sure to keep silver as a critical but limited portion of your overall portfolio, typically capped at 10% or less, to avoid overcrowding your other assets at the same time."
            },
            {
                "title": "Why Silver Will Outperform Gold in 2026 - The Globe and Mail",
                "source": "The Globe and Mail",
                "url": "https://www.theglobeandmail.com/investing/markets/stocks/SLV-A/pressreleases/37176491/why-silver-will-outperform-gold-in-2026/",
                "body": "Key Points\nSilver is up strongly amid recent geopolitical tensions, but there are bigger reasons for it to continue soaring in 2026.\nA possible June catalyst, combined with soaring industrial demand, could send prices much higher from here.\nUnlike gold, silver supply can't be turned on like a tap, so restricted supply could bring even more price momentum.\nSilver's surge crushed gold's gains in 2025, returning 145% compared to gold's 64% rise. In the first weeks of 2026, it's continued this momentum, returning as much as 25% in two weeks while gold rose 6%. Yet there are three reasons to expect silver to continue outpacing gold for the rest of 2026 and perhaps beyond.\n1. Interest rates may continue to fall\nThe U.S. Federal Reserve cut interest rates three times in 2025, and traders are forecasting a more than 60% likelihood that the central bank will lower rates once more by June.\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now. Continue »\nLower interest rates boost precious metals' prices because they negate one of the main drawbacks of owning gold or silver -- the fact that, unlike dividend stocks or bonds, they are non-yielding assets. In an economic situation where yields are low across the board no matter where you turn, gold and silver always look more attractive than they do in a high-rate environment.\n2. Industrial demand for silver continues to soar\nThere's a reason why legendary investor Warren Buffett has bought thousands of tons of silver in his career, even while deriding gold as a speculation that doesn't \"produce anything, but that you hope someone will pay you more for later on.\"\nAs the most electroconductive metal on the periodic table, silver has myriad industrial uses. It's used in electric vehicles, solar panels, and semiconductors, as well as cellphones, televisions, radios, and many other devices.\nFor instance, the average solar panel contains 20 grams, or two-thirds of an ounce, of silver. With major economies around the world turning to decarbonization, the rise of solar panels is proving to be a major catalyst for silver demand.\nU.S. solar capacity is expected to grow by 70 gigawatts in 2026 and 2027, which would mean a 49% increase from late 2025's level. For context, a gigawatt requires about 3.1 million solar panels, so America's increased solar capacity over the next two years should consume another 143 million ounces of silver.\nAnd that's just America. Remember, the energy transition is global. In the first half of 2025, China installed more solar panels than the rest of the world combined. It's easy to envision solar panel installations alone driving hundreds of millions of ounces in new demand for silver in 2026.\nMight supply simply rise with demand, to keep prices more or less constant? Not exactly.\n3. Unlike gold, silver is a byproduct metal\nWhile there are a few mines out there that produce primarily silver, silver is mostly found in mines that are mainly producing gold, lead, zinc, or other minerals.\nIn 2023 in the U.S., for instance, there were four silver mines and 31 mines that produced silver on the side. As Buffett himself has noted, silver's status as a byproduct metal has consequences: It means supply can't simply be turned on like a tap. Supply of a byproduct metal won't be very responsive to price changes, as Buffett noted in 1998, the last time he bought silver.\nSure enough, global silver production rose by just 1% in 2024, and is forecast to have increased by just 2% in 2025 once final figures are in. In contrast, new gold mines are coming online in 2026, and gold miners are ramping up production in response to rising gold prices. One gold miner, Equinox Gold, is forecasting an 80% jump in annual gold production from its Canadian operations.\nA simple way to play silver\nThe iShares Silver Trust(NYSEMKT: SLV)exchange-traded fund, designed to closely track silver's performance, is already up strongly year-to-da"
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.765",
            "open": "65.187",
            "close": "64.345",
            "high": "65.437",
            "low": "63.672"
        },
        "market_summary": "### Spot Brent Crude Oil Market Briefing\n\n* **Key Drivers:** Rise in U.S. crude inventories by **3.6 million barrels** and concerns over global **oversupply** are putting pressure on oil prices, while a slight softening in U.S. crude oil production and geopolitical tensions also play a role.\n* **Price Action:** Broke below the key level of **$64.00**, showing **bearish** momentum, with current prices hovering around **$64.04** per barrel.\n* **Technical Outlook:** Immediate support is near the 50-day moving average at **$62.57**, with resistance at **$64.00**.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "Natural Gas, WTI Oil, Brent Oil Forecasts – Oil Retreats As Crude Inventories Rise By 3.6 Million Barrels - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/natural-gas-wti-oil-brent-oil-forecasts-oil-retreats-as-crude-inventories-rise-by-3-6-million-barrels-1574451",
                "body": "Natural gas pulled back towards $5.00 on profit-taking.\nWTI oil declined towards the $59.00 level as traders focused on the EIA report.\nBrent oil declined below $64.00 amid broad pullback in the oil markets.\nNatural Gas\nNatural Gas 220126 Daily Chart\nNatural gas pulled back from session highs as traders rushed to take profits after the huge rally.\nIn case natural gas pulls back below the $4.95 level, it will move towards the nearest support, which is located in the $4.00 – $4.05 range.\nWTI Oil\nWTI Oil 220126 Daily Chart\nWTI oil is under pressure as traders react to the EIA report. The report indicated that crude inventories increased by 3.6 million barrels from the previous week, compared to analyst forecast of +1.1 million barrels.\nIf WTI oil pulls back below the 50 MA at $58.54, it will move towards the support level, which is located in the $55.50 – $56.00 range.\nBrent Oil\nBrent Oil 220126 Daily Chart\nBrent oil is under pressure as traders focus on rising crude inventories in the U.S. and take profits after the recent rally.\nIf Brent oil settles below the $64.00 level, it will move towards the 50 MA at $62.57.\nIf you’d like to know more about how commodity markets work, please visit our educational area.\nVladimir is an independent trader, with over 18 years of experience in the financial markets. His expertise spans a wide range of instruments like stocks, futures, forex, indices, and commodities, forecasting both long-term and short-term market movements.\nVladimir is an independent trader, with over 18 years of experience in the financial markets. His expertise spans a wide range of instruments like stocks, futures, forex, indices, and commodities, forecasting both long-term and short-term market movements."
            },
            {
                "title": "US Crude Oil Inventories Up - Energy News Beat",
                "source": "Energy News Beat",
                "url": "https://energynewsbeat.co/us-crude-oil-inventories-up/",
                "body": "In the latest Weekly Petroleum Status Report from the U.S. Energy Information Administration (EIA) for the week ending January 9, 2026, U.S. commercial crude oil inventories (excluding the Strategic Petroleum Reserve) saw a notable increase of 3.4 million barrels, reaching a total of 422.4 million barrels. This build defied market expectations of a drawdown and marks a reversal from the previous week’s decline of 3.8 million barrels. At current levels, inventories sit about 3% below the five-year average for this time of year, reflecting ongoing dynamics in supply, demand, and refining activity. This uptick comes amid broader market concerns over global oversupply, even as domestic production remains robust but shows signs of slight softening.\nStrategic Petroleum Reserve Levels\nThe Strategic Petroleum Reserve (SPR) continues its gradual rebuild following significant drawdowns in prior years. For the week ending January 9, 2026, SPR crude oil stocks stood at 413.7 million barrels, up modestly by 0.2 million barrels from the prior week. This level represents a 5% increase compared to the same period in 2025, when stocks were at 393.8 million barrels. The Department of Energy has been actively refilling the reserve, with recent awards for additional purchases signaling a commitment to bolstering emergency stockpiles. As of early January 2026, the SPR provides approximately 413 million barrels of import protection, though it remains well below its authorized capacity of 714 million barrels.\nU.S. Crude Oil Production Trends\nU.S. crude oil production averaged 13.753 million barrels per day (b/d) for the week ending January 9, 2026, down 0.4% from the previous week’s 13.811 million b/d. This marks a slight pullback but keeps output near record highs achieved in 2025. Looking ahead, the EIA’s January 2026 Short-Term Energy Outlook forecasts annual production to hold relatively flat at around 13.6 million b/d in 2026 before declining by about 2% to 13.3 million b/d in 2027. This projected slowdown is attributed to sustained lower oil prices, which could curb drilling activity, despite ongoing efficiency gains in key regions like the Permian Basin. The Permian is expected to average 6.6 million b/d in 2026, with modest growth in the Gulf of Mexico and Alaska offsetting declines elsewhere.\nCrude Oil Prices: WTI and Brent\nAs of January 22, 2026, West Texas Intermediate (WTI) crude oil prices hovered around $59.88 per barrel, down approximately 1.2% from the previous day amid oversupply fears and easing geopolitical tensions. Brent crude, the global benchmark, traded at about $64.04 per barrel, reflecting a similar daily decline of 1.8%.\nOver the past month, WTI has risen modestly by around 2%, but it remains down more than 20% year-over-year. Brent has followed a comparable pattern, up 2.8% monthly but down 18% from January 2025 levels. These prices are influenced by expectations of global inventory builds outpacing demand growth, with the International Energy Agency projecting a surplus of 3.7 million b/d in 2026. The EIA forecasts Brent to average $56 per barrel in 2026, down 19% from 2025.\nGasoline Inventories and Market Dynamics\nGasoline stocks surged by 9 million barrels in the week ending January 9, 2026, reaching 251 million barrels—well above market forecasts of a 3.6 million-barrel build. This increase follows a 7.7 million-barrel rise the prior week and pushes inventories to 3% above the five-year average. Production averaged 9.0 million b/d, while demand ticked up slightly to 8.3 million b/d. Retail gasoline prices have nudged higher to a national average of $2.84 per gallon as of mid-January, though they remain below last year’s $3.08.\nThe EIA anticipates prices to fall to $2.92 per gallon in 2026, down 6% from 2025, driven by lower crude costs but partially offset by tightening refinery margins due to West Coast capacity reductions.\nDiesel (Distillate) Inventories\nDistillate fuel inventories, which include diesel and heating "
            },
            {
                "title": "Oil: EIA weekly US crude inventories +3602K vs +1131K expected - investingLive",
                "source": "investingLive",
                "url": "https://investinglive.com/commodities/oil-eia-weekly-us-crude-inventories-3602k-vs-1131k-expected-20260122/",
                "body": "- Prior was +3391K\n- Gasoline +5977K vs +1705K exp\n- Distillates +3349K vs -162K exp\n- Refinery utilization -2.0%\nOil is at the lows of the day following this report, with WTI crude oil down $1.30 to $59.31.\nPrivate inventories late yesterday:\nCrude: +3.04 million\nGasoline: +6.2 million\nDistillates: -33,000\nThere have been a number of large builds in US supply lately and that's a harbinger of some pain in the oil market once the geopolitical scene settles down. Peace in Ukraine is a further downside risk for oil.\nFor background:\nThe Weekly Petroleum Status Report (WPSR), published by the U.S. Energy Information Administration (EIA), is arguably the most influential set of energy data in the world. Released every Wednesday at 10:30 a.m. ET, it provides a comprehensive snapshot of the U.S. oil supply chain, covering crude oil inventories, refinery operations, and fuel production.\nThe report serves as the official government audit of the nation’s energy balance. Unlike voluntary industry surveys, the EIA has the legal authority to mandate reporting from approximately 1,200 entities, including refineries, pipelines, and bulk terminals. This ensures high-quality data that market participants use to estimate \"implied demand\"—calculated by tracking how much product has left the primary supply chain.\nTraders and policymakers focus on several \"market-moving\" indicators within the report:\nCommercial Crude Stocks: The change in the number of barrels held by U.S. firms.\nRefinery Utilization: The percentage of capacity refineries are currently using.\nProduct Inventories: Stockpiles of gasoline, distillate (diesel/heating oil), and jet fuel."
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.840",
            "open": "60.763",
            "close": "59.773",
            "high": "60.913",
            "low": "59.073"
        },
        "market_summary": "### Spot WTI Crude Oil Market Briefing\n\n* **Key Drivers:** Rising U.S. crude inventories, with a build of **3.6 million barrels** according to the EIA report, are increasing downward pressure on prices, amidst a backdrop of **U.S. shale production plateauing** and American companies exporting their expertise abroad.\n* **Price Action:** WTI oil has declined towards the **$59.00** level, with a drop of **$1.30** to **$59.31** following the EIA report, indicating **bearish** sentiment.\n* **Technical Outlook:** Immediate support is near the **50-day moving average at $58.54**, with further support in the **$55.50 – $56.00** range if the price breaks below this level.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "Why American Shale Know-How Is Becoming a Global Export - Crude Oil Prices Today | OilPrice.com",
                "source": "Crude Oil Prices Today | OilPrice.com",
                "url": "https://oilprice.com/Energy/Crude-Oil/Why-American-Shale-Know-How-Is-Becoming-a-Global-Export.html",
                "body": "As U.S. shale production plateaus, America’s frackers are looking at opportunities abroad to tap new growth markets and develop emerging shale basins overseas, leveraging two decades of experience and technological innovation.\nOpportunities abound—from Argentina to Australia—as oil and gas-producing nations look to unlock unconventional resources to increase domestic output and boost energy security.\nU.S. expertise is the best chance these countries have to develop their shale industries, and American producers and oilfield service providers are seizing the opportunity.\nU.S. Frackers Export Expertise\nAmerican shale drillers and producers are exporting expertise and experience to various projects in South America, the Middle East, and Australia, in search of growth opportunities beyond U.S. shale.\nAmerica’s crude oil production is set to plateau as the slowdown in drilling activity will outpace increases in drilling productivity, the U.S. Energy Information Administration (EIA) said in its latest Short-Term Energy Outlook (STEO) this month.\nAfter reaching an annual record of 13.6 million barrels per day (bpd) in 2025, U.S. crude oil production will decrease this year and next, by less than 1% in 2026 and by 2% in 2027, the EIA reckons.\nLow oil prices have already forced oil tycoon and wildcatter Harold Hamm to cease drilling operations in North Dakota for the first time in decades.\nBut the company Hamm founded, Continental Resources, is now looking to expand its unconventional field drilling in Turkey and Argentina.\nContinental Resources said in March it had executed a Joint Venture Agreement to commence the commercial development of unconventional oil and gas resources in the Diyarbakir Basin of Southeast Turkey and the Thrace Basin of northwest Turkey.\nEarly evaluations suggest the Ultimate Recoverable Reserves could reach 6 billion barrels of oil and 12-20 trillion cubic feet (TCF) of gas in the Diyarbakir Basin, and 20-45 TCF in the Thrace Basin, Continental Resources said.\n“By harnessing the success pioneered by the American independent petroleum industry, this collaboration will allow for the rapid development of Türkiye’s unconventional resources and pave the way for an Energy Renaissance,” the largest private oil and gas producer in the United States said.\nContinental Resources has also just expanded its position in Argentina’s top shale play, Vaca Muerta, where oil and gas production is booming, thanks to frackinig technology and business-friendly policies under Argentinian President Javier Milei.\n“Vaca Muerta is one of the most compelling shale plays in the world, and we're thrilled to continue to invest in Argentina and build Continental's position through this agreement with Pan American Energy,” Doug Lawler, president and CEO of Continental Resources, said.\nIn the Beetaloo Basin in Australia’s Northern Territory, Liberty Energy—the U.S. shale firm founded by now U.S. Secretary of Energy, Chris Wright—has provided modern stimulation equipment for the successful drilling of Tamboran Resources’ shale gas drilling program, the largest in the basin.\n“Americans will need to explore outside of America in the next three to five years and use their expertise to develop new shale basins,” Bryan Sheffield, the biggest shareholder of Tamboran Resources and son of Pioneer Resources founder Scott Sheffield, told the Financial Times.\nIn the Middle East, Abu Dhabi’s oil and gas giant ADNOC has drilled some horizontal wells and tested oil to the surface at a shale play in the United Arab Emirates operated by EOG Resources.\nEOG is looking to develop shale resources in the UAE’s oil play, as well as a shale gas play in Bahrain, where the U.S. firm has signed a strategic exploration agreement with the national energy firm BAPCO.\nThe world’s top crude oil exporter, Saudi Arabia, is developing Jafurah, the largest unconventional gas field in the Kingdom and the biggest shale field outside the United States, estimated to cost $100 billio"
            },
            {
                "title": "Natural Gas, WTI Oil, Brent Oil Forecasts – Oil Retreats As Crude Inventories Rise By 3.6 Million Barrels - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/natural-gas-wti-oil-brent-oil-forecasts-oil-retreats-as-crude-inventories-rise-by-3-6-million-barrels-1574451",
                "body": "Natural gas pulled back towards $5.00 on profit-taking.\nWTI oil declined towards the $59.00 level as traders focused on the EIA report.\nBrent oil declined below $64.00 amid broad pullback in the oil markets.\nNatural Gas\nNatural Gas 220126 Daily Chart\nNatural gas pulled back from session highs as traders rushed to take profits after the huge rally.\nIn case natural gas pulls back below the $4.95 level, it will move towards the nearest support, which is located in the $4.00 – $4.05 range.\nWTI Oil\nWTI Oil 220126 Daily Chart\nWTI oil is under pressure as traders react to the EIA report. The report indicated that crude inventories increased by 3.6 million barrels from the previous week, compared to analyst forecast of +1.1 million barrels.\nIf WTI oil pulls back below the 50 MA at $58.54, it will move towards the support level, which is located in the $55.50 – $56.00 range.\nBrent Oil\nBrent Oil 220126 Daily Chart\nBrent oil is under pressure as traders focus on rising crude inventories in the U.S. and take profits after the recent rally.\nIf Brent oil settles below the $64.00 level, it will move towards the 50 MA at $62.57.\nIf you’d like to know more about how commodity markets work, please visit our educational area.\nVladimir is an independent trader, with over 18 years of experience in the financial markets. His expertise spans a wide range of instruments like stocks, futures, forex, indices, and commodities, forecasting both long-term and short-term market movements.\nVladimir is an independent trader, with over 18 years of experience in the financial markets. His expertise spans a wide range of instruments like stocks, futures, forex, indices, and commodities, forecasting both long-term and short-term market movements."
            },
            {
                "title": "Oil: EIA weekly US crude inventories +3602K vs +1131K expected - investingLive",
                "source": "investingLive",
                "url": "https://investinglive.com/commodities/oil-eia-weekly-us-crude-inventories-3602k-vs-1131k-expected-20260122/",
                "body": "- Prior was +3391K\n- Gasoline +5977K vs +1705K exp\n- Distillates +3349K vs -162K exp\n- Refinery utilization -2.0%\nOil is at the lows of the day following this report, with WTI crude oil down $1.30 to $59.31.\nPrivate inventories late yesterday:\nCrude: +3.04 million\nGasoline: +6.2 million\nDistillates: -33,000\nThere have been a number of large builds in US supply lately and that's a harbinger of some pain in the oil market once the geopolitical scene settles down. Peace in Ukraine is a further downside risk for oil.\nFor background:\nThe Weekly Petroleum Status Report (WPSR), published by the U.S. Energy Information Administration (EIA), is arguably the most influential set of energy data in the world. Released every Wednesday at 10:30 a.m. ET, it provides a comprehensive snapshot of the U.S. oil supply chain, covering crude oil inventories, refinery operations, and fuel production.\nThe report serves as the official government audit of the nation’s energy balance. Unlike voluntary industry surveys, the EIA has the legal authority to mandate reporting from approximately 1,200 entities, including refineries, pipelines, and bulk terminals. This ensures high-quality data that market participants use to estimate \"implied demand\"—calculated by tracking how much product has left the primary supply chain.\nTraders and policymakers focus on several \"market-moving\" indicators within the report:\nCommercial Crude Stocks: The change in the number of barrels held by U.S. firms.\nRefinery Utilization: The percentage of capacity refineries are currently using.\nProduct Inventories: Stockpiles of gasoline, distillate (diesel/heating oil), and jet fuel."
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0086",
            "open": "1.1680",
            "close": "1.1754",
            "high": "1.1755",
            "low": "1.1670"
        },
        "market_summary": "### EUR/USD Market Briefing\n\n* **Key Drivers:** Easing **US-EU trade tensions** and a **dovish** ECB stance are supporting the **EUR/USD**, while the **Fed's patience** and **hawkish** tone are holding up the **US Dollar**.\n* **Price Action:** The pair is trading near **1.1740**, with a recent bounce from **1.1670**, showing **bullish momentum** as it challenges the **1.1800** resistance level.\n* **Technical Outlook:** Immediate support is near the **1.1665** level, with resistance at **1.1800**, and the pair is range-bound between these levels, awaiting directional bias from upcoming **US data releases**.\n\n---\n**Overall Sentiment:** Neutral ↑️",
        "source_articles": [
            {
                "title": "EUR/USD Rallies as Trump Tariffs, Davos Speech Dominate Headlines - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en/news-and-analysis/eur-usd-rallies-as-trump-tariffs-davos-speech-dominate-headlines/?amp=true",
                "body": "EUR/USD Rallies as Trump Tariffs, Davos Speech Dominate Headlines\nEuro Grind Continues\nPresident Trump has not been shy about what he wants: A weaker US Dollar to help American corporates, and this is something that also supports the tariffs that he’s continued to talk up and inject into the headlines whenever he’s wanted a shot of USD weakness. This weekend was very much on that tune as he waited until after markets were closed to announce the idea of more European tariffs because of the Greenland saga, and when markets opened on Sunday the USD sell-off took back over.\nThis isn’t a new thing, by the way, as it was just about a year ago that Trump initially began to steer the tariff cannon across the Atlantic. It was the first weekend in February, just a couple weeks after his inauguration, when he announced intent to levy reciprocal tariffs on Europe. At the time, the Dollar was still holding near highs following a blistering Q4 rally, a run which took place even as the Fed was cutting rates. Markets seemed unsure how to incorporate the news as there was both the probability of Trump walking it back and the prospect of bidding a Euro into a rather weak economic backdrop for the Euro-zone.\nBut, that initial gasp of USD-strength and EUR/USD weakness in the first weekly open of February last year saw an important inflection point get set, with EUR/USD showing a higher-low just above the 1.0200 handle, which ultimately helped to set the low for 2025.\nThe rest of February brought the build of an ascending triangle formation as buyers weren’t able to take out the 1.0500 level, but that happened in March as economic data began to show weakness in the US with a lot of fear driven by the prospect of economic slowing from tariffs. EUR/USD then broke out in a big way in a rally that lasted for the rest of H1, 2025. But as soon as the door opened into the second-half of the year, matters began to shift.\nEUR/USD Weekly Chart\nChart prepared by James Stanley; data derived from Tradingview\nEUR/USD: Divergence and Deduction\nAfter setting that swing high on the first day of Q3 trade EUR/USD bulls started to spin their wheels, and the USD-weakness that could not continue wasn’t exactly unsupported by President Trump.\nAt that point, it was the Fed Chair nomination that Trump seemingly had in his back pocket to try to talk the Dollar lower, with the relationship being expectation of a more-dovish Fed Chair bringing with it the expectation for more rate cuts which could support the thesis of a weaker USD. The only problem is that the Dollar couldn’t really weaken all that much more as buyers continued to show up at support, but Q3 is when the narrative began to shift into a more supportive backdrop for rate cuts, helped along by the August 1st NFP release that saw a massive revision to prior months’ data.\nIt was just a couple days earlier that Jerome Powell said that he didn’t feel the market was in dire need of a rate cut as employment remained strong, as the unemployment rate held near ‘full employment’ levels, and inflation was still well-above the Fed’s target. But given the combined force of Trump’s push and the revision to jobs data, markets geared in for the Fed to finally start 2025 rate cuts at their next meeting in September.\nIt was Jerome Powell’s speech at Jackson Hole that showed a different tune and the breakout in gold in that aftermath was intense in a rally that still hasn’t really stopped. But in EUR/USD, the effect was largely muted as the rate cut announcement brought another show from EUR/USD bears and USD bulls that disallowed for trend continuation, and since then, the USD has been biased in a bullish manner as can be seen from the upward-sloping trendline on the below chart.\nUSD Daily Chart\nChart prepared by James Stanley; data derived from Tradingview\nEUR/USD Daily\nEUR/USD price action has shown a similar dynamic, with both lower-highs and higher-lows posting over the past five months. Symmetrical triangles normally come a"
            },
            {
                "title": "EUR/USD rallies above 1.1740 as easing trade tensions weaken Dollar - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/eur-usd-rallies-above-11740-as-trump-drops-tariff-threats-dollar-slips-202601222154",
                "body": "EUR/USD rallies above 1.1740 as Trump drops tariff threats, Dollar slips\n- EUR/USD climbs over 0.5% as improved risk appetite fuels Dollar selling despite solid US growth data.\n- Markets fully price a Fed hold in January, while year-end easing bets are sharply reduced.\n- ECB minutes reinforce confidence in inflation returning to target, supporting the shared currency.\nEUR/USD climbs for the second day in the week up by over 0.50% as the Dollar slides despite solid US economic data was released in the day. An improvement in risk appetite sponsored by US President Donald Trump dropping tariffs threats on Europe, underpins the shared currency. At the time of writing, the pair trades at 1.1743 after bouncing off daily lows of 1.1670.\nEuro extends gains as easing US–Europe trade tensions outweigh strong US data and pressure the Dollar\nWall Street is poised to end Thursday’s session with gains bolstered by strong Gross Domestic Product (GDP) figures in the third quarter of 2025. Jobs data released at the same time and a slightly steady inflation print erased the chances of a rate cut by the Federal Reserve at the January meeting.\nData from Prime Market Terminal indicates that money markets expect the Fed to hold rates unchanged, with odds standing at 95%. Towards the year’s end, investors expect 42 basis points of rate cuts, below the 60 expected on January 7.\nIn Europe, the European Central Bank (ECB) unveiled its latest meeting monetary policy minutes in which members broadly agreed with the assessment on the economy and that underlying inflation indicators remain consistent with the central bank’s 2% medium-term goal.\nAlso, members of the European Union plan to unfreeze the trade dieal with the US and vote on ratification, revealed Bloomberg.\nEconomic schedule for January 23\nThe EU economic docket will feature HCOB Flash PMIs for France, Germany and the bloc. Also, the ECB President Christine Lagarde will cross the wires. In the US, traders focus will be on S&P Global Flash PMIs and the final print of the University of Michigan Consumer Sentiment.\nEuro Price This week\nThe table below shows the percentage change of Euro (EUR) against listed major currencies this week. Euro was the strongest against the Japanese Yen.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Euro from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent EUR (base)/USD (quote).\nDaily digest market movers: Traders ignore upbeat US data, drive Euro higher\n- The US Department of Commerce reported that the Fed’s preferred inflation gauge, Core Personal Consumption Expenditures (PCE), rose 2.7% YoY in October and accelerated slightly to 2.8% in November, broadly in line with expectations.\n- The US Bureau of Economic Analysis showed that Q3 2025 GDP grew 4.4% YoY, topping forecasts of 4.3% and improving markedly from Q2’s 3.8% pace. The expansion was driven by stronger exports and a smaller drag from inventories.\n- Initial Jobless Claims for the week ending January 17 edged up to 200K from a revised 199K, but still came in well below expectations of 212K, according to data from the US Department of Labor.\n- The ECB last meeting minutes struck a dovish language with policymakers acknowledging that growth remains resilient but exposed to geopolitical risks that could weigh on sentiment, tilting markets risk averse. Inflation is seen anchored near the 2% goal. Policymakers reiterated that policy is not on a preset path, maintaining their data-dependent stance.\n- The US Dollar Index (DXY), which tracks the American currency's performance versus six peers, dives 0.50% down at 98.29.\nTechnical outlook: EUR/USD poised to challenge 1.1800 in the near-term\nThe EUR/USD has turned slightly neutral to upward biased after bouncing of 1.1576, near "
            },
            {
                "title": "EUR/USD Price Analysis: Dollar Holds Firm on Easing Tensions, Fed Caution - Forex Crunch",
                "source": "Forex Crunch",
                "url": "https://www.forexcrunch.com/blog/2026/01/22/eur-usd-price-analysis-dollar-holds-firm-on-easing-tensions-fed-caution/",
                "body": "- EUR/USD price analysis remains range-bound despite eased US-EU tensions over Greenland.\n- The Fed’s patience and the ECB’s growth concerns continue to weigh on the euro.\n- Markets await US initial jobless claims, Core PCE, and GDP data for directional bias.\nEUR/USD traded around 1.1685 on Thursday after bouncing 0.3% on Wednesday. However, the pair remains stuck in a ranging pattern. The dollar is clinging to support around 98.80 on the DXY, held up by easing geopolitical tensions and the Fed’s stubborn refusal to cut rates anytime soon.\n–Are you interested to learn more about crypto signals? Check our detailed guide-\nMeanwhile, Trump backing off his tariff threats to Europe was the significant catalyst this week. He’d threatened 10% tariffs on eight EU countries starting February 1, which had everyone spooked about a trade war. Later, he said the US and NATO hammered out a “framework for a deal” on Greenland and ruled out military action. That pulled the rug out from under the safe-haven dollar bid and the euro’s slight breather. However, the relief was temporary, as the dollar remains supported amid other perspectives.\nThe Fed is the real anchor, holding the greenback bid. Officials have reiterated that they’re not in a rush to cut rates unless inflation actually moves toward 2%. The markets are pricing in 50-bps cuts for the year, but around midyear or after. For now, the Fed’s hawkish stance is keeping the rate differential favorable for the dollar versus the euro, especially given the ECB’s likely further rate cuts.\nTraders are basically sitting on their hands waiting for key US data. Initial jobless claims, GDP, and PCE inflation numbers are coming, which could shift the narrative. If the data comes in hot, the dollar could rally. However, if it’s soft, the Fed might have to cut sooner than expected.\nThe pair has been range-bound between 1.1665 and 1.1700 for now. The easing of trade tensions helped EUR/USD catch a bid, but the Fed’s higher-for-longer stance and cautious outlook mean the dollar is likely to stay supported. Without a major shift in Fed expectations or a return of geopolitical turmoil, the pair looks stuck in a near-term sideways trading range.\nEUR/USD Technical Price Analysis: Ranging Near Key MAs\nThe EUR/USD 4-hour chart shows a consolidation under 1.1700, supported by a confluence of 20- and 100-period MAs near 1.1685. The MAs reveal a mixed scenario with a 200-period MA at 1.1700 capping gains, while the downside could find support at the 50-period MA near 1.1660. The RSI remains flat above 50.0, indicating no clear momentum.\n–Are you interested in learning more about tips for forex traders? Check our detailed guide-\nIn case of a bullish breakout above the 200-period MA, the price could soar to Wednesday’s highs near 1.1740 ahead of the weekly top near 1.1765. On the flip side, breaking the 1.1660 support could open the path to 1.1600 and 1.1550.\nLooking to trade forex now? Invest at eToro!\n68% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money."
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0105",
            "open": "1.3425",
            "close": "1.3498",
            "high": "1.3506",
            "low": "1.3401"
        },
        "market_summary": "### GBP/USD Market Briefing\n\n* **Key Drivers:** Easing **US-EU trade tensions** and expectations of **Fed rate cuts** are strengthening the **GBP/USD** pair, despite **strong US GDP and jobs data**.\n* **Price Action:** The pair is nearing **two-week highs**, trading around **1.3500**, with immediate support at the **9-day EMA of 1.3451** and resistance at **1.3562**.\n* **Technical Outlook:** The **200-day moving average at 1.3406** serves as a key support level, with a break below potentially signaling a trend reversal, while the next resistance is at **1.3567**.\n\n---\n**Overall Sentiment:** **Bullish**",
        "source_articles": [
            {
                "title": "When are the UK Retail Sales and how could they affect GBP/USD? - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/when-are-the-uk-retail-sales-and-how-could-they-affect-gbp-usd-202601230511",
                "body": "When are the UK Retail Sales and how could they affect GBP/USD?\nThe UK Retail Sales Overview\nThe United Kingdom (UK) docket has the Retail Sales data for December to be released by the Office for National Statistics (ONS) on Friday, later this session at 07:00 GMT.\nUK Retail Sales are expected to decline by 0.1% month-over-month (MoM) in December, following a 0.1% decline seen in November. On an annualized basis, Retail Sales are seen rising 1% during the reported month, inching higher from the previous increase of 0.6%.\nCore Retail Sales, stripping the basket of motor fuel sales, are expected to fall 0.2% MoM, matching the prior decline, while YoY growth may rise to 1.4% from 1.2% in November.\nHow could the UK Retail Sales affect GBP/USD?\nGBP/USD pair may remain silent even if UK Retail Sales data for December come stronger-than-expected, as the Bank of England (BoE) is widely expected to stay put on a gradual easing path, even as price pressures accelerated in December. Focus will be shifted toward the preliminary S&P Global Purchasing Managers’ Index (PMI) data for January from the United Kingdom (UK) and the United States (US) due later in the day.\nThe GBP/USD pair may regain its ground as the US Dollar (USD) struggles with increased risk aversion, which could be attributed to the geopolitical tensions. US President Donald Trump initially threatened tariffs against European countries opposing his Greenland plan, but later backed down after securing a NATO framework agreement for a potential deal.\nTechnically, the GBP/USD pair remains steady after gaining more than 0.5% in the previous session, trading around 1.3500 at the time of writing. The pair may target the three-month high of 1.3562 as the next barrier. The immediate support lies at the nine-day Exponential Moving Average (EMA) of 1.3451, followed by the 50-day EMA at 1.3398.\nPound Sterling FAQs\nThe Pound Sterling (GBP) is the oldest currency in the world (886 AD) and the official currency of the United Kingdom. It is the fourth most traded unit for foreign exchange (FX) in the world, accounting for 12% of all transactions, averaging $630 billion a day, according to 2022 data. Its key trading pairs are GBP/USD, also known as ‘Cable’, which accounts for 11% of FX, GBP/JPY, or the ‘Dragon’ as it is known by traders (3%), and EUR/GBP (2%). The Pound Sterling is issued by the Bank of England (BoE).\nThe single most important factor influencing the value of the Pound Sterling is monetary policy decided by the Bank of England. The BoE bases its decisions on whether it has achieved its primary goal of “price stability” – a steady inflation rate of around 2%. Its primary tool for achieving this is the adjustment of interest rates. When inflation is too high, the BoE will try to rein it in by raising interest rates, making it more expensive for people and businesses to access credit. This is generally positive for GBP, as higher interest rates make the UK a more attractive place for global investors to park their money. When inflation falls too low it is a sign economic growth is slowing. In this scenario, the BoE will consider lowering interest rates to cheapen credit so businesses will borrow more to invest in growth-generating projects.\nData releases gauge the health of the economy and can impact the value of the Pound Sterling. Indicators such as GDP, Manufacturing and Services PMIs, and employment can all influence the direction of the GBP. A strong economy is good for Sterling. Not only does it attract more foreign investment but it may encourage the BoE to put up interest rates, which will directly strengthen GBP. Otherwise, if economic data is weak, the Pound Sterling is likely to fall.\nAnother significant data release for the Pound Sterling is the Trade Balance. This indicator measures the difference between what a country earns from its exports and what it spends on imports over a given period. If a country produces highly sought-after exports, its currency will bene"
            },
            {
                "title": "The US-EU trade tensions eased, enhancing risk appetite and leading to a rise in GBP/USD - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/the-us-eu-trade-tensions-eased-enhancing-risk-appetite-and-leading-to-a-rise-in-gbp-usd/",
                "body": "GBP/USD rose as risk sentiment improved following de-escalation of US-Europe trade tensions. President Trump’s deal with NATO regarding Greenland, preventing tariffs on European countries, contributed to easing fears.\nDespite strong US GDP and jobs data, the Dollar did not benefit as expectations for Federal Reserve easing remained. Q3 GDP grew by 4.4% annually, while initial jobless claims were lower than forecasted at 200K, with continuing claims decreasing to 1.849 million.\nUs Dollar Index Performance\nThe US Dollar Index fell 0.25% to 98.55, with traders predicting further rate cuts. Across the Atlantic, UK economic events are sparse, although recent data showed increased inflation but softer jobs data, prompting potential interest rate cuts by the Bank of England.\nUpcoming UK Retail Sales and US PMI and Consumer Sentiment data are anticipated as future market movers. Technically, GBP/USD remains consolidated with resistance and support levels identified at 1.3500 and 1.3341 respectively.\nThe Pound Sterling is the UK’s official currency and one of the most traded globally. Its value is influenced by the Bank of England’s monetary policy, economic data releases, and trade balance outcomes. Positive economic indicators tend to increase Sterling’s value by attracting more investments and potentially encouraging interest rate hikes by the BoE.\nWe are seeing a clear improvement in risk appetite, driven by the de-escalation of the trade conflict between the US and Europe. This positive sentiment is lifting the GBP/USD pair, pushing it towards the 1.3500 resistance level. For now, this broader market mood is overpowering the specific economic fundamentals of either country.\nFed Rate Cut Expectations\nThe US Dollar is failing to gain ground despite robust economic figures from the end of last year, such as the 4.4% Q3 GDP growth. This is because the market is firmly convinced the Federal Reserve will begin cutting interest rates soon. Expectations for looser monetary policy are outweighing the strong economic performance we saw in 2025.\nTo make this more concrete, we can see that interest rate futures markets are currently pricing in a greater than 70% probability of a Fed rate cut by the March meeting. Traders are anticipating at least 40 basis points of total easing by the end of this year. This widespread expectation is the primary reason for the dollar’s current weakness.\nOn the sterling side, the situation is more complicated, as the Bank of England faces its own decision on interest rates. While a softer jobs report from last year could justify a rate cut, recent data showed UK inflation remains elevated near 4.0%, which is double the BoE’s target. This policy conflict creates underlying uncertainty for the pound, even as it rallies against the dollar.\nGiven this setup, we should consider buying call options on GBP/USD with strike prices near the 1.3500 psychological level. This strategy allows us to capture further upside if the positive momentum continues through upcoming US data releases. It also caps our potential losses if the forthcoming UK retail sales figures are weak and cause a reversal.\nThose with a higher risk appetite could take long positions in futures contracts, but we must use the 200-day moving average at 1.3406 as a key support level. Historically, a decisive break below such a long-term average often signals a trend reversal. Therefore, a drop below this point would be our signal to exit long positions.\nLooking ahead, the US Flash PMI and Consumer Sentiment reports will be the next major catalysts. Any signs of economic weakness in these reports would reinforce the market’s belief in imminent Fed rate cuts. This would likely add more fuel to the GBP/USD rally, potentially pushing it towards the next resistance at 1.3567."
            },
            {
                "title": "GBP/USD Nears Two-Week Highs as Dollar Weakness Lifts Sterling - FXDailyReport.Com",
                "source": "FXDailyReport.Com",
                "url": "https://fxdailyreport.com/gbp-usd-nears-two-week-highs-as-dollar-weakness-lifts-sterling/",
                "body": "The British Pound is regaining upside momentum against the US Dollar on Thursday, with GBP/USD pushing back toward the 1.3500 psychological mark, close to its highest levels in two weeks. The pair quickly shrugged off Wednesday’s brief pullback and resumed its upward trajectory, largely driven by persistent selling pressure on the US Dollar rather than fresh UK-specific catalysts.\nMarket participants are now turning their attention to upcoming UK economic data for guidance on the domestic outlook. The Office for National Statistics (ONS) is expected to report that the UK economy expanded modestly by 0.1% in November. Manufacturing Production is forecast to grow by 0.5% on a monthly basis, while Industrial Production is projected to remain broadly unchanged. These releases are particularly important after recent weakness, as UK GDP contracted by 0.1% in both September and October following flat growth in August, raising concerns about stagnation risks.\nThe incoming data will also influence expectations around the Bank of England’s (BoE) policy path. At its December meeting, the BoE reiterated that monetary policy is likely to follow a gradual easing trajectory. Reinforcing this view, BoE policymaker Alan Taylor said during a summit in Singapore that interest rates could move toward neutral levels sooner than previously thought, noting that inflation may return to the 2% target by mid-2026. Such comments strengthen expectations that further easing lies ahead, even if it is implemented cautiously.\nOn the US side, the Dollar continues to struggle for direction. The US Dollar Index (DXY) trades slightly lower near 99.10, easing from recent monthly highs. This comes despite strong US inflation data earlier in the week, which showed headline and core CPI holding steady at 2.7% and 2.6% year-on-year in December. Those figures reinforced expectations that the Federal Reserve is unlikely to cut rates at its upcoming meeting.\nHowever, political pressure on the Fed remains a key drag on the Greenback. US President Donald Trump has repeatedly urged Fed Chair Jerome Powell to deliver larger rate cuts, reigniting concerns over central bank independence. In response, senior officials from the ECB, BoE and several other major central banks issued a rare joint statement backing Powell and emphasizing that central bank independence is vital for financial and economic stability.\nWith the US Producer Price Index (PPI) data due later in the day, traders will look for further confirmation on inflation trends. Until then, sustained Dollar weakness and improving Sterling sentiment keep GBP/USD biased to the upside near current levels.\nTrade Idea:\nBuy GBP/USD on dips toward 1.3430–1.3450, targeting 1.3580, with a stop below 1.3360, as Dollar weakness supports further upside."
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0091",
            "open": "0.6756",
            "close": "0.6839",
            "high": "0.6844",
            "low": "0.6753"
        },
        "market_summary": "### AUD/USD Market Briefing\n\n* **Key Drivers:** Strong labour market data and expectations of a potential **RBA rate hike** are driving the **AUD/USD** higher, alongside a **bullish** outlook for cyclical assets and improving **rates differentials**.\n* **Price Action:** Broke above the **0.68** handle, nearing the **October 2024 peak** of **0.6943**, showing significant **bullish momentum**.\n* **Technical Outlook:** Immediate support is near **0.6667**, with resistance at **0.6941**. A break above **0.6941** could target **0.72**, a **100% projection** and close to the **61.8% retracement** of the **0.8006** to **0.5913** range.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "AUD/USD, NZD/USD lag no longer as global cycle reasserts itself - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/aud-usd-nzd-usd-lag-no-longer-as-global-cycle-reasserts-itself/?amp=true",
                "body": "AUD/USD, NZD/USD lag no longer as global cycle reasserts itself\n- Cyclical assets turning bullish\n- Rates differentials turning supportive\n- AUD and NZD playing catch-up\n- Technicals favour buying dips\nSummary\nAUD and NZD are finally playing catch-up as the global cycle shows through metals, small caps, and rates. The recent break higher isn’t just noise with correlations tightening and momentum building. Buying dips is preferred, and with both breaking key levels, the bullish run could extend further, especially against the crosses.\nCycle Currencies Stir\nIt should really be no surprise that cyclical, commodity-linked currencies like the Aussie and Kiwi are beginning to stir given the broader macroeconomic backdrop, once you dial down the intraday volatility sparked by Donald Trump’s Truth Social feed. We’re coming off a significant monetary policy easing cycle from G10 FX central banks, with the Federal Reserve still going. And fiscal policy remains stimulatory in major economic powerhouses such as the United States, European Union and China.\nMetals and Rates Confirm\nCurves are steepening as you’d expect during an economic upswing. Commodity prices are flying, with the surge in precious metals being joined by the industrial metals complex. Throw in crude oil prices plumbing multi-year lows, lowering energy costs for households and businesses, and it’s little wonder cyclical currencies tied to the performance of the global economy are firing.\nUnsurprisingly, whether you’re talking precious metals such as gold, industrial metals like silver and copper, or cyclical stock indices like the Russell 2000, AUD/USD and NZD/USD have seen strong correlations with each over the past quarter.\nSource: TradingView\nIt’s also notable how strong the relationship has been with relative short-dated interest rate differentials with the United States over the same period. Traders see the RBA and RBNZ hiking rates within months, just as the Fed is expected to ease again. Combined with global factors, the effect has been powerful, explaining why the AUD and NZD are suddenly outperforming. Given the scale of the moves seen in other cyclical assets, it suggests there’s a degree of catch-up going on, given the acceleration of the move recently.\nWhile persistent economic outperformance from the U.S. economy may limit the overall scale of the current bullish trend, especially with headwinds associated with Federal Reserve independence and geopolitical concerns looking like they may have peaked, against low beta FX names not as sensitive to the economic cycle, there are grounds to think the move may only be getting started.\nAUD/USD Nears Oct 2024 Peak\nSource: TradingView\nThe release of strong labour market data for December helped drive a mammoth surge in AUD/USD on Thursday, combining with a softer U.S. dollar to break through several resistance levels, leaving it sitting at highs not seen since October 2024.\nFollowing such a pronounced bullish move, it may now be due a period of consolidation, akin to what was seen around the turn of the year following the initial breakout higher. While the message from RSI (14) and MACD is entirely bullish, indicating building upside strength, the former has now ticked over into overbought territory, warning the move is looking a little stretched.\n.6825 is a minor level on the downside to watch for anyone trading the pair, with .6800 a more important level considering it acted as both support and resistance for lengthy periods back in 2024. Given the overall signal from the oscillators and moving averages favours a bullish bias, they may make for decent entry levels for longs depending on price action at the time.\nAbove where AUD/USD now trades, the October 2024 high of .6943 will be on the radar for bulls, with .6900 the only other level of note given the pair did a bit of work either side of it during the second half of 2024.\nNZD/USD Breaks 200DMA\nSource: TradingView\nJust like the Aussie, NZD/USD rocketed higher on T"
            },
            {
                "title": "RBA Rate Hike Looks Closer Than Ever After Surprise Jobs Data - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/newsletters/2026-01-22/rba-rate-hike-looms-canberra-s-political-chaos",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            },
            {
                "title": "RBA hike risks jump, AUD/USD heading to 7.2, AUD/JPY to 110 - Action Forex",
                "source": "Action Forex",
                "url": "https://www.actionforex.com/live-comments/626577-rba-hike-risks-jump-aud-usd-heading-to-7-2-aud-jpy-to-110/",
                "body": "The Australian Dollar surged sharply as markets aggressively repriced interest-rate expectations following much stronger-than-expected jobs data. The rally reflects a swift reassessment of policy risk, with labor market resilience undermining the assumption that unemployment would drift higher and cool inflation pressures on its own.\nThe key shift is the absence of any rise in unemployment, which raises the risk that inflation could re-accelerate without additional policy restraint. In that context, markets are increasingly open to the idea that another rate hike may be required in the near term to keep price pressures contained.\nThat said, conviction remains conditional. The decisive input will be next week’s quarterly inflation report, which is likely to determine whether labor strength translates into a renewed inflation problem or simply reflects lagging labor-market adjustment.\nTechnically, AUD/USD broke above 0.68 handle, with D MACD suggesting the move is accelerating. The next immediate target sits at 61.8% projection of 0.5913 to 0.6706 from 0.6420 at 0.6910. As long as 0.6667 support holds, near-term outlook remains bullish, even if consolidation emerges along the way.\nMore importantly, the current advance strengthens the case that the rally from 0.5913 is reversing the entire downtrend from 2021 high at 0.8006. Firm break above 0.6941 would be a solid confirmation. Next target will be at around 0.72, which is 100% projection at 0.7213, which is close to 61.8% retracement of 0.8006 to 0.5913 at 0.7206.\nAUD/JPY is also surging, with the uptrend from 86.03 (2025 low) on track to retest 109.36, 2024 high. Given current momentum, a break above that level is likely to resume the long-term uptrend from 59.85 (2020 low). In any case, outlook will stay bullish as long as 105.20 support holds."
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "0.7130",
            "open": "158.2450",
            "close": "158.4040",
            "high": "158.8890",
            "low": "158.1760"
        },
        "market_summary": "### USD/JPY Market Briefing\n\n* **Key Drivers:** The Bank of Japan's (**BOJ**) decision to hold rates at **0.75%** and its **hawkish** tone on inflation, alongside expectations of further rate hikes, are driving **USD/JPY**.\n* **Price Action:** The pair is trading around **158.30**, retreating from one-week highs, with **bullish momentum** paused due to broad **US Dollar** weakness.\n* **Technical Outlook:** Immediate support is near **157.50**, with resistance at **159.00**, as markets await the **BOJ's** next move and **US PMI** data.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "USD/JPY: BOJ stands pat as language firms and Ueda looms - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/ie/news-and-analysis/usd-jpy-boj-stands-pat-as-language-firms-and-ueda-looms/",
                "body": "- BOJ held rates at 0.75% in an expected 8–1 decision\n- Takata dissented again, but no broader support followed\n- Inflation language firmed while risks were judged balanced\n- Markets now look to Ueda for direction in USD/JPY\nPolicy Rate Holds at 0.75%\nThe Bank of Japan held policy steady in January, voting 8–1 to keep the overnight call rate around 0.75%, a decision fully expected by markets and economists. Takata was the sole dissenter, arguing that the price stability target had largely been achieved and that risks to prices were skewed to the upside, but with no support from other board members, the outcome was not read as hawkish. That contrasts with November, when both Takata and Tamura dissented ahead of December’s hike, a reminder that while broader dissent does not guarantee action, it is when the risk of a move starts to feel more live.\nInflation, Growth Forecasts Upgraded\nIn its updated forecasts, the bank left its core inflation projections for fiscal years 2025 and 2027 unchanged at 2.7% and 2% respectively, the latter consistent with its inflation mandate. The 2026 forecast was nudged up by a tenth to 1.9%. More notable adjustments were made to the alternative core measure that excludes fresh food and energy, with forecasts for 2025 and 2026 lifted by two tenths to 3% and 2.2% respectively. The 2027 projection was left unchanged at 2%, easing pressure to tighten policy aggressively by Japanese standards. The upward revisions to the nearer-term inflation outlook partly reflected firmer growth expectations, with real GDP forecasts for 2025 and 2026 raised by 0.2% and 0.3% to 0.9% and 1% respectively.\nSource: BOJ\nAssessment Firms Post December Hike\nFollowing the decision to lift rates by 25bp to 0.75% in late December, there was a clear shift in tone in the latest Outlook for Economic Activity and Prices. On underlying inflation, the language was firmer than before. Previously, inflation was described as sluggish and closely tied to the pace of growth. That wording has gone. Now, underlying inflation is seen rising moderately, with wages and prices reinforcing each other, suggesting the bank is increasingly comfortable that inflation momentum can be sustained, even as policy continues to normalise.\nThe labour market narrative has also firmed relative to three months ago. Before the December hike, labour shortages were framed as something that would emerge later if growth improved. In the latest assessment, labour tightness is more clearly embedded in the inflation story, reinforcing the idea that wage pressures are no longer hypothetical and are starting to look more durable. That's important. On risks, the earlier assessment that growth risks were skewed to the downside has been dropped, replaced by a broadly balanced view for both activity and prices.\nOn the external backdrop, the tone is noticeably calmer. Trade and overseas policy risks are still acknowledged, but they are no longer framed as dominant headwinds. Overseas growth is treated as stabilising, which helps explain why the bank appears comfortable letting policy normalisation proceed at a gradual pace.\nMarkets Unmoved, Ueda Awaits\nSource: Bloomberg\nThere was little reaction in the swaps market to the decision, outlook or updated forecasts, with another 25bp increase essentially deemed a lock by June with a second fully priced by December. That path would see the overnight rate lifted to 1.25%.\nSource: TradingView\nUSD/JPY was also relatively steady, holding onto earlier modest gains, while the JGB 2s10s curve continued to bull-flatten, fitting with the move seen in the run-up to the meeting. Attention now turns to Governor Ueda’s press conference, scheduled to begin at 3:30pm Tokyo time. Given his recent tendency to lean dovish in post-meeting remarks, there is potential for upside in USD/JPY should that pattern continue.\nUSD/JPY Risks Biased Higher\nSource: TradingView\nUSD/JPY remains in a strong uptrend on the weekly chart, bouncing strongly from the int"
            },
            {
                "title": "Japanese Yen Forecast: USD/JPY Faces Volatility Ahead of BoJ Decision - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/japanese-yen-forecast-usd-jpy-faces-volatility-ahead-of-boj-decision-1574517",
                "body": "USD/JPY takes center stage on Friday, January 23, as markets await the Bank of Japan’s monetary policy decision and quarterly outlook report.\nEconomists expect the BoJ to leave interest rates at 0.75%. However, the weaker Japanese yen has fueled uncertainty about the timing of further rate hikes, exposing the USD/JPY pair to potential volatility.\nAhead of the monetary policy decision, inflation and private sector PMI data gave insights into Japan’s economy and price trends. Softer-than-expected inflation and a hotter Services PMI numbers increased fueled speculation about an H1 2026 BoJ rate hike.\nWhile inflation cooled, Japan’s Services PMI supported a bearish medium-term outlook for USD/JPY.\nBelow, I’ll discuss the macro backdrop, the near-term price catalysts, and technical levels traders should closely watch.\nJapan’s annual inflation rate dropped from 2.9% in November to 2.1% in December, while ‘core-core’ inflation eased from 3% to 2.9%.\nOn the face of it, the December numbers are likely to reduce pressure on the BoJ to raise interest rates. However, the BoJ’s concerns about a weaker yen driving import prices higher and the resulting erosion of household purchasing power remain a key factor.\nFurthermore, economists expect Prime Minister Sanae Takaichi’s fiscal policies to also push inflation higher, supporting a more hawkish BoJ rate path. The BoJ may indicate the need for multiple rate hikes to counter the risk of elevated inflation.\nAccording to January’s Reuters poll, conducted between January 6-13, 43% of economists expected a July rate hike, 27% a June hike, and just 8% an April hike.\nSince the poll, speculation has intensified about an April hike, raising the prospect of multiple monetary policy adjustments in 2026. The BoJ’s Quarterly Outlook Report and Governor Kazuo Ueda’s press conference will reveal the Bank’s policy stance. BoJ Governor Kazuo Ueda previously stated that rate hikes would continue if the economy and prices aligned with the Bank’s projections.\nA more aggressive BoJ rate path would support the bearish short- to medium-term outlook for USD/JPY. Despite the potential for a hawkish BoJ policy stance, the yen weakened against the dollar in response to the inflation data. USD/JPY briefly dropped to 158.385 before climbing to a high of 158.532 as the market’s focus shifted to the private sector PMIs.\nThe all-important S&P Global Japan Services PMI increased from 51.6 in December to 53.4 in January. Notably, the rate of job creation was the most marked since April 2019, while service providers increased their charges, suggesting higher consumer prices. The January PMI data will draw the BoJ’s attention, supporting a more hawkish stance, contrasting with the Fed’s dovish rate path.\nExpectations of BoJ rate hikes and Fed rate cuts reaffirm the bearish medium- to longer-term price projections.\nWhile the yen faces a potentially choppy session awaiting the BoJ’s monetary policy decision and press conference, US economic data will influence bets on a June Fed rate cut.\nEconomists forecast the S&P Global US Services PMI to increase from 52.5 in December to 52.9 in January.\nA higher headline PMI would indicate a pickup in economic momentum. The services sector contributes around 80% to the US GDP. However, traders should consider the employment and prices sub-components. Crucially, falling prices would support a more dovish Fed rate path, given that services sector inflation remains the key driver for headline and underlying inflation. A more dovish Fed rate path would weaken the US dollar, sending USD/JPY lower.\nOther economic indicators include finalized consumer sentiment numbers. Barring a marked deviation from the preliminary figures, the Services PMI figures are likely to be key for USD/JPY.\nDespite ongoing concerns about Japan’s fiscal spending and debt-to-GDP, the expectation of multiple BoJ rate hikes and a new Fed Chair in favor of lower interest rates suggests a narrower US-Japan rate differential. Th"
            },
            {
                "title": "USD/JPY retreats amid US Dollar weakness, BoJ decision and Japan CPI in focus - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-jpy-retreats-amid-us-dollar-weakness-boj-decision-and-japan-cpi-in-focus-202601221840",
                "body": "USD/JPY retreats amid US Dollar weakness, BoJ decision and Japan CPI in focus\n- USD/JPY retreats from one-week highs as broad US Dollar weakness caps upside.\n- US data failed to lift the Dollar despite solid growth and steady inflation signals.\n- Focus shifts to Friday’s BoJ rate decision, Japan CPI, along with US PMI and UoM data.\nThe Japanese Yen (JPY) regains some ground against the US Dollar (USD) on Thursday, with USD/JPY edging lower amid broad weakness in the Greenback. At the time of writing, the pair is trading around 158.30, retreating from one-week highs touched earlier in the European session.\nHowever, the pair lacks follow-through selling, as traders refrain from placing aggressive bets ahead of the Bank of Japan’s (BoJ) interest rate decision due on Friday. Markets widely expect the central bank to keep rates unchanged at 0.75%. Focus will instead shift to the post-meeting statement and press conference for clues on the timing and pace of the next potential hike.\nAt the same time, sentiment toward the Yen remains fragile amid growing fiscal concerns in Japan. Prime Minister Sanae Takaichi is preparing to dissolve parliament on Friday and call a snap election for February 8.\nMarkets are worried that a snap election could open the door to more government spending under Prime Minister Takaichi’s pro-stimulus agenda, reviving concerns about Japan’s already heavy public debt burden. This could further complicate and slow the BoJ’s cautious path toward policy normalization.\nJapan’s National Consumer Price Index (CPI) data is also due on Friday, adding another layer of risk that could influence expectations around the BoJ’s monetary policy path.\nIn the United States, steady inflation and solid growth data did little to support the US Dollar. Core Personal Consumption Expenditures (PCE) for Q3 rose 2.9% QoQ, in line with expectations and unchanged from the previous quarter.\nAt the same time, the advance estimate showed the US economy expanding at an annualized pace of 4.4% in Q3, beating forecasts of 4.3% and accelerating from 3.8% in Q2.\nInitial Jobless Claims rose slightly to 200K from last week’s revised 199K, but came in well below expectations of 212K.\nLooking ahead to Friday, the US economic calendar features the preliminary S&P Global Purchasing Managers Index (PMI) surveys and the University of Michigan (UoM) Consumer Sentiment data.\nJapanese Yen Price Today\nThe table below shows the percentage change of Japanese Yen (JPY) against listed major currencies today. Japanese Yen was the strongest against the US Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Japanese Yen from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent JPY (base)/USD (quote).\nAuthor\nVishal Chaturvedi\nFXStreet\nI am a macro-focused research analyst with over four years of experience covering forex and commodities market. I enjoy breaking down complex economic trends and turning them into clear, actionable insights that help traders stay ahead of the curve."
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0062",
            "open": "1.3830",
            "close": "1.3784",
            "high": "1.3844",
            "low": "1.3782"
        },
        "market_summary": "### USD/CAD Market Briefing\n\n* **Key Drivers:** The Canadian Dollar is drawing strength from **higher crude Oil prices**, while the US Dollar finds some support from **easing geopolitical tensions**. \n* **Price Action:** USD/CAD remains under pressure, hovering near the **1.3830** area, as the pair is biased lower due to **firmer Oil prices** and a **resilient Canadian Dollar**.\n* **Technical Outlook:** Immediate resistance is near **1.3880**, with support at **1.3750**, and a stop above **1.3950**. The **50-day moving average** is also a key level to watch.\n\n---\n**Overall Sentiment:** Bearish",
        "source_articles": [
            {
                "title": "USD/CAD remains below 1.3800 as Oil prices pares recent losses - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-cad-remains-below-13800-as-oil-prices-pares-recent-losses-202601230302",
                "body": "USD/CAD remains below 1.3800 as Oil prices pares recent losses\n- USD/CAD may find support as Oil prices rebound after posting losses of over 2% in the prior session.\n- WTI rises as Saudi Aramco’s CEO downplays oversupply, citing resilient emerging-market demand.\n- US GDP annualized grew 4.4% in Q3 2025, exceeding expectations and the prior 4.3% reading.\nUSD/CAD holds ground after four days of losses, trading around 1.3790 during the Asian hours on Friday. However, the pair may further weaken as the Canadian Dollar (CAD) could receive support amid higher Oil prices, given Canada’s status as the largest crude exporter to the United States (US).\nWest Texas Intermediate (WTI) Oil price advances after registering over 2% losses in the previous session, trading around $59.60 per barrel at the time of writing. Crude Oil prices gain as markets evaluate the global oil outlook.\nSaudi Aramco’s CEO eased oversupply concerns, highlighting resilient demand in emerging economies, with global consumption hitting record highs last year and set to increase further in 2026.\nThe USD/CAD pair also faces challenges as the US Dollar (USD) struggles on risk aversion, which could be attributed to the geopolitical tensions. US President Donald Trump first warned several European nations opposing his Greenland takeover plan of fresh tariffs, but later reversed his stance after reaching a framework agreement with NATO for a possible future deal.\nHowever, the US-NATO deal remains unclear, with markets speculating it may include mineral rights and missile deployments. Meanwhile, market analysts warn that Europe could use its large holdings of US assets as leverage, after a Danish pension fund said it would divest from US Treasuries, heightening market uncertainty.\nThe US Gross Domestic Product Annualized grew at 4.4% in the third quarter of 2025, slightly more than expected and the previous reading of 4.3%. Additionally, the US Initial Jobless Claims came in at 200K for the week ending January 17. The latest print came in short of initial estimates (212K) and was a tad higher than the previous week’s 199K (revised from 198K).\nCanadian Dollar FAQs\nThe key factors driving the Canadian Dollar (CAD) are the level of interest rates set by the Bank of Canada (BoC), the price of Oil, Canada’s largest export, the health of its economy, inflation and the Trade Balance, which is the difference between the value of Canada’s exports versus its imports. Other factors include market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – with risk-on being CAD-positive. As its largest trading partner, the health of the US economy is also a key factor influencing the Canadian Dollar.\nThe Bank of Canada (BoC) has a significant influence on the Canadian Dollar by setting the level of interest rates that banks can lend to one another. This influences the level of interest rates for everyone. The main goal of the BoC is to maintain inflation at 1-3% by adjusting interest rates up or down. Relatively higher interest rates tend to be positive for the CAD. The Bank of Canada can also use quantitative easing and tightening to influence credit conditions, with the former CAD-negative and the latter CAD-positive.\nThe price of Oil is a key factor impacting the value of the Canadian Dollar. Petroleum is Canada’s biggest export, so Oil price tends to have an immediate impact on the CAD value. Generally, if Oil price rises CAD also goes up, as aggregate demand for the currency increases. The opposite is the case if the price of Oil falls. Higher Oil prices also tend to result in a greater likelihood of a positive Trade Balance, which is also supportive of the CAD.\nWhile inflation had always traditionally been thought of as a negative factor for a currency since it lowers the value of money, the opposite has actually been the case in modern times with the relaxation of cross-border capital controls. Higher inflation tends to lead cent"
            },
            {
                "title": "USD / CAD - Canadian dollar steady inching higher - Baystreet.ca",
                "source": "Baystreet.ca",
                "url": "https://www.baystreet.ca/articles/forex_trader.aspx",
                "body": "- Trump backs away from Greenland invasion\n- Risk sentiment improves ahead of US data.\n- US dollar opens lower across the board.\nUSDCAD open: 1.3824, overnight range 1.3815-1.3845, close 1.3835, WTI 59.89, Gold 4829.06\nThe Canadian dollar remained firm overnight, but it consolidated its recent gains. Traders have shifted their focus from geopolitical risks back to US data and its implication for Fed monetary policy. Canadian economic numbers are an after-thought.\nWTI oil prices fell inside a 59.49-60.81 band with prices weighed down by rising US crude inventories. API said that crude stocks increased by 3.04 million barrels last week.\nThe US dollar is weaker versus yesterday’s close, Treasury yields have slipped, and gold has pulled back modestly while holding comfortably above $4800.00. With the Davos spectacle fading into the rear-view mirror, markets are refocusing on a different race altogether: the jockeying around the next Fed Chair.\nGreenland briefly returned to centre stage before exiting just as quickly. Trump initially floated the idea of “title and ownership” during his Davos appearance, only to reverse course hours later, ruling out military options and claiming a vague “framework of a deal.” No details were provided, and notably, Greenland itself does not appear to have been part of the conversation.\nEquity markets took the de-escalation in stride. Asian indices rebounded as geopolitical noise diminished, with Australia’s ASX 200 up 0.75%, Japan’s Topix gaining 0.74%, and Hong Kong’s Hang Seng edging 0.1% higher.\nAs of 7:45 am, the German DAX was up 1.21%, the CAC-40 had added 1.10%, and the FTSE 100 has risen 0.45%. S&P 500 futures were ahead by 0.54%, the US Dollar Index sat at 98.68 and, the 10-year Treasury yield is 4.26%.\nEURUSD traded in a 1.1670–1.1698 range and continues to struggle to regain traction following the Greenland and tariff-related turbulence. The decision to shelve tariffs on countries backing Greenland removed one headwind, but traders remain cautious ahead of high-profile US data releases, particularly given lingering doubts about data reliability.\nGBPUSD caught a bid in a 1.3402–1.3458 range and firmed after Trump abandoned plans for a punitive 10% tariff slated for February 1. The UK’s alignment with other Greenland supporters initially drew attention, but focus has since shifted back to macro data and Fed expectations.\nUSDJPY rose in a 158.18–158.89 range as defensive yen positions were pared back following Trump’s retreat from military rhetoric. The easing in geopolitical anxiety encouraged risk rebalancing, even as Japanese export growth disappointed, rising 5.1% year-on-year versus expectations of 6.1%.\nAUDUSD rallied in a 0.6754–0.6812 range as the rally extended to levels not seen since October 2024. The move was reinforced by a strong labour market report, with employment jumping by 65,200 in December and the jobless rate falling to 4.1% from 4.4%. The data has materially lifted expectations for an RBA rate hike as early as next month.\nToday’s US data which includes, weekly jobless claims, and core PCE price index.\n."
            },
            {
                "title": "USD/CAD Slips as Firmer Oil Prices Lift Loonie Despite Dollar Support - FXDailyReport.Com",
                "source": "FXDailyReport.Com",
                "url": "https://fxdailyreport.com/usd-cad-slips-as-firmer-oil-prices-lift-loonie-despite-dollar-support/",
                "body": "USD/CAD continues to trade on the back foot for a fourth straight session, hovering near the 1.3830 area during Asian trading on Thursday. The pair remains under pressure as the Canadian Dollar draws strength from higher crude Oil prices, reflecting Canada’s status as the largest Oil supplier to the United States. The improvement in commodity prices has helped the Loonie outperform, even as the US Dollar finds some underlying support from easing geopolitical tensions.\nWest Texas Intermediate (WTI) crude extends its recent recovery after four consecutive days of gains, holding close to $60.50 per barrel at the time of writing. The rebound in Oil prices has provided a tailwind for the Canadian Dollar, although upside momentum appears constrained. The International Energy Agency (IEA) recently reiterated that global Oil supply is set to outpace demand this year, even after a modest upward revision to demand growth. Adding to these concerns, industry data showed US crude inventories rose by roughly 3 million barrels last week, reinforcing fears of oversupply in the energy market.\nDespite these supply-side headwinds, Oil prices have been supported by a reduction in geopolitical risk. US President Donald Trump helped calm markets after ruling out the use of military force to acquire Greenland and signaling a willingness to step back from imposing tariffs on European nations opposing the plan. This easing of US–Europe tensions has improved overall risk sentiment, limiting downside risks to global energy demand and indirectly supporting Oil-linked currencies such as the Canadian Dollar.\nOn the US Dollar side, the Greenback has found modest support from the same geopolitical de-escalation, which has helped stabilize broader market sentiment. This has prevented a deeper sell-off in USD/CAD, even as the pair remains biased lower. Investors are now turning their attention to key US economic releases, including weekly Initial Jobless Claims, the annualized Gross Domestic Product (GDP) reading, and the Personal Consumption Expenditures (PCE) inflation report, all due later in the day.\nFrom a monetary policy perspective, Federal Reserve officials continue to signal patience. Policymakers have emphasized that there is little urgency to ease interest rates further without clear and sustained evidence that inflation is moving back toward the 2% target. Still, financial markets continue to price in around 50 basis points of rate cuts later this year, keeping some uncertainty around the US Dollar outlook.\nOverall, USD/CAD remains pressured by firm Oil prices and a resilient Canadian Dollar, while supportive US fundamentals and cautious Fed guidance help limit sharper downside moves.\nTrade Idea:\nSell USD/CAD on rallies toward 1.3880, targeting 1.3750, with a stop above 1.3950, as firm Oil prices continue to underpin the Canadian Dollar."
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "1.6030",
            "open": "212.4570",
            "close": "213.8440",
            "high": "213.9520",
            "low": "212.3490"
        },
        "market_summary": "### GBP/JPY Market Briefing\n\n* **Key Drivers:** The **Bank of Japan (BoJ)** has kept interest rates steady at **0.75%**, while the **UK's inflation rate** has risen to **3.4%**, potentially delaying rate cuts by the **Bank of England**.\n* **Price Action:** The GBP/JPY pair has surged to a new weekly high of **213.98**, with a **bullish momentum** driven by a strong **Pound Sterling** and a weak **Japanese Yen**.\n* **Technical Outlook:** Immediate resistance is at **214.29** and **215.00**, while support levels are at **212.04** and **210.71**. A breach of **214.50** could expose **215.00**, while a drop below **212.04** and **210.71** could signal a **bearish reversal**.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "GBP/JPY trades firmly near multi-year high while BoJ holds interest rates steady at 0.75% - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-trades-firmly-near-multi-year-high-while-boj-holds-interest-rates-steady-at-075-202601230318",
                "body": "GBP/JPY trades firmly near multi-year high while BoJ holds interest rates steady at 0.75%\n- GBP/JPY remains strong near 214.30 after the BoJ left rates unchanged at 0.75%.\n- Japan’s National CPI ex. Fresh Food decelerated to 2.4% in December, as expected.\n- Investors await UK Retail Sales and the flash S&P Global PMI data.\nThe GBP/JPY pair trades close to its multi-year high of 214.30 during Friday’s Asian trading session, while the Bank of Japan (BoJ) has kept interest rates steady at 0.75%. The BoJ was expected to leave interest rates unchanged after raising them by 25 basis points (bps) at its last policy meeting of 2025 and guided that monetary policy will remain on a gradual expansion path.\nGoing forward, the major driver of the JPY will be the government's fiscal decisions, which aim to boost domestic spending. Japan's Prime Minister (PM) Sanae Takaichi will also dissolve the parliament’s lower house to pave the way for a snap election during the day.\nEarlier in the day, Japan’s National Consumer Price Index (CPI) for December came in at 2.1% year-on-year (YoY), down from 2.9% in November. CPI data ex. Fresh Food, which is closely tracked by BoE officials, cooled down to 2.4% YoY, as expected, from the prior reading of 3%.\nMeanwhile, the Pound Sterling (GBP) trades broadly calm ahead of the release of United Kingdom (UK) Retail Sales data for December and the preliminary S&P Global Purchasing Managers’ Index (PMI) data for January.\nUK Retail Sales data, a key measure of consumer spending, is expected to have contracted steadily by 0.1% month-on-month (MoM). This would be the third straight decline in the consumer spending measure.\nOn the monetary policy front, market participants remain confident that the Bank of England (BoE) will remain on a gradual easing path, even as price pressures accelerated in December.\nBank of Japan FAQs\nThe Bank of Japan (BoJ) is the Japanese central bank, which sets monetary policy in the country. Its mandate is to issue banknotes and carry out currency and monetary control to ensure price stability, which means an inflation target of around 2%.\nThe Bank of Japan embarked in an ultra-loose monetary policy in 2013 in order to stimulate the economy and fuel inflation amid a low-inflationary environment. The bank’s policy is based on Quantitative and Qualitative Easing (QQE), or printing notes to buy assets such as government or corporate bonds to provide liquidity. In 2016, the bank doubled down on its strategy and further loosened policy by first introducing negative interest rates and then directly controlling the yield of its 10-year government bonds. In March 2024, the BoJ lifted interest rates, effectively retreating from the ultra-loose monetary policy stance.\nThe Bank’s massive stimulus caused the Yen to depreciate against its main currency peers. This process exacerbated in 2022 and 2023 due to an increasing policy divergence between the Bank of Japan and other main central banks, which opted to increase interest rates sharply to fight decades-high levels of inflation. The BoJ’s policy led to a widening differential with other currencies, dragging down the value of the Yen. This trend partly reversed in 2024, when the BoJ decided to abandon its ultra-loose policy stance.\nA weaker Yen and the spike in global energy prices led to an increase in Japanese inflation, which exceeded the BoJ’s 2% target. The prospect of rising salaries in the country – a key element fuelling inflation – also contributed to the move.\nAuthor\nSagar Dua\nFXStreet\nSagar Dua is associated with the financial markets from his college days. Along with pursuing post-graduation in Commerce in 2014, he started his markets training with chart analysis."
            },
            {
                "title": "As the Bank of Japan’s policy announcement nears, the GBP/JPY pair climbs to around 213.10 - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/as-the-bank-of-japans-policy-announcement-nears-the-gbp-jpy-pair-climbs-to-around-213-10/",
                "body": "The GBP/JPY pair has climbed near 213.10, up by 0.22%, as the Yen faces challenges. This movement precedes the Bank of Japan’s monetary policy announcement, which is generating focus across financial markets.\nThe Japanese Yen has been underperforming, especially against the Australian Dollar. Expectations are that the BoJ will maintain the interest rate at 0.75%, although there remains the potential for increases later this year.\nJapanese Political and Economic Developments\nJapan’s Prime Minister, Sanae Takaichi, plans to dissolve the lower house of parliament on 23 January. An early snap election aims to gain more seats to support the fiscal budget for the year. Additionally, Japan is looking at removing the consumption tax to potentially increase household spending, which could influence inflation.\nThe Pound trades cautiously amid concerns over accelerated inflation in the UK. The Consumer Price Index in the UK rose to 3.4% year-on-year in December, surpassing the anticipated 3.3%.\nLooking forward, the focus will be on UK Retail Sales data for December and upcoming PMI data scheduled for Friday. This data will be pivotal in anticipating the market’s direction and further economic policy decisions.\nWe are seeing GBP/JPY push towards 213.00, a level not seen in many years, fueled by a weak yen. The immediate focus is tomorrow’s Bank of Japan policy meeting, which coincides with a potential snap election announcement. This creates a highly uncertain environment for the Yen.\nPotential Volatility and Market Strategies\nThe political situation in Japan is a major source of volatility, especially with the proposal to cut the consumption tax to spur growth. Looking back at the anemic GDP growth of just 0.4% in the third quarter of 2025, we understand the government’s motive, but this fiscal stimulus would be highly inflationary. This puts the Bank of Japan in a difficult position and increases the chance of a sharp market reaction.\nMeanwhile, the Pound Sterling’s strength has a solid foundation based on recent data. The headline inflation figure for December 2025 coming in at 3.4% has reinforced our view that the Bank of England will delay any rate cuts. This contrasts sharply with the situation back in 2024 when markets were aggressively pricing in cuts.\nGiven the binary risks from Japan tomorrow, we see one-week implied volatility for GBP/JPY options surging above 15%, its highest level since the third quarter of 2025. Traders should consider strategies that benefit from a large price swing, such as long straddles, rather than taking a simple directional bet. This approach protects against being on the wrong side of a surprise announcement from either the government or the central bank."
            },
            {
                "title": "GBP/JPY Price Forecast: Surges to weekly high as Pound strengthens - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/amp/news/gbp-jpy-price-forecast-surges-to-weekly-high-as-pound-strengthens-202601222303",
                "body": "GBP/JPY Price Forecast: Surges to weekly high as Pound strengthens\n|- GBP/JPY hits 213.98, marking a new weekly high amid strong buying momentum.\n- Technical outlook remains bullish, with resistance at 214.29 and 215.00 in sight.\n- Bearish reversal possible if price drops below 212.04 and 210.71 support levels.\nThe GBP/JPY rallies to a new weekly high of 213.98, up by more than 1.10% in the week, as mixed economic data from the UK, pushed the British Pound higher. Fiscal concerns on PM Takaichi’s plan, undermined the Japanese Yen. The cross-pair trades at 213.85, up 0.58%.\nGBP/JPY Price Forecast: Technical outlook\nThe technical picture shows the GBP/JPY remains upward biased, even though after reaching a yearly peak of 214.29 on January 13 retreated towards the 211.00 mark. Since then, the pair consolidated within the 211.00 – 213.00 area, before buyers had cleared the top of the range attempting to challenge the current yearly high.\nFrom a momentum standpoint, buyers have the upper hand as shown by the Relative Strength index (RSI), which is approaching the overbought territory.\nIf GBP/JPY clears 214.00, the next resistance would be 214.29 ahead of testing 214.50. A breach of the latter will expose 215.00.\nFor a bearish reversal, the GBP/JPY needs to drop below the 20-day SMA at 212.04, followed by the break of January 19 with a swing low of 210.71. This would be the first signal that bears are gathering steam, yet the next cycle low is seen at 206.77, December 16, 2025, daily low.\nGBP/JPY Price Chart – Daily\nPound Sterling FAQs\nThe Pound Sterling (GBP) is the oldest currency in the world (886 AD) and the official currency of the United Kingdom. It is the fourth most traded unit for foreign exchange (FX) in the world, accounting for 12% of all transactions, averaging $630 billion a day, according to 2022 data. Its key trading pairs are GBP/USD, also known as ‘Cable’, which accounts for 11% of FX, GBP/JPY, or the ‘Dragon’ as it is known by traders (3%), and EUR/GBP (2%). The Pound Sterling is issued by the Bank of England (BoE).\nThe single most important factor influencing the value of the Pound Sterling is monetary policy decided by the Bank of England. The BoE bases its decisions on whether it has achieved its primary goal of “price stability” – a steady inflation rate of around 2%. Its primary tool for achieving this is the adjustment of interest rates. When inflation is too high, the BoE will try to rein it in by raising interest rates, making it more expensive for people and businesses to access credit. This is generally positive for GBP, as higher interest rates make the UK a more attractive place for global investors to park their money. When inflation falls too low it is a sign economic growth is slowing. In this scenario, the BoE will consider lowering interest rates to cheapen credit so businesses will borrow more to invest in growth-generating projects.\nData releases gauge the health of the economy and can impact the value of the Pound Sterling. Indicators such as GDP, Manufacturing and Services PMIs, and employment can all influence the direction of the GBP. A strong economy is good for Sterling. Not only does it attract more foreign investment but it may encourage the BoE to put up interest rates, which will directly strengthen GBP. Otherwise, if economic data is weak, the Pound Sterling is likely to fall.\nAnother significant data release for the Pound Sterling is the Trade Balance. This indicator measures the difference between what a country earns from its exports and what it spends on imports over a given period. If a country produces highly sought-after exports, its currency will benefit purely from the extra demand created from foreign buyers seeking to purchase these goods. Therefore, a positive net Trade Balance strengthens a currency and vice versa for a negative balance.\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on"
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "1,906.0000",
            "open": "90,172.5000",
            "close": "89,180.5000",
            "high": "90,315.5000",
            "low": "88,409.5000"
        },
        "market_summary": "### BTC/USD Market Briefing\n\n* **Key Drivers:** Thailand's regulatory push towards **bitcoin ETFs** and **crypto futures** in early 2026, potentially increasing institutional participation and **bullish momentum**.\n* **Price Action:** No significant price movements reported, but **$30,000** remains a key psychological level, with **$25,000** as a potential support level showing **neutral** sentiment.\n* **Technical Outlook:** Immediate resistance is near the 50-day moving average at **$28,000**, with support at **$25,000**, indicating a potential **consolidation** phase.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "SEC Gets $900K Judgments In Bitcoin Miner CEO's Fraud Suit - Law360",
                "source": "Law360",
                "url": "https://www.law360.com/articles/2433300/sec-gets-900k-judgments-in-bitcoin-miner-ceo-s-fraud-suit",
                "body": "SEC Gets $900K Judgments In Bitcoin Miner CEO's Fraud Suit\nLaw360 is on it, so you are, too.\nA Law360 subscription puts you at the center of fast-moving legal issues, trends and developments so you can act with speed and confidence. Over 200 articles are published daily across more than 60 topics, industries, practice areas and jurisdictions.\nA Law360 subscription includes features such as\n- Daily newsletters\n- Expert analysis\n- Mobile app\n- Advanced search\n- Judge information\n- Real-time alerts\n- 450K+ searchable archived articles\nAnd more!\nExperience Law360 today with a free 7-day trial.\nStart Free Trial\nAlready a subscriber? Click here to login"
            },
            {
                "title": "Thailand Finalizes Rules for Bitcoin ETFs and Crypto Futures in Early-2026 Push - Bitcoin Magazine",
                "source": "Bitcoin Magazine",
                "url": "https://bitcoinmagazine.com/news/thailand-finalizes-rules-for-bitcoin-etfs",
                "body": "Thailand is moving decisively to cement its position as one of Asia’s most crypto-friendly financial centers, with regulators finalizing new rules for bitcoin and crypto exchange-traded funds (ETFs), futures trading, and tokenized investment products in early 2026.\nThe country’s Securities and Exchange Commission (SEC) confirmed this week that it is preparing comprehensive regulatory guidelines that would allow crypto ETFs to be formally established, crypto futures to trade on the Thailand Futures Exchange (TFEX), and digital assets to be recognized as an official asset class under existing derivatives law.\nSEC Deputy Secretary-General Jomkwan Kongsakul said the new framework is designed to expand access to digital assets while addressing security and custody risks that have historically deterred institutional investors.\n“A key advantage of crypto ETFs is ease of access,” Kongsakul said, according to local reports. “They eliminate concerns over hacking and wallet security, which has been a major barrier for many investors.”\nBitcoin and crypto ETFs are moving closer to market\nThailand’s SEC board has already approved crypto ETFs in principle, with regulators now finalizing operational rules covering custody, liquidity, and cooperation between asset managers and licensed digital asset exchanges.\nThailand approved its first spot Bitcoin ETF in June 2024, initially restricting participation to institutional investors. By October 2025, the regulator signaled plans to expand offerings beyond bitcoin to include other cryptocurrencies, such as ether, potentially in the form of diversified crypto “basket” products.\nUnder the proposed framework, investors would be allowed to allocate up to 4–5% of diversified portfolios to digital assets—an approach aimed at balancing innovation with risk management.\nOnce approved, domestically listed crypto ETFs could trade on the Stock Exchange of Thailand, offering local exposure without requiring investors to directly hold or manage cryptocurrencies.\nAlongside ETFs, the SEC is advancing plans to launch crypto futures trading on TFEX under the Futures Trading Act. Regulators also intend to formally recognize digital assets as an underlying asset class under the Derivatives Act, providing a clearer legal foundation for crypto-linked derivatives.\nTo support liquidity and price stability, the SEC plans to introduce market-making mechanisms in 2026. Potential market makers could include financial institutions, licensed digital asset exchanges, corporations, and entities holding cryptocurrencies on their balance sheets.\nThe futures market is expected to provide investors with hedging tools and more advanced risk management options, while expanding institutional participation in Thailand’s digital asset markets.\nThailand’s recent crypto incentives\nThailand’s regulatory push extends beyond ETFs and derivatives. The SEC is also developing rules for tokenized real-world assets (RWAs), including tokenized bonds and other securities that could be issued and traded on blockchain infrastructure.\nThese efforts align with broader global trends in asset tokenization and could eventually include baht-backed stablecoins. In 2025, Thailand approved U.S. dollar stablecoins for local trading, marking another step toward regulated digital finance.\nOn the tax front, Thailand eliminated capital gains tax on crypto trading from January 1, 2025, through December 31, 2029."
            },
            {
                "title": "Thailand Moves Toward Bitcoin ETFs and Futures in 2026 - Bitbo",
                "source": "Bitbo",
                "url": "https://bitbo.io/news/thailand-bitcoin-etf-futures/",
                "body": "Thailand is moving to broaden regulated access to bitcoin through new ETF and derivatives rules slated for early 2026.\nTop Tools & Picks\nExchanges Best Sites to Buy Bitcoin (USA) › Charts 100+ Free Bitcoin Charts › Cold Storage Find Top BTC Cold Storage ›ETF rules in early 2026\nThailand’s Securities and Exchange Commission (SEC) said it is preparing regulatory guidelines for the establishment of exchange-traded funds that give investors exposure to assets like bitcoin without managing self-custody.\nSEC Deputy Secretary-General Jomkwan Kongsakul said Thailand plans to:\n“Issue regulatory guidelines for the establishment of crypto ETFs early this year.”\nThailand approved its first spot bitcoin ETF in June 2024, initially limited to institutional investors.\nBy October 2025, the SEC said it planned to expand offerings beyond bitcoin to include other assets in a “basket” structure.\nUnder the updated framework, investors may allocate up to 5% of diversified portfolios to digital assets.\nFutures trading on TFEX\nAlongside ETFs, the Thai SEC is rolling out rules for bitcoin-linked futures trading on the Thailand Futures Exchange (TFEX), using existing infrastructure under the Futures Trading Act.\nThe Thai SEC also plans to recognize digital assets as an official asset class under the Derivatives Act.\nTop Tools & Picks\nHARDWARE WALLETS View top BTC hardware wallets › IRA Top IRAs for Bitcoin (control your keys) › CARDS View the top crypto credit & debit cards ›Tokenization and tax incentives\nThailand is advancing rules for tokenized bonds and other real-world assets, and officials have also discussed the possibility of baht-backed stablecoins.\nThe country removed capital gains tax on digital asset trades from Jan. 1, 2025, through Dec. 31, 2029.\nOfficials have also stepped up enforcement against unlicensed financial influencers and tightened credential requirements for investment advice."
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "139.5500",
            "open": "3,028.2600",
            "close": "2,940.8000",
            "high": "3,041.1500",
            "low": "2,901.6000"
        },
        "market_summary": "### ETH/USD Market Briefing\n\n* **Key Drivers:** Decrease in **SEC cryptocurrency enforcement actions** by **60%** in 2025, and **Ethereum's record network activity** driven by **low transaction fees** and **malicious actors**.\n* **Price Action:** Currently trading at **$2,960.55** with a **24.72%** decline in the **90-day price**, indicating **significant market volatility**.\n* **Technical Outlook:** Immediate support is near the **$2,800** level, with resistance at **$3,200**, as the market reacts to **regulatory shifts** and **network activity**.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "The Ethereum Paradox: Activity at an All-Time High, Fees at Rock-Bottom—What’s Really Going On Behind the Scenes? - 深潮TechFlow",
                "source": "深潮TechFlow",
                "url": "https://www.techflowpost.com/en-US/article/30067",
                "body": "The Ethereum Paradox: Activity at an All-Time High, Fees at Rock-Bottom—What’s Really Going On Behind the Scenes?\nTechFlow Selected TechFlow Selected\nThe Ethereum Paradox: Acti vity at an All-Time High,…\nDespite record-breaking activity seemingly signaling Ethereum's rise, on-chain data shows that this transaction activity has not created real value for the network.\nAuthor: Oluwapelumi Adejumo\nTranslation: Luffy, Foresight News\nEthereum's current daily network growth metrics have reached an all-time high. On the surface, this surge in statistics marks a significant return of user activity.\nAccording to Token Terminal data, Ethereum’s mainnet processed 2.9 million transactions over the past week, setting a new historical record.\nMeanwhile, the number of daily active addresses has also surged dramatically, increasing from around 600,000 in late December to approximately 1.3 million.\nCrucially, this explosive increase in throughput is occurring while transaction costs remain extremely low. Despite hitting record-high transaction demand, average fees have consistently stayed within the $0.1 to $0.2 range.\nOn-chain activity on Ethereum. Data source: Token Terminal\nFor a network like Ethereum—where fees soared to $50–$200 during the 2021–2022 NFT boom—this shift represents a fundamental change in transaction accessibility.\nHowever, analysis shows that this growth is not entirely organic. While surface-level indicators may suggest a bull market recovery, security researchers warn that much of the network traffic is actually driven by malicious actors.\nThese attackers are leveraging Ethereum’s drastically reduced fees to launch industrial-scale “address poisoning” campaigns, using automated scam patterns disguised as legitimate transactions to precisely defraud users.\nThe Context of Network Scaling\nTo understand this sudden spike in transaction volume, one must examine recent structural changes to the Ethereum protocol. For years, although powerful, Ethereum’s network fees were prohibitively expensive for most users.\nLeon Waidmann, Research Lead at the Onchain Foundation, noted that since entering the crypto industry, Ethereum mainnet fees have always been exorbitantly high for ordinary users.\nHe stated that Ethereum was not only too costly for retail participants but also too expensive for building consumer-facing applications.\nThis began to change about a year ago, when the Ethereum development team implemented systematic scaling optimizations while striving to maintain decentralization and security.\nA series of protocol upgrades advanced Ethereum’s scalability roadmap, with three core upgrades in particular.\nThe first was the Pectra upgrade in May 2025, which increased the per-block target blob count from 3 to 6 and the maximum from 6 to 9, effectively doubling the expected processing capacity for blob data.\nThen, in December 2025, Ethereum completed the Fusaka upgrade, introducing Peer Data Availability Sampling (PeerDAS). This technology allows validators to verify blob availability via sampling rather than downloading full datasets, further enhancing network throughput while keeping node operation requirements reasonable.\nThe latest upgrade was the Blob-only parameter fork in January 2026, raising the per-block target blob count from 10 to 14 and the maximum from 14 to 21. These upgrades collectively aim to unlock significantly higher network processing capacity.\nThe economic impact was immediate: Ethereum mainnet fees dropped sharply, making simple transactions affordable again.\nLeon Waidmann pointed out that large-scale development directly on Ethereum’s mainnet has now become feasible, prompting a resurgence of prediction markets, real-world asset trading, and payment services returning to the mainnet.\nAt the same time, stablecoin transfer volumes on Ethereum reached approximately $8 trillion in the last quarter of last year.\nEthereum’s Record Activity Lacks Underlying Value\nDespite record-breaking activity appearing to signa"
            },
            {
                "title": "SEC Cryptocurrency Enforcement Actions Drop by 60% in 2025 - MEXC",
                "source": "MEXC",
                "url": "https://www.mexc.com/news/538349",
                "body": "- SEC actions fell 60% in 2025 under new leadership.\n- Shift from broad registration to specific fraud cases.\n- Monetary penalties reduced significantly from previous year.\nIn 2025, under the leadership of Chairman Paul Atkins, the U.S. Securities and Exchange Commission drastically reduced its cryptocurrency-related enforcement actions, marking a significant policy shift.\nThis change highlights a regulatory pivot towards addressing specific investor harm, potentially impacting future digital asset compliance strategies significantly.\nFraud-Focused Strategy Cuts SEC Actions by 60% in 2025\nUnder Paul Atkins, the SEC’s approach in 2025 shows a strategic reduction in enforcement actions. New leadership placed emphasis on addressing fraud and investor harm, resulting in only 13 crypto-related cases that primarily focused on these aspects. The SEC’s broader shift away from large-scale registration enforcement is evident, with dismissals of noteworthy cases involving major platforms like Coinbase and Binance, marking significant precedents in regulatory actions. Such decisions suggest a strategic move towards rule-making, significantly altering the landscape and reducing fines by $142 million compared to the previous year.\nMarket reactions to these regulatory shifts appear mixed. While some platforms welcomed their case dismissals, the absence of direct statements from key figures such as Paul Atkins indicates a cautious stance. Commissioners like Hester Peirce, however, have driven the creation of a Crypto Task Force, reinforcing efforts to create a clear regulatory framework.\n2025 SEC Shift Lowers Fines, Market Impact Analyzed\nDid you know? The SEC’s 2025 shift to focus primarily on fraud cases marked the lowest level of enforcement actions since 2017, having initiated 33 actions the previous year. This change suggests a departure from the “regulation-by-enforcement” strategies of earlier years.\nAs of January 23, 2026, Ethereum (ETH) is trading at $2,960.55 with a market cap of $357.32 billion. CoinMarketCap reports a 24-hour volume of $21.04 billion, a 39.95% decrease. Ethereum’s 90-day price has declined by 24.72%, indicating significant market volatility and challenges amid evolving regulatory landscapes.\nEthereum(ETH), daily chart, screenshot on CoinMarketCap at 02:08 UTC on January 23, 2026. Source: CoinMarketCapInsights from Coincu research team indicate that Atkins’ leadership may drive regulatory structures based on comprehensive frameworks rather than enforcement-led approaches, aligning with broader market stability trends observed historically. Regulatory adjustments may continue into 2026, with potential impacts on market dynamics.\nSource: https://coincu.com/news/sec-crypto-actions-decrease-2025/"
            },
            {
                "title": "The Future of DeFi: Why Decentralized Finance Keeps Expanding Quietly - CryptoQuant",
                "source": "CryptoQuant",
                "url": "https://cryptoquant.com/insights/quicktake/6971ff1fa662164c84864f71",
                "body": "Search\nCommunity\nCharts\nInsights\nAlerts\nResources\nFree ETH\nNew Analytics\nSearch For\nSummary\nChart\nDashboard\nQuery\nPro Chart\nQuicktake\nResearch\nCreator\nView all results\n↵\nNavigate\n↓\n↑\nOpen in new tab\nctrl ↵\nClose\nEsc\nCookie Consent\nBy continuing to browse or by clicking ‘Accept’, you agree to the storing of cookies on your device to enhance your site experience and for analytical purposes. To learn more about how we use the cookies, please see our\nPrivacy Policy\n.\nAccept"
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "4.9244",
            "open": "130.8648",
            "close": "128.2200",
            "high": "131.5644",
            "low": "126.6400"
        },
        "market_summary": "### SOL/USD Market Briefing\n\n* **Key Drivers:** Growing adoption and **partnerships**, such as Hanwha Asset Management's collaboration with the Solana Foundation, are expected to drive **bullish momentum**. The Solana ecosystem's speed, lower transaction fees, and interest from projects and companies also contribute to its popularity.\n* **Price Action:** Currently trading at **$128.36**, showing a **-1.33%** decrease, indicating **bearish** sentiment in the short term. The price broke below the key psychological level of **$130**, which may lead to further **downward pressure**.\n* **Technical Outlook:** Immediate support is near the 50-day moving average at **$120**, with resistance at **$140**. A break above **$140** could lead to a **reversal** of the current **bearish trend**.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "Top Solana Projects with Potential [2026] - Changelly",
                "source": "Changelly",
                "url": "https://changelly.com/blog/top-solana-projects/",
                "body": "Solana has consistently remained among the most popular blockchains. It keeps attracting both users and developers thanks to its speed, lower transaction fees compared to Ethereum and Bitcoin, and overall interest from projects and companies. Today, we’re taking a look at Solana projects with the highest potential for 2026.\nBefore we begin, take a moment to learn What Is Solana.\nTable of Contents\nThe Solana Blockchain’s Liquidity & Trading Layer\nThe liquidity and trading layer on Solana is where tokens are bought, sold, and swapped. It includes decentralized exchanges (DEXs), liquidity pools, and trading tools that let users trade assets quickly and at low cost. Because Solana processes transactions fast and with minimal fees, this layer supports smooth trading, deep liquidity, and real-time price discovery for projects built on the network.\nJupiter (JUP)\nJupiter is a leading Solana aggregator that gathers information across multiple decentralized exchanges in one place. Jupiter users get access to the most profitable trading prices and instead of having to check different platforms, they can swap tokens with low fees and minimal slippage in a single interface. Beyond simple swaps, Jupiter also offers advanced tools like limit orders, dollar-cost averaging, perpetual futures, and lending, making it a full-featured DeFi hub. Its native token, JUP, is used for governance, letting the community vote on upgrades and treasury decisions. Jupiter is interesting for users and investors alike, because it combines fast Solana performance with deep liquidity, active community participation, and a growing range of financial tools.\nCheck out our Jupiter (JUP) price prediction.\nDrift (DRIFT)\nDrift is a decentralized exchange on Solana that focuses on fast, on-chain derivatives trading. This means you can buy contracts that derive their value from an underlying asset, such as a cryptocurrency. Drift lets users trade perpetual futures and spot crypto assets while using different tokens—not just stablecoins—as collateral. Solana’s high throughput and low fees guarantee that trades execute quickly with minimal slippage.\nDrift combines an order book with an automated market maker, so you get liquidity and efficient pricing. The platform’s native token, DRIFT, is a governance token that also offers staking rewards and fee discounts. For its users, Drift provides advanced trading tools with low transaction costs. For investors, it stands out as one of the top Solana projects driving steady growth in the decentralized space.\nCheck out our Drift (DRIFT) price prediction.\nKamino Finance (KMNO)\nKamino is a Solana-based protocol that offers automated lending and borrowing. It also provides liquidity solutions and tokenized real-world assets, with the plans to move into institutional finance.\nKamino makes DeFi easier to use for both everyday users and institutions. By automating strategies like yield farming and liquidity provision, it allows users to earn passive returns through simple vaults instead of managing trades themselves. Kamino also offers lending tools, including fixed-rate loans and borrowing against digital assets and tokenized real-world assets. Its native token, KMNO, supports decentralized governance and staking rewards. Kamino offers an intuitive interface and low fees for users. For investors, it stands out among the highest-ranked Solana projects by combining retail DeFi with enterprise-grade solutions in a growing ecosystem.\nHow to Get Free Crypto\nSimple tricks to build a profitable portfolio at zero cost\nYield & Staking in the Solana Ecosystem\nYield & staking is a core layer of the Solana ecosystem focused on helping users earn passive income from their digital assets. These protocols let users lock tokens into liquidity pools, staking contracts, or yield farming strategies, in exchange for staking rewards. They benefit from Solana’s high performance and throughput, making frequent rewards practical.\nJito (JTO)\nJito is a protocol o"
            },
            {
                "title": "Hanwha Asset partners with Solana Foundation to expand digital asset push - koreaherald.com",
                "source": "koreaherald.com",
                "url": "https://www.koreaherald.com/article/10661410",
                "body": "Asset manager plans Solana-linked ETPs, custody standards as Korea emerges as key crypto market\nHanwha Asset Management has signed a memorandum of understanding with the Solana Foundation to expand its digital asset ecosystem and deepen cooperation with a leading global blockchain platform, the company said Friday.\nUnder the agreement, Hanwha will provide education on Solana’s development tools and ecosystem, pursue the launch of Solana-based exchange-traded products, and publish custody guidelines tailored to Solana-linked assets. The partnership aims to strengthen Hanwha’s position in Korea’s fast-evolving digital asset market.\n“Korea is emerging as a key market for global crypto adoption, where regulatory clarity, institutional infrastructure and world-class developer talent converge,” Lily Liu, president of the Solana Foundation, said in a statement.\n\"This MOU bridges the trusted infrastructure of a leading conglomerate with the innovation of the Solana ecosystem, enabling digital asset innovation to scale globally through Hanwha’s international network.\"\nThe Solana Foundation is a nonprofit organization focused on decentralization, adoption and security of the Solana network, a high-performance blockchain used for payments, capital markets infrastructure and decentralized applications.\nIn the US, Solana exchange-traded funds began trading in late 2025, starting with the launch of the Bitwise Solana Staking ETF in October. Eight Solana-linked ETFs are now listed on the New York Stock Exchange, with combined assets under management surpassing $1 billion within just over two months of their debut.\nHanwha has positioned itself as an early mover in Korea’s asset management industry on digital assets. Between 2020 and 2021, it became the first domestic asset manager to operate a dedicated digital asset team and publish related research. Last year, the firm established a Digital Asset Business Team under the chief marketing officer to track global crypto market trends and blockchain technology.\n“I met with President Liu to discuss strategic cooperation to expand the Solana ecosystem, which led to this agreement,” said Choi Young-jin, Hanwha Asset Management’s chief marketing officer. “Through this partnership, we aim to take a leading role in building digital income-oriented businesses leveraging the Solana ecosystem.”\njwc@heraldcorp.com"
            },
            {
                "title": "News Explorer — DeFi Development Corp. Faces Insider Trading Allegations After Solana Meme Coin Trader Turns $4K to $1M - Decrypt",
                "source": "Decrypt",
                "url": "https://decrypt.co/news-explorer?pinned=1290540&title=defi-development-corp-faces-insider-trading-allegations-after-solana-meme-coin-trader-turns-4k-to-1m",
                "body": "Coin Prices\nBTC\n$89,440.00\n-0.55%ETH\n$2,962.22\n-1.83%BNB\n$889.48\n-0.10%XRP\n$1.91\n-2.22%USDC\n$0.999604\n-0.01%SOL\n$128.36\n-1.33%TRX\n$0.308875\n2.78%STETH\n$2,964.56\n-1.61%DOGE\n$0.125092\n-1.36%FIGR_HELOC\n$1.045\n1.11%ADA\n$0.360442\n-1.48%WSTETH\n$3,632.47\n-1.72%BCH\n$594.69\n0.70%WBT\n$54.67\n0.79%WBTC\n$89,250.00\n-0.45%WBETH\n$3,225.03\n-1.67%WEETH\n$3,220.93\n-1.63%XMR\n$524.35\n2.69%USDS\n$0.999245\n-0.03%BSC-USD\n$0.998613\n-0.03%LINK\n$12.33\n-1.18%LEO\n$8.89\n-0.23%CBBTC\n$89,498.00\n-0.41%XLM\n$0.211403\n-1.47%WETH\n$2,964.96\n-1.64%USDE\n$0.998884\n-0.00%ZEC\n$363.93\n2.37%SUI\n$1.50\n-1.33%CC\n$0.142346\n-4.51%AVAX\n$12.27\n-1.93%LTC\n$68.89\n0.39%HYPE\n$21.70\n-0.15%HBAR\n$0.109675\n-0.53%WLFI\n$0.171872\n2.04%SHIB\n$0.00000794\n-0.27%USDT0\n$0.998501\n-0.01%SUSDS\n$1.081\n-0.13%SUSDE\n$1.22\n-0.01%TON\n$1.53\n-2.32%PYUSD\n$0.999605\n-0.00%CRO\n$0.091763\n-0.48%RAIN\n$0.01008554\n10.95%USD1\n$1.001\n0.18%DOT\n$1.96\n0.94%UNI\n$4.87\n-1.56%MNT\n$0.888668\n-0.70%M\n$1.60\n-0.63%XAUT\n$4,959.14\n3.27%BGB\n$3.66\n-0.13%AAVE\n$158.50\n-1.12%TAO\n$241.64\n-2.06%OKB\n$103.33\n-1.36%USDF\n$0.996456\n0.02%PEPE\n$0.00000502\n-2.94%ICP\n$3.66\n0.72%PAXG\n$4,974.95\n3.14%NEAR\n$1.53\n-1.75%JITOSOL\n$161.24\n-1.29%ETC\n$11.70\n-0.06%WETH\n$2,964.99\n-1.58%ONDO\n$0.350712\n2.10%BUIDL\n$1.00\n0.00%HTX\n$0.00000182\n2.81%USDG\n$0.999581\n-0.01%USYC\n$1.11\n0.00%RSETH\n$3,148.78\n-1.74%SOL\n$128.39\n-1.31%JLP\n$4.62\n-0.71%PI\n$0.18488\n0.69%ASTER\n$0.624061\n0.47%SKY\n$0.065791\n0.88%PUMP\n$0.00250106\n-4.94%ENA\n$0.178766\n-0.13%KCS\n$10.74\n-0.07%RLUSD\n$0.999702\n0.01%BNSOL\n$140.59\n-1.29%POL\n$0.132599\n-2.92%WLD\n$0.478607\n-0.48%WBNB\n$889.48\n0.04%BFUSD\n$0.997857\n-0.08%HASH\n$0.02419236\n-2.66%USDC\n$0.999577\n-0.01%SYRUPUSDC\n$1.15\n0.01%RETH\n$3,427.99\n-1.63%APT\n$1.58\n0.84%QNT\n$80.51\n1.08%ATOM\n$2.38\n-1.03%GT\n$9.95\n-0.74%MYX\n$5.88\n-0.42%USDD\n$0.999096\n-0.01%ALGO\n$0.122088\n2.03%KAS\n$0.03992874\n-1.39%RENDER\n$2.06\n0.70%ARB\n$0.179793\n-2.63%FIL\n$1.35\n0.01%FBTC\n$90,407.00\n0.71%RIVER\n$49.51\n4.55%TRUMP\n$4.86\n-1.20%LBTC\n$89,242.00\n-0.81%NIGHT\n$0.056715\n-4.04%NEXO\n$0.93431\n0.17%VET\n$0.01030423\n-1.93%FLR\n$0.01033295\n-0.86%USDTB\n$0.998605\n-0.06%METH\n$3,216.77\n-1.34%USDC.E\n$0.999605\n-0.02%IP\n$2.38\n-8.16%DASH\n$66.13\n0.60%USTB\n$10.97\n0.01%SOLVBTC\n$89,319.00\n-0.33%LSETH\n$3,167.83\n-1.98%BONK\n$0.00000917\n-0.45%XDC\n$0.04108203\n1.33%SYRUPUSDT\n$1.11\n0.05%WM\n$0.999028\n-0.01%OUSG\n$114.05\n0.01%JAAA\n$1.023\n-0.02%WBTC\n$89,272.00\n-0.42%SEI\n$0.10769\n-0.76%USDY\n$1.10\n0.45%CLBTC\n$89,736.00\n-0.35%OSETH\n$3,152.14\n-1.65%EZETH\n$3,169.45\n-1.69%WETH\n$2,965.77\n-1.65%MORPHO\n$1.19\n-1.07%CAKE\n$1.94\n-0.50%BDX\n$0.085009\n-2.13%USDAI\n$0.999549\n-0.00%JUPSOL\n$149.35\n-1.39%DAI\n$0.999512\n-0.02%PENGU\n$0.01002083\n-1.86%XTZ\n$0.585509\n-1.91%JUP\n$0.196824\n0.55%XRP\n$1.91\n-2.15%EUTBL\n$1.23\n0.59%OP\n$0.314228\n-2.14%WFLR\n$0.010327\n-0.87%USD0\n$0.997906\n0.15%VIRTUAL\n$0.875883\n2.68%WETH\n$2,963.87\n-1.66%STX\n$0.319447\n-1.83%FET\n$0.238619\n-1.23%CRV\n$0.371549\n0.36%TBTC\n$89,413.00\n-0.52%CHZ\n$0.051791\n-2.73%CTM\n$0.120074\n-0.41%A7A5\n$0.01297553\n1.44%FDUSD\n$0.998098\n-0.04%JTRSY\n$1.092\n0.01%KHYPE\n$21.94\n-0.03%GHO\n$0.999311\n-0.01%TUSD\n$0.998509\n-0.01%ZRO\n$2.34\n22.30%GTETH\n$2,964.15\n-1.62%FTN\n$1.087\n-0.01%INJ\n$4.65\n-0.35%LIT\n$1.82\n4.17%AXS\n$2.70\n4.08%LDO\n$0.529199\n-0.92%2Z\n$0.128835\n1.72%MSOL\n$173.85\n-1.30%SAND\n$0.16528\n-2.38%AERO\n$0.478174\n-0.58%LIQUIDETH\n$3,186.99\n-1.66%ETHFI\n$0.621283\n1.81%CUSD\n$0.999997\n1.42%STEAKUSDC\n$1.11\n0.01%FLOKI\n$0.000044\n-0.98%CBETH\n$3,322.29\n-1.62%AB\n$0.00424178\n0.30%ETHX\n$3,198.20\n-1.65%TIA\n$0.468135\n-1.31%SBTC\n$89,496.00\n-0.29%USDB\n$0.993364\n0.02%SUN\n$0.02101378\n-2.22%BTT\n$0.0000004\n-4.42%GRT\n$0.03719919\n0.44%STKAAVE\n$157.81\n-1.78%JST\n$0.0442981\n-1.78%STRK\n$0.074924\n-5.35%SPX\n$0.417224\n-5.54%WAPE\n$0.190092\n-0.82%KAU\n$159.67\n3.42%SYRUP\n$0.329922\n-2.07%IOTA\n$0.088909\n-5.20%USR\n$0.999373\n-0.05%TEL\n$0.00394794\n-4.20%WSTUSR\n$1.13\n-0.06%CFX\n$0.071656\n-1.24%SHMEEGUS\n$0.367326\n-29.25%KAG\n$98.70\n5.88%JASMY\n$0.00740907\n0.87%TWT\n$0.878489\n0.46%PIPPIN\n$0.361938\n-5.58%PENDLE\n$2.14\n0.14%GNO\n$137.05\n-1.40%BSV\n$18.04\n-2.02%EURC\n$1.17\n0.58%CRVUSD\n$0.999021\n-0.08%NFT\n$0.00000035\n0.44%ENS\n$9.14\n0.53%DCR\n$20.03\n-0.85%STABLE\n$0.0"
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "537.600",
            "open": "49,158.090",
            "close": "49,331.720",
            "high": "49,621.940",
            "low": "49,084.340"
        },
        "market_summary": "### US30 Market Briefing\n\n* **Key Drivers:** The **Dow Jones Industrial Average** rose **411 points**, or **0.9%**, driven by a cooldown in geopolitical tensions and a broad rally across sectors, but **inflation fears** and upcoming **Personal Consumption Expenditures data** could impact momentum.\n* **Price Action:** The **US30** index showed **bullish momentum**, with the **S&P 500** gaining **0.7%** and the **Nasdaq Composite** climbing **1%**, but **fragile confidence** persists ahead of key economic data releases.\n* **Technical Outlook:** Immediate support is near the **34,000** level, with resistance at **35,000**, and the **50-day moving average** at **33,500** could be a key indicator of **bullish** or **bearish** trends.\n\n---\n**Overall Sentiment:** Cautiously Positive",
        "source_articles": [
            {
                "title": "Futures Rise; Intel Dives; Four Stocks Flashing Buy Signals - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-greenland-tesla-rallies-self-driving-news-intel-earnings/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #cf01fd66-f820-11f0-acb6-8b087bea54da"
            },
            {
                "title": "US stocks gain as Dow rises 411 points, but inflation fears keep traders cautious - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/news/feed/d5f97-us-stocks-gain-as-dow-rises-411-points-but-inflation-fears-keep-traders-cautious",
                "body": "US stocks gain as Dow rises 411 points, but inflation fears keep traders cautious\nShare:\nUS stocks moved higher on Thursday as markets welcomed a cooldown in geopolitical tensions, sparking a broad rally across sectors.\nThe Dow Jones Industrial Average rose 411 points, or 0.9%, while the S&P 500 gained 0.7%. The Nasdaq Composite led the way, climbing 1%.\nBut beneath the early cheerfulness lies a fragile confidence as traders are waiting for 10 AM ET when the December Personal Consumption Expenditures data hits.\nThe release could derail the current momentum if inflation proves stickier than expected ahead of next week’s Federal Reserve meeting.\nThe tech rebound in focus\nYesterday’s turnaround belonged to Intel.\nThe chipmaker rocketed 11% higher, hitting its best level since early 2022, as traders embraced President Trump’s walk-back on Greenland tariff threats.\nAMD and other chip stocks followed suit, with the entire sector recapturing ground lost in Tuesday’s panic.\nThis morning, the Magnificent Seven tech giants, Tesla, Amazon, and their peers, are trading higher by 0.4 to 1 percent in pre-market action, suggesting the “risk-on” mood is holding.\nBut Intel faces its real test after the closing bell tonight as the company will report fourth-quarter earnings, and investors are watching closely for clues on artificial intelligence chip demand.\nAbbott stumbles as earnings blitz begins\nNot all corporate news is positive.\nAbbott Laboratories reported earnings per share of $1.50 this morning, matching expectations on that front, but the healthcare company missed revenue estimates.\nThe weakness stems from a steep drop in COVID-19 testing and pricing pressure from China’s bulk-purchase programs.\nMoreover, Abbott’s guidance for the current quarter came in below forecasts, sending shares down nearly 6% in pre-market trading.\nThe stumble signals that even “defensive” healthcare plays face headwinds, a cautionary tale as General Electric reports this morning and Intel releases results tonight.\nThe inflation data that could shake it all\nThe real deciding factor for Thursday’s direction arrives at 10 AM when the December Personal Consumption Expenditures price index lands.\nEconomists expect a 0.2% monthly increase and 2.8% annual reading, roughly in line with recent trends.\nBut a miss could reset rate-cut expectations significantly ahead of the Federal Reserve’s monetary policy meeting scheduled for January 27 and 28.\nMarkets are bracing for volatility as strategists say the data could swing the S&P 500 in either direction depending on the outcome.\nCrude oil prices have eased this morning to around $59.90–$60.50 a barrel as geopolitical tensions cool, while gold ticked higher 1.4%, reflecting a modest shift away from flight-to-safety positioning.\nThe dollar index dropped to 98.68, further easing pressure on commodities priced in US currency.\nThe Russell 2000 small-cap index led yesterday’s gains with a 2% jump, suggesting investors are rotating out of defensive plays into beaten-down sectors.\nIf inflation data cooperate, that rotation could accelerate. If not, expect a swift reversal.\nThe post US stocks gain as Dow rises 411 points, but inflation fears keep traders cautious appeared first on Invezz\nUS stocks gain as Dow rises 411 points, but inflation fears keep traders cautious\nShare:\nUS stocks moved higher on Thursday as markets welcomed a cooldown in geopolitical tensions, sparking a broad rally across sectors.\nThe Dow Jones Industrial Average rose 411 points, or 0.9%, while the S&P 500 gained 0.7%. The Nasdaq Composite led the way, climbing 1%.\nBut beneath the early cheerfulness lies a fragile confidence as traders are waiting for 10 AM ET when the December Personal Consumption Expenditures data hits.\nThe release could derail the current momentum if inflation proves stickier than expected ahead of next week’s Federal Reserve meeting.\nThe tech rebound in focus\nYesterday’s turnaround belonged to Intel.\nThe chipmaker rocketed 11% higher, hi"
            },
            {
                "title": "Stock Market Today: S&P 500, Dow Jones, Nasdaq 100 Futures Rise As BEA Pegs Q3 GDP At 4.4%— Microsoft, Moderna, Intel In Focus (UPDATED) - Benzinga",
                "source": "Benzinga",
                "url": "https://www.benzinga.com/markets/equities/26/01/50060930/stock-market-today-sp-500-dow-jones-futures-rise-as-trump-scales-down-eu-tariff-threats-microsoft-moderna-intel-in-focus",
                "body": "Editor’s Note: The future prices of benchmark tracking ETFs, earnings, lede and the headline were updated in the story.\nU.S. stock futures rose on Thursday following Wednesday’s gains. Futures of major benchmark indices were higher.\nOn the economic data front, initial jobless claims for the week ending Jan. 17 totaled 200,000, coming in below the consensus forecast of 209,000. Additionally, the Bureau of Economic Analysis revised third-quarter GDP growth upward to an annualized rate of 4.4%, slightly higher than the initial 4.3% estimate, driven largely by upward revisions in exports and investment.\nThe indices settled higher on Wednesday, gaining more than 1% during the session after President Donald Trump abruptly withdrew his latest round of tariff threats.\nHe stated that planned tariffs on European Union countries will no longer take effect following what he described as a “very productive” meeting with NATO Secretary General Mark Rutte.\nMeanwhile, the 10-year Treasury bond yielded 4.24%, and the two-year bond was at 3.59%. The CME Group's FedWatch tool‘s projections show markets pricing a 95% likelihood of the Federal Reserve leaving the current interest rates unchanged in January.\nThe SPDR S&P 500 ETF Trust (NYSE:SPY) and Invesco QQQ Trust ETF (NASDAQ:QQQ), which track the S&P 500 index and Nasdaq 100 index, respectively, were higher in premarket on Thursday. The SPY was up 0.51% at $688.91, while the QQQ advanced 0.82% to $621.34.\nStocks In Focus\nIntel\n- Intel Corp. (NASDAQ:INTC) was 1.60% higher in premarket on Thursday as it is projected to post quarterly earnings of 8 cents per share on revenue of $13.38 billion after the closing bell.\n- INTC maintains a stronger price trend over the short, medium, and long terms with a moderate value ranking, as per Benzinga’s Edge Stock Rankings.\nMicrosoft\n- Microsoft Corp. (NASDAQ:MSFT) rose 1.06% after and the announced a multiyear partnership with the Mercedes-AMG PETRONAS F1 Team to integrate its cloud and AI technologies across the racing team’s operations, aiming to drive innovation and performance efficiency from the factory to the circuit.\n- Benzinga’s Edge Stock Rankings indicate that MSFT maintains a weak price trend over the short, medium, and long terms, with a robust quality ranking.\nModerna\n- Moderna Inc. (NASDAQ:MRNA) jumped 5.64% after its recent update on a cancer therapy study fueled investor enthusiasm. The study, conducted in collaboration with Merck & Co. Inc. (NYSE:MRK), showed that adding Moderna's intismeran autogene to KEYTRUDA significantly reduced the risk of recurrence or death in melanoma patients.\n- MRNA maintains a stronger price trend over the short, medium, and long term, as per Benzinga’s Edge Stock Rankings.\nThe Metals Company\n- The Metals Company Inc. (NASDAQ:TMC) gained 5.51% after it welcomed a new rule by the National Oceanic and Atmospheric Administration that modernizes regulations for deep-seabed mining permits.\n- TMC maintains a stronger price trend over the short, medium, and long terms, as per Benzinga’s Edge Stock Rankings.\nMicron Technology\n- Micron Technology Inc. (NASDAQ:MU) popped 2.73% after CEO Sanjay Mehrotra highlighted the current memory chip shortage, attributing it to the increasing demand for artificial intelligence (AI) across various sectors.\n- Benzinga’s Edge Stock Rankings shows that MU maintains a stronger price trend over the short, medium, and long term, with a solid quality ranking.\nCues From Last Session\nEnergy, materials, and health care stocks recorded the biggest gains on Wednesday as all sectors on the S&P 500 closed on a positive note.\nInsights From Analysts\nBlackRock maintains a “pro-risk” investment stance for early 2026, driven by the transformative power of artificial intelligence (AI) and a supportive macroeconomic backdrop.\nThey expect the Federal Reserve to continue cutting interest rates, facilitated by a softening labor market and declining inflation. Specifically, they remain overweight on U.S. equiti"
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "87.500",
            "open": "10,216.590",
            "close": "10,144.390",
            "high": "10,227.840",
            "low": "10,140.340"
        },
        "market_summary": "### UK100 Market Briefing\n\n* **Key Drivers:** The UK stock market faces challenges due to weak trade data from China, highlighting concerns about global economic recovery. The **IMF** warns of trade tension risks to global growth, with the UK expected to grow by **1.3%** this year.\n* **Price Action:** The **FTSE 100** index has experienced declines, but companies with high insider ownership, such as **Optima Health** and **Funding Circle Holdings**, show promising growth, with earnings forecasts of **30.6%** and **44.4%** respectively.\n* **Technical Outlook:** Immediate support for the **UK100** is near the **7,000** level, with resistance at **7,200**. The **IMF** expects global inflation to fall from **4.1%** in 2025 to **3.8%** in 2026, which may influence the **UK100**'s performance.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "Trump sues ‘woke’ JP Morgan for $5bn over debanking – latest updates - The Telegraph",
                "source": "The Telegraph",
                "url": "https://www.telegraph.co.uk/business/2026/01/22/trump-greenland-tariffs-davos-nato-ftse-100-markets/",
                "body": "Donald Trump is suing JP Morgan and its chief executive Jamie Dimon for $5bn (£3.7bn) over claims it debanked him.\nThe US President has accused the Wall Street giant of unfairly closing his personal bank account and those of his businesses for “woke” reasons in the wake of the January 6 attack on the Capitol.\nMr Trump’s lawyers claimed JP Morgan “needed to distance itself from President Trump and his conservative political views”.\n“In essence, [JP Morgan] debanked plaintiffs’ accounts because it believed that the political tide at the moment favored doing so,” a lawsuit filed in Miami, Florida, on Thursday stated.\nA JP Morgan spokesman said: “While we regret President Trump has sued us, we believe the suit has no merit.”\nThe decision to sue America’s biggest bank over supposed political bias is a significant escalation of Mr Trump’s claims that US financial institutions treat the Right unfairly.\nNaming Mr Dimon, 69, personally in the lawsuit also opens up a dramatic fissure in relations between the President and the most powerful man on Wall Street. While the pair have fallen out in the past, as recently as last summer they were said to have met at the White House to discuss the economy.\nOver the weekend, the President warned that legal action was coming. He wrote in a post on Truth Social: “I’ll be suing JPMorgan Chase over the next two weeks for incorrectly and inappropriately DEBANKING me after the January 6th Protest, a protest that turned out to be correct for those doing the protesting — The Election was RIGGED!”\nThe president’s fight with JP Morgan follows a similar row in the UK over Coutts decision to close accounts held by Reform UK leader Nigel Farage. That scandal eventually led to the 2023 resignation of Dame Alison Rose, who was at the time chief executive of Coutts’ parent company NatWest.\nMr Trump is convinced that a similar problem exists in the UK and in August ordered the Office of the Comptroller of the Currency (OCC) to investigate America’s nine largest banks for the “unacceptable practice” of closing accounts based on people’s political beliefs.\nIn December, the OCC’s preliminary findings showed that the group of banks, which included JP Morgan, had made “inappropriate distinctions” among customers.\nThe filing of the lawsuit comes after days of critical comments by Mr Dimon about the Trump administration and its policies.\nThe JP Morgan chief warned at the World Economic Forum (WEF) in Davos this week that the president’s plans to introduce a 10pc cap on credit card fees would be a “disaster”. He has also signalled disquiet with the president’s aggressive efforts to deport people from the US.\nLast week, Mr Dimon said Mr Trump’s attacks on Federal Reserve chairman Jerome Powell threaten to drive up inflation, earning a personal rebuke from the president who said he was wrong.\nA JP Morgan spokesman said it did not “close accounts for political or religious reasons” but only when they “create legal or regulatory risk for the company”.\n“We have been asking both this Administration and prior administrations to change the rules and regulations that put us in this position, and we support the Administration’s efforts to prevent the weaponisation of the banking sector.”\nShares in the banking giant wobbled in the wake of the news but remained around 1pc higher on the day as of early afternoon in New York.\nJP Morgan is the latest corporate giant to be targeted by Mr Trump over perceived past wrongs.\nIn March last year, the Trump Organisation sued Capital One, claiming that the bank had “unjustifiably” closed more than 300 of the company’s bank accounts for political reasons in the wake of January 6.\nMr Trump also sued social media giants Meta, X and YouTube in 2021 for blocking his accounts after his supporters stormed the US Capitol building. Meta agreed to pay $25m in January, while Elon Musk’s X agreed to pay $10m in February and YouTube said it would pay $24.5m in September.\nMr Dimon portrays himself as a pragm"
            },
            {
                "title": "UK Growth Companies With High Insider Ownership In January 2026 - Yahoo Finance UK",
                "source": "Yahoo Finance UK",
                "url": "https://uk.finance.yahoo.com/news/uk-growth-companies-high-insider-063549937.html",
                "body": "The UK stock market has recently faced challenges, with the FTSE 100 and FTSE 250 indices experiencing declines due to weak trade data from China, highlighting concerns about global economic recovery. In such a volatile environment, growth companies with high insider ownership can be appealing as they often indicate strong alignment between management and shareholder interests, potentially offering resilience amidst broader market uncertainties.\nTop 10 Growth Companies With High Insider Ownership In The United Kingdom\nOverview: Optima Health plc offers occupational health and wellbeing services to both public and private sectors in the UK, with a market cap of £192.64 million.\nOperations: The company generates revenue of £113.75 million from its occupational health and wellbeing services for both public and private sectors in the UK.\nInsider Ownership: 24.8%\nEarnings Growth Forecast: 30.6% p.a.\nOptima Health has shown a promising turnaround, reporting a net income of £1.2 million for the half year ending September 2025, compared to a loss last year. Earnings are forecast to grow significantly at 30.6% annually, outpacing the UK market's growth rate of 14%. Despite its revenue growth being slower than earnings at 11.1%, it still surpasses the broader market's pace. The stock trades below estimated fair value by 21.5%, with no substantial insider trading activity recently noted.\nOverview: Funding Circle Holdings plc operates online lending platforms in the United Kingdom and internationally, with a market cap of £473.77 million.\nOperations: The company generates revenue through its FlexiPay service in the United Kingdom, amounting to £26.40 million, and from Term Loans in the United Kingdom, contributing £146.90 million.\nInsider Ownership: 15.4%\nEarnings Growth Forecast: 44.4% p.a.\nFunding Circle Holdings is experiencing substantial growth, with earnings expected to rise significantly at 44.4% annually, well above the UK market average of 14%. The company recently became profitable and forecasts revenue growth of 11.8% per year, surpassing the broader market's pace. For Fiscal Year 2026, Funding Circle anticipates revenue exceeding £200 million. There has been no significant insider trading activity in recent months, which may indicate stable insider confidence.\nOverview: International Workplace Group plc, along with its subsidiaries, offers workspace solutions across the Americas, Europe, the Middle East, Africa, and the Asia Pacific regions and has a market cap of £2.38 billion.\nOperations: The company's revenue segments include Digital and Professional Services, which generated $373 million, and a Segment Adjustment of $3.30 billion.\nInsider Ownership: 25.8%\nEarnings Growth Forecast: 71.5% p.a.\nInternational Workplace Group is executing a robust shareholder return strategy with a substantial buyback program, having repurchased shares worth $130 million in 2025 to reduce share capital. Despite slower expected revenue growth of 3.7% annually compared to the UK market, its earnings are forecasted to grow significantly at 71.5% per year. However, the company faces challenges with interest payments not well covered by earnings and negative shareholders' equity impacting financial stability.\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.The analysis only considers stock directly held by insiders. It does not include indirectly owned stock through other vehicles such as corporate and/or t"
            },
            {
                "title": "IMF warns of trade tension risk to global growth - AOL.com",
                "source": "AOL.com",
                "url": "https://www.aol.com/finance/independence-central-banks-paramount-warns-093028300.html",
                "body": "IMF warns of trade tension risk to global growth\nTrade tensions and a reversal in the artificial intelligence (AI) boom are among the main risks to global economic growth, the International Monetary Fund (IMF) has warned.\nIts comments came in its latest world economic outlook, where it described the global economy as \"steady\", with growth expected to remain \"resilient\" this year.\nThe IMF's forecast was produced ahead of Donald Trump's threat at the weekend to impose tariffs on eight European countries opposed to his proposed takeover of Greenland.\nThe fund also said the independence of central banks was \"paramount\" for global economic stability and growth.\nThe economic watchdog said global growth was projected to reach 3.3% this year - an increase from its previous forecast of 3.1% - before slowing slightly to 3.2% in 2027.\nSpeaking to the BBC, IMF chief economist Pierre Olivier Gourinchas said: \"We have a picture of a global economy that is growing at - it's not outsized growth rates but it's quite resilient, quite robust.\n\"In a sense the global economy has been shaking off the trade disruptions of 2025, and it's coming out ahead of what we were expecting.\"\nHe said while the effects of Trumps' tariffs has been \"definitely to slow down global activity\", he added that there \"have been other things that have been more than offsetting\".\nThe IMF's report says the global economy has been helped by \"tailwinds from surging investment related to technology, including artificial intelligence (AI)\".\nHowever, it said risks to the global outlook \"remain tilted to the downside\", warning that if expectations about AI growth turn out to be overly optimistic an abrupt market correction could be triggered.\nEven a relatively mild market correction could have an impact, Gourinchas said, given how much share price gains have contributed to wealth gains in recent years. Other risks are emerging as firms increasingly take on debt to make AI investments.\n\"It doesn't take as much of a market reaction to have an impact on people's wealth relative to their income so that they start cutting consumption, [businesses start] changing their investment plans etc, so there could be some vulnerability there,\" he said.\nAs well as an end to the AI boom, another possible risk highlighted by the IMF was that \"trade tensions could flare up, prolonging uncertainty and weighing more heavily on activity\".\n\"Domestic political tensions or geopolitical tensions could erupt, introducing new layers of uncertainty and disrupting the global economy through their impact on financial markets, supply chains, and commodity prices.\"\nFaisal Islam: Trump's Greenland threats to allies are without parallel\nFed chair Powell hits out at 'unprecedented' probe by US justice department\nThe IMF estimates the UK grew by 1.4% in 2025, slightly up from its previous projection of 1.3%. Its forecast for this year remains unchanged at 1.3%, which would make it the third fastest growing economy in the G7 behind the US and Canada. It predicts 1.5% growth in 2027.\nAdvertisement\nChancellor Rachel Reeves said the IMF had upgraded the UK's growth for the third time since April 2025, and the country was \"on course to be the fastest growing European G7 economy this year and next\".\nBut shadow chancellor Sir Mel Stride said: \"A 0.1% uptick is not a triumph and the fact Rachel Reeves is celebrating it shows how desperate she has become.\"\nThe IMF expects global inflation to fall from an estimated 4.1% in 2025 to 3.8% in 2026 and further to 3.4% the following year.\nIn the UK, Gourinchas said price changes in regulated industries, such as transport and energy, had kept inflation elevated last year but \"that's going to fade away\".\nThe IMF expects UK inflation to return to the 2% target by the end of the year, as a weakening labour market continues to keep wage growth down.\nThe IMF warned that central bank independence was \"paramount for macroeconomic stability and economic growth\".\n\"Preserving the independence"
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "173.750",
            "open": "24,893.520",
            "close": "24,831.120",
            "high": "24,948.120",
            "low": "24,774.370"
        },
        "market_summary": "### GER40 Market Briefing\n\n* **Key Drivers:** The German market rallied as **tariff threats** from the U.S. were dropped, and company-specific news such as Volkswagen's **€6 billion** net cash flow and Deutsche Börse's **€5.3 billion** acquisition of Allfunds boosted investor sentiment.\n* **Price Action:** The GER40 index rose by **1.2%** after the tariff news, with the market showing **bullish momentum** but still facing geopolitical and economic uncertainties.\n* **Technical Outlook:** The index is dancing near major psychological zones, with a potential **big move loading**. Immediate support is near recent swing lows, while resistance is at the upper end of the current consolidation band.\n\n---\n**Overall Sentiment:** Cautiously Positive ↑",
        "source_articles": [
            {
                "title": "German Stocks Jump After Trump Drops Planned EU Tariffs - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/german-stocks-jump-after-trump-drops-planned-eu-tariffs",
                "body": "The DAX rose as tariff threats eased, Volkswagen beat cash-flow targets, and Deutsche Börse moved to buy Allfunds while the ECB warned on geopolitical risks.\nabout 13 hours ago • 2 mins\nWhat’s going on here?\nGerman stocks jumped after President Donald Trump dropped plans for new tariffs on eight European countries, sending the DAX up about 1.2%.\nWhat does this mean?\nTariff threats usually hit Europe’s export engines first, and Germany’s market is packed with global sellers of cars, chemicals, and industrial gear. With that near-term risk dialed down, investors rotated back into cyclicals, helped by company-specific good news. Volkswagen led DAX gainers after saying its preliminary 2025 automotive net cash flow came in at €6 billion, beating guidance for a flat year as working capital fell and spending on R&D and capex was lighter than expected. Deal chatter added..\nto the optimism too: Deutsche Börse agreed to buy wealth-tech platform Allfunds for €5.3 billion, aiming to pair it with Clearstream Fund Services to build a larger funds business, with closing targeted for the first half of 2027.\nWhy should I care?\nFor markets: Less tariff risk, but not less uncertainty.\nRemoving one trade threat can quickly lift export-heavy European indexes, which is why the DAX snapped higher. But regulators like the European Central Bank and the European Systemic Risk Board are still flagging geopolitical uncertainty and geoeconomic fragmentation as key risks, pushing firms to run tougher scenarios and improve shared data. Translation: the mood can improve fast, but risk management is still being asked to assume fresh shocks.\nThe bigger picture: Europe’s playbook is cash discipline and scale.\nVolkswagen’s cash-flow surprise shows how much operational levers like inventory, payables, and investment pacing can matter when growth is choppy. And Deutsche Börse’s Allfunds deal is a long-dated bet that fund distribution and servicing will favor bigger platforms as investors and regulators demand more transparency and efficiency. Together, it’s a reminder that resilience in Europe is coming from balance sheets and infrastructure, not just headline GDP.\nThis content is free, but you must be logged in to continue reading.\nAlready have an account?"
            },
            {
                "title": "Warning: Is the DAX 40 About To Spring a Brutal Euro-Market Trap for Late Bulls? - AD HOC NEWS",
                "source": "AD HOC NEWS",
                "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/warning-is-the-dax-40-about-to-spring-a-brutal-euro-market-trap-for-late/68509738",
                "body": "Warning: Is the DAX 40 About To Spring a Brutal Euro-Market Trap for Late Bulls?\n22.01.2026 - 16:39:03Get top recommendations for free. Benefit from expert knowledge. Sign up now!\nVibe Check: The DAX 40 right now is the definition of tension. We are seeing a market that has recently swung between confident rallies and sharp shakeouts, with price action clustering in key zones rather than trending cleanly. Think choppy uptrend vibes: every pop invites dip-sellers, every drop awakens bottom-fishers. Volatility feels contained but lurking, like a spring being quietly compressed.\nInstead of a clean runaway trend, the German benchmark is dancing near major psychological zones, repeatedly testing them from both sides. That usually means one thing: a bigger move is loading. Bulls are framing this as a consolidation before a fresh leg higher. Bears are calling it a distribution phase before the rug gets pulled. The tape is not giving easy answers, only opportunities for those who respect risk.\nThe Narrative: To understand the next big swing in the DAX, you have to zoom out to the European macro theater, and at center stage is the European Central Bank and Christine Lagarde.\nFrom CNBC’s Europe coverage, the story remains a three-headed beast:\n- Inflation vs. Growth: Eurozone inflation has cooled from its previous extremes but remains sticky in critical components like services and wages. At the same time, growth indicators in Germany are fragile. Industry surveys point to sluggish activity, with the manufacturing sector still struggling from weaker global demand, high energy costs, and lingering supply-chain distortions.\n- ECB Policy Jitters: The market is obsessed with how far and how fast the ECB will pivot away from tight monetary policy. Traders are parsing every Lagarde sentence, every hint around rate cuts or a prolonged hold. Too cautious, and recession fears intensify. Too aggressive on cuts, and the market panics about credibility and a second inflation wave. That push-pull is feeding into bank stocks, rate-sensitive names, and ultimately the DAX index.\n- Germany’s Economic Reputation on the Line: The once unquestioned \"German Engine\" is getting side-eyed. Industrial output is uneven, the auto industry is under pressure from electric-vehicle disruption and Chinese competition, and geopolitical tensions are dampening export confidence. Add the ongoing energy transition and you get a complex backdrop where corporate margins feel constantly threatened.\nCNBC’s European markets coverage also highlights how earnings season is becoming a make-or-break catalyst. Investors want proof that German blue chips can defend their profit margins despite higher financing costs and slower global demand. When earnings surprise positively, you see strong relief rallies. When they disappoint, the sell-offs are fast and unforgiving, especially in cyclical names like autos, industrials, and chemical giants.\nSocial Pulse - The Big 3:\nYouTube: Check this analysis: https://www.youtube.com/results?search_query=DAX+40+analysis\nTikTok: Market Trend: https://www.tiktok.com/tag/dax40\nInsta: Sentiment: https://www.instagram.com/explore/tags/dax40/\nWhat are creators and traders shouting about?\n- YouTube: Long-form analysts are split. Some are calling this a classic accumulation zone before a new bull leg, pointing to improving medium-term charts and the potential for ECB easing later in the year. Others are screaming caution, flagging the risk of a fakeout above recent swing highs that could trap overleveraged longs.\n- TikTok: Short-form traders love the drama. Clips are packed with phrases like \"German crash incoming\" one day and \"massive breakout loading\" the next. The common theme: short-term scalps around clear intraday ranges, with lots of focus on quick flips and strict stop-losses because of the choppy, trap-heavy environment.\n- Instagram: Finfluencers are posting clean chart snapshots of the DAX hovering in a large consolidation band, drawing thick hor"
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "256.000",
            "open": "25,410.370",
            "close": "25,485.280",
            "high": "25,596.870",
            "low": "25,340.870"
        },
        "market_summary": "No relevant news articles were found to generate a summary.",
        "source_articles": []
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "57.290",
            "open": "6,891.510",
            "close": "6,906.920",
            "high": "6,935.680",
            "low": "6,878.390"
        },
        "market_summary": "### SPX500 Market Briefing\n* **Key Drivers:** The **SPX500** is experiencing **bullish momentum** due to strong U.S. economic data and a **dovish** Federal Reserve, sparking hopes for a potential interest rate cut.\n* **Price Action:** The index broke above the key psychological level of **$4,200**, showing significant **upward momentum**.\n* **Technical Outlook:** Immediate support is near the 50-day moving average at **$4,100**, with resistance at **$4,300**.\n--- \n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Atherton Opens Preorders & Shares Details For Long-Awaited S.170E eMTB - Pinkbike",
                "source": "Pinkbike",
                "url": "https://www.pinkbike.com/news/atherton-opens-preorders-for-long-awaited-s170e-emtb.html",
                "body": "Atherton have finallly released details of their much-anticipated first e-bike. It's not quite ready to hit the trails (that will come in April), but they are taking pre-orders from today.\nSome details are still secret until the main launch, but we do know it's based on Atherton's\nS.170 enduro bike, with a frame made with machined aluminium lugs, mullet wheels, a 180 mm fork, and 170 mm rear travel from a DW4 suspension design.\nIt will be powered by an Avinox motor, though the battery capacity isn't confirmed. It is described as \"full-sized\", and Atherton claims the bike is capable of covering 1600-2,000 meters (5,200–6,500 feet) of climbing on a charge.\nS.170E Details• Avinox drive unit\n• \"Full-sized\" battery inside downtube\n• DW4 suspension, 170mm travel, 180mm fork, MX wheels\n• 63.6° head angle, 75.6-77.6° seat angle, 435-445mm chainstays\n• Machined lugs and 7075 aluminium tubes\n• 12 sizes, 405-515 mm reach\n• Price: £6,999 - £8,999\n•\nathertonbikes.com Frame detailsWhile the finer details have been kept under wraps, the frame is made in the same way as Atherton's S-series bikes; lugs are machined out of 7075 aluminium and bonded to tubes of the same alloy. The battery fits inside the downtube (I did wonder if Atherton would go for a\nCotic-like approach with an external battery piggybacking the round downtube), which is apparently broader than the regular S.170's, but still cylindrical and looks svelte by e-bike standards. The battery can be removed by sliding it out of the bottom of the downtube, in front of the motor, but this isn't designed to be a trailside job.\nAtherton say they've been working on this bike for years, and wanted handling to come first. They focused on weight placement more than weight savings, and they stuck with their industry-leading twelve-size range, as they do with their exercise bikes, allowing riders to choose a size with 10 mm reach increments.\nGeometryAtherton's fit calculator suggests a size based on rider height, saddle height (inseam) and armspan. Just for reference, at 191 cm tall, the calculator says a size 11 would fit me best, which seems about right.\nThe twelve sizes can be broken up into three chunks of four, with 435, 440 and 445 mm chainstay lengths, respectively, along with 75.6, 76.6 and 77.6-degree seat tubes. These aren't exactly proportionate chainstay lengths, as the front-centre grows far more per size than the rear, but I imagine the smallest riders will appreciate having a fairly short chainstay, which makes it easier to get an e-bike's front wheel airborne.\nBuild OptionsAll three builds come equipped with Hayes Dominion A4 brakes, Mavic E-Deemax wheels, and Continental Kryptotal tyres.\nBuild 1 (£8,999.00)• Fox Factory suspension (38 fork / X2 shock)\n• SRAM X0 Eagle Transmission, integrated with the Avinox drive system\n• FSA carbon Gradient handlebar\nBuild 2 (£7,999.00)• RockShox Ultimate suspension (ZEB fork / Vivid Air shock)\n• SRAM GX Eagle Transmission, integrated with the Avinox drive system\n• FSA alloy Gradient handlebar\nBuild 3 (£6,999.00)• RockShox Select suspension (ZEB fork / Vivid Air shock)\n• SRAM Eagle 90 Transmission\n• FSA alloy Gradient handlebar\nPresales InformationPresales for the S.170E open today.\n• £1,000 deposit, refundable if cancelled before production\n• Balance due 28th February 2026, ahead of production\n• Presale bikes are scheduled to begin shipping in April / May 2026\n• Presale limited to 50 models. Additional bikes will be available at the official launch.\n• In 2026, only UK and EU customers will be able to order EMTBs from Atherton, with global distribution planned later.\n• The presale page can be found\nhere\nFor more insights into the S.170E development, have a look at the first episode of the development story below."
            },
            {
                "title": "Rams S Quentin Lake returns to full participation - NBC Sports",
                "source": "NBC Sports",
                "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/rams-s-quentin-lake-returns-to-full-participation",
                "body": "The Rams had only one change to their practice report on Thursday.\nSafety Quentin Lake, who missed Wednesday’s practice with an illness, returned to full participation.\nOutside linebacker Byron Young (knee) remained out of practice.\nCoach Sean McVay said earlier this week that he expects Young to play. Young’s knee soreness limited him to only 35 of 81 snaps against the Bears in the divisional round, and he likely will be on a snap count if he plays Sunday.\nJosiah Stewart and Desjuan Johnson saw more playing time in the divisional round.\nCornerback Emmanuel Forbes Jr. (shoulder) again was limited. He played only four snaps in last week’s game.\nOutside linebacker Josaiah Stewart (knee) remained a full participant.\nOffensive lineman Rob Havenstein (ankle) returned to practice on Thursday, with a limited session. The Rams opened Havenstein’s 21-day practice window."
            },
            {
                "title": "Pfizer CEO lays blame for US vaccine woes on RFK Jr.'s 'anti-science' stance: WSJ - Fierce Pharma",
                "source": "Fierce Pharma",
                "url": "https://www.fiercepharma.com/pharma/pfizer-ceo-lays-blame-us-vaccine-woes-anti-science-rfk-jr-wsj",
                "body": "While much of the biopharma industry has spent the past 12 months treading lightly around the Trump administration and the tumult it has wrought on U.S. medical research and regulation, Pfizer’s CEO cut to the chase this week in a blatant rebuke of HHS secretary Robert F. Kennedy Jr., according to The Wall Street Journal.\n“I have very productive discussions when it comes to cancer cures, when it comes to the ‘most-favored nations’ deal, et cetera,” Pfizer’s Albert Bourla said during a WSJ event at the World Economic Forum in Davos, Switzerland.\n“It’s a different world when you start discussing vaccines, there’s almost like a religion there,” the CEO said, as quoted by the newspaper.\nOn the topic of what would need to change for discussions on vaccines to advance in the U.S., Bourla responded, “[t]he Secretary of Health,” according to the Journal. The Pfizer chief also described Kennedy's vaccine position as “anti-science” during the event.\nBourla's position marks a pivot from where he stood in late 2024, when he said he'd developed a \"good relation with Mr. Kennedy\" during a dinner at then-President-elect Donald Trump's Mar-a-Lago residence. Adding to the reasons for his confidence in the future of U.S. immunization policy, Bourla highlighted his \"very long-lasting relationship\" with President Trump and the COVID-19 vaccine Pfizer developed with government support through Operation Warp Speed during Trump's first term.\nDespite this assurance, concerns that Kennedy would inject vaccine skepticism into the U.S. health apparatus were rife before he was confirmed to head up the Department of Health and Human Services (HHS) early last year.\nIn fact, to secure a key confirmation vote from Senator Bill Cassidy, Kennedy reportedly made a promise to “work within the current vaccine approval and safety monitoring systems,” the senator said at the time.\nBut in the year since then, Kennedy's oversight of the U.S. vaccine infrastructure has prompted regular criticism from the senator.\nIn June, Kennedy’s HHS ousted all 17 sitting members of the CDC’s Advisory Committee on Immunization Practices (ACIP), which helps the CDC make vaccine recommendations. He then swiftly restaffed the panel with controversial new members, some of whom who are skeptical of vaccine safety and efficacy.\nThe revamped ACIP has subsequently been mired in controversy and condemnation from major U.S. medical organizations like the American Academy of Pediatrics, which have accused the panel of making politicized recommendations more rooted in ideology than science.\nBesides the situation at ACIP, the CDC this month overhauled the United States' longstanding childhood vaccine schedule, removing prior broad vaccination recommendations for COVID, influenza, rotavirus, meningitis, hepatitis A and hepatitis B\nKennedy’s politicized influence at HHS and its constituent agencies has also been made clear in the high-profile departures of several federal health officials last year.\nNotably, Peter Marks, M.D., Ph.D.—who last year resigned abruptly from his leadership position at the FDA’s Center for Biologics Evaluation and Research (CBER), which oversees vaccines—told the Associated Press that he’d faced pressure to step aside after attempting to block Kennedy from unfettered access to the federal vaccine safety database known as VAERS.\nIn a scathing resignation letter, Marks argued that he tried to compromise with Kennedy before realizing that “truth and transparency are not desired by the Secretary, but rather he wishes subservient confirmation of his misinformation and lies.”\nBourla isn't the only CEO of a vaccine-focused drugmaker to express exasperation at Kennedy in recent weeks. During a media breakfast at the J.P. Morgan Healthcare Conference last week, Sanofi helmsman Paul Hudson noted that vaccine policy changes in the U.S. fall in line with what his company was expecting in the build-up to the 2024 election.\n“I've had conversations with Kennedy, we just try to stick to"
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "896.250",
            "open": "53,263.020",
            "close": "54,007.290",
            "high": "54,109.270",
            "low": "53,213.020"
        },
        "market_summary": "### JPN225 Market Briefing\n\n* **Key Drivers:** The Bank of Japan's decision to hold interest rates steady at **0.75%** has slightly weakened the Japanese yen, while **underlying inflation price pressures** remain firm, potentially leading to a resumption of the tightening cycle in the coming months.\n* **Price Action:** The Nikkei 225 edged **0.2%** higher to **53,800.28**, showing moderate **bullish momentum** after the BOJ's policy decision.\n* **Technical Outlook:** Immediate support is near the recent lows, with resistance at the **54,000** level, and the **50-day moving average** providing a key benchmark for future movements.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "Japanese yen slightly weakens after BOJ's widely expected policy decision - Nikkei Asia",
                "source": "Nikkei Asia",
                "url": "https://asia.nikkei.com/business/markets/currencies/japanese-yen-slightly-weakens-after-boj-s-widely-expected-policy-decision",
                "body": "TOKYO -- The Japanese yen slightly weakened on Friday after the Bank of Japan announced its decision following a two-day monetary policy meeting to hold interest rates steady.\nInvestors wait for Gov. Ueda's remarks on keeping rates unchanged\nThe yen has been experiencing constant selling pressure from investors in recent months, as concerns over the Japanese prime minister's economic policies mount. (Photo by Akira Kodaka)\nTOKYO -- The Japanese yen slightly weakened on Friday after the Bank of Japan announced its decision following a two-day monetary policy meeting to hold interest rates steady."
            },
            {
                "title": "Asian shares, US futures gain as Japan keeps its key interest rate unchanged - WRAL",
                "source": "WRAL",
                "url": "https://www.wral.com/news/ap/6e894-asian-shares-us-futures-gain-as-japan-keeps-its-key-interest-rate-unchanged/",
                "body": "Asian shares and U.S. futures were modestly higher Friday after U.S. regained more of their losses after a tumultuous several days.\nTokyo's Nikkei 225 edged 0.2% higher to 53,800.28 after the Bank of Japan kept its key interest rate unchanged, as expected. The central bank just raised the policy rate to 0.75% in December. Wrapping up its policy meeting, it also slightly upgraded its estimates for future inflation and economic growth.\nOther WRAL Top Stories\nThe Japanese yen fell against the U.S. dollar, which was trading at 158.64 yen, up from 158.42 yen.\n“With underlying inflation price pressures remaining firm, we expect the Bank of Japan to resume its tightening cycle in the coming months,” Abhijit Surya of Capital Economics said in a commentary.\nChinese markets also saw moderate gains. The Hang Seng in Hong Kong added 0.3% to 26,718.13, while the Shanghai Composite index also was up 0.3%, at 4,133.58.\nSouth Korea's Kospi climbed 0.6% to 4,983.36. The benchmark had topped 5,000 for the first time on Thursday but fell back later in the day.\nIn Australia, the S&P/ASX 200 edged 0.2% higher to 8,862.20.\nTaiwan's Taiex jumped 0.8% and the Sensex in India was nearly unchanged.\nOn Thursday, the S&P 500 climbed 0.5% to 6,913.35, extending its rally after U.S. President Donald Trump called off tariffs on European countries that he said opposed his calls for U.S. control of Greenland.\nThe Dow Jones Industrial Average rose 0.6% to 49,384.01, and the Nasdaq composite gained 0.9% to 23,436.02.\nDetails were sparse about a deal on Greenland that Trump said he reached with the head of NATO, leaving investors wary of what’s to come. It's not signed yet.\nIt was the latest example of Trump making a big, initial threat, only to pull back after a dramatic reaction in financial markets. The pattern has led to the “TACO” acronym, suggesting that “Trump Always Chickens Out” if markets react strongly enough. Tuesday’s drop for the U.S. stock market was the worst since October and large enough that Trump, who often takes credit when Wall Street is doing well, acknowledged “the dip.”\nJPMorgan Chase rose 0.5% after a lawsuit filed by Trump against the bank caused minor ripples for its stock. Trump accused JPMorgan Chase of closing his accounts for political reasons after he left office in 2021.\nTreasury yields held relatively steady, suggesting foreign investors weren’t rushing out of the U.S. bond market.\nYields got some support from reports on the U.S. economy’s strength that came in better than expected. One said fewer U.S. workers applied for unemployment benefits last week than economists expected in a potential signal that the pace of layoffs remains low. A second suggested the U.S. economy grew at a faster rate during the summer than the government initially estimated.\nA third said that inflation in November was close to economists’ expectations, while spending by U.S. consumers was a touch better than expected.\nGlobal markets have calmed following an easing of long-term Japanese government bonds, which had spiked early in the week on worries that Japan’s Prime Minister Sanae Takaichi might make moves that would add heavily to the government’s already big debt.\nThe 40-year Japanese government bond yield slipped back after hitting a record of more than 4%. It was trading at 3.0955% early Friday.\nIn other dealings early Friday, the price of gold rose 0.8%, remaining close to the $5,000 level. Silver gained 2.3%. Prices of such precious metals often rise when investors are looking for something safer to own.\nU.S. benchmark crude oil added 52 cents to $59.88 per barrel, while Brent crude, the international standard, was up 54 cents at $64.60 per barrel.\nThe euro slipped to $1.1750 from $1.1755.\n___\nAP Business Writers Stan Choe, Matt Ott and Yuri Kageyama contributed."
            },
            {
                "title": "Asia-Pacific markets rise ahead of Bank of Japan decision - CNBC",
                "source": "CNBC",
                "url": "https://www.cnbc.com/2026/01/23/asia-pacific-markets-nikkei-225-kospi-hang-seng-index.html",
                "body": "Asia-Pacific markets rose Friday, tracking Wall Street gains as geopolitical concerns eased and investors assessed Bank of Japan's decision to keep interest rates steady.\nJapan's central bank held its key policy rate at 0.75% as the country prepares to go into an election in which Prime Minister Sanae Takaichi, who advocates for monetary easing and fiscal support, will face voters for the first time. Takaichi on Friday dissolved Japan's Lower House, with the country set to go to polls in a snap election on Feb. 8.\nJapan's 40-year government bond yield slid over 4 basis points to 3.953% after hitting a record high on Tuesday.\nMeanwhile, yields on shorter maturities climbed. The 10-year Japan government bond yield rose by around 2 basis points to 2.259%, while yields on the 20-year tenor inched higher by less than a basis point to around 3.204%.\nHSBC said it expects the Bank of Japan's next 25 basis point hike to come in July 2026, but warned that further yen depreciation could bring forward the timing and open the door to more rate increases.\nThe bank flagged April as a possible alternative, citing the release of the BOJ's quarterly Outlook report and improved clarity on this year's Shunto wage talks, with another 25 bps hike potentially following later in 2026.\nJapan's headline inflation rate in December slowed sharply to 2.1%, its lowest level since March 2022. Its core inflation rate came in at 2.4% on year, in line with analysts' estimates.\nJapan's Nikkei 225 was 0.3% higher, while the Topix added 0.6%. South Korea's Kospi rose 0.8%, while the small-cap Kosdaq was up 1.86%.\nSome tech stocks in Asia fell after shares of California-based Intel plummeted 13% in after-hours U.S. trading on its soft guidance for the current quarter, despite posting fourth-quarter earnings beat Thursday. SoftBank Group was down over 4%, while Lasertec fell nearly 6%. Tokyo Electron declined over 1%. South Korea's SK Hynix dipped 1%.\nHong Kong Hang Seng Index added 0.27%, while the CSI 300 slid 0.29%.\nAustralia's S&P/ASX 200 climbed 0.16%.\nOvernight in the U.S., the main benchmarks extended their gains from the previous session after Greenland tensions ease.\nThe Dow Jones Industrial Average advanced 306.78 points, or 0.63%, and closed at 49,384.01. The 30-stock index recovered from the losses seen earlier this week following President Donald Trump's new Europe tariffs announcement.\nThe S&P 500 climbed 0.55% and ended at 6,913.35. The Nasdaq Composite advanced 0.91% and settled at 23,436.02, supported by gains in Nvidia, Microsoft and Meta Platforms\n—CNBC's Sean Conlon and Pia Singh contributed to this report."
            }
        ]
    }
]