[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "54.310",
            "open": "3,746.040",
            "close": "3,763.950",
            "high": "3,791.120",
            "low": "3,736.810"
        },
        "market_summary": "Gold has reached new record highs, driven by a combination of factors including expectations of further interest rate cuts from the US Federal Reserve, a weakening US dollar that boosts international demand, and ongoing geopolitical tensions and inflation fears. This rally is also lifting silver to multi-year highs, with analysts maintaining a bullish short-term outlook despite the potential for profit-taking pullbacks. The market's momentum is underpinned by a view that these supportive macroeconomic conditions are likely to persist.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Gold climbs to new record high as wars and inflation fears drive haven demand - Yahoo",
                "source": "Yahoo",
                "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_e42d6538-6b1b-4199-887e-20980b981f7c",
                "body": "Yahoo is part of the Yahoo family of brands.\nWhen you use our sites and apps, we use cookies to:\n- provide our sites and apps to you\n- authenticate users, apply security measures, and prevent spam and abuse, and\n- measure your use of our sites and apps\nIf you click '\nAccept all', we and\nour partners, including 238 who are part of the IAB Transparency & Consent Framework, will also store and/or access information on a device (in other words, use cookies) and use precise geolocation data and other personal data such as IP address and browsing and search data, for analytics, personalised advertising and content, advertising and content measurement, and audience research and services development.\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\nIf you would like to customise your choices, click 'Manage privacy settings'.\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy & cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our privacy policy and cookie policy."
            },
            {
                "title": "Global gold price hits record high on US Federal Reserve rate cut bets - Nation Thailand",
                "source": "Nation Thailand",
                "url": "https://www.nationthailand.com/business/trading-investment/40055806",
                "body": "Spot gold broke above US$3,759.02 per ounce on Tuesday before easing slightly to US$3,743.39 in Asian morning trade. The rally followed last week’s Fed rate cut of 0.25%, with markets now pricing in further reductions.\nA softer US dollar, down 0.1%, has added momentum by making gold cheaper for foreign buyers. December gold futures also edged up 0.1% to US$3,779.50.\nAnalysts at OANDA said the short-term outlook remains bullish, though profit-taking could trigger intraday pullbacks. Key support levels are seen at US$3,710 and US$3,690.\nThe Fed is set to revisit its policy path within five weeks, with newly appointed governor Stephen Miran joining Chair Jerome Powell in upcoming meetings.\nPowell’s speech later tonight is closely watched for clearer guidance. Miran has urged swift cuts to support jobs, though other officials warn against underestimating inflationary risks.\nAccording to the CME FedWatch Tool, investors see a 90% chance of another 0.25% cut in October and a 75% probability of a further cut in December.\nANZ Bank noted that slowing global growth, persistent inflation, a weaker dollar and geopolitical tensions are underpinning demand for gold.\nThe bank added that strong appetite for the metal could spill over to silver, even though prices eased 0.9% to US$43.67 per ounce, near a 14-year high. Platinum fell 0.3% to US$1,412.80, while palladium slipped 0.2% to US$1,176.44."
            },
            {
                "title": "Gold and Silver Soar as Weakening Dollar and Falling Interest Rates Ignite Precious Metals Rally - FinancialContent",
                "source": "FinancialContent",
                "url": "https://markets.financialcontent.com/stocks/article/marketminute-2025-9-23-gold-and-silver-soar-as-weakening-dollar-and-falling-interest-rates-ignite-precious-metals-rally",
                "body": "The global financial markets are witnessing a significant surge in gold and silver prices, driven by a weakening US Dollar and the ongoing prospect of declining US interest rates. This dynamic, which has seen gold reach record highs and silver hit a 14-year peak in 2025, underscores the enduring inverse relationship between the greenback's strength and the value of these dollar-denominated precious metals. For international buyers, a softer dollar translates into more affordable gold and silver, fueling demand and reshaping investment strategies worldwide.\nThe Dollar's Dip: What Happened and Why It Matters\nThe recent rally in gold and silver is a direct consequence of the US Dollar's depreciation against other major currencies. Gold and silver, universally priced in US Dollars, become inherently cheaper for buyers holding Euros, Yen, or other non-dollar currencies when the dollar weakens. This increased purchasing power for international investors significantly boosts demand, pushing up the dollar price of these precious commodities. The catalyst for this dollar weakness largely stems from the Federal Reserve's dovish stance, with market expectations firmly set on further cuts to US interest rates.\nWhen US interest rates fall, dollar-denominated assets such as Treasury bonds offer lower yields, diminishing their attractiveness to foreign capital. This outflow or reduced inflow of investment demand for dollar assets contributes to the currency's depreciation. Furthermore, lower interest rates reduce the \"opportunity cost\" of holding non-yielding assets like gold and silver. In an environment where traditional interest-bearing investments offer meager returns, the appeal of precious metals as a store of value and an inflation hedge grows substantially, drawing in more capital and reinforcing their price appreciation. This confluence of factors creates a powerful updraft for gold and silver, reaffirming their role as critical components of a diversified portfolio, especially during periods of monetary easing.\nHow a Weak Dollar Might Affect the Market\nThe current market dynamics present a clear delineation of winners and losers within the precious metals industry and broader financial landscape. Mining companies stand to gain significantly from sustained high gold and silver prices. Companies like Barrick Gold (NYSE: GOLD), Newmont (NYSE: NEM), and Pan American Silver (NASDAQ: PAAS) will see their revenues per ounce sold increase, directly boosting their profit margins, particularly if their operational costs remain stable or rise at a slower pace. A weaker dollar also benefits miners with substantial international operations, as their foreign currency-denominated costs become relatively cheaper when converted back to a depreciated dollar. This increased profitability can enable greater investment in exploration, development of new projects, and potentially higher shareholder returns.\nConversely, a strengthening dollar and subsequent decline in precious metal prices would exert downward pressure on these companies' profitability, making new projects less viable and potentially leading to a contraction in the sector. Refiners and fabricators, such as Valcambi and Johnson Matthey (LSE: JMAT), also experience a boost. While their business often relies on processing fees, rising precious metal prices increase the value of their inventory and the overall market activity, leading to greater demand for their services and potentially higher revenues. Investors might also gravitate towards precious metals ETFs and related financial instruments, seeing them as a safer harbor against dollar devaluation and inflation.\nBeyond the direct players, the broader market implications are noteworthy. A weaker dollar can make US exports more competitive, potentially benefiting American manufacturing and export-oriented sectors. However, it also makes imports more expensive, which could contribute to inflationary pressures. For international investors, "
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.920",
            "open": "66.541",
            "close": "67.699",
            "high": "67.936",
            "low": "66.016"
        },
        "market_summary": "Brent crude oil prices are hovering around $67.80, supported in the short term by a decline in U.S. crude inventories and supply disruptions from Iraqi Kurdistan. However, these gains are being constrained by concerns over a looming oversupply, driven by rising Iraqi exports and unwinding OPEC+ production cuts. The longer-term outlook remains bearish, with forecasts suggesting a decline in prices due to anticipated inventory builds and weak global demand conditions.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Crude oil prices rise to $67.80 amid U.S. inventory decline, tightening supply concerns - Economy Middle East",
                "source": "Economy Middle East",
                "url": "https://economymiddleeast.com/news/crude-oil-prices-rise-to-67-80-amid-u-s-inventory-decline-tightening-supply-concerns/",
                "body": "Oil prices saw an increase for a second consecutive day on Wednesday, following an industry report indicating a decline in U.S. crude inventories last week. This development has contributed to a growing perception in the market regarding tightening supplies.\nBrent futures rose by 17 cents to $67.80 a barrel, while U.S. West Texas Intermediate crude futures increased by 19 cents to $63.60. Both benchmarks surged by more than $1 a barrel on Tuesday, as a deal to resume exports from Iraq’s Kurdistan faced setbacks. This situation has halted pipeline shipments of oil from the region to Turkey, despite optimism surrounding a potential resolution to the deadlock, particularly as two key producers requested guarantees for debt repayment.\nPipeline flows on hold\nThe agreement involving Iraq’s federal and Kurdish regional governments, along with oil companies, aims to restart exports of approximately 230,000 barrels per day of oil. Notably, pipeline flows have been suspended since March 2023.\nLater in the day, figures released by the American Petroleum Institute revealed that U.S. crude and gasoline stocks experienced a decline, while distillate stocks showed an increase last week, as reported by market sources referencing the API data. The data indicated that crude stocks decreased by 3.82 million barrels in the week ending September 19. Furthermore, gasoline inventories dropped by 1.05 million barrels, while distillate inventories rose by 518,000 barrels.\nOfficial U.S. government energy data is scheduled for release on Wednesday, with expectations of an increase in both crude oil and gasoline stockpiles, alongside a likely decline in distillates.\nRead more: Crude oil prices dip to $66.21 as concerns over oversupply grow\nOPEC+ production adjustments\nGlobally, OPEC+ has been adjusting production cautiously amid a mixed outlook. After a series of output increases in recent months, including a collective raise by over half a million barrels per day in September, OPEC+ members continue balancing rising supply with evolving demand conditions. Saudi Arabia, Iraq, the UAE, and Kuwait have notably contributed to increased output as the oil market navigates a fragile equilibrium between oversupply risks and geopolitical uncertainties such as EU sanctions on Russian oil and Middle East tensions. The International Energy Agency (IEA) projects growing global oil supply this year, potentially resulting in surpluses extending into 2026, which tempers expectations for price rallies despite current supply interruptions.\nPrice forecasts indicate decline\nMoreover, price forecasts suggest a possible downward adjustment in Brent crude prices in the coming months, with the U.S. Energy Information Administration predicting Brent could drop to around $59 a barrel in the fourth quarter of 2025 and potentially near $50 by early 2026, influenced by anticipated inventory builds and OPEC+ production increases. However, short-term volatility remains high due to geopolitical risks and supply chain uncertainties, including prospective new EU sanctions on Russian exports and disruptions in key producing regions."
            },
            {
                "title": "Oil prices rise for second consecutive day amid shrinking US inventories - Українські Національні Новини",
                "source": "Українські Національні Новини",
                "url": "https://unn.ua/en/news/oil-prices-rise-for-second-consecutive-day-amid-us-inventory-drawdowns",
                "body": "Oil prices rise for second consecutive day amid shrinking US inventories\nKyiv • UNN\nBrent crude futures rose to $67.82 a barrel, while WTI rose to $63.62. The price increase is due to a decrease in oil inventories in the US and the cessation of exports from Iraqi Kurdistan.\nOil prices rose for a second straight day on Wednesday after an industry report showed a decline in US crude inventories last week, reinforcing a sense of tightening supply in the market, UNN reports, citing Reuters.\nDetails\nBy 04:00 GMT (07:00 Kyiv time), Brent crude futures were up 19 cents, or 0.3%, at $67.82 a barrel. US West Texas Intermediate crude futures rose 21 cents, or 0.3%, to $63.62.\nBoth benchmark grades rose more than $1 a barrel on Tuesday amid a stalled deal to resume exports from Iraqi Kurdistan, halting pipeline oil flows from the region to Turkey, despite hopes for a deal to resolve the issue, as two key producers sought debt repayment guarantees.\nThe agreement between Iraq's federal and Kurdish regional governments and oil companies provides for the resumption of oil exports of about 230,000 barrels per day. Pipeline supplies have been suspended since March 2023.\n\"Prices are expected to remain supported but in a limited range in the near term,\" said Emril Jamil, senior oil analyst at LSEG.\nOngoing supply disruptions from Russia are supporting prices, but further gains are being constrained by uncertainty over the US Federal Reserve's interest rate decisions, Jamil added.\nTrump to talk to Orban about Hungary buying Russian oil23.09.25, 21:21 • 11325 views\nData from the American Petroleum Institute (API) showed that US crude and gasoline inventories fell last week, while distillate inventories rose, market sources said. According to sources, crude inventories fell by 3.82 million barrels in the week ended September 19, while gasoline inventories fell by 1.05 million barrels and distillate inventories rose by 518,000 barrels. Official US government energy data will be released on Wednesday. It is expected to show an increase in both crude and gasoline inventories and a likely decrease in distillate inventories.\nThere are other signs of tightening supply: Reuters reports that Chevron, the largest US company, will only be able to export about half of the 240,000 barrels of oil per day it produces jointly with partners in Venezuela.\nIn July, the company received permission to operate in the sanctioned country, but new rules will mean less heavy, high-sulfur crude produced in Venezuela will flow to the US."
            },
            {
                "title": "Could Iraq's oil exports exacerbate oil market tensions? - Oil Review Middle East",
                "source": "Oil Review Middle East",
                "url": "https://oilreviewmiddleeast.com/industry/could-iraqs-oil-exports-exacerbate-oil-market-tensions",
                "body": "The oil market landscape for Q4 2025 is looking highly volatile, with rising oil exports from Iraq exacerbating oversupply concerns, says Mohanad Yakout, senior markets analyst at Scope Markets\nOil prices are hovering around US$67 as the IEA warns of a ‘looming oversupply’ outweighing geopolitical tensions in Russia and the Middle East.\nAdding to pressures including the unwinding of OPEC + production cuts and higher non-OPEC production is the prospect of rising oil exports from Iraq, OPEC’s second-largest producer. The country has increased oil exports under the OPEC+ agreement, according to state oil marketing organisation SOMO, as reported by Reuters. It expects September's exports to range from 3.4-3.45 mn bpd, up from around 3.38mn bpd in August.\nBaghdad is also reported to have come to a preliminary agreement with the Kurdistan region to resume pipeline oil exports from the Kurdistan region through Turkey, amounting to around 230,000 bpd, after a two-year hiatus.\n“This shift comes as part of Iraq’s broader effort to boost production after a relaxation of some commitments under the OPEC+ agreement and to strengthen the country’s financial revenue,” comments Yakout.\n“However, despite the clear benefits of this move in terms of revenue generation and improved financial liquidity, multiple risks loom over the global oil market as the end of 2025 approaches. First, there's the risk of oversupply, especially if the Kurdistan pipeline returns to full capacity without alignment with global demand, which is expected to remain relatively weak due to global economic conditions and the accelerating shift toward renewable energy and electric vehicles.\n“Second, there are logistical, legal, and political risks related to the ongoing dispute between Baghdad and Erbil over export contracts, revenue sharing, or obligations to foreign companies. Any delays or sudden stoppages could disrupt pipeline flows and undermine investor and market confidence.\n“Third, price volatility remains a major concern. Geopolitical tensions in the Middle East or the imposition of sanctions on supplies from countries like Russia could trigger sharp market swings, especially if news is conflicting or if the implementation of agreements faces obstacles.”\nYakout concludes that the oil landscape for Q4 2025 looks highly volatile.\n“While the increase in exports offers an opportunity to bolster Iraq’s financial position and improve revenues, the success of this strategy depends on legal and political stability, infrastructure reliability, alignment with global supply and demand, and effective risk management. If these factors are handled properly, Iraq stands to gain significantly, but if markets are caught off guard by any serious disruptions, prices could fall, and market tensions may rise.”"
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "2.030",
            "open": "62.653",
            "close": "63.988",
            "high": "64.208",
            "low": "62.178"
        },
        "market_summary": "WTI crude oil prices are rising due to tightening supply conditions, primarily driven by a significant draw in US crude inventories and ongoing export disruptions from Iraqi Kurdistan. These bullish factors are, however, being tempered by bearish headwinds including a warning from the IEA of a potential global supply glut and uncertainty over future Federal Reserve interest rate decisions. The market is caught between these opposing forces of immediate physical tightness and a weaker future demand outlook.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Oil prices rise for second consecutive day amid shrinking US inventories - Українські Національні Новини",
                "source": "Українські Національні Новини",
                "url": "https://unn.ua/en/news/oil-prices-rise-for-second-consecutive-day-amid-us-inventory-drawdowns",
                "body": "Oil prices rise for second consecutive day amid shrinking US inventories\nKyiv • UNN\nBrent crude futures rose to $67.82 a barrel, while WTI rose to $63.62. The price increase is due to a decrease in oil inventories in the US and the cessation of exports from Iraqi Kurdistan.\nOil prices rose for a second straight day on Wednesday after an industry report showed a decline in US crude inventories last week, reinforcing a sense of tightening supply in the market, UNN reports, citing Reuters.\nDetails\nBy 04:00 GMT (07:00 Kyiv time), Brent crude futures were up 19 cents, or 0.3%, at $67.82 a barrel. US West Texas Intermediate crude futures rose 21 cents, or 0.3%, to $63.62.\nBoth benchmark grades rose more than $1 a barrel on Tuesday amid a stalled deal to resume exports from Iraqi Kurdistan, halting pipeline oil flows from the region to Turkey, despite hopes for a deal to resolve the issue, as two key producers sought debt repayment guarantees.\nThe agreement between Iraq's federal and Kurdish regional governments and oil companies provides for the resumption of oil exports of about 230,000 barrels per day. Pipeline supplies have been suspended since March 2023.\n\"Prices are expected to remain supported but in a limited range in the near term,\" said Emril Jamil, senior oil analyst at LSEG.\nOngoing supply disruptions from Russia are supporting prices, but further gains are being constrained by uncertainty over the US Federal Reserve's interest rate decisions, Jamil added.\nTrump to talk to Orban about Hungary buying Russian oil23.09.25, 21:21 • 11325 views\nData from the American Petroleum Institute (API) showed that US crude and gasoline inventories fell last week, while distillate inventories rose, market sources said. According to sources, crude inventories fell by 3.82 million barrels in the week ended September 19, while gasoline inventories fell by 1.05 million barrels and distillate inventories rose by 518,000 barrels. Official US government energy data will be released on Wednesday. It is expected to show an increase in both crude and gasoline inventories and a likely decrease in distillate inventories.\nThere are other signs of tightening supply: Reuters reports that Chevron, the largest US company, will only be able to export about half of the 240,000 barrels of oil per day it produces jointly with partners in Venezuela.\nIn July, the company received permission to operate in the sanctioned country, but new rules will mean less heavy, high-sulfur crude produced in Venezuela will flow to the US."
            },
            {
                "title": "Crude, Gasoline Inventories Continue to Fall - Crude Oil Prices Today | OilPrice.com",
                "source": "Crude Oil Prices Today | OilPrice.com",
                "url": "https://oilprice.com/Latest-Energy-News/World-News/Crude-Gasoline-Inventories-Continue-to-Fall.html",
                "body": "Israel is testing Gulf partners’…\n\"It's most important 8 minute read of my week…\"\nThe American Petroleum Institute (API) estimated that crude oil inventories in the United States fell by 3.821 million barrels in the week ending September 19. This week’s draw follows last week’s 3.420 million barrel draw.\nSo far this year, crude oil inventories are up just 1.5 million barrels, according to Oilprice calculations of API data.\nEarlier this week, the Department of Energy (DoE) reported that crude oil inventories in the Strategic Petroleum Reserve (SPR) rose by 300,000 barrels to 406 million barrels in the week ending September 19.\nAt 402 pm ET, Brent crude was trading up $1.36 (+2.04%) on the day, reaching $67.93. While up on the day, the figure is down $0.50 per barrel from this time last week. WTI was also trading up on the day, by $1.41 (+2.26%) at $63.69—a nearly $0.80 per barrel drop week over week.\nGasoline inventories fell by 1.046 million barrels in the week ending September 19, after falling by 691,000 barrels in the week prior. As of last week, gasoline inventories were already 1% below the five-year average for this time of year, according to the latest EIA data.\nDistillate inventories rose again this week, adding 518,000 barrels, following the week prior’s 1.906-million-barrel gain. Distillate inventories were 8% below the five-year average as of the week ending September 12, the latest EIA data shows.\nCushing inventories grew by 72,000 barrels in the week.\nBy Julianne Geiger for Oilprice.com\nMore Top Reads From Oilprice.com\nADVERTISEMENT\nJulianne Geiger is a veteran editor, writer and researcher for Oilprice.com, and a member of the Creative Professionals Networking Group."
            },
            {
                "title": "As The IEA Warns Of An Oil Supply Glut, Make This 1 Trade Here - Barchart.com",
                "source": "Barchart.com",
                "url": "https://www.barchart.com/story/news/34981771/as-the-iea-warns-of-an-oil-supply-glut-make-this-1-trade-here",
                "body": "December micro WTI crude oil (CLZ25) futures present a selling opportunity on more price weakness.\nSee on the daily bar chart for December crude oil futures that a price downtrend is in place and the bears have the slight near-term technical advantage as prices hover just above key technical support at the August low.\nFundamentally, global crude oil demand growth is slowing at the same time crude oil supplies are on the rise, including a recent OPEC-plus increase in its collective production quota. The International Energy Agency recently warned of a global crude oil supply glut that is coming.\nA move in December crude oil futures below solid chart support at the August low of $60.57 would give the bears more power and it would also become a selling opportunity in the micro WTI crude oil futures. The downside price objective would be $53.00 or below. Technical resistance, for which to place a protective buy stop just above, is located at $64.00.\nIMPORTANT NOTE: I am not a futures broker and do not manage any trading accounts other than my own personal account. It is my goal to point out to you potential trading opportunities. However, it is up to you to: (1) decide when and if you want to initiate any trades and (2) determine the size of any trades you may initiate. Any trades I discuss are hypothetical in nature.\nHere is what the Commodity Futures Trading Commission (CFTC) has said about futures trading (and I agree 100%):\nTrading commodity futures and options is not for everyone. IT IS A VOLATILE, COMPLEX AND RISKY BUSINESS. Before you invest any money in futures or options contracts, you should consider your financial experience, goals and financial resources, and know how much you can afford to lose above and beyond your initial payment to a broker. You should understand commodity futures and options contracts and your obligations in entering into those contracts. You should understand your exposure to risk and other aspects of trading by thoroughly reviewing the risk disclosure documents your broker is required to give you.\nOn the date of publication, Jim Wyckoff did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. For more information please view the Barchart Disclosure Policy here."
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0042",
            "open": "1.1794",
            "close": "1.1813",
            "high": "1.1820",
            "low": "1.1778"
        },
        "market_summary": "The EUR/USD is holding steady above the 1.1800 level, supported by a weakening U.S. Dollar due to high market expectations for Fed rate cuts in October and a more hawkish hold stance from the ECB. While both regions face economic slowdowns evidenced by soft PMI data, the perceived monetary policy divergence is currently underpinning the pair. Traders are focused on upcoming U.S. data and Fed speeches for further direction.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "EUR/USD steady as Powell's stance and weak PMIs favor Euro's upside - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/eur-usd-steady-as-powell-comments-and-slowing-pmis-highlight-fed-ecb-divergence-202509232220",
                "body": "- EUR/USD unmoved as Powell said that policy remains modestly restrictive but flexible.\n- Flash PMIs in US and Eurozone show slowing activity, raising concerns over GDP prints later this week.\n- Fed expected to cut in October while ECB seen on hold, favoring EUR/USD’s upside.\nThe EUR/USD holds firm above the 1.1800 figure on Tuesday after the Federal Reserve Chair Jerome Powell remained neutral and business activity data in Europe and the United States, hints that both economies are slowing down. The pair trades with modest gains of 0.09%.\nDollar stays pressured by risk appetite; Fed-ECB policy divergence underpins Euro\nRisk appetite keeps the Dollar pressured, yet the Euro failed to capitalize on its weakness. The Fed Chair Jerome Powell crossed the newswires and nearly repeated what did he said at the Federal Open Market Committee (FOMC) press conference.\nHe said that the policy path is difficult as the central bank must look at both goals of the dual mandate “equally.” He reiterated the downside risks in the labor market hhad risen, though that inflation remains “somewhat elevated,” despite coming into better balance. He added that the current monetary policy stance remains “modestly restrictive, leaves us well positioned to respond to potential economic developments.”\nData-wise, Flash Purchasing Managers’ Index (PMI) in the US and the Eurozone showed that business activity slowed, which could weigh on the release of economic growth figures, with the US Gross Domestic Product (GDP) set to be released in the week.\nFed vs. ECB monetary policy divergence, favors Euro’s appreciation\nDespite this, the Federal Reserve is expected to reduce interest rates at the October meeting, as revealed by the Prime Market Terminal interest rate probability tool. The European Central Bank (ECB) is foreseen to hold rates firm, following remarks by President Lagarde after the last ECB’s meeting, who said “The disinflation process is over.”\nOn Wednesday, the docket will feature Germany’s IFO Business Climate, Current Assessment and Expectations for September. In the US, traders await for housing data and Fed speakers.\nDaily market movers: Euro consolidate despite US, EZ economic slowdown\n- Earlier, US S&P Global Manufacturing PMI dipped in September to 52.0 from 53.0 reported in the previous print. Meanwhile, the Services PMI fell to 53.9 from 54.5 in August. S&P Global revealed that prices paid rose to 62.6 in September, up from 60.8 last month as business mentioned tariffs “as the principal cause of further cost increases.”\n- Fed Chair Jerome Powell mentioned that “downside risks to employment shifted balance of risks, prompting to last week’s rate cut,” and that the rate cut moved policy to a more neutral stance. Despite acknowledging employment risks, he said that “two-sided risks mean there is no risk-free path.”\n- Atlanta Fed President Raphael Bostic said he is open to adopting an inflation target range and warned of further inflationary pressures ahead.\n- Fed Governor Michelle Bowman signaled she anticipates three rate cuts in 2025 to support the labor market. Meanwhile, Chicago Fed President Austan Goolsbee emphasized the need for the central bank to bring inflation back to its 2% target.\n- The Eurozone HCOB Manufacturing PMI in September dipped from 50.7 to 49.5, below forecasts for an expansion of 50.9. The Services PMI for the same period rose by 51.4 up from August’s and estimates of 50.5.\n- The US Dollar Index (DXY) which tracks the American currency value against a basket of six peers, tumbles 0.09% down at 97.21.\n- The Federal Reserve is expected to cut rates 25 bps at the October 19 meeting, as revealed by data from Prime Market Terminal. Odds are at 91%.\nTechnical outlook: EUR/USD climb back above 1.1800\nEUR/USD uptrend remains intact as a ‘bullish engulfing’ candle chart pattern emerged and pushed prices back above 1.1800. Although the pair reached a weekly peak of 1.1820, price action is muted, with buyers unable to push prices"
            },
            {
                "title": "EUR/USD Price Forecast - EUR to USD Steadies at 1.1800 as DXY Slips to 97.31, Powell Speech and PMIs Loom - tradingnews.com",
                "source": "tradingnews.com",
                "url": "https://www.tradingnews.com/news/eur-usd-price-forecast-eur-to-usd-holds-11800-powell-pmi-data-in-focus",
                "body": "EUR/USD Price Forecast - EUR to USD Holds 1.1800 as Dollar Weakens, Powell and PMI Data in Focus\nPair trades above 50-EMA at 1.1770 with RSI at 52; DXY at 97.31 as Fed split widens. Traders eye Powell’s Sept 24 speech, US PCE at 2.6% YoY, and Eurozone confidence at -14.9 | That's TradingNEWS\nEUR/USD Holds 1.1800 as Dollar Weakens into Powell Speech\nThe EUR/USD (EUR/USD) pair is stabilizing near 1.1800, recovering from intraday lows at 1.1775 as traders balance Eurozone weakness against U.S. policy uncertainty. The U.S. Dollar Index (DXY) sits at 97.39, slipping from Monday’s high of 97.78 after dovish commentary from Fed officials, while expectations for Powell’s upcoming remarks on Tuesday dominate sentiment. Futures markets are pricing a 90% probability of a 25 bp cut in October and nearly an 80% chance of another cut in December, keeping pressure on the greenback despite mixed internal Fed views.\nDivergent Fed Signals Keep Dollar Volatile\nFederal Reserve officials have split sharply, leaving markets without a clear anchor. Atlanta Fed’s Raphael Bostic and Cleveland Fed’s Beth Hammack warned against rushing into more easing, citing sticky inflation risks. St. Louis Fed’s Alberto Musalem backed last week’s cut as a labor market safeguard but stressed “limited room” for more reductions. By contrast, Governor Stephen Miran pushed for an immediate 50 bp cut, calling current policy excessively restrictive with the neutral rate closer to 2%. This policy divide leaves the dollar exposed to each new data point, reinforcing volatility in EUR/USD.\nEurozone PMI Data Highlights Manufacturing Strain\nFresh Eurozone PMI readings underscore an uneven recovery. The manufacturing index fell deeper into contraction at 45.9, while services provided some relief at 50.5, keeping the composite index just above 48. Germany’s data showed similar divergence, while French PMIs contracted across both sectors, raising concerns about Europe’s second-largest economy. Despite this, Eurozone consumer confidence improved to -14.9 in September, beating August’s -15.5, hinting that sentiment may be stabilizing. For EUR/USD, the resilience in services helps prevent a sharper breakdown below 1.1775, but structural headwinds remain.\nU.S. Data and Treasury Yields in Focus\nThe U.S. side offers a mixed picture. PMI readings are due Tuesday and could tilt market expectations quickly. Consensus forecasts U.S. GDP growth at 3.3% annualized for Thursday’s release, while Friday’s core PCE inflation is expected to hold at 2.6% YoY, the Fed’s preferred measure. The 10-year Treasury yield at 4.12% reflects anticipation of Powell’s direction, with traders wary of a hawkish pushback that could reignite dollar strength. A softer tone from Powell would likely send EUR/USD through 1.1820 resistance, opening a move toward 1.1874–1.1918, while hawkish signals could drag the pair back toward 1.1726 support.\nRead More\n-\nXME ETF at $91.50 With +59.7% YTD Rally, Uranium and Gold Drive Gains\n23.09.2025 · TradingNEWS ArchiveStocks\n-\nBitcoin ETF Inflows Surge $887M as BlackRock’s IBIT Nears $85B AUM and 57.5% Share\n23.09.2025 · TradingNEWS ArchiveCrypto\n-\nNatural Gas Price Forecast - NG=F Holds $2.85 as EU Storage Hits 81.6% and Options Price €50/MWh Surge\n23.09.2025 · TradingNEWS ArchiveCommodities\n-\nUSD/JPY Price Forecast - Dollar to Yen at 148.40 as Fed Cuts Clash With BoJ Hawkish Signals, CPI in Focus\n23.09.2025 · TradingNEWS ArchiveForex\nTechnical Picture: Neutral but Skewed Bullish\nOn the charts, EUR/USD is consolidating above its 50-EMA at 1.1770 and 200-EMA at 1.1705, maintaining a slight bullish bias. RSI sits near 52, reflecting balanced momentum but leaning toward the upside. Immediate resistance is layered at 1.1820 and 1.1875, while support rests at 1.1775 and 1.1700. A break below 1.1700 exposes 1.1650, while a sustained close above 1.1830 would confirm bullish continuation. Traders remain locked on Powell’s Tuesday speech as the deciding catalyst for a breakout.\nStrategic "
            },
            {
                "title": "EUR/USD Outlook: Choppy Near 1.18, Focus on US PMI, Fed - Forex Crunch",
                "source": "Forex Crunch",
                "url": "https://www.forexcrunch.com/blog/2025/09/23/eur-usd-outlook-choppy-near-1-18-focus-on-us-pmi-fed/",
                "body": "- The EUR/USD outlook remains supported as Eurozone PMI data showed contraction in manufacturing but resilience in services.\n- Fed officials remain divided on further cuts, keeping dollar strength in play.\n- Market focus turns to U.S. GDP and PCE inflation for direction in EUR/USD.\nThe EUR/USD outlook remains steady near the 1.1800 handle on Tuesday after bouncing from the intraday lows of 1.1775, with traders balancing mixed Eurozone PMI readings against expectations of US PMIs and the Fed speech.\n–Are you interested in learning more about MT5 brokers? Check our detailed guide-\nThe preliminary Eurozone data revealed contraction in manufacturing, while services accelerated above the forecast. Germany mirrored the divergence, while the French manufacturing and services sectors contracted, raising concerns about the country’s second-largest economy. Such an uneven recovery provides short-term support to the euro but underscores structural headwinds.\nOn the US side, the markets are digesting the Fed’s rate cut last week. Although the rate cut briefly weakened the dollar, hawkish commentary from the Fed Chair capped the upside in EUR/USD. The Fed remains split, with seven members seeing no further cuts in 2025, while ten members favor a 50-basis-point rate cut by the end of 2025.\nKey Events Ahead\n- US PMI (Tuesday): PMI readings due today could shape the pair’s trend.\n- US GDP data (Thursday): Consensus at 3.3% annualised growth.\n- US PCE Price Index (Friday): Fed’s preferred inflation gauge, expected unchanged at 2.6% YoY.\n- Fed speeches: Jerome Powell, Michelle Bowman, Raphael Bostic, Stephen Miran, and Beth Hammack could shift rate expectations.\n- Eurozone economic data: Follow-up business sentiment and consumer confidence will provide clarity on whether the services momentum can offset manufacturing weakness.\nEUR/USD technical outlook: Downside appears limited\nThe 4-hour chart for the EUR/USD shows consolidation above the confluence of 20- and 50-period MAs. However, a strong bearish pinbar could limit the gains and keep pressure on the buyers. The RSI remains above the 50.0 level, indicating a gradual bullish trend.\n–Are you interested in learning more about forex signals telegram groups? Check our detailed guide-\nThe immediate support lies at 1.1775, which could help maintain the bullish momentum ahead of 1.1700 and then 1.1650. On the upside, the immediate resistance is located at 1.1830, followed by 1.1900 and then 1.1930.\nLooking to trade forex now? Invest at eToro!\n68% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money."
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0049",
            "open": "1.3502",
            "close": "1.3524",
            "high": "1.3536",
            "low": "1.3486"
        },
        "market_summary": "The GBP/USD is consolidating around the 1.35 handle, caught between conflicting forces. Sterling is pressured by weak UK PMI data signaling slowing growth and a deteriorating fiscal outlook with higher-than-expected government borrowing. However, the pair is finding support from a policy divergence narrative, where the Bank of England is expected to lag behind a potentially more dovish Federal Reserve in cutting interest rates.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "GBP/USD Forecast: Policy divergence keeps cable supported for now - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/gbp-usd-forecast-policy-divergence-keeps-cable-supported-for-now/",
                "body": "- GBP/USD forecast remains modestly bullish despite UK growth concerns\n- Dollar weakness persists as markets eye dovish Fed expectations\n- Bank of England likely to lag Fed in rate cuts, keeping sterling supported\nThe pound edged higher against the dollar as the greenback lost steam following its brief post-FOMC recovery. What’s interesting here is that the move came despite some rather disappointing UK PMI numbers, which showed momentum in Britain’s economy slipping. Yet, the market seems more focused on the policy divergence story — with the Bank of England likely to keep rates elevated for longer than the Federal Reserve. This is preventing the GBP/USD forecast to turn bearish just yet, with the pair looking to consolidate around the $1.35 handle.\nDollar makes weaker start to the week\nThe dollar softened at the start of the week, even as several Fed officials struck a more cautious note on rate cuts. Today, the dollar index was trading flat-ish as the major currency pairs traded mixed and without much conviction.\nMeanwhile, from a data point of view, US PMIs came broadly in line with forecasts, though the Richmond manufacturing index disappointed, highlighting the softer tone in recent American data. This backdrop keeps pressure on the dollar, with downside risks dominating the near-term outlook.\nThis week we have plenty of Fed speakers. Yesterday, policymakers such as Musalem, Bostic, and Hammack all sounded relatively hawkish, but their stance failed to sway markets much. Investors appear more convinced by softer economic data and the Fed’s own guidance pointing towards rate cuts ahead. More Fedspeak is on the way. Jerome Powell is due to speak today, though he’s unlikely to deviate from last week’s comments.\nUK PMIs signal weakening momentum\nAcross the Atlantic, UK business activity clearly slowed in September. The services PMI fell to 51.9 from 54.2, manufacturing slipped further into contraction at 46.2, and, as a result, the composite index dropped to 51.0 from 53.5. The figures underline a loss of confidence as firms brace for potential tax hikes in the coming budget.\nNormally, such soft data would weigh on the GBP/USD forecast. But the cablehas held up relatively well, partly because inflation in Britain is still running close to 4% — almost double the BoE’s target. This keeps the prospect of UK rates staying higher for longer alive, contrasting with expectations of further Fed cuts.\nTechnical GBP/USD forecast: Key levels to watch\nWith EUR/GBP touching a two-month high, sterling’s resilience may not extend across the board. But against the dollar, the narrative still tilts in favour of the pound, at least until the Fed’s dovish turn is fully priced in. Indeed, the GBP/USD chart was holding steady around the 1.35 handle at the time of writing. Short-term resistance is seen around 1.3540 to 1.358, while support comes in between 1.3434 to 1.3460.\n-- Written by Fawad Razaqzada, Market Analyst\nFollow Fawad on Twitter @Trader_F_R"
            },
            {
                "title": "GBP/USD Price Forecast - GBP to USD Steady at 1.3518 After UK PMI Miss and £18B Borrowing Surge - tradingnews.com",
                "source": "tradingnews.com",
                "url": "https://www.tradingnews.com/news/gbp-usd-price-forecast-gbp-to-usd-holds-13518-as-weak-uk-pmi-and-18b-pound-borrowing-clash",
                "body": "GBP/USD Price Forecast - GBP to USD Holds 1.3518 as Weak UK PMI and £18B Borrowing Clash With Fed’s Hawkish Cut\nSterling pressured by PMI miss and fiscal slippage while Powell’s balanced stance supports USD; GBP/USD trapped between 1.3480–1.3550 with breakout to decide next leg toward 1.3400 or 1.3600+ | That's TradingNEWS\nGBP/USD Holds 1.3518 After PMI Miss and Fed Hawkish Tilt\nWeak UK Data Adds Pressure on Sterling\nThe British pound remains under strain after the latest UK PMI reports signaled slowing activity. The Composite PMI fell to 51.0, well below expectations of 52.7 and the prior 53.5, showing the expansion of business activity is losing steam. Manufacturing PMI contracted deeper at 46.2 versus consensus 47.0, while services softened to 51.9 from 54.2. These figures underscore the fragility of the UK economy, raising fears that growth momentum is fading just as inflation stays elevated. Sterling’s fiscal backdrop is deteriorating as well, with August borrowing surging to £18B, the largest in five years, and total borrowing already overshooting projections. The increase in gilt yields highlights growing investor concern about fiscal credibility ahead of Chancellor Reeves’ autumn budget in November.\nBank of England’s Stagnant Policy Stance\nThe Bank of England left rates steady at 4.0%, stressing caution on further cuts despite inflation lingering above its 2% target. Governor Bailey has signaled patience, but the weak data complicates the path. Stagflation risks loom as the economy faces slow growth and sticky inflation, a combination that historically undermines currency performance. UK policymakers face a dilemma: tightening too soon could worsen growth, but further easing risks fueling inflation expectations already reflected in rising wage settlements.\nUS Data and Federal Reserve Dynamics\nAcross the Atlantic, the Federal Reserve cut rates by 25bps, its first reduction of 2025, yet Chair Powell balanced it with hawkish commentary, warning of ongoing labor market softness while emphasizing commitment to price stability. U.S. retail sales and jobless claims confirmed economic resilience, supporting the dollar’s strength. The U.S. Manufacturing PMI eased to 52 from 53, while Services slowed to 53.9 from 54.5, both still comfortably above the 50 expansion threshold. The divergence between a slowing UK economy and a still-expanding U.S. economy has kept GBP/USD capped, with the Fed expected to deliver at least two more cuts this year while maintaining a hawkish narrative.\nMarket Positioning and Technical Levels for GBP/USD\nGBP/USD is consolidating around 1.3518, after a sharp slide last week to 1.3450. On the charts, the pair faces immediate support at 1.3500, followed by 1.3450 and then 1.3400 if selling accelerates. To the upside, bulls need to clear 1.3550, with the next ceiling at 1.3600. The RSI remains under 50, showing lingering weakness despite the recent bounce. Price action is clustered near the 20-day SMA at 1.3523, and a sustained push below the 100-day SMA at 1.3481 would hand momentum back to sellers. Meanwhile, the heatmap shows Sterling has gained 0.35% vs USD this week but underperformed against the euro, highlighting selective strength in broader FX markets.\nRead More\n-\nXME ETF at $91.50 With +59.7% YTD Rally, Uranium and Gold Drive Gains\n23.09.2025 · TradingNEWS ArchiveStocks\n-\nBitcoin ETF Inflows Surge $887M as BlackRock’s IBIT Nears $85B AUM and 57.5% Share\n23.09.2025 · TradingNEWS ArchiveCrypto\n-\nNatural Gas Price Forecast - NG=F Holds $2.85 as EU Storage Hits 81.6% and Options Price €50/MWh Surge\n23.09.2025 · TradingNEWS ArchiveCommodities\n-\nUSD/JPY Price Forecast - Dollar to Yen at 148.40 as Fed Cuts Clash With BoJ Hawkish Signals, CPI in Focus\n23.09.2025 · TradingNEWS ArchiveForex\nKey Events on the Horizon\nAttention now turns to Fed Chair Powell’s next remarks and scheduled speeches from officials including Michele Bowman and Raphael Bostic. Markets are pricing a 90% probability of another 25bps "
            },
            {
                "title": "GBP/USD Forecast: Bull Lacking Momentum at 1.35 Ahead of Fed - Forex Crunch",
                "source": "Forex Crunch",
                "url": "https://www.forexcrunch.com/blog/2025/09/23/gbp-usd-forecast-bull-lacking-momentum-at-1-35-ahead-of-fed/",
                "body": "- The GBP/USD forecast remains subdued as UK PMI data signals slowing growth.\n- Fiscal deterioration and rising gilt yields weigh heavily on Sterling sentiment.\n- The Fed’s hawkish tilt offsets the recent rate cut, supporting the dollar against the GBP.\nThe British pound came under renewed selling pressure on Tuesday after the UK PMI for September came in downbeat. The Composite PMI slipped to 51.0 against the expected 52.7 and previous 53.5. It suggests that business activity continues to expand, albeit at a slower pace. The manufacturing PMI showed a deeper contraction, falling to 46.2, below the consensus of 47.0, while services cooled to 51.9 from 54.2.\n–Are you interested in learning more about MT5 brokers? Check our detailed guide-\nChief Economist at S&P Global Market Intelligence, Chris Williamson, flagged a litany of concerning news, including weak overseas demand, rising job losses, and declining business confidence. The slowdown comes against the backdrop of a strained UK fiscal outlook.\nThe UK public finances further declined in August as borrowing rose to £18 billion, the highest level in five years. Cumulative borrowing in the current fiscal year already exceeds official forecasts, leading to higher gilt yields. Markets are now bracing for Rachel Reeve’s autumn budget in November, which could signal fiscal tightening or more spending pressure.\nMeanwhile, the Bank of England kept interest rates unchanged at 4.0% last week and reiterated its gradual approach to easing amid stubborn inflation above 2%. The fear of stagflation also persists as growth stagnates while inflation lingers higher.\nOn the US side, the Federal Reserve delivered its first rate cut in 2025. Still, Fed Chair Powell struck a hawkish tone, warning of weakness in the labor market while emphasizing the Fed’s commitment to controlling inflation. The retail sales data and jobless claims reinforced US growth momentum.\nThe combination of a hawkish Fed and a fragile UK fiscal situation is weighing on the GBP/USD, which is currently consolidating at 1.3500 after falling to the 1.3450 area last week.\nKey Events Ahead\n- US PMIs: The US PMIs could weigh on the pair as the data is important for the Fed to gauge economic sentiment.\n- Jerome Powell’s speech: Markets await fresh guidance from the Fed Chair on future rate cuts and labor market conditions.\n- Comments from Fed officials: Michele Bowman, Raphael Bostic, Stephen Miran, and Beth Hammack may shape near-term USD expectations.\n- UK Autumn Budget (November): Investors will watch whether Chancellor Reeves signals fiscal tightening or additional borrowing.\n- Upcoming UK data: Inflation, retail sales, and consumer confidence figures will be key in shaping BoE policy expectations.\nGBP/USD technical forecast: Key MAs to set trend\nThe GBP/USD price wobbles around the key MAs around 1.3500 on the 4-hour chart. A sustained breakout of the 200-period MA could ignite a selling momentum leading to a deeper correction. The RSI is now out of the oversold region but remains below the 50.0 mark, indicating a prevailing weakness.\n–Are you interested in learning more about forex signals telegram groups? Check our detailed guide-\nThe immediate support appears at 1.3500 ahead of the previous week’s lows of 1.3450 and then 1.3400. On the upside, 1.3550 remains the immediate target for the bulls ahead of 1.3600.\nLooking to trade forex now? Invest at eToro!\n68% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money."
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0034",
            "open": "0.6594",
            "close": "0.6597",
            "high": "0.6615",
            "low": "0.6581"
        },
        "market_summary": "The Australian Dollar is forecast to break out of its recent trading range against the US Dollar, driven by a relatively hawkish RBA holding rates steady amid resilient domestic economic data and a softening USD as the Fed is expected to cut rates more aggressively. Major banks predict near-term appreciation towards levels not seen since mid-2022, though longer-term forecasts suggest this strength may fade due to potential US dollar recovery and concerns over China's economic growth. Technical analysis shows the pair attempting to reclaim higher ground, supported by a reduction in speculative short positions.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Barclays sees AUD/USD breaking range as RBA stays relatively hawkish - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/news/forex-news/barclays-sees-audusd-breaking-range-as-rba-stays-relatively-hawkish-93CH-4250676",
                "body": "Asia stocks dip tracking Wall St weakness amid tech losses, rate caution\nInvesting.com - Barclays expects the Australian dollar to break out of its months-long trading range against the U.S. dollar in the fourth quarter, according to a research note released Monday.\nThe bank forecasts AUD/USD will push above the 0.64-0.66 range that has contained the currency pair for several months, citing a softening U.S. dollar and the Reserve Bank of Australia’s comparatively hawkish stance relative to the Federal Reserve.\nBarclays notes that Australia’s economy \"is holding up well,\" pointing to positive economic surprises, improving terms of trade driven by higher commodity prices, and limited negative impact from China’s economic situation.\nThe RBA is expected to maintain a \"gradual easing track\" with markets anticipating the next interest rate cut in November, while the Federal Reserve is projected to reduce rates more aggressively in the coming months.\nLooking beyond the near-term appreciation, Barclays predicts a \"mild depreciation path\" for the Australian dollar over its longer-term forecast horizon, as the U.S. dollar may regain some strength.\nThis article was generated with the support of AI and reviewed by an editor. For more information see our T&C.\nWhich stocks should you consider in your very next trade?\nThe best opportunities often hide in plain sight—buried among thousands of stocks you'd never have time to research individually.\nThat's why smart investors use our Stock Screener with 50+ predefined screens and 160+ customizable filters to surface hidden gems instantly.\nFor example, the Piotroski's Picks method averages 23% annual returns by focusing on financial strength, and you can get it as a standalone screen. Momentum Masters catches stocks gaining serious traction, while Blue-Chip Bargains finds undervalued giants.\nWith screens for dividends, growth, value, and more, you'll discover opportunities others miss. Our current favorite screen is Under $10/share, which is great for discovering stocks trading under $10 with recent price momentum showing some very impressive returns!"
            },
            {
                "title": "Bold prediction for surging Aussie dollar - Yahoo",
                "source": "Yahoo",
                "url": "https://au.finance.yahoo.com/news/bold-prediction-surging-aussie-dollar-224539728.html",
                "body": "The Australian dollar will reach highs against the greenback in coming months not seen since June 2022, Commonwealth Bank forecasts.\nTariffs slugging the US economy and lower oil prices are key factors that are expected to drive the Aussie dollar’s continued march upwards, CBA economist and currency strategist Carol Kong said in a note on Wednesday.\n“We forecast AUD/USD will lift over the next few quarters … to converge closer to our estimate of fair value of 0.72,” she said.\nThe exchange rate last reached $US0.72 in June 2022.\nOn Wednesday morning, the rate was hovering at $US0.66, with gold prices hitting a new record of $US3791.1 per ounce overnight.\nThe Australian dollar continues to gain against the NZD, pushing above a 35-month high overnight.\nDespite the recent gains, CBA does not project the Aussie dollar will maintain above a long-run average of $US0.75.\n“We expect the recovery in AUD/USD to fade as the first half of 2026 progresses,” Ms Kong said.\n“We predict China’s economy will expand below potential again in 2026.\n“In addition, AUD/USD will decrease if we are right about a return to US exceptionalism that attracts foreign capital. But AUD will outperform the cross rates amid an improvement in the world economy under our baseline.”\nANZ, CBA and Morgan Stanley all expect the greenback will keep falling, as the Federal Reserve cuts rates more aggressively than Australia’s central bank."
            },
            {
                "title": "Can the Aussie Dollar break higher? Key levels to watch - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/analysis/australian-dollar-price-forecast-data-china-and-rba-hold-the-keys-202509231553",
                "body": "- AUD/USD added to Monday’s gains and reclaimed the 0.6600 hurdle and above.\n- The US Dollar navigated an inconclusive range ahead of Chief Powell’s speech.\n- The Australian flash S&P Global PMIs are seen losing impulse in September.\nThe Australian Dollar (AUD) extended Monday’s modest gains, with AUD/USD climbing toward two-day highs near 0.6620 on turnaround Tuesday. The move helped the pair recover some composure after slipping to two-week lows the day before, as the US Dollar (USD) continued its choppy back-and-forth.\nThe US Dollar Index (DXY) inched higher too, clawing back some of Monday’s losses as traders looked ahead to Chair Powell’s speech and digested a weaker run of September PMIs.\nStubborn inflation keeps the RBA cautious\nAustralia’s inflation problem hasn’t gone away. July’s Monthly CPI Indicator (Weighted Mean) accelerated to 2.8% from 1.9% in June, while Q2 CPI rose 0.7% QoQ and 2.1% YoY.\nThat’s why the Reserve Bank of Australia (RBA) is holding the line. With prices still running hotter than target, policymakers are reluctant to cut too quickly. Policymakers must strike a balance between supporting growth and preventing inflation from escalating.\nDomestic economy holding up better than feared\nEven with global uncertainty swirling, Australia’s economy looks more resilient than expected. Early reads for September suggest Manufacturing PMI may ease to 51.3 and Services to 52.0, but both remain comfortably in expansion territory.\nOther data have been firmer too: Retail Sales rose 1.2% in June, the trade surplus widened to A$7.3 billion in July, and business investment ticked higher in Q2. GDP also surprised, up 0.6% QoQ and 1.8% YoY.\nThe labour market is showing a few cracks, though. Unemployment held steady at 4.2% in August, but total employment dropped by 5.4K.\nRBA sticks to data-driven path\nEarlier this month, the RBA trimmed the Official Cash Rate (OCR) by 25 basis points to 3.60% and cut back its 2025 growth forecast. Governor Michele Bullock has since underlined that deeper cuts aren’t on the table, making clear that policy will stay data-dependent.\nThe Minutes reinforced the point: if jobs weaken further, the RBA could accelerate cuts. But if the economy stays steady, easing will be gradual.\nSpeaking to the House Economics Committee, Bullock described both growth and inflation as being in a “good place”, reinforcing that there's no urgency to shift policy. For now, markets expect the RBA to hold steady at next week’s meeting, with pricing implying about 26 basis points of easing by year-end.\nChina still the swing factor\nAustralia’s outlook is still tied to China’s fortunes. Q2 GDP grew 5.2% YoY, but August retail sales undershot at 3.4%. PMIs were mixed: Manufacturing slipped into contraction at 49.4, while services barely stayed in growth territory at 50.3. Deflation worries linger too, with CPI down 0.4% YoY in August.\nThe People’s Bank of China (PBoC) kept its Loan Prime Rates (LPR) unchanged in September: 3.00% for the One-Year and 3.50% for the Five-Year, matching expectations.\nSpeculators pare back AUD shorts\nCFTC data for the week ending (September 16) showed speculators trimming bearish AUD bets, with net shorts dropping to 51.2K contracts, the lowest since May. Still, total open interest fell sharply to about 154K, suggesting traders have cut back exposure overall.\nTechnical landscape\nFrom a technical perspective, if buyers stay in control, AUD/USD could make another run at the 2025 ceiling at 0.6707 (September 17). A clean break above that would bring last year’s high at 0.6942 (September 30) into view, just under the psychological 0.7000 mark.\nOn the downside, initial support lies at the 55-day and 100-day Simple Moving Averages (SMAs), at 0.6537 and 0.6511. A drop below there would put the August low at 0.6414 (August 21) back in play, followed by the 200-day SMA at 0.6397 and the June trough at 0.6372 (June 23).\nMomentum indicators are sending mixed but mildly constructive signals. The Relati"
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "0.4650",
            "open": "147.6820",
            "close": "147.6320",
            "high": "147.9230",
            "low": "147.4580"
        },
        "market_summary": "The USD/JPY pair is consolidating around 148.40 as conflicting central bank policies create a stalemate. The Federal Reserve's dovish pivot to rate cuts is being offset by rising U.S. Treasury yields and resilient inflation, which supports the dollar. Conversely, the Bank of Japan is signaling potential future rate hikes, but this hawkishness is being tempered by weak domestic data and political uncertainty, capping the yen's gains. The market is coiling within a tight technical range, awaiting a catalyst from key U.S. inflation data or BoJ policy signals for a decisive breakout.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "USD/JPY Price Forecast: Pair Holds 148.40 Ahead of Core CPI, BoJ Hawkish Hints - tradingnews.com",
                "source": "tradingnews.com",
                "url": "https://www.tradingnews.com/news/usd-jpy-price-forecast-dollar-to-yen-at-148-fed-cut-clash-with-boj-cpi-in-focus",
                "body": "USD/JPY Price Forecast - Dollar to Yen at 148.40 as Fed Cuts Clash With BoJ Hawkish Signals, CPI in Focus\nDollar-yen rebounds from 145.49 to 148.40, testing 148.84 resistance. Fed’s easing cycle lifts yields while BoJ hints at hikes; Core CPI set to decide whether range breaks toward 150.88 or back to 144.10 | That's TradingNEWS\nUSD/JPY Tests 148.50 as Fed Cuts Collide With BoJ Hawkish Hints\nUSD/JPY is trading near 148.40, marking a sharp rebound of almost 2% from last week’s FOMC lows at 145.49. The Federal Reserve’s renewed easing cycle has fueled volatility, but the Bank of Japan’s cautious hawkish tone is holding the yen in check. This divergence between a Fed easing into elevated inflation and a BoJ edging toward possible rate hikes is defining the current range. The pair has now spent seven consecutive weeks between 145.50 and 148.80, with traders positioning for a decisive breakout as September’s U.S. Core CPI release approaches.\nTechnical Compression Signals Larger Move in USD/JPY\nCharts show a classic coiling structure. Support remains firm at 145.83, the 61.8% retracement of July’s advance. Resistance is stacked at 148.55–148.84, capped by the 200-day moving average and prior cycle highs. A close above 148.84 would expose 149.75 and eventually 150.88, the 100% extension of April’s advance. A downside break below 145.83 would confirm a larger reversal, targeting 144.10–144.40. For now, the higher lows since April keep buyers marginally favored, but momentum indicators like the RSI hovering near neutral reflect hesitation ahead of key data.\nRead More\n-\nXME ETF at $91.50 With +59.7% YTD Rally, Uranium and Gold Drive Gains\n23.09.2025 · TradingNEWS ArchiveStocks\n-\nBitcoin ETF Inflows Surge $887M as BlackRock’s IBIT Nears $85B AUM and 57.5% Share\n23.09.2025 · TradingNEWS ArchiveCrypto\n-\nNatural Gas Price Forecast - NG=F Holds $2.85 as EU Storage Hits 81.6% and Options Price €50/MWh Surge\n23.09.2025 · TradingNEWS ArchiveCommodities\n-\nGBP/USD Price Forecast - GBP to USD Holds 1.3518 as Weak UK PMI and £18B Borrowing Clash With Fed’s Hawkish Cut\n23.09.2025 · TradingNEWS ArchiveForex\nU.S. Inflation and Treasury Yields Drive Dollar Demand\nThe U.S. Core CPI and PCE inflation data this week are critical for direction. Last year’s Fed cuts failed to bring yields down; instead, 10-year Treasuries rose as inflation stayed above target, making long bonds unattractive. The same pattern is re-emerging. Yields are climbing despite cuts, keeping the U.S. dollar resilient and preventing USD/JPY from breaking lower. The 10-year yield at 4.36% continues to support the dollar against lower-yielding currencies like the yen. Traders will be watching whether inflation eases enough to justify further cuts or forces the Fed to slow its easing pace.\nBoJ Policy and Yen Positioning Under Scrutiny\nThe BoJ’s last meeting offered no fresh policy action but Governor Ueda signaled that rate hikes remain on the table if wage growth and inflation stabilize. This contrasts with the Fed’s dovish pivot, reinforcing policy divergence. Japanese investors have also been unwinding carry trades selectively, but the yen remains one of the weakest majors this year. USD/JPY’s failure to drop despite repeated retests of support reflects heavy Japanese demand for overseas assets, especially U.S. Treasuries. The 145.00 level is increasingly seen as the line where authorities might intervene verbally if yen weakness accelerates.\nGlobal Risk Sentiment Adds Volatility to USD/JPY\nBroader risk trends are feeding into USD/JPY flows. U.S. equities remain near record highs despite Fed cuts, and this risk-on backdrop reduces demand for the yen as a safe haven. However, if equity volatility spikes or if geopolitical risk in Asia escalates, demand for the yen could surge quickly. Hedge funds remain net long the dollar versus yen, but positioning is stretched, raising the odds of sharp corrections if macro surprises hit. The pair’s resilience above 147 in recent weeks shows how dee"
            },
            {
                "title": "Dollar forecast: USD/JPY and DXY analysis: Technical Tuesday - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/dollar-forecast-usd-jpy-and-dxy-analysis-technical-tuesday/?amp=true",
                "body": "Dollar forecast: USD/JPY and DXY analysis: Technical Tuesday\nAfter a rather quiet few months, the USD/JPY is shaping up to be rather intriguing. The Bank of Japan struck a marginally hawkish note last week, hinting that further rate rises could be on the horizon. That comes right when the Federal Reserve is now cutting rates again, a divergence that should in theory place downward pressure on the dollar-yen pair as the US dollar forecast remains modestly bearish. Yet, price action hasn’t quite reflected this. Not yet, anyway. But is that about to change? That’s what we will examine in this edition of Technical Tuesday.\nBefore looking at the USD/JPY, let’s first quickly discuss levels on the Dollar Index chart, which remains entrenched in a bearish trend.\nDollar forecast: Dollar Index (DXY) technical analysis\nThe US dollar index staged a bounce following last week’s FOMC rate decision, but the rally now finds itself pressing against resistance at around the 97.60-80 area. Here, the 21-day exponential moving average meets prior support and the underside of a bearish trend line given the confluence of these important technical factors here, this makes it a key resistance area to watch. A clean breakout above here would therefore put an end to the technical bearish dollar forecast, at least in the near-term.\nHowever, the broader picture still reflects a sequence of lower highs and lower lows, consistent with a corrective trend. The recovery we saw began after the index dipped beneath the July trough of 96.37, sweeping out liquidity before staging a rebound. Whether this proves to be a durable low, perhaps a double bottom or even a false breakdown, remains to be seen. For the moment, the market requires stronger bullish confirmation to convince traders this is anything more than a short-term reprieve. I’m not persuaded just yet, so it’s a case of watching how the week develops.\nDollar forecast: USD/JPY coiling for a potential breakdown?\nTurning our gaze to the USD/JPY chart now, and on the weekly we can see the pair has produced a string of indecisive doji-style candles over recent weeks — a classic signal that the market is coiling before a larger directional move. What will be the fundamental trigger of that remains to be seen, but with the US dollar being among the weakest of major currencies in recent months, it could simply be a case of rotations into the yen ahead of a possible rate hike or two from the BoJ in the coming months.\nAnyway, the USD/JPY chart continues to grapple with a major resistance band between 148.65 and 150.00. This zone, once a strong base in December and again earlier this year, has been retested multiple times since it broke down. So far, we haven’t had a convincing break back above it to tip the balance in the bull’s favour again. So, the sellers are still technically in charge, and this group of traders were encouraged by the appearance of an inverted hammer candle at those highs that was formed at the end of July. Yet, frustratingly for the bears, the follow-through has been conspicuously absent. Prices have merely drifted sideways. The question now is whether the Fed’s dovish tilt can finally tip the balance lower. If so, the UJ bears could initially target liquidity resting beneath last week’s low of 145.48, with the pair having already testing waters above the high of last week’s range at 148.28, before turning modestly lower.\nTechnical analysis: Daily chart of the USD/JPY also indecisive\nOn the daily chart, the 200-day moving average is doing a fine job of capping rallies, reinforcing the importance of that 148.65–150 resistance corridor. With this long-term moving average pointing lower, the broader trend is starting to lean bearish. However, conviction will only come if the market can break below some important support levels now. The first one is at 147.00. Beneath there, a descending trendline offers support at around 146.00, and if that were to give way, 145.00 becomes the logical next target"
            },
            {
                "title": "Japanese Yen slips on weak PMI; BoJ-Fed divergence to limit losses - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/japanese-yen-weakens-as-softer-pmi-data-adds-to-boj-rate-hike-uncertainty-202509240336",
                "body": "- The Japanese Yen drifts lower in reaction to the disappointing Japan Manufacturing PMI.\n- A modest USD uptick further contributes to the USD/JPY pair’s modest intraday rise.\n- The divergent BoJ-Fed policy expectations could limit losses for the lower-yielding JPY.\nThe Japanese Yen (JPY) extends its steady intraday descent against a broadly firmer US Dollar (USD) and lifts the USD/JPY pair to the 148.00 mark during the Asian session on Wednesday. A private survey showed this Wednesday that manufacturing sector activity in Japan fell at the fastest pace in six months in September. This comes amid concerns that domestic political uncertainty and economic headwinds stemming from US tariffs could prompt the Bank of Japan (BoJ) to delay raising interest rates, which, in turn, is seen undermining the JPY.\nMeanwhile, there were two board members voting against the BoJ's decision last week to keep interest rates unchanged, which underscores mounting pressure within the central bank to phase out its massive monetary stimulus. This marks a significant divergence in comparison to the US Federal Reserve's (Fed) dovish signal that two more rate cuts will follow through the rest of this year, which might cap the USD and lend support to the lower-yielding JPY. Apart from this, rising geopolitical tensions should help limit losses for the safe-haven JPY.\nJapanese Yen bulls remain on the defensive on the back of weaker manufacturing data\n- The S&P Global flash Japan Manufacturing Purchasing Managers' Index (PMI) declined from 49.7 in August to 48.4 in September, or the steepest decline since March. This also marked the 14th month of contraction in the past 15 and exerts some downward pressure on the Japanese Yen during the Asian session on Wednesday.\n- Furthermore, a Liberal Democratic Party (LDP) leadership election will take place on 4 October, and the outcome could delay the next interest rate hike by the Bank of Japan if a candidate with dovish views is selected. The BoJ, however, signaled that rate hikes remain on the table if the economy and prices move in line with forecasts.\n- Moreover, investors are still pricing in the possibility of a 25-basis-point rate hike by the BoJ in October amid signs of economic resilience. This contrasts with the US Federal Reserve (Fed) dovish pivot, which reinforces policy divergence and, in turn, should help limit any meaningful depreciating move for the lower-yielding JPY.\n- The US Dollar attracts some buyers and, for now, seems to have stalled a two-day pullback from an over one-week top touched on Monday in the wake of Fed Chair Jerome Powell's remarks on Tuesday. Powell said that policymakers faced a challenging situation in deciding whether to prioritise fighting inflation or protecting jobs.\n- Powell added that easing too aggressively could leave the inflation job unfinished and need to reverse course. The comments pushed back against market expectations of more interest rate cuts in the coming months, which revived the USD demand and assisted the USD/JPY pair to gain some positive traction after a two-day downtick.\n- Traders now look to the release of New Home Sales from the US for some impetus later during the North American session. The focus, however, remains glued to other important US macro data scheduled during the latter part of the week, including the final GDP print and the Personal Consumption Expenditure (PCE) Price Index.\n- Apart from this, traders this week will also confront the release of Tokyo Consumer Price Index (CPI) on Friday, which could influence BoJ rate hike expectations and drive the JPY. Nevertheless, the fundamental backdrop favors the JPY bulls and warrants caution before positioning for any meaningful USD/JPY appreciation.\nUSD/JPY could attract fresh sellers at higher levels; seems vulnerable while below 200-day SMA\nThe USD/JPY pair, barring a few knee-jerk moves in either direction, has been trading in a familiar range since early August. This constitutes the formati"
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0038",
            "open": "1.3814",
            "close": "1.3833",
            "high": "1.3849",
            "low": "1.3811"
        },
        "market_summary": "The USD/CAD is experiencing short-term strength, driven by a rebound in the U.S. dollar following Fed Chair Powell's comments signaling a cautious approach to rate cuts. This is compounded by increased risk aversion due to geopolitical tensions and Trump's tariff threats. However, the pair remains trapped in a technical sideways range as the market weighs a widening US-Canada interest rate gap against supportive oil prices and Canada's efforts to diversify its economy.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "USD/CAD Analysis: The Canadian Dollar Loses Ground After Powell’s Comments - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en/news-and-analysis/usdcad-analysis-the-canadian-dollar-loses-ground-after-powells-comments/",
                "body": "The USD/CAD has posted two consecutive bullish sessions, with a short-term gain of around 0.5%, strengthened after comments from Federal Reserve Chairman Jerome Powell. Buying pressure has become more consistent, although still insufficient to establish a decisive path for the U.S. dollar. In this context, the market continues to show indecisive movements, without a clear short-term direction.\nWhat Updates Has the Fed Provided?\nToday, Powell highlighted that the central bank faces a delicate balance between persistent inflation and a weaker labor market, which has begun to show signs of slowdown in recent months.\nHe emphasized that the new cycle of rate cuts cannot progress too quickly, as this could reignite inflationary pressures. At the same time, he underscored that the Fed’s short-term goal is to sustain a recovery in employment.\nThese remarks were interpreted as a signal that the Fed is not leaning toward overly aggressive cuts, which gave the U.S. dollar some temporary relief after trending lower for much of 2025. In fact, the DXY index, which measures the dollar’s strength against a basket of currencies, has halted its recent declines and is holding above 97 points, reflecting a degree of recovery in recent sessions.\nSource: MarketWatch\nAs a result, this rebound in confidence in the dollar could cause the Canadian dollar to lose further ground in the short term. However, this appears to be a temporary development, particularly after last week’s rate decisions from both the Fed and the Bank of Canada. If the Fed continues with a cycle of steady rate cuts and the Bank of Canada does not confirm additional reductions this year, the selling pressure that previously characterized USD/CAD could return in the medium term, especially given that the pair has yet to establish a clear directional move.\nNew Plans for Canada?\nOn September 18, a meeting took place between the Canadian Prime Minister and the President of Mexico, where both countries agreed to deepen cooperation in trade and security ahead of the scheduled USMCA review in 2026. During the meeting, it was noted that Canada seeks to expand its bilateral trade with Mexico, which reached nearly $56 billion in 2024, with expectations of further growth in the coming years.\nThese initiatives are part of Canada’s broader strategy to diversify its economic policy, in response to the risk that trade relations with the U.S. could put pressure on its economy. At the same time, the government remains committed to its “Buy Canadian” policy, designed to boost domestic production and consumption as a way to mitigate potential risks to growth.\nIn this context, Canada’s current measures aim to diversify the economy and reduce its dependence on the U.S. If these efforts succeed, they could stabilize confidence in the Canadian dollar and enhance its attractiveness as an investment asset. In such a scenario, renewed selling pressure on USD/CAD could emerge, becoming a key factor for the pair’s movements in upcoming sessions.\nUSD/CAD Technical Forecast\nSource: StoneX, Tradingview\n- Short-Term Sideways Range: Since late July, USD/CAD has been moving within a lateral channel, with resistance at 1.39036 and support at 1.37356. Recent moves have not been strong enough to break this formation, which remains the main technical reference in the short term. As long as the range holds, the market will likely continue in a state of indecision.\n- RSI: The RSI line continues to rise above the neutral 50 level, indicating that buying momentum has gained strength in the average of the last 14 sessions. If this trend continues, it could reinforce a short-term bullish bias.\n- MACD: The MACD histogram oscillates around the neutral zero line, signaling indecision in short-term moving averages. Unless a clearer direction emerges, the lateral range is likely to prevail.\nKey Levels:\n- 1.37356 – Crucial Support: Coincides with recent declines and the Ichimoku cloud. A break below could revive the bearish trend "
            },
            {
                "title": "USD/CAD holds gains near 1.3850 amid increased risk aversion - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-cad-holds-gains-near-13850-amid-increased-risk-aversion-202509240248",
                "body": "- USD/CAD appreciates as market sentiment weakens following fresh Trump tariff threats on Russia.\n- Trump also condemned European nations for purchasing Russian energy, insisting they are “financing the war against themselves.”\n- Canadian Prime Minister Mark Carney noted that the effects of US trade tariffs are becoming increasingly evident.\nUSD/CAD extends its winning streak for the third consecutive day, trading around 1.3840 during the Asian hours on Wednesday. The pair appreciates as the US Dollar (USD) receives support from increased risk aversion, driven by the fresh tariff threats from US President Donald Trump against Russia.\nAt the United Nations (UN) General Assembly on Tuesday, President Trump warned that the United States (US) is ready to impose a “very strong round of powerful tariffs” if Russia refuses to end the war in Ukraine. Trump also criticized European countries for buying Russian energy, arguing that “they are funding the war against themselves,” and urged the EU to join Washington in implementing tariffs to ensure their effectiveness.\nHowever, the Greenback faced challenges following the release of US S&P Global PMI figures for September on Tuesday. Composite PMI ticked down to 53.6 from 54.6 in August, pointing to a private sector that seems to be struggling to strengthen further. Manufacturing PMI eased to 52.0 from 53, signalling waning momentum in the sector. Services PMI slipped to 53.9 from 54.5, suggesting demand there may be easing.\nCanadian Prime Minister Mark Carney noted that ongoing impacts from Donald Trump's trade tariffs are becoming more noticeable and acknowledged that trade discussions between the US and Canada are still ongoing.\nBank of Canada (BoC) Governor Tiff Macklem noted on Monday that Canada will need to continue charting a \"more independent course\" away from the US, citing the US Dollar's recent performance across the market. Trump's attempts to influence the Fed are raising questions about the continued independence of US monetary policy, Macklem added.\nCanadian Dollar FAQs\nThe key factors driving the Canadian Dollar (CAD) are the level of interest rates set by the Bank of Canada (BoC), the price of Oil, Canada’s largest export, the health of its economy, inflation and the Trade Balance, which is the difference between the value of Canada’s exports versus its imports. Other factors include market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – with risk-on being CAD-positive. As its largest trading partner, the health of the US economy is also a key factor influencing the Canadian Dollar.\nThe Bank of Canada (BoC) has a significant influence on the Canadian Dollar by setting the level of interest rates that banks can lend to one another. This influences the level of interest rates for everyone. The main goal of the BoC is to maintain inflation at 1-3% by adjusting interest rates up or down. Relatively higher interest rates tend to be positive for the CAD. The Bank of Canada can also use quantitative easing and tightening to influence credit conditions, with the former CAD-negative and the latter CAD-positive.\nThe price of Oil is a key factor impacting the value of the Canadian Dollar. Petroleum is Canada’s biggest export, so Oil price tends to have an immediate impact on the CAD value. Generally, if Oil price rises CAD also goes up, as aggregate demand for the currency increases. The opposite is the case if the price of Oil falls. Higher Oil prices also tend to result in a greater likelihood of a positive Trade Balance, which is also supportive of the CAD.\nWhile inflation had always traditionally been thought of as a negative factor for a currency since it lowers the value of money, the opposite has actually been the case in modern times with the relaxation of cross-border capital controls. Higher inflation tends to lead central banks to put up interest rates which attracts more capital inflows from global investors se"
            },
            {
                "title": "Canadian Dollar Hits 11-Day Low As Rate Gap Widens - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/canadian-dollar-hits-11-day-low-as-rate-gap-widens",
                "body": "Join the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nThe Canadian dollar just hit its weakest level in nearly two weeks, as a widening gap between Canadian and US interest rates weighed heavy—only a rebound in oil prices stopped it from falling further.\nWhat does this mean?\nThe loonie is losing ground as the difference between Canadian and US interest rates grows, with the 2-year bond spread now at 114 basis points compared to 92 just a month ago. That’s pushed the Canadian dollar down to around 72.25 US cents. The Bank of Canada cut rates for the first time since March, hoping to boost economic growth even as it keeps an eye on inflation. Now, traders are pricing in a 50% chance of another rate cut at the bank’s meeting in late October—which could mean more challenges ahead for the currency. While a jump in crude oil prices gave the loonie some support, it’s still stuck in a tight trading range as investors brace for more rate moves.\nWhy should I care?\nFor markets: Interest rate gaps set the pace.\nThe growing rate gap has driven down Canadian bond yields and left the loonie under pressure, making life trickier for currency traders and businesses with cross-border exposure. If the Bank of Canada cuts rates again, the currency could slide further, with possible ripple effects on Canadian stocks and other riskier assets.\nThe bigger picture: Balancing growth and currency strength in a shifting world.\nCanada’s central bank is walking a fine line between supporting growth and keeping inflation in check—a challenge faced by central banks everywhere. Persistent rate differences with the US could eventually sway global investment flows, shape trade competitiveness, and impact the longer-term resilience of Canada’s export-driven economy.\nYou read that right: you can win two return flights to London, a three-night stay at a hotel in the capital, and in-person tickets to our Modern Investor Summit. Even better, your trip will be created in partnership with Echo Bravo – the experts in hassle-free business travel and round-the-clock human support.\nSo not only can you skip the bill, but you can leave the planning to the pros, too.\nAll you need to do is register for the Summit… and decide who you’d share that room with, of course.\nT&C's apply. Click here for details.\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nResearch\nRussell Burns • about 12 hours ago\nQuick Take\nAberdeen Group x Finimize • about 15 hours ago\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies."
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "0.8170",
            "open": "199.4010",
            "close": "199.6890",
            "high": "199.9600",
            "low": "199.1430"
        },
        "market_summary": "The GBP/JPY is under significant selling pressure following the release of much weaker-than-expected UK PMI data, which indicates a sharp deceleration in economic activity. This has intensified concerns over the sustainability of the UK's recovery and is weighing heavily on the British Pound. The pair's price action is technically bearish, trading below key moving averages with a clear downside target towards the 197.25 level.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "GBP/JPY Slides on Dismal UK PMI Data: Bearish Trend Targets 197.25 - EconoTimes",
                "source": "EconoTimes",
                "url": "https://www.econotimes.com/GBP-JPY-Slides-on-Dismal-UK-PMI-Data-Bearish-Trend-Targets-19725-1721360",
                "body": "GBPJPY pared some of its gains after dismal UK PMI data. The intraday trend is bearish as long as the resistance at 200 holds. It is currently trading around 199.282; the pair reached an intraday low of 199.19.\nWith the composite PMI plummeting dramatically to 51.9 from 53.5 in September 2025—a two-month low—the UK Flash PMI statistics showed a sharp economic deceleration. August is falling short of expectations and showing decreasing growth momentum. Falling short of expectations at 46.9, the Manufacturing PMI worsened from 47.0 to 46.2, extending contraction for the twelfth consecutive month in weak domestic and foreign demand. Meanwhile, the predominant Services PMI dropped from a 16-month high of 54.2 to 51.9, well below the projected 53.5, inching near to stagnation albeit still expanding. These depressing numbers intensify worries about the UK's recovery sustainability, so putting pressure on the British Pound and affecting the Bank of England's current policy. 4% rates, particularly right before the budget disclosure.\nThe pair is trading below 55, 200 EMA and 365 EMA (long-term) on the 1-hour chart, confirming a bearish trend. Any violation below 199 indicates the intraday trend is weak. A dip to 198.75 /198/197.85/197.25/ 196.70/196.20/195 is possible. Immediate resistance is at 200 a breach above this level targets of 200.53/201.26/ 202/203.\nMarket Indicators ( 1-hour chart)\nCCI (50)- Neutral\nDirectional movement index - Neutral\nTrading Strategy: Sell\nIt Is good to sell on rallies 199.48-50 with SL around 200.25 for a TP of 197.25."
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "1,907.0000",
            "open": "112,763.7900",
            "close": "111,992.5000",
            "high": "113,363.5000",
            "low": "111,456.5000"
        },
        "market_summary": "Bitcoin is holding near the $112,000 level, supported by significant institutional investment flowing into spot Bitcoin ETFs, with BlackRock's fund nearing $85 billion in AUM. Regulatory developments are broadly favorable, as the SEC is drafting an \"innovation exemption\" to fast-track digital asset products and lawmakers are pushing for crypto inclusion in retirement plans. Despite a day of notable outflows, the substantial weekly inflows and positive regulatory momentum underscore strong institutional adoption.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Coinbase Recovers From Plunge But Hits Resistance As Bitcoin Nears $112,000 – Is Coinbase Stock A Sell Now? - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/research/coinbase-stock-buy-now-september-2025/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #de122bff-9909-11f0-900b-ef5a2822356d"
            },
            {
                "title": "Here’s what happened in crypto today - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/cointelegraph:b431ea497094b:0-here-s-what-happened-in-crypto-today/",
                "body": "Here’s what happened in crypto today\nToday in crypto, the SEC is drafting an “innovation exemption” to speed approvals of digital-asset products. Meanwhile, blockchain payment company Fnality raised $136 million from major banks to grow its settlement network, and US lawmakers pressed for crypto in retirement plans.\nUS SEC eyes ‘innovation exemption’ to fast-track digital asset products: Atkins\nThe US Securities and Exchange Commission is working to create an “innovation exemption” that would ease approval of digital-asset products by the end of the year, SEC Chair Paul Atkins said on Tuesday.\nDuring an interview on Fox Business, Atkins told anchor Maria Bartiromo that the SEC is working on “rulemaking in the coming months.”\nAn “innovation exemption” would function as a regulatory carve-out, giving crypto companies temporary relief from older securities rules to roll out new products under lighter oversight while the SEC develops tailored regulations.\nAtkins addressed a question about the recent approval of the first multi-asset crypto exchange-traded product (ETP) in the United States. Launched on Friday, the product gives investors access to Bitcoin (BTC), Ether (ETH), XRP (XRP), Solana (SOL) and Cardano (ADA). Grayscale's crypto fund launched under the SEC's recently announced generic listing standards, which reduce approval timelines for ETFs under Rule 6c-11.\nAccording to Atkins, the new listing standards are “another example of how we can move forward. “It’s not just an ad hoc type of approach. We’re trying to give the marketplace some kind of stable platform upon which they can introduce new products.”\nBlockchain payment firm Fnality raises $136 million in round led by major banks\nLondon-based blockchain payments company Fnality secured $136 million in a Series C funding round backed by some of the world’s largest financial institutions.\nBank of America, Citi, KBC Group, Temasek, Tradeweb and WisdomTree led the round, joined by returning investors including Goldman Sachs, Santander, Barclays and UBS, according to a Tuesday announcement by the company.\n“The closing of our Series C reflects a shared conviction that the future of money demands a new foundation,” Fnality CEO Michelle Neal said. She added that the company’s blockchain-based settlement systems offer “24/7 payment rails, real-time settlement, and enhanced liquidity.”\nFnality, which launched its sterling-denominated Fnality Payment System in the United Kingdom last year, aims to modernize wholesale payments through a blockchain-based infrastructure tied to central bank reserves. The new capital will help Fnality expand into the US dollar and euro markets, pending regulatory approvals, it said.\nUS lawmakers urge SEC to act on Trump’s crypto retirement plan\nUS lawmakers have called on Securities and Exchange Commission Chair Paul Atkins to help accelerate the executive order enabling crypto investments in US 401(k) retirement plans.\nIn the letter on Monday, nine lawmakers, including House Financial Services Committee Chairman French Hill and Subcommittee on Capital Markets Chairman Ann Wagner, said that Atkins was asked to “provide swift assistance” to the Secretary of Labor and to make any necessary adjustments to its current regulations and guidance.\nThey also noted that under President Donald Trump’s August executive order on “Democratizing Access to Alternative Assets for 401(k) Investors,” the SEC was instructed to make alternative assets like crypto more accessible in participant-directed retirement plans, in consideration of accredited investor and qualified purchaser rules.\n“We are hopeful that such actions will help the 90 million Americans that are currently restricted from investing in alternative assets to secure a dignified, comfortable retirement,” the nine lawmakers said."
            },
            {
                "title": "Bitcoin ETF Inflows Hit $887M as BlackRock Nears $85B AUM, BTC Holds $112K - tradingnews.com",
                "source": "tradingnews.com",
                "url": "https://www.tradingnews.com/news/bitcoin-etf-oinflows-887m-usd-as-blacksrock-ibit-nears-85b-usd-aum",
                "body": "Bitcoin ETF Inflows Surge $887M as BlackRock’s IBIT Nears $85B AUM and 57.5% Share\nBTC-USD at $112K after $363M ETF outflows, offset by $887M weekly inflows. BlackRock’s spot Bitcoin ETF dominates with $85B AUM, $218M revenue, while Fed cuts drive volatility. Fidelity trails at $22.8B, underscoring BlackRock’s grip on institutional flows | That's TradingNEWS\nBitcoin ETF Inflows Reshape Institutional Market Dynamics\nBlackRock’s BTC-USD ETF Dominance and Revenue Scale\nBlackRock’s spot Bitcoin ETF (BTC-USD) has emerged as the clear anchor of institutional adoption. With assets under management approaching $85 billion and commanding 57.5% of the U.S. Bitcoin ETF market share, the iShares Bitcoin Trust has established itself as one of the largest ETFs globally. The fund’s size is translating directly into revenue: BlackRock’s combined Bitcoin and Ether products are generating $260 million annually, of which $218 million comes from Bitcoin ETFs alone. That revenue figure rivals long-standing profit centers in traditional finance and highlights crypto ETFs as a durable business model rather than a speculative experiment.\nWeekly Flows: $887 Million In, $363 Million Out\nThe past week underscored how volatile ETF flows can be despite their structural growth. Data shows that Bitcoin ETFs pulled in a net $887 million over five trading days, including $292 million on September 16 and $260 million on September 15, before registering a midweek outflow of $51.2 million on September 17. The week ended positive, but on September 22 the trend reversed sharply: U.S. spot Bitcoin ETFs recorded $363.1 million in net outflows, the heaviest single-day withdrawal since launch. Fidelity’s FBTC led the exodus with $276.7 million in redemptions, ARK’s ARKB lost $52.3 million, and WisdomTree’s BTCW shed $24.6 million. BlackRock’s IBIT was notable in showing no inflows or outflows, signaling that its investor base remains more anchored than peers.\nEthereum ETF Flows Support Broader Trend\nEthereum ETFs mirrored Bitcoin’s volatile flow pattern. Across the week, they absorbed $557 million in inflows, including a single-day record of $359.7 million on September 15. However, that momentum was partially offset by $61.7 million in outflows the next day and a small $1.9 million dip on September 17. By September 19, renewed strength added $213 million, bringing cumulative inflows to their highest level since inception. Year-to-date, Ethereum ETFs have received $12.6 billion, underscoring how institutional money is no longer limited to Bitcoin.\nRead More\n-\nXME ETF at $91.50 With +59.7% YTD Rally, Uranium and Gold Drive Gains\n23.09.2025 · TradingNEWS ArchiveStocks\n-\nSolana Price Forecast - SOL-USD Holds $214 as Institutions Add $1.7B, ETF Approval Odds Fuel $500 Bull Case\n23.09.2025 · TradingNEWS ArchiveCrypto\n-\nNatural Gas Price Forecast - NG=F Holds $2.85 as EU Storage Hits 81.6% and Options Price €50/MWh Surge\n23.09.2025 · TradingNEWS ArchiveCommodities\n-\nUSD/JPY Price Forecast - Dollar to Yen at 148.40 as Fed Cuts Clash With BoJ Hawkish Signals, CPI in Focus\n23.09.2025 · TradingNEWS ArchiveForex\nMacro Backdrop: Fed Policy and Rate Cuts\nThe Federal Reserve’s decision to cut rates by 25 basis points for the first time this year served as a catalyst for late-week ETF demand. Bitcoin briefly surged above $117,000, while Ethereum touched $4,600, before retracing as broader markets absorbed the implications of looser monetary policy. The correlation between inflows and rate decisions suggests that ETFs are becoming a direct channel for monetary policy transmission into digital asset demand. Analysts caution that further macro shocks—whether rate adjustments or risk-off moves in equities—could dictate ETF flows as much as crypto-native factors.\nRevenue as a Benchmark for TradFi Expansion\nThe $260 million annualized revenue figure from BlackRock’s crypto ETFs provides a template for legacy asset managers. The profitability resembles what ETFs in equities and bonds achiev"
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "114.6200",
            "open": "4,180.5500",
            "close": "4,175.4700",
            "high": "4,231.1100",
            "low": "4,116.4900"
        },
        "market_summary": "Institutional investment in Ethereum is growing, as evidenced by ETHZilla's significant $350 million investment into ETH and DeFi ecosystem projects. Regulatory developments are also favorable, with the SEC drafting an \"innovation exemption\" to fast-track crypto products and lawmakers pushing for crypto inclusion in retirement plans. However, the market also shows a trend of investors seeking higher returns from newer, smaller-cap DeFi projects rather than ETH itself due to its perceived limited upside.\n\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "ETHZilla to Invest $350M in Ethereum and DeFi Ecosystem Through Convertible Bonds - CoinCentral",
                "source": "CoinCentral",
                "url": "https://coincentral.com/ethzilla-to-invest-350m-in-ethereum-and-defi-ecosystem-through-convertible-bonds/",
                "body": "TLDR\n- ETHZilla secures $350M via convertible bonds to boost Ethereum holdings and DeFi investments.\n- The company plans to use funds for Ethereum Layer-2 projects and tokenized real-world assets.\n- ETHZilla now holds around 102,000 ETH, becoming a significant institutional player in Ethereum.\n- ETHZilla’s pivot from biotech to crypto aims for recurring revenue through Ethereum-based investments.\nETHZilla, a Nasdaq-listed company that recently transitioned from a biotech focus to cryptocurrency, has raised $350 million through convertible bonds. The funds will be used to expand the company’s Ethereum (ETH) holdings and strengthen its position in the decentralized finance (DeFi) ecosystem. This shift in strategy is part of a broader trend where institutions are increasingly getting involved in Ethereum’s growth, aiming to capitalize on both its market value and technological developments.\nWith this new funding, ETHZilla could potentially purchase an additional 120,000 ETH, nearly doubling its current holdings. This move places the company among the largest institutional holders of Ethereum, signaling its commitment to the blockchain and DeFi innovations. ETHZilla already holds 102,000 ETH, which makes it one of the top ten corporate holders of the cryptocurrency.\nFrom Biotech to Blockchain: ETHZilla’s New Strategy\nETHZilla’s pivot from biotechnology to cryptocurrency is significant. Founded in 2016, the company initially focused on clinical-stage biotech. However, after facing significant financial setbacks and a nearly 99% drop in stock value, ETHZilla decided to reinvent itself. Now, instead of biotechnology, ETHZilla is targeting cash-flowing assets within the crypto space.\nRather than just holding Ethereum as a treasury asset, the company is actively investing in Ethereum’s growing ecosystem.\nThis includes initiatives such as Layer-2 networks, which enhance Ethereum’s scalability, and tokenized real-world assets (RWAs) like digital bonds or property. These investments are aimed at generating recurring revenue, which will further strengthen Ethereum’s role in decentralized finance.\nStrategic Investments: Layer-2 and Tokenized Assets\nETHZilla’s strategy goes beyond accumulating Ethereum. The company is also investing in Layer-2 networks, which help lower Ethereum’s transaction costs and improve scalability. By deploying capital into Layer-2 projects, ETHZilla is positioning itself at the forefront of Ethereum’s evolution.\nAdditionally, the company is investing in the tokenization of real-world assets (RWAs), which expands the utility of Ethereum in areas like real estate and finance. Tokenized assets allow real-world goods and financial instruments to be represented on the blockchain, broadening Ethereum’s practical applications in DeFi.\nETHZilla’s investments are not limited to Ethereum itself but are designed to enhance the ecosystem around it. This broader approach provides more diversified revenue streams, making the company more resilient in the fast-changing crypto landscape.\nA New Era of Corporate Ethereum Treasuries\nThe scale of ETHZilla’s investment in Ethereum aligns with a broader trend in the crypto industry, where corporations are increasingly holding and managing significant amounts of digital assets. Similar to Bitcoin-focused firms, ETHZilla’s strategy of acquiring and holding large amounts of Ethereum mirrors the practices of corporate treasuries that use crypto as a reserve asset.\nThe rise of Digital Asset Treasuries (DATs), including ETHZilla, has contributed to a tightening of Ethereum’s available supply. As of now, ETHZilla and similar entities control roughly 4.34% of Ethereum’s circulating supply. This strategy is seen as a way to help reduce the liquidity of Ethereum, which could have long-term effects on its price, especially with around 30% of Ethereum currently staked in the network.\nETHZilla’s approach is notable for its focus on generating revenue from its Ethereum holdings through strategic inves"
            },
            {
                "title": "Here’s what happened in crypto today - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/cointelegraph:b431ea497094b:0-here-s-what-happened-in-crypto-today/",
                "body": "Here’s what happened in crypto today\nToday in crypto, the SEC is drafting an “innovation exemption” to speed approvals of digital-asset products. Meanwhile, blockchain payment company Fnality raised $136 million from major banks to grow its settlement network, and US lawmakers pressed for crypto in retirement plans.\nUS SEC eyes ‘innovation exemption’ to fast-track digital asset products: Atkins\nThe US Securities and Exchange Commission is working to create an “innovation exemption” that would ease approval of digital-asset products by the end of the year, SEC Chair Paul Atkins said on Tuesday.\nDuring an interview on Fox Business, Atkins told anchor Maria Bartiromo that the SEC is working on “rulemaking in the coming months.”\nAn “innovation exemption” would function as a regulatory carve-out, giving crypto companies temporary relief from older securities rules to roll out new products under lighter oversight while the SEC develops tailored regulations.\nAtkins addressed a question about the recent approval of the first multi-asset crypto exchange-traded product (ETP) in the United States. Launched on Friday, the product gives investors access to Bitcoin (BTC), Ether (ETH), XRP (XRP), Solana (SOL) and Cardano (ADA). Grayscale's crypto fund launched under the SEC's recently announced generic listing standards, which reduce approval timelines for ETFs under Rule 6c-11.\nAccording to Atkins, the new listing standards are “another example of how we can move forward. “It’s not just an ad hoc type of approach. We’re trying to give the marketplace some kind of stable platform upon which they can introduce new products.”\nBlockchain payment firm Fnality raises $136 million in round led by major banks\nLondon-based blockchain payments company Fnality secured $136 million in a Series C funding round backed by some of the world’s largest financial institutions.\nBank of America, Citi, KBC Group, Temasek, Tradeweb and WisdomTree led the round, joined by returning investors including Goldman Sachs, Santander, Barclays and UBS, according to a Tuesday announcement by the company.\n“The closing of our Series C reflects a shared conviction that the future of money demands a new foundation,” Fnality CEO Michelle Neal said. She added that the company’s blockchain-based settlement systems offer “24/7 payment rails, real-time settlement, and enhanced liquidity.”\nFnality, which launched its sterling-denominated Fnality Payment System in the United Kingdom last year, aims to modernize wholesale payments through a blockchain-based infrastructure tied to central bank reserves. The new capital will help Fnality expand into the US dollar and euro markets, pending regulatory approvals, it said.\nUS lawmakers urge SEC to act on Trump’s crypto retirement plan\nUS lawmakers have called on Securities and Exchange Commission Chair Paul Atkins to help accelerate the executive order enabling crypto investments in US 401(k) retirement plans.\nIn the letter on Monday, nine lawmakers, including House Financial Services Committee Chairman French Hill and Subcommittee on Capital Markets Chairman Ann Wagner, said that Atkins was asked to “provide swift assistance” to the Secretary of Labor and to make any necessary adjustments to its current regulations and guidance.\nThey also noted that under President Donald Trump’s August executive order on “Democratizing Access to Alternative Assets for 401(k) Investors,” the SEC was instructed to make alternative assets like crypto more accessible in participant-directed retirement plans, in consideration of accredited investor and qualified purchaser rules.\n“We are hopeful that such actions will help the 90 million Americans that are currently restricted from investing in alternative assets to secure a dignified, comfortable retirement,” the nine lawmakers said."
            },
            {
                "title": "Best Crypto to Invest in and Turn 1 ETH into 15 ETH in 2025 - Cryptopolitan",
                "source": "Cryptopolitan",
                "url": "https://www.cryptopolitan.com/best-crypto-to-invest-in-and-turn-1-eth-into-15-eth-in-2025/",
                "body": "Ethereum (ETH) remains one of the top cryptocurrencies in 2025, valued for its robust ecosystem and role as the backbone of decentralized finance. Yet while ETH itself is solid, its potential for 2025 upside may be more limited than with newer cryptos. That is where Mutuum Finance (MUTM) comes into the equation.\nNow priced at just $0.035, MUTM is a DeFi-based token positioned to reshape lending and borrowing. Experts suggest that if MUTM can hit its projected growth margins, early investors can look forward to returns of up to 15x. That is, 1 ETH invested in Mutuum Finance today could become 15 ETH before the end of 2025.\nEthereum Stays Robust as DeFi Pillar\nEthereum (ETH) is trading at around $4,530 currently, staying strong as the second-largest market cap cryptocurrency and the foundation for decentralized finance. Its extensive ecosystem of layer-2 solutions, smart contracts, and institutional backing continues to build its foundation as a long-term market leader. But with ETH’s size automatically limiting its potential upside compared to smaller-cap stocks, investors are turning their attention to new project Mutuum Finance that is seen as having more upside growth in the next cycle.\nMutuum Finance Presale and the Future of DeFi\nMutuum Finance presale has raised over $16.2 million in presale and more than 16,500 investors have bought tokens. Stage 6 is available for sale at the price of $0.035 per token.\nMutuum Finance aspires to long-term growth in the DeFi space. The project is promoting early adoption by running a $100,000 giveaway campaign where 10 users of the platform will get $10,000 MUTM each.\nMutuum Finance and CertiK also have an open Bug Bounty Program with a reward pool of $50,000 USDT. The Program is intended to encourage white-hat hackers and security researchers to reward them for identifying bugs in the project codebase. Bugs are ranked on severity level, i.e., critical, major, minor, and low, and rewards are issued in same.\nMutuum Finance is in the shape of a balanced dynamic rate of interest liquidity model. Borrowing is extremely appealing during periods of low interest and triggers lending and usage. High interest induces repayment, as well as further injections of capital. The most suitable are fixed interest rates for highly liquid funds, anchored and reopenable on fluctuation in the market.\nBeing a fully decentralized system, rights ownership is in the hands of the MUTM token holders where lending and borrowing are distinguished from one another. The interest rate mechanism rewards long-term efficiency, increases portfolio auto-diversification, and grows as the DeFi market evolves.\nPrecise pricing facilitates lending, borrowing, and liquidation trades to be carried out profitably. Mutuum Finance utilizes Chainlink oracles to obtain USD and natively native assets such as ETH, POL, and AVAX. The system utilizes fallback oracles, composite feeds, and time-weighted averages of decentralized exchanges to provide precise valuations even in stressed markets.\nTurn 1 ETH into 15 ETH\nMutuum Finance (MUTM) ranks amongst the top cryptos that have been attracting investor attention as one of the most promising opportunities in 2025. Stage 6 presale tokens are priced at $0.035 with over $16.2M raised and 16,500+ investors already on board. Experts are expecting returns up to 15x, i.e., 1 ETH today may become the value of 15 ETH by taking MUTM’s route. Backed by a $100K giveaway, a $50K CertiK bug bounty, and a safe oracle-powered lending protocol, Mutuum Finance is innovation meets growth potential. As Ethereum (ETH) remains flat at $4,530, MUTM offers the greater upside small-cap investors are looking for. Get your Stage 6 tokens now before the next presale price increase.\nFor more information regarding Mutuum Finance (MUTM) please use the following links:\nWebsite: https://mutuum.com/\nLinktree: https://linktr.ee/mutuumfinance"
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "9.2500",
            "open": "219.3400",
            "close": "215.2100",
            "high": "221.4800",
            "low": "212.2300"
        },
        "market_summary": "The Solana ecosystem is experiencing significant growth, highlighted by a record $34 billion in Total Value Locked (TVL) that has doubled year-on-year, signaling strong DeFi expansion and mainstream adoption. This growth is further bolstered by key developments, such as the AI platform Perle joining the ecosystem to leverage its high-speed infrastructure for decentralized AI training. While SOL price shows strength and is approaching new all-time highs, the articles also note a shift of some investor enthusiasm towards newer, lower-cap DeFi projects seeking higher potential returns.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Perle Joins Solana Ecosystem To Bring Human Trained AI Onchain - PR Newswire",
                "source": "PR Newswire",
                "url": "https://www.prnewswire.com/news-releases/perle-joins-solana-ecosystem-to-bring-human-trained-ai-onchain-302565071.html",
                "body": "SAN FRANCISCO, Sept. 23, 2025 /PRNewswire/ -- Perle, an AI training data platform powered by Web3 that brings human wisdom to AI models, today announced a strategic expansion into the Solana ecosystem, marking a key milestone in the company's growth and mission to improve how AI systems are trained and evaluated.\nThis move will enable Perle to leverage Solana's high-speed, scalable blockchain infrastructure, further strengthening its crypto-native platform for transparent, verifiable human input in AI model training. Through this initiative with Solana, Perle aims to broaden participation, improve data quality, and empower a global community to actively contribute to AI development.\n\"Expanding into the Solana ecosystem represents a major step forward in our mission to improve how AI systems are trained and evaluated,\" said Ahmed Rashad, CEO of Perle. \"Solana's high-speed architecture, near-instant finality, and scalable infrastructure make it an ideal platform for decentralizing human input at scale. By integrating with a blockchain like Solana, we can further decentralize human input, ensure verifiable data quality, and unlock global participation, making AI development more accurate, inclusive, and impactful.\"\n\"Perle's approach to scaling human intelligence with a permissionless platform strongly aligns with our vision of how blockchain-based systems can be useful to advancing state-of-the-art AI,\" said Rishin Sharma, Head of AI at the Solana Foundation. \"By bringing Perle's platform to our ecosystem, we're helping drive a more transparent, scalable model for data collection and curation used in building AI that will be competitive with centralized solutions that exist today.\"\nPerle's expansion into the Solana ecosystem underscores the company's commitment to advancing AI development through transparent, verifiable, and decentralized human input. As AI continues to evolve, this initiative positions both Perle and Solana at the forefront of innovation, enabling developers and contributors worldwide to collaborate in building smarter, more trustworthy AI systems.\nAbout Perle\nPerle transforms how AI teams access and use training data by combining human expertise with adaptive workflows. Specializing in data acquisition, expert annotation, and model evaluation, Perle delivers faster, more reliable results tailored for generative AI, LLMs, and RLHF. Our approach ensures data quality and context where it matters most-helping teams build smarter, more trustworthy AI. Learn more at Perle.ai.\nMedia Contact: Perle@MGroupSC.com\nAbout Solana\nThe Solana Foundation is a non-profit foundation based in Zug, Switzerland, dedicated to the decentralization, adoption, and security of the Solana network. For more information, please visit https://solana.org/\nMedia contact: press@solana.org\nSOURCE Perle\nWANT YOUR COMPANY'S NEWS FEATURED ON PRNEWSWIRE.COM?\nNewsrooms &\nInfluencers\nDigital Media\nOutlets\nJournalists\nOpted In"
            },
            {
                "title": "Solana Price Outlook: Ecosystem TVL Hits $34B, Doubling Year-on-Year - The Tradable",
                "source": "The Tradable",
                "url": "https://thetradable.com/crypto/solana-price-outlook-ecosystem-tvl-hits-34b-doubling-yearonyear-cm--a",
                "body": "Solana has emerged as a powerhouse in the blockchain ecosystem, showcasing impressive growth metrics that continue to capture the attention of investors and developers alike. The network's recent achievement of reaching $34 billion in Total Value Locked represents a significant milestone that underscores its growing dominance in the decentralized finance space and provides a strong foundation for future price appreciation.\nSolana (SOL) Price Strengthens with DeFi Expansion\nSolana keeps proving its strength as a top DeFi network. The latest numbers show Solana's TVL has hit a record $34 billion - that's almost 200% growth from last year. This massive jump shows people are really confident in what Solana can do.\nCrypto analyst @CryptosRUs pointed out that this isn't just good news for the ecosystem - it's also a solid reason why SOL's price could keep climbing. The steady increase in DeFi activity suggests Solana might be hitting a new level of mainstream adoption that could drive the price even higher.\nSOL Price Outlook: Ecosystem Leaders Drive Growth\nSolana's success comes from its top protocols growing fast. Circle, Kamino, Jupiter, Jito, and Sanctum are leading the charge, while established names like Raydium, Marinade, Drift Protocol, and Orca keep providing solid liquidity options. Big institutional players like BlackRock, VanEck, and PayPal joining the ecosystem makes it even more credible.\nThis variety of apps is crucial for keeping Solana's growth going without relying too heavily on just one protocol. Analysts think if this pace continues, Solana's TVL could hit $40 billion soon, putting it in an even stronger position against Ethereum and other major blockchains.\nBesides the TVL numbers, Solana has built a reputation as one of the fastest and cheapest blockchains out there. Its ability to process tons of transactions quickly and cheaply has attracted developers, DeFi projects, and even traditional finance companies looking into digital assets.\nFor investors, the picture is pretty clear: Solana's $34 billion TVL milestone shows exponential growth, making a strong case for SOL's price to keep rising. If market conditions stay positive, analysts believe Solana could be entering a new bull run powered by its rapidly growing DeFi ecosystem."
            },
            {
                "title": "Solana News: SOL Price Set for New ATH, While This $0.035 DeFi Altcoin Builds Stronger Momentum - Mitrade",
                "source": "Mitrade",
                "url": "https://www.mitrade.com/insights/news/live-news/article-3-1139112-20250922",
                "body": "Solana (SOL) is setting itself up for a possible new all-time high this weekend, as robust network activity and renewed investor enthusiasm continue to propel its price. But as Solana (SOL) dominates the headlines with its price, there is another project building strength even more quietly in presale, Mutuum Finance (MUTM).\nSolana (SOL) is trading about $245.50, with intraday highs near $253 and lows near $243. Recent price action has shown steady buyer demand, but SOL is also increasing to areas of resistance that had earlier held it back from a solid breakout. Support is starting to develop in the $220–$230 range, which gives some cushion to the downside.\nWhile bullish sentiment and Solana ecosystem activity continue to be confidence supportive, investors feel that newer DeFi venture Mutuum Finance, is offering more potential upside in the current market conditions.\nMutuum Finance is offering investors the opportunity to be early adopters of the project and invest in tokens at considerably lower rates than what they will be asked to pay after the project’s launch. At presale Phase 6, where it is $0.035 per MUTM, the token will be priced at Phase 7 at $0.04. Presale has succeeded with over $16.05 million collected and over 16,450 token holders, a reflection of confidence and optimism on the part of investors in the market.\nAt yet another security level, Mutuum Finance has also initiated an official Bug Bounty Program in collaboration with CertiK ensuring rewards of up to $50,000 USDT. Publicly announced, the program invites white-hat hackers, developers, and researchers to test the codebase for any weaknesses. The bounties are rewarded on a severity level basis, so even low-level bugs are already resolved before release.\nMUTM is a two-layer hybrid lending protocol, with Peer-to-Contract (P2C) and Peer-to-Peer (P2P) models, to ensure ultimate flexibility. The P2C model is used to enable the contracts to monitor the market round-the-clock so that interest rates can be decided. It is designed such that investors will earn passive income and lenders will lend at the lowest interest rates and the contracts will execute the transaction automatically.\nP2P model enables lenders and borrowers to interact directly in real-time without an intermediary. The more dynamic of the two provides the possibilities for riskier products such as meme coins and freedom and efficiency in a trustless setting.\nIn the interest of providing precise and current prices, Mutuum Finance uses Chainlink oracles that feed on high-cap token price aggregations such as USD, ETH, MATIC, and AVAX. Fallback oracles, combined feeds, and on-chain data feeds are also used for security in a bear market. The stable foundation of sound pricing is used in stable collateral management, liquidation, and risk calculation for stability and efficiency of the protocol under all market conditions.\nMutuum Finance (MUTM) is picking up great momentum while Solana (SOL) is racing towards a fresh ATH above $300. Stage 6 presale tokens are worth $0.035, and the price will go up 14.29% to $0.04 in Stage 7. The project has raised a notable $16.05M in funds with 16,450+ holders, which means investors have confidence in it. With its double lending model of P2C and P2P, Chainlink oracle integration, and $50K CertiK bug bounty, MUTM offers a mix of innovation, flexibility, and security. As Solana tests for resistance, early investors see MUTM as the higher upside bet through 2025. Lock in Stage 6 tokens today before the next price spike.\nFor more information regarding Mutuum Finance (MUTM) please use the following links:\nWebsite: https://mutuum.com/\nLinktree: https://linktr.ee/mutuumfinance"
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "506.000",
            "open": "46,388.630",
            "close": "46,337.260",
            "high": "46,741.980",
            "low": "46,235.980"
        },
        "market_summary": "U.S. stocks retreated from record highs as Federal Reserve Chair Jerome Powell's comments that stocks are \"fairly highly valued\" prompted a sell-off, particularly in the tech sector. While major indexes closed lower, the market showed mixed signals with gains in stocks like Boeing on positive news and Micron rising ahead of its earnings report. Other assets like gold hit a new record high and oil prices advanced.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Futures: Micron Beats Views After Stocks Fall On Powell - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-market-slides-powell-stock-prices-micron-earnings/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #302b37dc-990a-11f0-a4f9-ef5a2822356d"
            },
            {
                "title": "Markets News, Sep. 23, 2025: Stock Indexes Close Lower as Tech Shares Lead Declines; Fed Chair Powell Gives First Comments Since Rate Cut - Investopedia",
                "source": "Investopedia",
                "url": "https://www.investopedia.com/dow-jones-today-09232025-11815145",
                "body": "U.S. stocks fell from record highs Tuesday after Federal Reserve Chair Jerome Powell spoke for the first time since the central bank cut interest rates last week.\nThe tech-heavy Nasdaq, the benchmark S&P 500, and the blue-chip Dow Jones Industrial Average closed down 1%, 0.6%, and 0.2%, respectively. The three indexes all had registered intraday and closing highs in the prior three sessions, and the Dow and S&P 500 set fresh intraday records soon after the opening bell Tuesday before retreating.\nPowell spoke at the Greater Providence Chamber of Commerce in Warwick, R.I., six days after the Fed made its first rate cut since last December. The Fed chair said that \"there is no risk-free path\" to achieve the central bank's dual mandate of maintaining full employment and price stability in the U.S. economy, and that stocks were \"fairly highly valued.\"\nNvidia (NVDA) shares fell nearly 3%, giving back most of their 4% gains from Monday, when they hit an all-time high on news that the company and OpenAI were partnering on a buildout of data centers, and that the AI chipmaker would be investing up to $100 billion in the ChatGPT developer.\nNvidia partner Micron Technology (MU) was slated to report its fiscal 2025 fourth-quarter results after the bell. Shares of the memory-chip maker, which have nearly doubled this year, rose 1%.\nOracle (ORCL) was one of the worst-performing stocks in the S&P 500 with a decline of more than 4% Tuesday, a day after jumping 6% as the technology firm boosted its bets on AI by naming two new CEOs, including the former head of its cloud infrastructure business, to take over from Safra Catz.\nKenvue (KVUE) shares closed 1.6% higher after dropping 7.5% yesterday ahead of a press conference by President Donald Trump in which he said that acetaminophen, the active ingredient in Tylenol, can lead to higher risk of autism and warned pregnant women against using the medication.\nBoeing (BA) shares advanced 2% after the company inked a lucrative contract to make planes for Uzbekistan Airways. President Trump called it \"a GREAT Deal\" worth more than $8 billion in a post on his Truth Social network, noting that last month he had spoken with Uzbekistan's president, Shavkat Mirziyoyev. Bloomberg also reported that U.S. Ambassador to China David Perdue said the countries were negotiating a \"huge\" Boeing plane order.\nGold futures rose 0.6% to set another record high of around $3,800 an ounce at 4 p.m. ET. West Texas Intermediate futures, the U.S. crude oil benchmark, was up 2.3% at $63.70 per barrel.\nThe 10-year Treasury yield, which affects borrowing costs on a variety of consumer and commercial loans, slipped to 4.11% from 4.15% at Monday's close. Bitcoin edged lower to around $111,700. The U.S. dollar index, which tracks the value of the greenback against a basket of foreign currencies and hit its lowest level since early 2022 last Wednesday, was down 0.1% at 97.21.\nBiggest S&P 500 Movers on Tuesday\nDecliners\n- Shares of Generac Holdings (GNRC), a supplier of standby power generators and other energy equipment, fell the most of any S&P 500 stock on Tuesday, dropping more than 10%. Although analysts at Stifel reiterated their \"buy\" rating on Generac stock, pointing to promising opportunities in providing emergency power backup solutions for data centers, they noted headwinds in the market for home standby generators.\n- Jefferies downgraded Vistra (VST) stock to \"hold\" from \"buy\" and reduced its price target. Shares of the electric utility company dropped 6.3%. Analysts noted that the stock is trading near its all-time high, pushed upward by enthusiasm about demand from power-intensive data centers. The firm also expressed concern that Vistra has yet to announce a data center agreement for its Comanche Peak nuclear facility in Texas.\n- Shares of Regeneron Pharmaceuticals (REGN) slipped 4.7% after a judge in Austria ruled in favor of a competitor that intends to create a competing version of Eylea, the treatment for eye diso"
            },
            {
                "title": "Wall Street opens mixed ahead of Powell's speech on U.S. economy - Seeking Alpha",
                "source": "Seeking Alpha",
                "url": "https://seekingalpha.com/news/4497527-sp500-nasdaq-dow-jones-outlook-stock-market",
                "body": "The stock market opened mixed on Tuesday, as Wall Street's major averages touched record highs again, while investors looked forward to Federal Reserve Chair Jerome Powell's speech.\nStock indexes touched record highs, with the S&P 500 unchanged, Dow up 0.3%, and Nasdaq down 0.1% as investors look forward to Jerome Powell's speech.\nOptimism is driven primarily by the 'Magnificent 7' tech stocks, especially companies like Nvidia after a major AI infrastructure deal with OpenAI.\nInvestors are watching Powell's economic outlook speech, upcoming PCE numbers, and economic data like the September Composite Flash and Richmond Fed Manufacturing Index.\nRecommended For You\nRelated Stocks\nTrending Analysis\nTrending News\nTo ensure this doesn’t happen in the future, please enable Javascript and cookies in your browser."
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "71.750",
            "open": "9,241.060",
            "close": "9,207.060",
            "high": "9,273.510",
            "low": "9,201.760"
        },
        "market_summary": "The UK private sector is showing significant signs of weakening, with the composite PMI falling to a near-stall speed and manufacturing sinking further into contraction. While there is a silver lining in that inflationary pressures may have peaked, the overall economic momentum is poor due to subdued demand, falling new orders, and rising job losses. The outlook is further clouded by potential tax hikes in the upcoming Budget, which threaten to severely thwart growth.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "UK private sector sinks in blow to growth, but inflation might have peaked - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/analysis/uk-private-sector-sinks-in-blow-to-growth-but-inflation-might-have-peaked-202509230959",
                "body": "The PMI surveys for September suggest that the third quarter was another weak one for the UK economy, however, there was also some good news on prices. Price rises moderated this month, which could shift the Bank of England back towards a dovish stance later this year.\nThe composite PMI sunk to 51.0, from 53.5 in the provisional September reading. Although this is still in expansion territory it suggests that the UK economy continues to lose momentum as we lead up the Budget. There were big losses for the manufacturing and the service sector indices. Manufacturing fell further into contraction territory at 46.2, while the service sector also fell to 51.9 from 54.2 in August. This is the weakest service sector and composite readings since May, after the government’s national insurance increases came into effect for employers.\nPMI: The grim details\nS&P Global, who produced the report, said that although private sector output expanded for the fifth month in a row, they warned about subdued demand and pressure on margins from rising input costs. The private sector is also negative about the 2026 outlook, and expectations fell to a 3-month low. The UK’s manufacturing sector is in disarray. The September PMI reading was the weakest since March, and the survey noted weak order books for both domestic and export markets. The Survey also reported that the auto industry was particularly impacted, as a result of plant stoppages at Jaguar Land Rover.\nExport sales remain subdued, and total new orders fell to their lowest level since April, when Donald Trump announced his plans for tariffs. The survey recorded falling sales to both the US and Europe, in a sign that tariffs are hitting demand on both sides of the Atlantic. The recent state visit by Donald Trump to the UK was meant to have positive economic benefits for the UK, this report suggests that a good economic relationship between the US and the UK is more important than ever.\nInflation may have peaked, as price rises moderate\nThe one bit of good news in this report is that price pressures may have moderated in the UK this month. The price index recorded one of the smallest increases in change since the pandemic.\nThis PMI report suggests that the economy is almost stalling in the UK, and job losses are rising. The PMI employment sector report, suggested that the private sector may have shed another 50,000 jobs in the three months to September. The PMI survey noted a large fall in business confidence, as tax rises are once again on the agenda. The survey also suggests that the economy may continue to stall due to a lack of confidence.\nBudget risks mount once again\nNews on Tuesday suggests that the government may consider hiking income tax by 2%. This would break Labour’s manifesto pledge and could have big political ramifications for the government. The suggestion comes from the Resolution Foundation, who also argue that the government should reduce the VAT threshold for business to £30,000 from the current £90,000. This would hammer small business at the same time as the private sector is suffering from weak orders here and abroad, as this PMI survey shows. Applying 20% of VAT to all small business activity could be the nail in the coffin for many. It would undoubtedly threaten jobs, and it could backfire dramatically. This PMI report should send a clear message to the government: tax rises should not take precedence over spending cuts, if tax rises are the centre piece of this Budget, then growth will be severely thwarted in the coming years.\nOECD calls out UK price rises\nThe bad news keeps piling up for the government. The OECD has said that the UK faces the highest level of inflation of any major economy this year. The OECD predicts that UK inflation rate will rise to 3.5% this year from 2.5% a year ago, and core inflation will rise to 3.7%, well above the G20 average rate.\nFrom hero to zero, UK growth set to slow sharply next year\nThe OECD has blamed food prices and has also poin"
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "223.150",
            "open": "23,583.830",
            "close": "23,553.330",
            "high": "23,730.080",
            "low": "23,506.930"
        },
        "market_summary": "The GER40 (DAX) closed moderately higher, supported by positive momentum from U.S. markets and a strong performance in European equities, with the French CAC 40 also advancing. However, U.S. markets pulled back from record highs due to Federal Reserve Chair Jerome Powell's comments on high equity valuations, which introduced caution. This mixed global performance, with Asian markets also showing a lack of direction, creates a balanced but watchful environment for European indices.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "U.S. Stocks Give Back Ground After Powell Comments About Valuations - RTTNews",
                "source": "RTTNews",
                "url": "https://www.rttnews.com/amp/3576499/u-s-stocks-give-back-ground-after-powell-comments-about-valuations.aspx",
                "body": "Stocks moved mostly lower over the course of the trading day on Tuesday, giving back ground after trending higher over the past few sessions. The major averages all moved to the downside, pulling back off Monday's record closing highs.\nThe tech-heavy Nasdaq led the way lower, slumping 215.50 points or 1.0 percent to 22,573.47. The S&P 500 slid 36.83 points or 0.6 percent to 6,656.92, while the narrower Dow dipped 88.76 points or 0.2 percent to 46,292.78.\nThe weakness that emerged on Wall Street may partly reflected concerns stocks are overvalued following comments by Federal Reserve Chair Jerome Powell.\nSpeaking at an event Rhode Island, Powell described equity prices as \"fairly highly valued\" following the recent run to record highs.\nPowell also addressed the outlook for monetary policy, noting the Fed is facing a \"challenging situation\" as near-term risks to inflation are tilted to the upside and risks to employment to the downside.\n\"Two-sided risks mean that there is no risk-free path,\" Powell said. \"If we ease too aggressively, we could leave the inflation job unfinished and need to reverse course later to fully restore 2 percent inflation.\"\n\"If we maintain restrictive policy too long, the labor market could soften unnecessarily,\" he continued. \"When our goals are in tension like this, our framework calls for us to balance both sides of our dual mandate.\"\nA pullback by shares of Nvidia (NVDA) also weighed on the Nasdaq, with the chipmaker tumbling by 2.8 percent after surging nearly 4 percent to a new record closing high on Monday.\nThe rally in Monday's session came after Nvidia and OpenAI announced a strategic partnership to deploy at least 10 gigawatts of Nvidia systems for OpenAI's next-generation AI infrastructure.\nSector News\nRetail stocks showed a significant move to the downside on the day, dragging the Dow Jones U.S. Retail Index down by 1.2 percent.\nNotable weakness also emerged among software stocks, as reflected by the 1.2 percent loss posted by the Dow Jones U.S. Software Index.\nOn the other hand, energy stocks continued to turn in a strong performance amid a sharp increase by the price of crude oil, with the Philadelphia Oil Service Index surging by 3.5 percent and the NYSE Arca Oil Index climbing by 1.6 percent.\nOther Markets\nIn overseas trading, stock markets across the Asia-Pacific region turned in a mixed performance on Tuesday, with Japanese markets closed for a holiday. Hong Kong's Hang Seng Index slid by 0.7 percent, while South Korea's Kospi climbed by 0.5 percent.\nMeanwhile, European stocks moved mostly higher on the day. The French CAC 40 Index advanced by 0.5 percent and the German DAX Index rose by 0.4 percent, although the U.K.'s FTSE 100 Index bucked the uptrend and closed just below the unchanged line.\nIn the bond market, treasuries moved to the upside after showing a lack of direction earlier in the session. Subsequently, the yield on the benchmark ten-year note, which moves opposite of its price, fell by 2.3 basis points to 4.120 percent.\nLooking Ahead\nA report on new home sales may attract some attention on Wednesday, although trading activity may be somewhat subdued ahead of the release of more closely watched data later in the week.\nby RTTNews Staff Writer\nFor comments and feedback: editorial@rttnews.com"
            },
            {
                "title": "European Stocks - 23-09-25 - Armenpress",
                "source": "Armenpress",
                "url": "https://armenpress.am/en/article/1230420",
                "body": "MOSCOW, SEPTEMBER 24, ARMENPRESS. European main indexes values for 23 September:\nThe value of German DAX up by 0.36% to 23611.33 points, French CAC 40 up by 0.54% to 7872.02 points, British FTSE down by 0.04% to 9223.32 points, and Russian RTSI up by 1.45% to 1042.63 points.\nThe German Stock Index is a total return index of 30 selected German blue chip stocks traded on the Frankfurt Stock Exchange. The equities use free float shares in the index calculation. The DAX has a base value of 1,000 as of December 31, 1987. As of June 18, 1999 only XETRA equity prices are used to calculate all DAX indices.\nThe CAC 40 (Cotation Assistée en Continu) is a benchmark French stock market index. The index represents a capitalization-weighted measure of the 40 most significant values among the 100 highest market caps on the Euronext Paris (formerly the Paris Bourse).\nThe FTSE UK Index Series is designed to represent the performance of UK companies, providing market participants with a comprehensive and complementary set of indices that measure the performance of all capital and industry segments of the UK equity market.\nRTS Index is cap-weighted composite index calculated based on prices of the 50 most liquid Russian stocks of the largest and dynamically developing Russian issuers presented on the Moscow Exchange. RTS Index was launched on September 1, 1995 at base value 100. The Index is calculated in real time by Moscow Exchange in US dollars and disseminated by the S&P Dow Jones Indices, “Armenpress” reports."
            },
            {
                "title": "Frankfurt Stock Exchange closing: US records drive DAX moderately higher - MarketScreener",
                "source": "MarketScreener",
                "url": "https://www.marketscreener.com/news/frankfurt-stock-exchange-closing-us-records-drive-dax-moderately-higher-ce7d58ddd98af027",
                "body": "Access Denied\nYou don't have permission to access \"http://www.marketscreener.com/news/frankfurt-stock-exchange-closing-us-records-drive-dax-moderately-higher-ce7d58ddd98af027\" on this server.\nReference #18.33a03b17.1758693038.4e48183\nhttps://errors.edgesuite.net/18.33a03b17.1758693038.4e48183"
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "244.750",
            "open": "24,766.240",
            "close": "24,605.400",
            "high": "24,796.860",
            "low": "24,552.110"
        },
        "market_summary": "The Nasdaq 100-led rally paused as Fed Chair Powell's comments introduced caution, noting equities are \"fairly highly valued\" and signaling a challenging path ahead for rate cuts due to persistent inflation risks. This tempered the recent AI-fueled optimism that had driven the market to consecutive record highs, with investors now awaiting key inflation data and earnings from major tech components like Micron for further direction.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Stock market today: Dow, S&P 500, Nasdaq slide after Powell flags Fed's challenge, 'highly valued' stocks - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-slide-after-powell-flags-feds-challenge-highly-valued-stocks-174834474.html",
                "body": "The Dow Jones Industrial Average (^DJI) fell nearly 0.2%. The S&P 500 (^GSPC) fell about 0.6%, and the tech-heavy Nasdaq Composite (^IXIC) lost almost 1%.\nStocks jumped on Monday to clinch a third straight day of record-high closes, lifted by optimism that the AI trade and further Fed policy easing will continue to fuel the rally. The Nasdaq led the gains as Nvidia stock surged (NVDA) after the chipmaker said it will invest at least $100 billion in OpenAI (OPAI.PVT).\nBut Powell's caution on Tuesday threw cold water on the rally on a couple different fronts. Powell suggested during a speech in Rhode Island that the central bank would move cautiously after resuming rate cuts last week, noting the challenge of balancing its dual mandate at the moment.\n\"Near-term risks to inflation are tilted to the upside and risks to employment to the downside — a challenging situation. Two-sided risks mean that there is no risk-free path,\" Powell said.\nLater, in a question-and-answer session, he noted that \"by many measures, for example, equity prices are fairly highly valued.\"\nPowell's comments set the stage for the release on Friday of the Fed's preferred inflation gauge, the Personal Consumption Expenditures index. Wall Street will look for signs that already sticky inflation isn't heating up, which could dent high expectations for two more rate reductions this year. Other data released Tuesday showed that US business activity cooled this month, while a measure of prices paid for materials jumped, indicating price pressures are persisting.\nOn the tech side, the spotlight is on Micron Technology's (MU) quarterly earnings due after the bell. The memory chipmaker's results will be watched for updates on AI-driven demand and revenue guidance, with analysts expecting an almost 40% jump in sales.\nLithium Americas (LAC) stock surged as much as 90% post-market hours on Tuesday after Reuters reported that the Trump administration is seeking as much as 10% equity in the mining and chemicals company.\nTrump officials have been renegotiating the terms of the company's Energy Department loan of $2.26 billion for a lithium project in Nevada, which was granted under President Biden's administration.\nThe Thacker Pass project is intended to be one of the largest domestic lithium sources in the US.\nThe potential stake is similar to other equity agreements Trump has reached with companies, including chipmaker Intel (INTC) and critical minerals miner MP Materials (MP).\nStocks snap 3-day record streak as Powell signals no 'risk-free path,' equities 'fairly highly valued'\nUS stocks slipped on Tuesday to snap a three-day record streak after Fed Chairman Jerome Powell hinted that future rate cuts this year were not a done deal.\nHe also indicated equities were \"fairly highly valued.\"\nThe Dow Jones Industrial Average (^DJI) erased earlier gains to fall 0.2%. The S&P 500 (^GSPC) dropped about almost 0.6%, and the tech-heavy Nasdaq Composite (^IXIC) lost around 0.9%.\n\"Near-term risks to inflation are tilted to the upside and risks to employment to the downside — a challenging situation,\" Powell stated during a luncheon speech on Tuesday.\n\"Two-sided risks mean that there is no risk-free path,\" he added.\nStocks had notched record highs for three days in a row prior to Tuesday's decline.\nInes Ferré\nGold surges to new high as Wall Street predicts precious metal has room to run\nGold futures (GC=F) hit a new record on Tuesday to surpass $3,800 in intraday tradingas Wall Street analysts predicted that the precious metal still has room to run.\nFutures rose 0.4% to trade near $3,800 per troy ounce, while bullion for immediate delivery traded near $3,777 per ounce.\nWall Street sees further upside for the precious metal, with Goldman Sachs reiterating a forecast of $4,000 by the middle of next year and UBS predicting $3,900 during the same time frame.\n\"We think gold prices have further room to rally, as US real interest rates should fall further amid additional Federal Reserve eas"
            },
            {
                "title": "Markets News, Sep. 23, 2025: Stock Indexes Close Lower as Tech Shares Lead Declines; Fed Chair Powell Gives First Comments Since Rate Cut - Investopedia",
                "source": "Investopedia",
                "url": "https://www.investopedia.com/dow-jones-today-09232025-11815145",
                "body": "U.S. stocks fell from record highs Tuesday after Federal Reserve Chair Jerome Powell spoke for the first time since the central bank cut interest rates last week.\nThe tech-heavy Nasdaq, the benchmark S&P 500, and the blue-chip Dow Jones Industrial Average closed down 1%, 0.6%, and 0.2%, respectively. The three indexes all had registered intraday and closing highs in the prior three sessions, and the Dow and S&P 500 set fresh intraday records soon after the opening bell Tuesday before retreating.\nPowell spoke at the Greater Providence Chamber of Commerce in Warwick, R.I., six days after the Fed made its first rate cut since last December. The Fed chair said that \"there is no risk-free path\" to achieve the central bank's dual mandate of maintaining full employment and price stability in the U.S. economy, and that stocks were \"fairly highly valued.\"\nNvidia (NVDA) shares fell nearly 3%, giving back most of their 4% gains from Monday, when they hit an all-time high on news that the company and OpenAI were partnering on a buildout of data centers, and that the AI chipmaker would be investing up to $100 billion in the ChatGPT developer.\nNvidia partner Micron Technology (MU) was slated to report its fiscal 2025 fourth-quarter results after the bell. Shares of the memory-chip maker, which have nearly doubled this year, rose 1%.\nOracle (ORCL) was one of the worst-performing stocks in the S&P 500 with a decline of more than 4% Tuesday, a day after jumping 6% as the technology firm boosted its bets on AI by naming two new CEOs, including the former head of its cloud infrastructure business, to take over from Safra Catz.\nKenvue (KVUE) shares closed 1.6% higher after dropping 7.5% yesterday ahead of a press conference by President Donald Trump in which he said that acetaminophen, the active ingredient in Tylenol, can lead to higher risk of autism and warned pregnant women against using the medication.\nBoeing (BA) shares advanced 2% after the company inked a lucrative contract to make planes for Uzbekistan Airways. President Trump called it \"a GREAT Deal\" worth more than $8 billion in a post on his Truth Social network, noting that last month he had spoken with Uzbekistan's president, Shavkat Mirziyoyev. Bloomberg also reported that U.S. Ambassador to China David Perdue said the countries were negotiating a \"huge\" Boeing plane order.\nGold futures rose 0.6% to set another record high of around $3,800 an ounce at 4 p.m. ET. West Texas Intermediate futures, the U.S. crude oil benchmark, was up 2.3% at $63.70 per barrel.\nThe 10-year Treasury yield, which affects borrowing costs on a variety of consumer and commercial loans, slipped to 4.11% from 4.15% at Monday's close. Bitcoin edged lower to around $111,700. The U.S. dollar index, which tracks the value of the greenback against a basket of foreign currencies and hit its lowest level since early 2022 last Wednesday, was down 0.1% at 97.21.\nBiggest S&P 500 Movers on Tuesday\nDecliners\n- Shares of Generac Holdings (GNRC), a supplier of standby power generators and other energy equipment, fell the most of any S&P 500 stock on Tuesday, dropping more than 10%. Although analysts at Stifel reiterated their \"buy\" rating on Generac stock, pointing to promising opportunities in providing emergency power backup solutions for data centers, they noted headwinds in the market for home standby generators.\n- Jefferies downgraded Vistra (VST) stock to \"hold\" from \"buy\" and reduced its price target. Shares of the electric utility company dropped 6.3%. Analysts noted that the stock is trading near its all-time high, pushed upward by enthusiasm about demand from power-intensive data centers. The firm also expressed concern that Vistra has yet to announce a data center agreement for its Comanche Peak nuclear facility in Texas.\n- Shares of Regeneron Pharmaceuticals (REGN) slipped 4.7% after a judge in Austria ruled in favor of a competitor that intends to create a competing version of Eylea, the treatment for eye diso"
            },
            {
                "title": "Stock Market News From Sept. 23, 2025: Nasdaq Falls 1% - Barron's",
                "source": "Barron's",
                "url": "https://www.barrons.com/livecoverage/stock-market-news-today-092325",
                "body": "CONCLUDED\nStock Market News From Sept. 23, 2025: Nasdaq Falls 1%\nThe Dow and S&P 500 also fell Tuesday as Wall Street stepped back from recent highs.\nLast Updated:\nSep. 23, 2025 at 6:35 PM ET\nKey Events\n11 hours ago\n11 hours ago\n12 hours ago\n15 hours ago\nPinned Post\nThe stock market pulled back on Tuesday as Wall Street digested the major indexes’ latest highs.\nThe Dow Jones Industrial Average fell 89 points, or 0.2%. The S&P 500 was down about 0.6%. The Nasdaq Composite dropped nearly 1%. All three marked record closing highs on Monday.\nThe yield on the 2-year Treasury note dropped to 3.59%, while the 10-year yield was down to 4.12%.\nThe market’s biggest strength on Monday—Big Tech and AI—was a major point of weakness on Tuesday.\n“Markets have been grinding lower for most of the day but started to accelerate around 1 p.m.,” wrote Mizuho’s Daniel O’Regan. “Between the Ryder Cup, holidays and lack of catalysts, it’s a very slow Tuesday.”\nPresident Donald Trump spoke at the United Nations. He also called off a meeting with Democratic lawmakers ahead of a Sept. 30 deadline to avert a government shutdown.\n“I have decided that no meeting with their congressional Leaders could possibly be productive,” he wrote on Truth Social.\nFederal Reserve Chairman Jerome Powell also spoke on Tuesday. Powell reiterated much of what he said during last week’s press conference, but a remark that “equity prices are fairly highly valued” may have caught some traders’ attention. Still, Powell noted it was not “a time of elevated financial stability risks.”\nWhatever the reason for the market's slide, Micron Technology's earnings report is due out within the hour, which could be the next test for the artificial intelligence stock rally."
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "54.500",
            "open": "6,695.150",
            "close": "6,661.680",
            "high": "6,702.190",
            "low": "6,647.690"
        },
        "market_summary": "The provided articles focus exclusively on NFL teams and players, with no mention of the SPX500, equities, or financial markets. The content details player performance issues for the Atlanta Falcons, defensive struggles for the Baltimore Ravens, and a roster move by the Houston Texans. There is no information from which to derive a market summary for the SPX500 index.\nSENTIMENT: Neutral\n\n**Overall Market Sentiment:** Neutral",
        "source_articles": [
            {
                "title": "NFL Panic Meter: Michael Penix Jr.'s early-season struggle isn't great news for Falcons - Yahoo Sports",
                "source": "Yahoo Sports",
                "url": "https://sports.yahoo.com/nfl/article/nfl-panic-meter-michael-penix-jrs-early-season-struggle-isnt-great-news-for-falcons-134037694.html",
                "body": "NFL Panic Meter: Michael Penix Jr.'s early-season struggle isn't great news for Falcons\nWhen Michael Penix Jr. didn't play well in Week 2, it didn't seem like it mattered much. The Atlanta Falcons won a tough road game against the Minnesota Vikings, and everyone understood the Vikings have an excellent defense.\nWhen Penix was even worse against a Carolina Panthers defense that hadn't played well since the start of the 2024 season, that was worrisome.\nPenix took a seat in the fourth quarter of a woeful effort against the Panthers. The Falcons were shut out. They never passed the 30-yard line. Last season the Panthers gave up the most points in a season in NFL history and they were allowing 26.5 points per game through two games this season. Then they looked like the 1976 Steelers against Penix and the Falcons. Kirk Cousins came in the game and Falcons coach Raheem Morris said the move was made because the game was out of hand. Morris quickly shot down any thought that the move was permanent, but everyone will be watching to see what happens if Penix struggles again. It was reasonable to keep Cousins, even at a high price tag, but it opened up the talk of a quarterback controversy if Penix ever struggled. And he has.\nIt's early this season and early in Penix's career as well, but all of a sudden the results don't look so good. This season he has 605 yards and one touchdown in three games. He has played in eight games, six of them starts, and has completed 58.3% of his passes for 1,380 yards, four touchdowns and five interceptions. That's a 75.2 passer rating. The only regular starting quarterback lower than 79.4 last season was Anthony Richardson. Richardson was also the only starter last season to complete less than 60% of his passes. Richardson doesn't have a starting job anymore. And Penix isn't playing at a starting level so far this season.\nIf Penix doesn't improve, he can't be guaranteed to keep his job regardless of his first-round pick pedigree.\n\"I think he just missed his throws today. We won't make excuses for him,\" Morris said, via the team's site. \"We did not play well in any phase, and he did not play well himself, either, and we did not play well around him. We have to play better across the board.\"\nIt's early. Penix had some good moments late last season and played well in the season opener. He's only six games into his career, which is way too early to make any sweeping opinions about what he'll be as a player. But the Falcons need it to look better, and they can't wait around all season for that to happen.\nPanic meter: A little concerning, but let's give it some time\nRavens defense ranks among worst\nThe Ravens have given up the most yards in the NFL. Only one team has given up more points. The Ravens have a great offense and it has resulted in a 1-2 record. Before this season no quarterback had ever lost multiple games in a season when putting up a passer rating of at least 140; Lamar Jackson has had it happen twice already this season, according to NFL researcher Zak Koeppel.\nYou can't win a championship if you don't have a passable defense. Ask Joe Burrow. Do the Ravens have a terrible defense? The one factor to consider is two of their three games have come against elite offenses. The Bills are moving the ball on everyone and the Lions are just fine on offense. Still, not being able to stop either of those teams in the slightest was troubling. The Ravens had a slow start on defense last season and figured it out. They were one of the best defenses in the NFL over the second half of last season. That better happen again if they want to be a Super Bowl contender.\nPanic meter: Probably will correct, but there are some alarms\nTitans flailing\nAfter Week 1, Titans coach Brian Callahan didn't challenge a catch and said afterward that the receiver needed to have a foot in bounds in addition to an elbow, which was incorrect. An NFL coach not knowing a rule like that was stunning. Then came Week 3, when the Titans took"
            },
            {
                "title": "Texans release S C.J. Gardner-Johnson - NBC Sports",
                "source": "NBC Sports",
                "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/texans-release-s-c-j-gardner-johnson",
                "body": "The Texans are letting go of a veteran defender.\nAccording to multiple reports, Houston is releasing safety C.J. Gardner-Johnson.\nGardner-Johnson, 27, was traded to Houston in March. He started each of the Texans’ first three games, playing 96 percent of defensive snaps. He recorded 15 total tackles.\nThe move comes a day after Jimmie Ward came off the commissioner’s exempt list — though Ward was placed on the physically unable to perform list.\nAccording to Aaron Wilson of KPRC 2 Houston, Gardner-Johnson’s release comes after there was friction between him and the team behind the scenes. Gardner-Johnson complained about his role, wanted to blitz more, and was critical of his teammates. He also told the Texans that he didn’t want to be traded.\nM.J. Stewart is set to be the next player at the position.\nHouston had traded offensive lineman Kenyon Green to Philadelphia as part of the deal for Gardner-Johnson. Coincidentally, Green was also waived on Monday.\nAt 0-3, the Texans will try to get their first win against the 0-3 Titans on Sunday."
            },
            {
                "title": "Texans To Release S C.J. Gardner-Johnson - ProFootballRumors.com",
                "source": "ProFootballRumors.com",
                "url": "https://www.profootballrumors.com/2025/09/texans-to-release-s-c-j-gardner-johnson",
                "body": "C.J. Gardner-Johnson‘s time in Houston has proven to be short-lived. The veteran safety is being released, as first reported by NFL Network’s Ian Rapoport.\n2025 has seen Gardner-Johnson serve as a starter for Houston, his fourth career team. The former Saint, Lion and Eagle (on two occasions) enjoyed a highly productive second Philadelphia stint last year. To his surprise, the 27-year-old was traded this offseason in a swap which saw former first-round guard Kenyon Green head the other way.\nThat move appeared to give Houston another veteran presence in the secondary and add further to a defense which faced high expectations entering 2025. That unit has fared well with an average of just 17 points allowed per game, but the Texans are moving on nonetheless. Jalen Mills was recently brought back into the fold as a depth option at safety, while Jimmie Ward was removed from the commissioner’s exempt list yesterday. In the wake of those developments, Gardner-Johnson is being let go.\nFriction with teammates was an issue in this case, Aaron Wilson of KPRC2 reports. Gardner-Johnson criticized other members of the Houston secondary and was unhappy with his role in the team’s scheme, per Wilson. Without even one month in the books, the decision has been made on the team’s part to move on rather than attempting to salvage the situation. Wilson adds a trade request was issued prior to today’s cut.\nTeam and player recently agreed to a restructure, with Gardner-Johnson’s base salary for 2025 being reduced to the veteran minimum in exchange for a conversion to a signing bonus. That spread out guaranteed cap charges over several years, an indication this relationship would continue through at least the remainder of the campaign. Instead, Houston will take on a $5.66MM dead money charge for 2025 as a result of this move.\nMills and (when he is healthy) Ward represent options to take on a starting role at the safety spot. Ward has been a key figure when available during his Texans tenure, but an NFL investigation stemming from domestic violence allegations is ongoing and he is currently on the reserve/PUP list while recovering from offseason ankle surgery. In any case, Calen Bullock is set to remain in place as a safety starter moving forward. M.J. Stewart is currently in line to join him as a first-team presence.\nGardner-Johnson is now set to hit free agency. With two six-interception seasons and four campaigns of at least eight pass deflections to his name, the former fourth-rounder is not lacking in production. Today’s move marks the latest example of a team preferring not to keep him in the fold in spite of that, however. As such, it will be interesting to see if a strong market develops over the near future."
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "400.000",
            "open": "45,678.120",
            "close": "45,562.410",
            "high": "45,888.120",
            "low": "45,488.120"
        },
        "market_summary": "The Nikkei 225 experienced a slight pullback, falling approximately 100 yen due to profit-taking influenced by a decline in U.S. markets and a strengthening yen. Despite this daily dip, the broader trend remains robust, fueled by corporate reforms and strong foreign investor inflows, with the market having recently hit multiple record highs. However, risks persist from political uncertainty and the potential for sudden currency movements.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "The Nikkei Average fell by approximately 100 yen, with initial selling followed by a sluggish decline = Morning session on the 24th. - 富途牛牛",
                "source": "富途牛牛",
                "url": "https://news.futunn.com/en/post/62509058/the-nikkei-average-fell-by-approximately-100-yen-with-initial",
                "body": "At around 10:00 a.m. on the 24th, the Nikkei Stock Average was trading approximately 100 yen lower than the previous business day, at around 45,400 yen. At 9:16 a.m., it hit a low of 45,270.49 yen, down 223.17 yen. In the U.S. stock market on the 23rd, expectations for interest rate cuts receded, leading to profit-taking and causing both the NY Dow Jones Industrial Average to decline after five days and the Nasdaq Composite Index to fall after four days. Japanese stocks were also affected by these movements and the stronger yen, with selling pressure dominating. Subsequently, the market appears to be experiencing some support from bargain hunting. The yen-denominated settlement value of the CME Nikkei 225 futures contract was 45,305 yen, down 15 yen from the Osaka Exchange's settlement value on the 22nd.\nBy sector, 20 out of the 33 industries declined, while 13 rose. Shares of insurance companies such as MS&AD <8725.T> and Tokio Marine <8766.T>, as well as service companies like Secom <9735.T> and Recruit Holdings <6098.T>, fell. Textile stocks including Unitika <3103.T> and Toray <3402.T>, along with glass and ceramics stocks like AGC <5201.T> and TOTO <5332.T>, also traded lower. Real estate shares such as Mitsui Fudosan <8801.T> and Mitsubishi Estate <8802.T>, as well as electrical machinery stocks like Sony Group <6758.T> and Keyence <6861.T>, were sluggish. Chemical stocks like Sumitomo Chemical <4005.T> and Nippon Oxygen HD <4091.T>, and wholesale stocks such as Itochu <8001.T> and Mitsubishi Corporation <8058.T>, also underperformed. On the other hand, miscellaneous product stocks like ASICS <7936.T> and Nintendo <7974.T>, and machinery stocks like Disco <6146.T> and Mitsubishi Heavy Industries <7011.T>, showed strength.\nElsewhere, MARUWA <5344.T>, Tsukishima HD <6332.T>, Nexon <3659.T>, Azbil <6845.T>, and Sakura <3778.T> declined. Conversely, Meck <4971.T>, ips <4390.T>, Career L <6070.T>, E-Garante <8771.T>, and NSD <9759.T> advanced.\nIn the Tokyo foreign exchange market at 10:00 a.m., the dollar-yen exchange rate was trading in the upper half of the 147 yen range (compared to 148.11-148.13 yen on the 22nd), while the euro-yen exchange rate was in the middle of the 174 yen range (compared to 173.99-174.03 yen on the 22nd).\nProvided by: Wealth Advisor Co."
            },
            {
                "title": "Yen slumps across currencies beyond dollar amid carry trade comeback - Nikkei Asia",
                "source": "Nikkei Asia",
                "url": "https://asia.nikkei.com/business/markets/currencies/yen-slumps-across-currencies-beyond-dollar-amid-carry-trade-comeback",
                "body": "TOKYO -- The yen's weakness across a broad swath of currencies, fueled by negative real interest rates and political uncertainty, comes amid an apparent revival of the yen carry trade that had dragged down the Japanese currency until early last year."
            },
            {
                "title": "Japan shares keep breaking records as reforms, foreign inflows outweigh political risks - CNBC",
                "source": "CNBC",
                "url": "https://www.cnbc.com/2025/09/24/japan-shares-breaking-records-reforms-foreign-inflows-outweigh-political-risks-nikkei-225-topix.html",
                "body": "Key Points\n- Japanese equities have been smashing records with the Nikkei 225 and broader Topix notching several fresh highs in recent days.\n- However, risks remain, from political instability to a potential yen spike or U.S. market downturn.\n- Analysts argue that the momentum for Japanese stocks rests on solid foundations — and has further room to run."
            }
        ]
    }
]