[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "99.620",
            "open": "4,084.880",
            "close": "4,044.860",
            "high": "4,106.640",
            "low": "4,007.020"
        },
        "market_summary": "### Gold (XAU/USD) Market Briefing\n\n* **Key Drivers:** Persistent U.S. inflation data, **China's de-dollarization strategy**, and central banks' accumulation of gold reserves are influencing gold prices.\n* **Price Action:** Gold prices have surged, with spot gold reaching **$4,400 per ounce** and currently trading around **$4,049.21 per ounce**, driven by **inflationary pressures** and **geopolitical tensions**.\n* **Technical Outlook:** Immediate support is near **$4,000 per ounce**, with resistance at **$4,400 per ounce**, as gold remains above **$4,000 per ounce**, supported by **cautious Fed commentary** and investors awaiting delayed U.S. data.\n\n---\n**Overall Sentiment:** **Bullish**",
        "source_articles": [
            {
                "title": "China Chases Gold Supremacy As It Builds A U.S. Dollar Alternative - Forbes",
                "source": "Forbes",
                "url": "https://www.forbes.com/sites/timtreadgold/2025/11/17/china-chases-gold-supremacy-as-it-builds-a-us-dollar-alternative/",
                "body": "China is rapidly closing the “gold gap” with the U.S. as it quietly builds what is believed to be world’s second largest stockpile of gold.\nUnofficial estimates put China’s gold reserves at up to 5500 metric tons, more than double the officially reported holding of 2303.5 tons.\nIf correct, the 5500-ton calculation by Australia’s ANZ Bank, lifts China from seventh on the gold ownership league table to second, above Germany’s 3350.3 tons but behind the 8133.5 tons owned by the US.\nChinese gold buying, reported and unreported, has been the major factor in the steep rise in the gold price over the past three years, including a 54% increase in the last 12-months to $4038 an ounce.\nBuilding its reserves is just one part of China’s gold strategy which is part of a campaign to reduce exposure to the U.S. dollar.\nOther features of the Chinese gold rush include the creation of a world-class gold trading hub centered on the Shanghai Gold Exchange (SGE) and the relaxation of rules governing investment in gold by Chinese insurance companies.\nJeff Currie, chief strategy officer of energy pathways at fund manager Carlyle, told the Financial Times newspaper that “China is buying gold as part of a de-dollarization strategy.\"\nANZ, in its Vault research report, said China had been increasing its activity in the gold market by “accumulating reserves, enhancing trading infrastructure and promoting domestic and international participation”.\nGold Trading Hub\nBut the bank also warned that progress towards becoming a gold trading hub would be gradual due to the challenges in attracting international investors and central banks to hold their gold reserves in China.\n“China is the largest producer and consumer of gold,” ANZ said in its report titled ‘China’s gold quest’.\n\"It is uniquely positioned to become a strong participant in the global gold market, especially when geopolitical uncertainty is prompting many nations to explore alternatives to the current monetary system.\n\"There has been a notable transition from physical gold buying to investment-driven demand since 2023.\n\"Trading volumes on the SGE and Shanghai Futures Exchange have surged, now approaching levels comparable to Comex (a division of the New York Mercantile Exchange).\n“The SGE has launched its first offshore vault and CNH (offshore renminbi) denominated contracts to attract foreign investors.”\nANZ said China’s central bank is increasing its gold holdings to enhance trust in the country’s currency.\n“To project China’s total gold reserves (reported and unreported, we calculate the market surplus by subtracting total demand (jewelry, bars and coins, exchange-traded fund and industrial) from total supply,” the bank said.\n\"We then assume 60% of this surplus is added the central bank’s reserve.\n“Based on this, we estimate China’s total gold reserves exceed 5500 tons, which is more than twice the officially reported volume.”"
            },
            {
                "title": "Global gold prices fall as stronger dollar and fading fed rate-cut hopes pressure market - Nation Thailand",
                "source": "Nation Thailand",
                "url": "https://www.nationthailand.com/business/trading-investment/40058388",
                "body": "Gold prices dropped overnight as the US dollar strengthened and expectations for further Federal Reserve rate cuts diminished, while investors await key US economic data scheduled later this week.\nReuters reported that spot gold fell 1.5% to US$4,019.12 per ounce at 3:13pm ET (20:13 GMT) on Monday (November 17 2025).\nUS gold futures for December delivery closed 0.5% lower at US$4,074.5 per ounce.\nA slight rise in the US dollar index made dollar-priced bullion more expensive for holders of other currencies, adding downward pressure to gold.\nDavid Meger, Director of Metals Trading at High Ridge Futures, said:\n“The market is moving back and forth, waiting for a wave of delayed economic reports since the US government reopened. Expectations for additional Fed rate cuts have come down, which is weighing on gold sentiment.”\nThis week’s economic calendar includes the September employment report on Thursday and the minutes of the Fed’s latest meeting on Wednesday, when policymakers implemented a 0.25% rate cut.\nHowever, several Fed officials have signalled a more cautious stance on further easing at the December meeting.\nCME’s FedWatch tool shows that markets currently price in only a 45% chance of another 0.25% rate cut in December — down from over 60% a week earlier.\nAt least four Fed officials, including Governor Christopher Waller and New York Fed President John Williams, are scheduled to speak today.\nGold, a non-yielding safe-haven asset, typically benefits from lower interest rates, which reduce the opportunity cost of holding bullion.\nAnalysts at Scotiabank expect gold prices to average US$3,800 per ounce next year, up from US$3,450 this year, citing persistent economic uncertainty and eventual declines in real interest rates.\nMorning update (November 18, 2025)\nSpot gold edged 0.1% higher to US$4,049.21 per ounce at 7:11am Singapore time.\nThe Bloomberg Dollar Spot Index rose 0.3% in earlier trading.\nSilver and platinum were steady, while palladium gained.\nGold has steadied after falling for three consecutive days, as expectations for a December rate cut weakened.\nBullion remains above US$4,000 per ounce, supported by cautious Fed commentary and investors awaiting delayed US data following the longest government shutdown in history.\nInterest-rate swap contracts now imply less than a 50% chance of a December cut, after the Fed eased by only 0.25% less than a month ago.\nLower rates typically enhance the appeal of non-yielding gold."
            },
            {
                "title": "As Inflation Looms Large, Gold and Silver Shine as the 'Golden Shield' for Investors - FinancialContent",
                "source": "FinancialContent",
                "url": "https://markets.financialcontent.com/stocks/article/marketminute-2025-11-17-as-inflation-looms-large-gold-and-silver-shine-as-the-golden-shield-for-investors",
                "body": "As of November 17, 2025, the specter of persistent inflation continues to cast a long shadow over global financial markets, prompting a significant shift in investor strategies. With consumer prices stubbornly high and producer costs reflecting ongoing economic pressures, a growing cohort of investors is turning to the time-honored safe havens of gold and silver. These precious metals are once again asserting their role as a \"golden shield,\" offering a tangible hedge against the erosion of purchasing power in an increasingly uncertain economic landscape.\nThe current inflationary environment, fueled by a complex interplay of trade policies, expansive fiscal spending, and geopolitical tensions, has seen both gold and silver surge to multi-year and even all-time highs throughout 2025. This remarkable rally underscores a renewed confidence in hard assets as central banks grapple with balancing economic growth against price stability, making the allure of tangible wealth preservation stronger than ever.\nThe Resurgence of Precious Metals Amidst Economic Headwinds\nThe narrative of rising inflation has been a dominant theme throughout 2025, with recent data painting a picture of enduring price pressures. The U.S. Consumer Price Index (CPI) for September 2025, for instance, registered a 3.0% year-on-year increase, signaling continued inflationary momentum. While the Producer Price Index (PPI) saw a slight month-over-month decrease in August 2025, the broader trend points to elevated input costs for businesses, which are increasingly being passed on to consumers.\nSeveral key factors have converged to create this environment. A primary driver identified by analysts, including J.P. Morgan Research, is the impact of President Donald Trump's tariffs on foreign imports. These tariffs are widely expected to accelerate inflation through the fourth quarter of 2025 and into 2026, as businesses absorb and then pass on higher import costs. Furthermore, major developed economies are operating under a state of \"fiscal dominance,\" characterized by large and persistent government deficits. This scenario often encourages investors to seek refuge in hard assets to safeguard their purchasing power against potential currency debasement. Geopolitical risks, including ongoing U.S.-China trade dynamics and broader global instability, also contribute to a \"risk-off\" sentiment that historically bolsters safe-haven demand.\nIn response to these conditions, market reactions have been pronounced. Gold (XAU/USD) prices have seen an extraordinary surge, climbing from an average of $1,800 per ounce in 2021 to $4,248.30 by November 2025 – a staggering 125.7% gain over four years. October 2025 witnessed gold reaching new all-time highs, briefly touching nearly $4,400 per ounce. As of November 17, 2025, spot gold traded around $4,105 per Troy ounce, maintaining a year-to-date gain of 57.4% in USD terms despite some recent short-term volatility. Silver (XAG/USD) has mirrored this ascent, increasing from $25 per ounce in 2021 to $54.09 by November 2025, a 116.3% return. It hit a 14-year high of $44.55 per ounce in September and an all-time high of $54.47 per ounce in October 2025, currently stabilizing near $51 per ounce with a year-to-date gain of 73.7%. This robust performance is also underpinned by strong industrial demand, particularly from the burgeoning photovoltaic solar panel and electronics manufacturing sectors. Central banks globally have also been significant players, continuing to accumulate gold, purchasing a net 166 tons in Q2 2025, further solidifying the metal's role in reserve diversification.\nWinners and Losers in a Precious Metals Boom\nThe sustained rally in gold and silver creates a clear delineation of potential winners and losers across various sectors of the financial market. Companies directly involved in the extraction, refining, and trading of these metals stand to benefit significantly, while others may face increased cost pressures.\nMining Com"
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.045",
            "open": "64.134",
            "close": "64.132",
            "high": "64.869",
            "low": "63.824"
        },
        "market_summary": "### Spot Brent Crude Oil Market Briefing\n\n* **Key Drivers:** Forecast discrepancies between IEA, OPEC, and EIA are causing confusion in the oil market, with a **2 million barrel** per day gap in demand forecasts for 2026. **Non-OPEC supply** is expected to slow down after 2027, potentially leading to a price recovery.\n* **Price Action:** **Brent crude** is currently trading at around **$64** a barrel, with a recent spike in June due to Middle East tensions. The price has been volatile, touching **$82.63** in January before resuming its downward trend.\n* **Technical Outlook:** Immediate support is near the recent low of **$60**, with resistance at **$70**. The **50-day moving average** is at **$65**, indicating a potential **bearish** trend.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "Goldman sees oil price recovery from 2027 as non-OPEC supply slows - Quantum Commodity Intelligence",
                "source": "Quantum Commodity Intelligence",
                "url": "https://www.qcintel.com/article/goldman-sees-oil-price-recovery-from-2027-as-non-opec-supply-slows-53075.html",
                "body": "Goldman sees oil price recovery from 2027 as non-OPEC supply slows\n11h ago\nGoldman Sachs expects oil prices to rebound from 2027 as non-OPEC supply slows after 15 years of low investment...\nPlease Register or Sign in to view this content.\nQuantum Commodity Intelligence is a premium paid subscription service for professionals in the oil, biofuels, carbon, ammonia and hydrogen markets.\nQuantum Oil service subscribers have access to:\nGet in touch with us for subscription information on all Quantum platforms, or help with the service."
            },
            {
                "title": "Canada’s oil sands surge as U.S. shale growth plateaus - World Oil",
                "source": "World Oil",
                "url": "https://worldoil.com/news/2025/11/17/canada-s-oil-sands-surge-as-u-s-shale-growth-plateaus/",
                "body": "Canada’s oil sands surge as U.S. shale growth plateaus\n(Bloomberg) – Canada’s oil sands are experiencing a comeback after years of living in the shadow of U.S. shale.\nCrude output is climbing to new highs, the nation’s top producers are seeing their shares soar and interest in the industry is rising among U.S. institutional investors. The catalyst for the brighter outlook is simple: The newly expanded Trans Mountain oil pipeline is bringing Canadian oil to the critical Asian market after years of capacity constraints capped output and pressured crude prices.\nWith the pipeline in place, production hit a record-high in June and is set to grow another 300,000 to 400,000 bpd to 6 million daily barrels by 2030, according to the Bank of Montreal. At the same time, the average stock price of the biggest oil sands producers — Imperial Oil Ltd., Suncor Energy Inc., Cenovus Energy Inc. and MEG Energy Corp., which was bought by Cenovus in November — have outpaced the S&P Global Oil Index by as much as three-fold over the past year.\nSee also: Cenovus completes MEG acquisition, adding 110,000 bopd of oil sands output\nAnd while a global supply glut is weighing on crude prices, the Trans Mountain expansion has juiced local prices for heavy oil, which are trading at a $10-$12 a barrel discount to the U.S. benchmark, compared with discounts as wide as $30 or more before. Against that backdrop, U.S. institutional investors’ stake in oil sands companies has risen as high as 65% from 40% a decade ago, according to BMO.\nThe brighter outlook illustrates a seismic shift in oil markets. As oil production from massive U.S. shale basins such as the Permian peak, investors are shifting their focus north of the border where steady crude supplies are poised to continue flowing for decades more, and where the cost of production is low enough to withstand even steep drops in the global benchmark.\nIt’s a stark turnaround from a decade ago, when booming shale production and a deluge of oil from OPEC tanked crude prices. Oil majors including Shell Plc., ConocoPhillips, TotalEnergies SE and Chevron Corp. began selling their stakes in Canadian operations, allowing production to concentrate within the hands of a handful of local producers. That helped the industry become more efficient, according to Enverus Senior Analyst Michael Berger.\nUnlike U.S. shale oil producers, who must continuously drill new wells just to sustain their level of output, oil sands production declines at a much slower rate. As a result, four of the five lowest-cost, large-cap oil companies in North America are oil sands producers, said BMO analyst Randy Ollenberger.\n“They don’t have to continually invest capital to offset decline,” he said. “They only have to invest capital to maintain their facilities and, so, that gives them a cost advantage.”"
            },
            {
                "title": "The 2 million barrel divide: IEA and OPEC at odds over oil demand - Financial Post",
                "source": "Financial Post",
                "url": "https://financialpost.com/financial-times/barrel-divide-iea-opec-at-odds-oil-demand",
                "body": "The 2 million barrel divide: IEA and OPEC at odds over oil demand\nWidening gap between forecasts from IEA, OPEC and EIA clouds oil market outlook\nThe widest gap for more than two decades has opened up between the forecasts of the three main international organisations that track the world’s crude markets, causing confusion about global oil demand.\nThe Paris-based International Energy Agency (IEA), the OPEC group of oil producers and the U.S. Energy Information Administration (EIA) all reported their monthly oil statistics this week. The divergence between their forecasts for oil demand in 2026 reached 1.8 million barrels of oil a day (b/d), the equivalent of France’s oil consumption and the biggest gap since 2002.\nThe gap has gradually widened over the past two years, raising questions about the trajectory of the world’s oil demand as countries transition to clean energy.\nThe oil market has been caught this year between fears of a supply crunch — stoked by U.S. sanctions on two of Russia’s largest oil companies in October — and warnings of a longer-term glut driven by rising U.S. shale output and an economic slowdown.\nBrent crude touched US$82.63 a barrel in January before resuming its downward trend, then spiked again in June after tensions flared in the Middle East. The benchmark was trading at about US$64 a barrel on Friday.\nThe IEA is the most bearish about demand in 2026, putting it at 104.7 million b/d. OPEC is the most bullish, with a forecast of 106.5 million b/d. The EIA is between the two, at 105.2 million b/d.\nTraders had been puzzled by the divergence, said Tamas Varga, an analyst at PVM, an oil broker. “These quite significant differences in views caused confusion, in that traders just simply did not know who to believe, did not know which number is accurate,” he said.\nHe added that there had traditionally been a strong correlation between oil stock levels and prices, so if the forecasts of stock levels diverged, “you can’t really figure out what the price could be in the future.”\nThere are multiple possible causes for the differences in the forecasts, including a greater share of the world’s oil falling under sanctions, and a lack of visibility about how much oil is being put into strategic storage by China, amid an off-again, on-again trade war with the U.S.\n- Low crude prices creating buyers market in Canada's oilpatch\n- OPEC+ to pause output hikes in 2026 as market set for glut\n- Advertisement 1Story continues below\nOne oil market observer, who asked not to be named, said that Iran, under U.S. sanctions, might be trying to hide a share of its oil production, causing problems with the data, while Giovanni Staunovo, an analyst at UBS, said that since the first Trump administration, China had held back some data, concealing the true size of its stocks, making it harder “to have the full picture.”\nAdding to the confusion, said Martijn Rats, an analyst at Morgan Stanley, there were now 1.13 million b/d of oil in the IEA’s model that were “unaccounted” for. These are barrels that have been produced, but do not appear to have been consumed or stored.\n“Historically, nine out of 10 times when you have unaccounted oil, you see revisions to demand as more data comes out,” he said.\nHe noted, however, that the missing barrels had grown from 110,000 b/d in 2024 to nearly 2mn barrels in August before falling back. The IEA said the unaccounted barrels were the result of a time lag in the data, but Rats suggested that the numbers were now so large, they might be distorting the view of demand growth.\n“There’s lots of conflicting data, it’s a fog, but the fog is telling you these numbers are not jiving and the underlying demand might be better than we thought,” he said.\nHe added that if demand growth was 200,000 b/d a year stronger than previously thought, it would have big implications for the sector.\n“Then you are back to the historical trend and you are thinking very differently about the impact of the energy transition on gr"
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.095",
            "open": "59.687",
            "close": "59.747",
            "high": "60.462",
            "low": "59.367"
        },
        "market_summary": "### Spot WTI Crude Oil Market Briefing\n\n* **Key Drivers:** Disagreements between IEA, OPEC, and EIA over **oil demand forecasts**, with a **2 million barrel** per day gap, and concerns over **non-OPEC supply** slowing down after 2027.\n* **Price Action:** Currently trading around **$64** a barrel, with a recent spike after Middle East tensions and a downward trend due to fears of a **supply glut** and **economic slowdown**.\n* **Technical Outlook:** Immediate support is near the recent low of **$62**, with resistance at **$70**, and a potential **bullish** recovery expected from 2027 as non-OPEC supply slows.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "Canada’s Oil Sands Make Their Comeback as US Shale Plateaus - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/articles/2025-11-17/canada-s-oil-sands-make-their-comeback-as-us-shale-plateaus",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            },
            {
                "title": "Goldman sees oil price recovery from 2027 as non-OPEC supply slows - Quantum Commodity Intelligence",
                "source": "Quantum Commodity Intelligence",
                "url": "https://www.qcintel.com/article/goldman-sees-oil-price-recovery-from-2027-as-non-opec-supply-slows-53075.html",
                "body": "Goldman sees oil price recovery from 2027 as non-OPEC supply slows\n11h ago\nGoldman Sachs expects oil prices to rebound from 2027 as non-OPEC supply slows after 15 years of low investment...\nPlease Register or Sign in to view this content.\nQuantum Commodity Intelligence is a premium paid subscription service for professionals in the oil, biofuels, carbon, ammonia and hydrogen markets.\nQuantum Oil service subscribers have access to:\nGet in touch with us for subscription information on all Quantum platforms, or help with the service."
            },
            {
                "title": "The 2 million barrel divide: IEA and OPEC at odds over oil demand - Financial Post",
                "source": "Financial Post",
                "url": "https://financialpost.com/financial-times/barrel-divide-iea-opec-at-odds-oil-demand",
                "body": "The 2 million barrel divide: IEA and OPEC at odds over oil demand\nWidening gap between forecasts from IEA, OPEC and EIA clouds oil market outlook\nThe widest gap for more than two decades has opened up between the forecasts of the three main international organisations that track the world’s crude markets, causing confusion about global oil demand.\nThe Paris-based International Energy Agency (IEA), the OPEC group of oil producers and the U.S. Energy Information Administration (EIA) all reported their monthly oil statistics this week. The divergence between their forecasts for oil demand in 2026 reached 1.8 million barrels of oil a day (b/d), the equivalent of France’s oil consumption and the biggest gap since 2002.\nThe gap has gradually widened over the past two years, raising questions about the trajectory of the world’s oil demand as countries transition to clean energy.\nThe oil market has been caught this year between fears of a supply crunch — stoked by U.S. sanctions on two of Russia’s largest oil companies in October — and warnings of a longer-term glut driven by rising U.S. shale output and an economic slowdown.\nBrent crude touched US$82.63 a barrel in January before resuming its downward trend, then spiked again in June after tensions flared in the Middle East. The benchmark was trading at about US$64 a barrel on Friday.\nThe IEA is the most bearish about demand in 2026, putting it at 104.7 million b/d. OPEC is the most bullish, with a forecast of 106.5 million b/d. The EIA is between the two, at 105.2 million b/d.\nTraders had been puzzled by the divergence, said Tamas Varga, an analyst at PVM, an oil broker. “These quite significant differences in views caused confusion, in that traders just simply did not know who to believe, did not know which number is accurate,” he said.\nHe added that there had traditionally been a strong correlation between oil stock levels and prices, so if the forecasts of stock levels diverged, “you can’t really figure out what the price could be in the future.”\nThere are multiple possible causes for the differences in the forecasts, including a greater share of the world’s oil falling under sanctions, and a lack of visibility about how much oil is being put into strategic storage by China, amid an off-again, on-again trade war with the U.S.\n- Low crude prices creating buyers market in Canada's oilpatch\n- OPEC+ to pause output hikes in 2026 as market set for glut\n- Advertisement 1Story continues below\nOne oil market observer, who asked not to be named, said that Iran, under U.S. sanctions, might be trying to hide a share of its oil production, causing problems with the data, while Giovanni Staunovo, an analyst at UBS, said that since the first Trump administration, China had held back some data, concealing the true size of its stocks, making it harder “to have the full picture.”\nAdding to the confusion, said Martijn Rats, an analyst at Morgan Stanley, there were now 1.13 million b/d of oil in the IEA’s model that were “unaccounted” for. These are barrels that have been produced, but do not appear to have been consumed or stored.\n“Historically, nine out of 10 times when you have unaccounted oil, you see revisions to demand as more data comes out,” he said.\nHe noted, however, that the missing barrels had grown from 110,000 b/d in 2024 to nearly 2mn barrels in August before falling back. The IEA said the unaccounted barrels were the result of a time lag in the data, but Rats suggested that the numbers were now so large, they might be distorting the view of demand growth.\n“There’s lots of conflicting data, it’s a fog, but the fog is telling you these numbers are not jiving and the underlying demand might be better than we thought,” he said.\nHe added that if demand growth was 200,000 b/d a year stronger than previously thought, it would have big implications for the sector.\n“Then you are back to the historical trend and you are thinking very differently about the impact of the energy transition on gr"
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0043",
            "open": "1.1612",
            "close": "1.1591",
            "high": "1.1624",
            "low": "1.1582"
        },
        "market_summary": "### EUR/USD Market Briefing\n\n* **Key Drivers:** The **dollar** is strengthening ahead of the US Nonfarm Payrolls (NFP) report, with markets speculating that the Federal Reserve may keep rates unchanged in December, citing a **hawkish** tone.\n* **Price Action:** The EUR/USD has broken below the **1.1600** level, currently trading at **1.1589**, showing **bearish** momentum, with the US Dollar Index (DXY) up **0.20%** at **99.47**.\n* **Technical Outlook:** Immediate support is near the **1.1550** level, with resistance at **1.1600** and further resistance at the 50-day Simple Moving Average (SMA) at **1.1656**, and the 100-day SMA at **1.1659**.\n\n---\n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "EUR/USD forecast: Currency Pair of the Week - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/eur-usd-forecast-currency-pair-of-the-week-november-17-2025/?amp=true",
                "body": "EUR/USD forecast: Currency Pair of the Week\nThe EUR/USD forecast will hinge more on the dollar this week than the euro. There’s not an awful lot of Eurozone data, but we will finally have the delayed release of US jobs report for September on Thursday. This could impact the Fed’s December rate decision where the probability of a rate cut is now a coin toss following the recent hawkish repricing. It could therefore be a choppy affair until the second half of the week in the FX space.\nEUR/USD forecast: All about the dollar\nA great deal now hinges on what the Fed decides at its 10 December FOMC meeting, with markets pricing the odds of another 25bp cut at 50% or so. The Fed is probably far more comfortable with that sort of expectation, especially given the limited flow of data following what turned out to be the longest government shutdown in US history. It really does feel as though Wednesday and Thursday’s data will set the tone for the dollar’s next move.\nOn Wednesday we will get the minutes from the 28–29 October FOMC meeting. That, of course, was the gathering where Jerome Powell made a point of stressing that a December cut was anything but guaranteed and that opinions within the FOMC were “strongly differing.” Given the lack of data and the hawkish Fed talk since, don’t expect too much of dollar strength in response to the FOMC minutes. Or weakness, for that matter.\nOn Thursday, we finally get the September NFP report. Markets are looking for a modest +50,000 gain in payrolls and an unchanged unemployment rate at 4.3%. That sort of outcome is probably neutral. Anything higher, should be at least slightly supportive for the dollar, given that a December Fed cut would require meaningfully weaker numbers.\nWe’ve also got a heavy line-up of Fed speakers through the week. Their views may influence the dollar’s direction, although the market will pay more attention to data and the Fed commentary this week.\nEuro: not much until Friday’s PMI release\nThe next key data point for the euro arrives on Friday with the flash PMIs for November. These have actually been holding up rather well, hinting that businesses are learning to cope with the still-uncertain global backdrop. There’s also a packed schedule of European Central Bank speakers today. The spotlight will likely fall on Chief Economist Philip Lane, who’s due to speak later in Ireland. The market is hardly expecting any further rate cuts from the ECB, so he will have to say something quite shocking for the market to take notice.\nTechnical EUR/USD forecast and key levels to watch\nFrom a technical perspective, the EUR/USD forecast has turned positive after it broke out of a bearish channel last week. This was a bullish development, although the currency pair then stalled at the next resistance around 1.1650 area, a prior area of support and resistance. But given the bullish price structure from the previous week, the two-day weakness here should not be seen as a bearish sign, but merely a normal pullback in what could be the start of the next bullish phase. That being said, is important that support at around 1.16 area now holds on a daily closing basis. This level was previously resistance and marks the point of origin of the breakout last week. Should this level hold and we go above 1.1650 in the coming days, then from there, the EUR/USD could kick on, and head towards 1.1750, and higher depending on the outcome of incoming economic data from the US. However, if 1.1600 breaks on a daily closing basis, then that could put the bulls in a spot of bother, in which case we could see renewed weakness toward that 1.1500 long-term support area again.\n-- Written by Fawad Razaqzada, Market Analyst\nFollow Fawad on Twitter @Trader_F_R\nThe information on this web site is not targeted at the general public of any particular country. It is not intended for distribution to residents in any country where such distribution or use would contravene any local law or regulatory requirement. The info"
            },
            {
                "title": "EUR/USD falls below 1.1600 as Dollar strengthens ahead of US NFP - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/eur-usd-falls-below-11600-as-dollar-strengthens-ahead-of-us-nfp-202511172154",
                "body": "EUR/USD falls below 1.1600 as Dollar strengthens ahead of US NFP\n- EUR/USD retreats to 1.1589 as traders buy Dollar amid expectations the Fed may keep rates unchanged in December.\n- US government reopening fuels volatility ahead of NFP and earnings, with AI-bubble fears boosting safe-haven flows.\n- ECB’s de Guindos says inflation is converging toward target but warns rising tariffs and sovereign debt remain risks.\nThe EUR/USD registers loses during the North American session down 030% as the Greenback enjoys a healthy recovery on speculation that the Federal Reserve might hold rates unchanged. The pair trades at 1.1589 after reaching a daily high of 1.1624.\nEuro slips 0.30% as rising risk aversion and renewed Fed caution lift the Greenback into the new trading week\nRisk aversion keeps the US Dollar bid as the US government reopening unleashes a flood of data, led by the release of the Nonfarm Payrolls report on Thursday. The US Bureau of Labor Statistics (BLS) will release those figures, and the Real Earnings print on Friday. Meanwhile, investors bought Greenback amid fears of a possible AI bubble, with NVIDIA set to release earnings on Wednesday, which could set markets mood ahead of US crucial data.\nThe US schedule is light on Monday, except for Federal Reserve officials. Vice-Chai Philip Jeffers was slightly dovish, while Fed Governor Christopher Waller supports the continuation of the easing cycle at the December’s meeting.\nEarlier, the New York Fed released the Empire State Manufacturing index for November, improving with current business conditions faring better than expected\nEuropean Central Bank Vice President Luis de Guindos expressed confidence that Eurozone inflation is on track to converge toward the ECB’s price-stability target. Still, he warned that rising tariffs and elevated sovereign debt levels pose risks and potentially impact an abrupt shift in market mood.\nDaily market movers: Euro slide on broad US Dollar strength\n- The US Dollar Index (DXY), which tracks the buck’s value against a basket of six currencies, is up 0.20% at 99.47.\n- The New York Fed’s latest survey showed a stronger-than-expected rebound in current manufacturing conditions, with gains in new orders and employment, while prices paid continued to ease. However, the six-month business outlook softened notably, falling to 19.1 from 30.3, signaling a decline in forward-looking confidence.\n- The Fed Vice Chair Philip Jefferson said upside risks to inflation have likely diminished, while downside risks to the labor market have increased. He noted that firms remain hesitant to either hire or fire, and characterized current monetary policy as “somewhat restrictive.”\n- Fed Governor Chritopher Waller said that a weak labor market justifies a rate cut in the December meeting. He added that once the impact of tariff is excluded, inflation would get closer to the Fed’s 2% target.\n- Money markets have shifted toward a more hawkish outlook, with CME FedWatch data showing a 43% probability of a 25-basis-point cut at the December meeting—implying a 57% chance the Fed holds rates steady.\nEUR/USD technical outlook: Tumbles below 1.1600, traders eye 1.1550\nEUR/USD continues to trade with a bearish tone, with sellers gaining control pushing the exchange rate towards the 50-day Simple Moving Average (SMA) at 1.1581. The Relative Strength Index (RSI) made a U-turn, edging lower, suggesting a pickup in bearish pressure. A clear breach of the 1.1550 would open the door toward the 1.1500 level.\nOn the upside, the EUR/USD must reclaim 1.1600 if buyers would like to regain the upper hand. Once done, the next stop is the 50-day SMA at 1.1656, followed by the 100-day SMA at 1.1659. On further strength, the next resistance is 1.1700.\nEuro FAQs\nThe Euro is the currency for the 20 European Union countries that belong to the Eurozone. It is the second most heavily traded currency in the world behind the US Dollar. In 2022, it accounted for 31% of all foreign exchange transac"
            },
            {
                "title": "EUR/USD outlook: Euro pressured as dollar strength returns ahead of key events - Forex Factory",
                "source": "Forex Factory",
                "url": "https://www.forexfactory.com/news/1371467-eurusd-outlook-euro-pressured-as-dollar-strength-returns",
                "body": "-\nEUR/USD outlook: Euro pressured as dollar strength returns ahead of key events\nThe narrow U.S. dollar index (DXY) has bounced off trend support and printed a bullish reversal, hinting at a possible push toward the November highs. EUR/USD is showing the opposite pattern, with price action and momentum tilting lower. With Nvidia’s results and the delayed payrolls report on deck, the broader dollar tone over the next 48 hours will likely be shaped by how risk appetite responds to these events. The DXY daily chart below makes for pleasant reading for dollar bulls, with Monday’s rally helping deliver a three-candle morning star—a textbook bullish reversal pattern following a downtrend. ... (full story)"
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0057",
            "open": "1.3147",
            "close": "1.3152",
            "high": "1.3193",
            "low": "1.3135"
        },
        "market_summary": "### GBP/USD Market Briefing\n\n* **Key Drivers:** The **US Dollar (USD)** strengthened due to declining expectations for a **December rate cut** by the Federal Reserve, with the likelihood falling to around **43%**. The **Pound Sterling (GBP)** faces pressure from uncertainty surrounding the UK's **autumn budget** and expectations of a **December rate cut** by the Bank of England (BoE).\n* **Price Action:** GBP/USD remains subdued, trading around **$1.3150** to **$1.3165**, with the pair struggling to gain momentum due to mixed economic data and **hawkish** Fed sentiments.\n* **Technical Outlook:** Immediate support is near **$1.3100**, with resistance at **$1.3193**. The **Relative Strength Index (RSI)** suggests **bearish momentum**, with potential upside above the **20-day SMA** at **$1.3197** or a downtrend if it drops below **$1.3100**.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "GBP/USD Forecast: Pound Sterling Struggles as BoE Cut Bets Build - currencynews.co.uk",
                "source": "currencynews.co.uk",
                "url": "https://www.currencynews.co.uk/forecast/20251117-44576_gbp-usd-forecast-pound-sterling-struggles-boe-cut-bets-build.html",
                "body": "The Pound US Dollar exchange rate (GBP/USD) saw limited movement on Monday as markets continued to reassess expectations for future Federal Reserve monetary policy.\nAt the time of writing, GBP/USD was trading around $1.3171, virtually unchanged from Monday’s opening levels.\nThe US Dollar (USD) strengthened at the start of the week as investors further unwound expectations for an imminent Federal Reserve rate cut.\nThe likelihood of a December reduction has fallen sharply to around 45%, from roughly 90% just a month ago.\nA cautious global mood also underpinned the Greenback, with weaker-than-expected Q3 GDP readings from Japan and Switzerland heightening concerns about global growth and prompting renewed demand for safe-haven assets such as the Dollar.\nThe Pound (GBP), meanwhile, traded broadly sideways as uncertainty surrounding the UK’s autumn budget continued to act as a drag on Sterling sentiment.\nMarkets remain unsure of the size of the UK’s fiscal gap and which measures Chancellor Rachel Reeves may introduce to plug it.\nSave on Your GBP/USD Transfer\nGet better rates and lower fees on your next international money transfer.\nCompare TorFX with top UK banks in seconds and see how much you could save.\nReeves had previously signalled that income tax could rise, but reports last week suggesting she had backed away from the idea unsettled investors, pushing gilt yields higher and knocking Sterling.\nCompounding budget anxiety are expectations that the Bank of England (BoE) may cut rates next month, keeping a lid on GBP buying interest.\nGBP/USD Forecast: ADP Jobs Data Could Pressure the Dollar\nLooking ahead, Tuesday’s US ADP employment report will be in sharp focus.\nIf the figures reveal another slowdown in private-sector hiring, the Dollar may weaken as markets reassess the Fed’s recent hawkish tilt.\nFor Sterling, attention will shift to comments from BoE policymaker Swati Dhingra, one of the Monetary Policy Committee’s most dovish members.\nAny hint of support for further easing could reinforce expectations of a December rate cut and exert renewed pressure on the Pound.\nLike this piece? Please share with your friends and colleagues:\nInternational Money Transfer? Ask our resident FX expert a money transfer question or try John's new, free, no-obligation personal service! ,where he helps every step of the way,\nensuring you get the best exchange rates on your currency requirements."
            },
            {
                "title": "GBP/USD remains subdued around 1.3150 as UK Chancellor Reeves abandons tax rises - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-usd-remains-subdued-around-13150-as-uk-chancellor-reeves-abandons-tax-rises-202511180407",
                "body": "GBP/USD remains subdued around 1.3150 as UK Chancellor Reeves abandons tax rises\n- GBP/USD struggles after UK Chancellor Rachel Reeves scrapped planned income-tax rises.\n- The British Pound remains under pressure as softer economic data boost expectations of a December rate cut by the BoE.\n- The US Dollar holds steady as markets await a wave of delayed US data after the government reopened.\nGBP/USD remains subdued for the third successive session, trading around 1.3150 during the Asian hours on Tuesday. The pair struggles as the Pound Sterling (GBP) comes under strain after the United Kingdom (UK) Chancellor of the Exchequer Rachel Reeves abandoned planned income-tax rises. The decision has raised questions about the UK’s fiscal outlook, despite the Office for Budget Responsibility lowering its budget deficit forecast to £20 billion from £35 billion. Reeves is still anticipated to pursue revenue through threshold changes and salary-sacrifice reforms, favoring a smaller-scale budget over significant tax increases.\nAdditionally, the British Pound continues to face downside pressure after softer economic data intensified bets on a December rate cut by the Bank of England (BoE). The UK economy delivered only marginal growth in Q3, with GDP declining monthly in September. This week, traders’ attention will be on inflation figures, flash PMIs, and any indications of cooling momentum in the manufacturing and services sectors.\nThe US Dollar (USD) moves little as traders brace for a backlog of US data following the government's reopening. The Greenback gained support amid declining US Federal Reserve (Fed) rate cut bets for December. The CME FedWatch Tool suggests that financial markets are now pricing in a 43% chance that the Fed will cut its benchmark overnight borrowing rate by 25 basis points (bps) at its December meeting, down from 62% probability that markets priced a week ago.\nHowever, Federal Reserve (Fed) Governor Christopher Waller said on Monday that the Fed should cut the interest rates when policymakers meet in December. Waller added that he’s grown concerned over the labor market and the sharp slowdown in hiring, according to a news report by Bloomberg.\nPound Sterling FAQs\nThe Pound Sterling (GBP) is the oldest currency in the world (886 AD) and the official currency of the United Kingdom. It is the fourth most traded unit for foreign exchange (FX) in the world, accounting for 12% of all transactions, averaging $630 billion a day, according to 2022 data. Its key trading pairs are GBP/USD, also known as ‘Cable’, which accounts for 11% of FX, GBP/JPY, or the ‘Dragon’ as it is known by traders (3%), and EUR/GBP (2%). The Pound Sterling is issued by the Bank of England (BoE).\nThe single most important factor influencing the value of the Pound Sterling is monetary policy decided by the Bank of England. The BoE bases its decisions on whether it has achieved its primary goal of “price stability” – a steady inflation rate of around 2%. Its primary tool for achieving this is the adjustment of interest rates. When inflation is too high, the BoE will try to rein it in by raising interest rates, making it more expensive for people and businesses to access credit. This is generally positive for GBP, as higher interest rates make the UK a more attractive place for global investors to park their money. When inflation falls too low it is a sign economic growth is slowing. In this scenario, the BoE will consider lowering interest rates to cheapen credit so businesses will borrow more to invest in growth-generating projects.\nData releases gauge the health of the economy and can impact the value of the Pound Sterling. Indicators such as GDP, Manufacturing and Services PMIs, and employment can all influence the direction of the GBP. A strong economy is good for Sterling. Not only does it attract more foreign investment but it may encourage the BoE to put up interest rates, which will directly strengthen GBP. Otherwise, if economic data is we"
            },
            {
                "title": "Traders anticipate US jobs data, keeping GBP/USD stable around 1.3165 during the North American session - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/traders-anticipate-us-jobs-data-keeping-gbp-usd-stable-around-1-3165-during-the-north-american-session/",
                "body": "The GBP/USD remains stable near 1.3165 as markets anticipate the release of the first US jobs report since the government reopened. This report is due Thursday alongside Initial Jobless Claims. The pair trades at 1.3166, almost unchanged in the North American session.\nThe US Dollar is recovering due to hawkish sentiments from Federal Reserve officials, with a 43% chance of a December rate cut according to CME FedWatch Tool data. The US Dollar Index has risen by 0.25% to 99.52. Concerns about a possible AI bubble have led to a sell-off in US equity markets.\nUK Economic Outlook\nUK economic outlook improves as Chancellor Rachel Reeves rules out income tax hikes, offering relief to stakeholders after GDP figures showed signs of weakness. Upcoming Consumer Price Index data could influence the Bank of England to consider a rate cut in December.\nTechnically, GBP/USD remains within a range of 1.3100 to 1.3193. The Relative Strength Index suggests bearish momentum, with potential upside above the 20-day SMA at 1.3197 or a downtrend if it drops below 1.3100. The British Pound was strongest against the Australian Dollar today.\nLooking back, the market was in a state of indecision around 1.3165 as we awaited key data in late 2024. The divergence we saw since then was kicked off by a surprisingly strong US jobs report that winter, which kept the Fed hawkish while the Bank of England followed through with its anticipated December rate cut. This policy split was the primary driver that pushed the pound lower through much of early 2025.\nThe landscape is now shifting, as the Federal Reserve’s prolonged period of tight policy shows signs of finally slowing the US economy. Last week’s initial jobless claims data showed a rise to 231,000, the highest reading in over three months, reinforcing this view. As a result, the CME FedWatch Tool now implies a 65% probability of a Fed rate cut by the end of the first quarter of 2026.\nBank Of England Pause\nConversely, the Bank of England appears to have paused its easing cycle after its cut last year. UK inflation has remained stubbornly above target, with the latest CPI reading holding at 3.1%, making further rate reductions unlikely in the near term. This monetary policy stabilization is providing a floor for the pound after its steady decline.\nGiven this potential reversal in central bank policy, we should consider positioning for a gradual recovery in GBP/USD from its current level of 1.2450. Buying call options with strikes around the 1.2600 level, expiring in February 2026, provides a defined-risk approach to capitalize on expected dollar weakness. This strategy benefits from both a potential rise in the exchange rate and an increase in implied volatility.\nHowever, we must hedge against the risk that the US labor market proves resilient once again in the next jobs report. A cost-effective strategy is to use put option spreads, which would protect our positions against a sharp move below the 1.2300 support level. This provides a crucial buffer if market sentiment turns against the pound unexpectedly."
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0055",
            "open": "0.6530",
            "close": "0.6491",
            "high": "0.6537",
            "low": "0.6481"
        },
        "market_summary": "### AUD/USD Market Briefing\n\n* **Key Drivers:** The Reserve Bank of Australia (RBA) minutes indicated a **balanced policy stance**, suggesting rates could stay on hold longer, but easing is still possible if growth weakens. The **US Dollar** strengthens as traders gauge upcoming US data releases and the likelihood of further rate cuts by the Federal Reserve (Fed).\n* **Price Action:** The AUD/USD pair is down, testing the critical **0.6500** support level, with a break potentially signaling a deeper slide. Immediate resistance is seen at the **100-day EMA of 0.6525**, and the next resistance level emerges at the **November 13 high of 0.6580**.\n* **Technical Outlook:** To the downside, the **October 10 low of 0.6472** will offer some comfort to buyers, with extended losses potentially seeing a drop to the **July 31 low of 0.6424**. The next contention level is located at the **0.6400 psychological level**.\n\n---\n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "RBA Minutes: Rates could stay on hold longer but easing still possible if growth weakens - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/when-are-the-rba-minutes-and-how-could-they-affect-aud-usd-202511172230",
                "body": "RBA Minutes: Rates could stay on hold longer but easing still possible if growth weakens\nThe Reserve Bank of Australia (RBA) published the Minutes of its November monetary policy meeting on Tuesday, which showed that board members signalled a more balanced policy stance, adding that it could keep the cash rate unchanged for longer if incoming data proves stronger than expected\nAdditional takeaways\nMembers commenced their discussion of financial conditions by considering central bank policy settings in advanced economies.\nMembers noted that Australian financial conditions had eased over the course of the year as the cash rate had been reduced.\nMembers considered their assessment of whether financial conditions overall were still restrictive. A range of indicators painted a mixed picture, in contrast to the clear signals apparent in 2024.\nSome other indicators suggested that financial conditions could be on the accommodative side: risk premia in capital markets were low; funding was readily available; and the spread to the cash rate for both bank funding costs and lending rates was notably below pre-pandemic levels.\nHowever, other indicators were consistent with financial conditions still being a little restrictive.\nMembers noted that market expectations for the policy rate in Australia had shifted significantly higher since the August Statement on Monetary Policy.\nThe bank’s tone on the labour market has shifted after October employment surged and the jobless rate fell back to 4.3%, helping markets scale back expectations for further cuts.\nThe board acknowledged that if growth disappoints or the labour market weakens materially, more easing may be needed.\nThe RBA noted the Australian dollar remains near its estimated fair value and said global downside risks have eased, even as global growth is expected to slow in the second half of 2025.\nMarket reaction\nAt the time of press, the AUD/USD pair is down 0.13% on the day at 0.6483.\nAustralian Dollar Price This week\nThe table below shows the percentage change of Australian Dollar (AUD) against listed major currencies this week. Australian Dollar was the weakest against the US Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Australian Dollar from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent AUD (base)/USD (quote).\nThis section was published on November 18 at 22.30 GMT as a preview of the RBA Minutes release.\nThe RBA Minutes Overview\nThe Reserve Bank of Australia (RBA) will publish its minutes of its monetary policy meeting on Tuesday at 00.30 GMT. It provides a detailed record of the discussions held between the RBA’s board members on monetary policy and economic conditions that influenced their decision on adjusting interest rates and/or bond buys, significantly impacting the AUD.\nThe minutes also reveal considerations on international economic developments and the exchange rate value.\nHow could the RBA Minutes affect AUD/USD?\nAUD/USD trades on a negative note on the day in the lead up to the RBA Minutes. The pair loses ground as the US Dollar strengthens as traders continue to gauge upcoming US data releases and the likelihood of further rate cuts by the Federal Reserve (Fed).\nIf the RBA is hawkish about the inflationary outlook for the economy, it could lift the Australian Dollar (AUD), with the first upside barrier seen at the 100-day EMA of 0.6525. The next resistance level emerges at the November 13 high of 0.6580, en route to the October 6 high of 0.6620.\nTo the downside, the October 10 low of 0.6472 will offer some comfort to buyers. Extended losses could see a drop to the July 31 low of 0.6424. The next contention level is located at the 0.6400 psychological level.\nRBA FAQs\nThe Reserve Bank of Australia (RBA) sets interest rate"
            },
            {
                "title": "Aussie Dollar Edges Higher - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/te_news:502780:0-aussie-dollar-edges-higher/",
                "body": "Aussie Dollar Edges Higher\nThe Australian dollar edged higher to around $0.649 on Tuesday, recouping some losses from the previous session, as the Reserve Bank of Australia signaled continued caution and emphasized a data-dependent approach to future monetary policy during its latest minutes.\nEarlier this month, the central bank held the cash rate at 3.60%, highlighting its reluctance to ease policy further amid persistently high inflation, robust consumer demand, and a renewed upswing in the housing market.\nMoreover, concerns about a weakening labor market were largely overstated, as employment surged while the unemployment rate fell in October.\nThis prompted markets to significantly discount the likelihood of near-term policy easing, with only a 40% probability of a rate cut in May next year currently priced in.\nNonetheless, the RBA acknowledged that certain scenarios could still warrant monetary easing, particularly if the labor market softens or if the broader economic recovery lags."
            },
            {
                "title": "Attention is drawn to RBA Minutes, ADP Weekly, and Federal Reserve commentary as the USD strengthens - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/attention-is-drawn-to-rba-minutes-adp-weekly-and-federal-reserve-commentary-as-the-usd-strengthens/",
                "body": "The US Dollar rebounded on Monday, rising from its recent lows as the market prepared for upcoming US data and Federal Reserve rate discussions. The US Dollar Index advanced modestly, nearing three-day highs around 99.50, with attention on the ADP Employment Change Weekly report and speeches from Fed officials Logan and Barr.\nThe EUR/USD pair declined for the second consecutive day, reaching the 1.1590-1.1580 range, while GBP/USD also dropped, revisiting the 1.3130 area. In Japan, USD/JPY increased, hitting 155.30 for the first time since February, with focus on upcoming Balance of Trade and Machinery Orders data. AUD/USD faced pressure near 0.6500, with the RBA Minutes expected to draw attention.\nCommodities And Precious Metals\nWTI crude oil prices briefly surpassed $60 per barrel as exports resumed at Russia’s Novorossiysk port amid ongoing geopolitical tensions. Gold prices continued to fall, nearing $4,000 per ounce, influenced by a stronger US Dollar and varied US Treasury yields, while silver gained slightly, surpassing $51 per ounce.\nThe US Dollar is gaining strength as we start the week, pushing the Dollar Index (DXY) towards 99.50. This comes after last month’s Nonfarm Payrolls report showed a surprisingly strong addition of 210,000 jobs, making the market question if the Federal Reserve will actually cut rates in December. Upcoming speeches from Fed officials Logan and Barr will be watched closely for any hints after Waller’s comments last week suggested a cut was possible.\nFor those watching the Euro, its slide below 1.1600 is a direct result of this dollar rally. Europe’s own inflation numbers have shown a faster cooling trend, with the latest headline CPI for the Eurozone dipping to 2.5% year-over-year. This divergence in economic data keeps the pressure on the EUR/USD pair.\nThe Australian dollar is now testing the critical 0.6500 support level ahead of the RBA minutes. We know the RBA held rates at their last meeting, but with Australian inflation remaining stubbornly higher than in other developed nations, traders will be looking for any hawkish language. A break of this support could signal a much deeper slide for the AUD/USD.\nMarket Volatility And Fed Decisions\nMeanwhile, the Japanese Yen continues to weaken, with USD/JPY pushing past 155.30. We remember this was a level that prompted serious verbal warnings from the Ministry of Finance back in 2024. Derivative traders should be cautious of potential intervention risk if the pair continues to climb this aggressively.\nIn commodities, oil and gold are telling different stories. WTI crude has pushed over $60 a barrel on persistent geopolitical risk, particularly with renewed threats to Russian oil facilities in the Black Sea. In contrast, gold is slipping towards $4,000 an ounce as the strong dollar makes it a less attractive investment for now.\nThe core issue for the next few weeks is the market’s uncertainty about the Fed’s next move. While some officials hint at easing, recent strong labor data and a Core PCE inflation figure still hovering just under 3% suggest they may wait longer. This means we should expect continued volatility, making options strategies that benefit from sharp price swings potentially useful."
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "0.8870",
            "open": "154.4560",
            "close": "155.2390",
            "high": "155.2990",
            "low": "154.4120"
        },
        "market_summary": "### USD/JPY Market Briefing\n\n* **Key Drivers:** The Japanese yen's weakness is attributed to political pressure for looser monetary policy, while **hawkish** Federal Reserve expectations and Japan's fiscal concerns support the **US Dollar**.\n* **Price Action:** USD/JPY is trading below **155.00**, after reaching a 10-month high of **155.38**, with a potential minor top at **155.30** and showing signs of **bearish** momentum.\n* **Technical Outlook:** Immediate resistance is at **155.30**, with support levels at **154.75**, **154.20**, and **153.65** (the 20-day moving average), and potential further resistance at **155.80/155.95** and **156.50/156.70** if **155.30** is broken.\n\n---\n**Overall Sentiment:** Cautiously **bearish**",
        "source_articles": [
            {
                "title": "USD/JPY: Potential minor top at 155.30, USD at risk of bearish reversal towards 154.20/153.65 - marketpulse.com",
                "source": "marketpulse.com",
                "url": "https://www.marketpulse.com/markets/usdjpy-potential-minor-top-at-15530-usd-at-risk-of-bearish-reversal-towards-1542015365/",
                "body": "Key takeaways\n- The Japanese yen has been the weakest major currency over the past month, with USD/JPY climbing nearly 3%—outpacing the US Dollar Index’s 0.9% gain—amid political pressure for looser monetary policy.\n- USD/JPY’s surge above 155.00 has heightened FX-intervention risk, prompting verbal warnings from Japan’s Finance Minister over rapid, one-sided yen depreciation.\n- A high-stakes meeting between BoJ Governor Ueda and Prime Minister Takaichi later today could trigger short-term volatility, with technical signals pointing to rising odds of a minor bearish reversal unless USD/JPY breaks above 155.30.\nIn the past month (based on a rolling basis), the Japanese yen has been the weakest major currency against the US dollar. The USD/JPY rose by almost 3% as of Tuesday, 18 November 2025, at the time of writing, surpassing the 0.9% return seen in the US Dollar Index over the same period (see Fig. 1).\nFig. 1: 1-month rolling performances of major currencies against the US dollar as of 18 Nov 2025 (Source: TradingView)\nThe current bout of weakness seen in the Japanese yen has been attributed to political jawboning by the new Japanese Prime Minister, Takaichi’s penchant for an accommodating monetary policy to drive economic growth, going against the Bank of Japan (BoJ)’s current monetary policy stance of gradually rising interest rates as inflation trend in Japan has stablished above BoJ’s 2% long-term target.\nFX intervention risk has increased with BoJ Ueda-PM Takaichi meeting on the horizon\nThe USD/JPY has surged past the 155.00 psychology level on Monday, 17 November, from the 7 November 2025 low of 152.82, and it continued to trade higher in today’s Asia session, 18 November, as it printed an intraday high of 155.38 to record a 10-month high.\nThe sharp rise in USD/JPY has triggered a verbal warning from Finance Minister Katayama, who reiterated concerns over rapid, one-sided yen moves in the FX market.\nSeparately, a closely watched meeting between BoJ Governor Ueda and Prime Minister Takaichi is scheduled for 3:30 p.m. local time. Any post-meeting comments related to monetary policy could spark meaningful short-term volatility in USD/JPY.\nLet’s now outline the short-term trajectory for USD/JPY over the next 1 to 3 days, along with the key technical elements and levels to monitor.\nPreferred trend bias (1-3 days) – Minor bearish reversal below 155.30\nFig. 2: USD/JPY minor trend as of 18 Nov 2025 (Source: TradingView)\nBearish bias with 155.30 as key short-term pivotal resistance for the USD/JPY. A break below 154.75 may expose near-term weakness towards the next intermediate supports at 154.20 and 153.65 (also the 20-day moving average) (see Fig. 2).\nKey elements\n- The minor uptrend phase of USD/JPY from its 29 October 2025 low of 151.89 to Tuesday, 18 November 2025, intraday high of 155.38 may have reached a terminal exhaustion point, as price action has hit the upper boundary of the bearish “Ascending Wedge” configuration.\n- In conjunction, the hourly RSI momentum indicator has traced out a bearish divergence before exiting its overbought region on Tuesday, 18 November 2025, during the Asia session.\n- These observations suggest that short-term upside momentum has started to wane, which increases the odds of a minor bearish reversal on the USD/JPY.\nAlternative trend bias (1 to 3 days)\nHowever, a clearance above 155.30 key resistance invalidates the bearish reversal scenario for a further squeeze up towards the next intermediate resistances at 155.80/155.95 and 156.50/156.70.\nOpinions are the authors'; not necessarily that of OANDA Business Information & Services, Inc. or any of its affiliates, subsidiaries, officers or directors. The provided publication is for informational and educational purposes only.\nIf you would like to reproduce or redistribute any of the content found on MarketPulse, an award winning forex, commodities and global indices analysis and news site service produced by OANDA Business Information & Services"
            },
            {
                "title": "Japanese Yen hits nine-month low against USD amid BoJ doubts - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/japanese-yen-refreshes-nine-month-low-against-usd-amid-boj-rate-hike-doubts-202511180214",
                "body": "Japanese Yen recovers from nine-month low against USD amid intervention fears\n- The Japanese Yen gains positive traction amid intervention fears and the risk-off mood.\n- Fiscal concerns and BoJ uncertainty might keep a lid on any further upside for the JPY.\n- Reduced Fed rate cut bets could act as a tailwind for the USD and the USD/JPY pair.\nThe Japanese Yen (JPY) stages an intraday recovery from the lowest level since early February, touched against its American counterpart during the Asian session on Tuesday, though it lacks follow-through buying or bullish conviction. The recent fall in the JPY prompted some verbal intervention from Japan’s Finance Minister Satsuki Katayama. This, along with the prevalent risk-off mood, provides a modest lift to the safe-haven JPY. Apart from this, the lack of follow-through US Dollar (USD) buying drags the USD/JPY pair below the 155.00 psychological mark in the last hour.\nMeanwhile, reports that Japan's Prime Minister Sanae Takaichi plans tax cuts to boost consumption add to concerns about the government's long-term fiscal health. This comes on top of Japan's weak Q3 GDP print on Monday and could put additional pressure on the Bank of Japan (BoJ) to delay raising interest rates, which could act as a headwind for the JPY. Moreover, less dovish Federal Reserve (Fed) expectations could support the buck and the USD/JPY pair. Traders might also wait for the FOMC Minutes and the delayed US Nonfarm Payrolls (NFP) report this week.\nJapanese Yen bears turn cautious amid intervention fears\n- Nikkei Asia reported late Monday that Japan's Prime Minister Sanae Takaichi will launch tax-reform talks this week, aiming to cut certain taxes to stimulate investment and consumption while raising others and eliminating breaks to fill the fiscal hole.\n- The report added that the ruling Liberal Democratic Party (LDP) and its coalition partner will discuss next year’s tax package, including the agreed-upon removal of gasoline and diesel surcharges, a move that will leave a ¥1.5 trillion revenue gap.\n- Government data released on Monday showed that Japan's economy contracted for the first time in six quarters during the July-September period. This tempers bets that the Bank of Japan will hike rates soon amid increasing political resistance.\n- Japan’s Finance Minister Satsuki Katayama said at a regular news conference this Tuesday that we have been alarmed by the recent one-sided, rapid moves in the foreign exchange market, fueling speculations about government intervention.\n- In fact, Katayama added that the government will thoroughly monitor for excessive fluctuations and disorderly movements in the forex market, with a high sense of urgency, which holds back traders from placing fresh bearish bets around the JPY.\n- Several Fed officials recently signaled caution on further monetary easing amid the lack of economic data, forcing investors to scale back their expectations for a rate cut in December. This acts as a tailwind for the US Dollar and the USD/JPY pair.\n- The USD bulls, however, seem reluctant and opt to wait for more cues about the Fed's rate-cut path. Hence, the market focus will remain glued to the FOMC Minutes on Wednesday and the delayed US Nonfarm Payrolls report on Thursday.\n- In the meantime, traders will scrutinize speeches from influential FOMC members later this Tuesday, which should continue to play a key role in driving the USD demand and producing short-term trading opportunities around the USD/JPY pair.\nUSD/JPY corrective slide below 155.00 is likely to be short-lived\nFrom a technical perspective, the overnight close above the 155.00 psychological mark could be seen as a fresh trigger for the USD/JPY bulls. Furthermore, oscillators on the daily chart are holding in positive territory and are still away from being in the overbought zone, suggesting that the path of least resistance for spot prices remains to the upside. Hence, some follow-through strength beyond the 155.60-155.65 intermediat"
            },
            {
                "title": "After Japan’s GDP surpasses estimates, USD/JPY remains under 155 amid expectations of future policy changes - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/after-japans-gdp-surpasses-estimates-usd-jpy-remains-under-155-amid-expectations-of-future-policy-changes/",
                "body": "The USD/JPY pair is trading just below 155.00 following Japan’s Q3 GDP figures, which showed a smaller contraction than anticipated. Japan’s Q3 GDP decreased by 0.4% quarter-on-quarter, compared to an expected 0.6% drop, after a 0.6% increase in Q2.\nThe contraction was mainly due to declines in residential construction and exports. However, private domestic demand remained steady, with household consumption rising by 0.1% quarter-on-quarter and private non-residential investment increasing by 1%.\nBOJ Rate Hike Expectations\nThe market’s expectation for a December BOJ rate hike has decreased, with the probability dropping to 30% from last week’s 50%. Nonetheless, enhanced fiscal measures planned by Prime Minister Takaichi could increase the possibility of policy tightening, with a new economic package set to surpass last year’s ¥13.9 trillion supplementary budget.\nThe market seems to be betting against a Bank of Japan rate hike next month, but we see signs that the Japanese economy is more resilient than expected. The recent Q3 GDP numbers shrank less than feared, and crucially, domestic spending and business investment remain firm. This tells us the foundation of the economy is solid.\nWe believe the risk of a December 19th rate increase is being underestimated, especially with the government planning another large spending package. Japan’s latest Tokyo Core CPI for October 2025 came in at 2.9%, which has remained above the BOJ’s 2% target for over a year and a half. This persistent inflation, combined with fiscal stimulus, creates significant pressure on the central bank to act.\nTrading Opportunities\nGiven that the swaps market is only pricing in a 30% chance of a hike, there’s a clear opportunity for traders. This low probability suggests that options are not fully pricing in the potential for a hawkish surprise from the BOJ. The current setup allows for positioning ahead of a possible shift in sentiment.\nWe see value in buying derivatives that would profit from a stronger yen, such as USD/JPY put options expiring after the December meeting. These options are likely inexpensive due to the market’s dovish expectations. A move by the BOJ could cause the USD/JPY to drop sharply from its current level just below 155.\nOne-month implied volatility for the pair is hovering around 8.5%, which seems too low given the binary risk of the upcoming meeting. We saw how the BOJ surprised markets a few years ago in December 2022 with a sudden policy tweak that sent the yen soaring. Buying straddles or strangles could be a prudent way to trade the potential for a significant move, regardless of the direction."
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0046",
            "open": "1.4013",
            "close": "1.4053",
            "high": "1.4057",
            "low": "1.4012"
        },
        "market_summary": "### USD/CAD Market Briefing\n\n* **Key Drivers:** Mixed fundamental signals, with a softer Canadian CPI print and downtick in Crude Oil prices undermining the Loonie, while less **dovish** Fed bets favor **bulls**.\n* **Price Action:** The USD/CAD pair is trading around **1.4040**, showing **bullish momentum** as it pushes above **1.40**, with the market favoring the US Dollar due to diverging economic signals.\n* **Technical Outlook:** Immediate support is near **1.39**, with resistance at **1.42**; a significant surprise in the jobs report could cause a violent move, potentially sending USD/CAD toward **1.42** or triggering a sharp reversal back below **1.39**.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "USD/CAD flat lines near mid-1.4000s amid mixed fundamental signals - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-cad-flat-lines-around-mid-14000s-downside-potential-seems-limited-202511180229",
                "body": "USD/CAD flat lines around mid-1.4000s; downside potential seems limited\n- USD/CAD is seen consolidating in a narrow range amid mixed fundamental cues.\n- Softer Canadian CPI print and a downtick in Crude Oil prices undermine the Loonie.\n- Economic concerns cap USD and the pair, though less dovish Fed bets favor bulls.\nThe USD/CAD pair struggles to capitalize on the previous day's positive move to a one-and-a-half-week high and oscillates in a narrow range during the Asian session on Tuesday. Spot prices currently trade around mid-1.4000s, nearly unchanged for the day, though the supportive fundamental backdrop favors bullish traders.\nThe Canadian Dollar (USD) continues to be undermined by data released on Monday, which pointed to signs of easing domestic inflation pressures. In fact, Canada's headline Consumer Price Index (CPI) decelerated from 2.4% YoY to 2.2% in October. The reading, however, was slightly above the 2.1% expected. Apart from this, a softer tone surrounding Crude Oil prices is seen weighing on the commodity-linked Loonie and acting as a tailwind for the USD/CAD pair.\nThe US Dollar (USD), on the other hand, is seen consolidating the previous day's strong move up and remains well supported by less dovish Federal Reserve (Fed) expectations. Several Fed officials recently signaled caution on further monetary easing amid the lack of economic data, forcing investors to scale back their bets for a rate cut in December. This, along with the prevalent risk-off environment, benefits the safe-haven buck, lending some support to the USD/CAD pair.\nThe USD bulls, however, seem reluctant amid concerns about the weakening economic momentum on the back of the longest-ever US government shutdown. Moreover, traders opt to wait for the FOMC Minutes, due on Wednesday, and the delayed US Nonfarm Payrolls (NFP) report for October on Thursday for more cues about the Fed's rate-cut path. This, in turn, will play a key role in influencing the USD price dynamics and provide a fresh impetus to the USD/CAD pair.\nCanadian Dollar FAQs\nThe key factors driving the Canadian Dollar (CAD) are the level of interest rates set by the Bank of Canada (BoC), the price of Oil, Canada’s largest export, the health of its economy, inflation and the Trade Balance, which is the difference between the value of Canada’s exports versus its imports. Other factors include market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – with risk-on being CAD-positive. As its largest trading partner, the health of the US economy is also a key factor influencing the Canadian Dollar.\nThe Bank of Canada (BoC) has a significant influence on the Canadian Dollar by setting the level of interest rates that banks can lend to one another. This influences the level of interest rates for everyone. The main goal of the BoC is to maintain inflation at 1-3% by adjusting interest rates up or down. Relatively higher interest rates tend to be positive for the CAD. The Bank of Canada can also use quantitative easing and tightening to influence credit conditions, with the former CAD-negative and the latter CAD-positive.\nThe price of Oil is a key factor impacting the value of the Canadian Dollar. Petroleum is Canada’s biggest export, so Oil price tends to have an immediate impact on the CAD value. Generally, if Oil price rises CAD also goes up, as aggregate demand for the currency increases. The opposite is the case if the price of Oil falls. Higher Oil prices also tend to result in a greater likelihood of a positive Trade Balance, which is also supportive of the CAD.\nWhile inflation had always traditionally been thought of as a negative factor for a currency since it lowers the value of money, the opposite has actually been the case in modern times with the relaxation of cross-border capital controls. Higher inflation tends to lead central banks to put up interest rates which attracts more capital inflows from global investors seekin"
            },
            {
                "title": "Market Minute: Rate expectations to weigh on the loonie vs. greenback - The Real Economy Blog",
                "source": "The Real Economy Blog",
                "url": "https://realeconomy.rsmus.com/market-minute-rate-expectations-to-weigh-on-the-loonie-vs-greenback/",
                "body": "The U.S. dollar has rallied against a broad basket of currencies as global investors move into dollar-denominated assets in pursuit of higher returns and as the questionable notion of de-dollarization runs its course.\nA look at the Canadian dollar illustrates how growth differentials and diverging rate expectations have driven a wedge between the greenback and the loonie since July.\nGet Joe Brusuelas’s Market Minute economic commentary every morning. Subscribe now.\nThe Bank of Canada, facing soft economic growth, will most likely cut rates in the coming months as Canada prepares to enter into the renegotiation of the USMCA next year.\nIn addition, sustained trade uncertainty and a global glut of oil will further dampen demand for the loonie compared with the greenback in the coming year, which is why we have a modestly bearish bias on the Canadian dollar.\nWe expect the divergence in growth prospects and central bank policy rates to continue into next year with the CAD falling to 1.34 against the USD, which is modestly below the forward rate of 1.38."
            },
            {
                "title": "The Canadian Dollar weakens against the US Dollar, causing USD/CAD to rise around 1.4040 - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/the-canadian-dollar-weakens-against-the-us-dollar-causing-usd-cad-to-rise-around-1-4040/",
                "body": "The Canadian Dollar (CAD) has weakened against the US Dollar (USD) following Canada’s October inflation report. The USD/CAD pair is trading around 1.4040 due to a stronger Greenback exerting pressure on the Loonie.\nIn October, Canada’s Consumer Price Index (CPI) eased to 2.2% annually, slightly higher than the expected 2.1% but down from September’s 2.4%. Monthly CPI increased by 0.2%, matching expectations and slightly exceeding September’s 0.1% rise. Core CPI advanced by 0.6% in October, with the annual rate rising to 2.9% from 2.8%.\nMonetary Policy Implications\nCanada’s central bank may maintain current interest rates as core inflation remains firm. The Bank of Canada has previously signalled a potential end to the easing cycle if inflation continues to decline. Meanwhile, US traders are evaluating delayed economic data following a government shutdown.\nRate-cut expectations by the Federal Reserve have cooled due to recent hawkish comments from Fed officials, maintaining support for the Greenback. Additionally, the NY Empire State Manufacturing Index for November beat forecasts, recording 18.7 against the expected 6.0. This further supports the US Dollar, with the Dollar Index trading at 99.48.\nNonfarm Payrolls data, a key US economic indicator, will be released next and is anticipated to impact the USD. The consensus expects 50K jobs, following a previous 22K.\nWith USD/CAD pushing above 1.40, we see the market favoring the US Dollar due to diverging economic signals. Canadian headline inflation is cooling, but the sticky core reading of 2.9% will likely keep the Bank of Canada on hold for now. This contrasts with a firming US outlook, creating a clear policy difference that supports the pair’s upward momentum.\nThe weakness in the Canadian dollar is not just about inflation. This follows last week’s disappointing Canadian retail sales figures, which showed a 0.5% contraction in September, underscoring weakness in consumer demand. A sidelined Bank of Canada gives little reason to buy the loonie, especially while US economic data remains resilient.\nUS Economic Indicators\nIn the US, the stronger-than-expected NY Empire State Manufacturing Index has cooled expectations for a December rate cut from the Federal Reserve. The US Dollar Index (DXY) is holding firm around 99.48 as traders await more definitive data. The market is now keenly focused on labor market health to guide the Fed’s next move.\nThe upcoming Nonfarm Payrolls report on Thursday, November 20, is the main event we are all watching this week. The consensus forecast is a soft 50K, following an even weaker 22K in the prior month. Recent weekly initial jobless claims have been ticking up, hovering around the 240,000 mark, suggesting this anticipated weakness in the labor market is justified.\nGiven the major event risk, we should consider using options to trade the expected volatility. Implied volatility on short-dated USD/CAD options has already risen to a 30-day high, showing that the market is bracing for a significant price swing. A long straddle could be a viable strategy to profit from a large move in either direction following the NFP release.\nHistorically, we saw a similar dynamic back in the 2017-2018 period where Federal Reserve tightening outpaced the Bank of Canada, leading to a sustained rally in USD/CAD. If the NFP data on Thursday beats expectations, it could confirm the Fed is done easing and ignite a similar long-term trend. This makes positioning for a topside break in USD/CAD an attractive strategy, perhaps through buying call options or call spreads to define risk.\nA significant surprise in the jobs report could cause a violent move. A number above 150K would likely cement the Fed’s hawkish stance and could send USD/CAD toward 1.42 quickly. Conversely, a negative print would reignite rate cut bets and could trigger a sharp reversal back below 1.39, wiping out any unprepared long positions."
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "1.3960",
            "open": "203.2210",
            "close": "204.1750",
            "high": "204.5200",
            "low": "203.1240"
        },
        "market_summary": "### GBP/JPY Market Briefing\n\n* **Key Drivers:** Continued **JPY-weakness** driven by Japan's pro-growth and inflation measures, contrasting with currency strength, and the **hawkish** stance of other major economies.\n* **Price Action:** Broke out to fresh **monthly highs**, showing significant **bullish momentum** with a test of support at prior resistance around the **200** level.\n* **Technical Outlook:** Immediate support is near the **195** level, which is a key area of prior resistance, with resistance at **205**, a major psychological level.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "USD/JPY Through 155 as EUR/JPY, GBP/JPY Break Out to Fresh Highs - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/usd-jpy-through-155-as-eur-jpy-gbp-jpy-break-out-to-fresh-highs/?amp=true",
                "body": "USD/JPY Through 155 as EUR/JPY, GBP/JPY Break Out to Fresh Highs\nJapanese Yen Weakness Continues to Drive\nDon’t be surprised if grumblings appear from the Japanese Finance Ministry in the coming days. I wouldn’t necessarily expect that to lead to an intervention immediately, as we’re still in the early innings of that theme, but with USD/JPY crossing the 155.00 barrier, it seems we’re due for a veiled threat of intervention.\nWe’ve already heard an initial comment on the matter, with the MoF saying that “the government is watching for any excessive and disorderly moves with a high sense of urgency.”\nOftentimes the next set of comments is a more tense warning, along the lines of ‘we won’t hesitate to intervene if we have to.” And then, when the Yen weakens some more, usually up to the next major psychological level, we just see a gush of Yen-strength as social media buzzes about a whether or not the Bank of Japan was ordered to intervene.\nThis isn’t to say that the Ministry of Finance will be able to tilt the trend. When the intervened in April of last year following a test of 160.00 in USD/JPY, the pair merely found support at 151.95 and continued to rally. They ordered intervention again in July following another push above 160.00 but that episode was coupled with falling US inflation and rising odds for US rate cuts. It actually turned out very badly just in a different way, as that intervention spurred a case of carry unwind that soon drove a global de-leveraging event. It took the BoJ months of keeping rates flat to calm markets and by the time we got into Q4 the market reversed on the back of USD-strength.\nAt this point, however, the next threat of intervention could serve as a pullback opportunity in the trend. Broader fiscal policy in Japan continues to drive towards pro-growth and inflation measures and that’s directly at odds with currency strength, and this is one dominant reason why JPY-weakness has been such a notable theme so far in Q4 trade.\nUSD/JPY Daily Chart\nChart prepared by James Stanley; data derived from Tradingview\nUSD/JPY\nThe challenge with USD/JPY at the moment is that the pair is trading above the big figure for the first time since February, and this comes after a clean resistance test there last week. This does allow for continued bullish structure, and if we do get another intervention threat, that could produce a pullback similar to what showed up last week.\nThe Fibonacci level at 154.33 remains attractive for higher-low support given the multiple iterations of resistance that had showed their previously. And below that, we had a clean bounce from 153.63 last week, and that can be synced down to another spot of prior resistance at 153.28 to create a support zone for deeper pullback scenarios.\nUSD/JPY Four-Hour Chart\nChart prepared by James Stanley; data derived from Tradingview\nEUR/JPY\nFor much of the past few months I’ve leaned heavier into EUR/JPY for JPY-weakness scenarios, and the pair is now trading at a fresh all-time-high after tagging the 180.00 level for the first time ever. But therein lies the complication as a print above that level could produce profit taking from longs that have been riding the trend.\nNonetheless, the backdrop is still bullish as the horizontal resistance around the big figure matches with higher-lows, so breakout strategies can still be justified. But, for pullbacks in the event that profit taking does appear, there’s a few spots of prior resistance, namely th 178.57-178.83 zone that set the highs in late-October and hasn’t yet been tested for support since the breakout.\nEUR/JPY Four-Hour\nChart prepared by James Stanley; data derived from Tradingview\nGBP/JPY\nLast week when I looked into the Yen on Wednesday I shared a breakout setup in GBP/JPY. That has since led to a rally up to fresh monthly highs and I wrote about the pair earlier today as part of a broader British Pound article.\nAt this point, we’re already seeing a test of support at prior resistance around the 2"
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "4,819.0000",
            "open": "93,433.5000",
            "close": "91,815.5000",
            "high": "95,956.5000",
            "low": "91,137.5000"
        },
        "market_summary": "### BTC/USD Market Briefing\n\n* **Key Drivers:** Institutional investments, such as **Harvard University**'s nearly **$442 million** stake in the **iShares Bitcoin Trust (IBIT)**, signal growing acceptance, but recent price slumps indicate **bearish** sentiment.\n* **Price Action:** Broke below the key level of **$89,600**, where the average cost basis for ETF inflows sits, showing **bearish momentum**. Currently trading near **$92,000**, down roughly **27%** from its all-time high of almost **$126,000**.\n* **Technical Outlook:** Immediate support is near the recent low of **$89,600**, with resistance at the psychological level of **$100,000**.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "Bitcoin ETF Investors Now in the Red After $89,600 Level Breaks - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/articles/2025-11-18/bitcoin-etf-investors-now-in-the-red-after-89-600-level-breaks",
                "body": "Bitcoin ETF Investors Now in the Red After $89,600 Level Breaks\nThe Bitcoin rally that welcomed a wave of new investors through easy-to-access ETFs has officially gone underwater.\nInvestors in US exchange-traded funds that offer direct access to the cryptocurrency are now sitting on collective losses. The average cost basis across all ETF inflows sits at approximately $89,600, according to Sean Rose at Glassnode — a level Bitcoin breached on Tuesday."
            },
            {
                "title": "Harvard now owns nearly half a billion dollars worth of Bitcoin, filings show - Fortune",
                "source": "Fortune",
                "url": "https://fortune.com/2025/11/17/harvard-owns-nearly-half-a-billion-dollars-worth-of-bitcoin/",
                "body": "Harvard is home to top intellectuals, famous alumni, and, more recently, a sizable hoard of Bitcoin. The university has more than $442 million dollars in the BlackRock-issued ETF called iShares Bitcoin Trust (IBIT), which provides exposure to the cryptocurrency in the form of stock, according to filings released on Friday with the Securities and Exchange Commission.\nIn 2025, major companies and institutions have lined up to invest in crypto, including those from Wall Street, Silicon Valley, and increasingly, the Ivy League. Brown University has also disclosed roughly $14 million in crypto ETF holdings.\nHarvard has more money in the Bitcoin ETF than it does in any other stock, including its stakes in mainstay companies like Nvidia, Microsoft, and Amazon. While half a billion dollars in IBIT is nothing to sneeze at, it accounts for less than 1% of the university’s nearly $57 billion endowment.\nHarvard did not respond to a request for comment about its decision to invest in Bitcoin.\nEric Balchunas, an analyst at Bloomberg Intelligence, posted on X on Friday that Harvard’s investment in IBIT was “as good a validation as an ETF can get.”\nThe fund Harvard invested in is one of the first spot crypto ETFs to launch in the U.S. When it went public in January 2024, it marked the end of a more than decade-long battle between the crypto sector and the SEC. It was also the first time that U.S. investors could invest in Bitcoin through their brokerage accounts, rather than through crypto exchanges.\nEven with a recent slump in Bitcoin prices, IBIT’s total market cap is well over $70 billion. Although Harvard’s $442 million stake in BlackRock’s Bitcoin ETF is yet another sign of crypto’s growing institutional acceptance, a year of wins for the industry hasn’t translated to a big price increase for Bitcoin. In the last year, Bitcoin has gone up less than 0.5%, a fraction of the S&P 500’s 13% rise during that time. Bitcoin shot up to its all-time high price of almost $126,000 last month but is down roughly 27% to less than $92,000."
            },
            {
                "title": "Harvard endowment triples exposure to BlackRock bitcoin ETF, becomes top holding - Pensions & Investments",
                "source": "Pensions & Investments",
                "url": "https://www.pionline.com/asset-management/exchange-traded-funds/pi-harvard-triples-exposure-blackrock-bitcoin-etf/",
                "body": "Harvard University more than tripled its investment in BlackRock’s bitcoin ETF, making it the largest publicly disclosed investment in its third quarter 13F filing.\nHarvard University more than tripled its investment in BlackRock’s bitcoin ETF, making it the largest publicly disclosed investment in its third quarter 13F filing.\nCalPERS’ board approved the adoption of a total portfolio approach, making it the first U.S. public pension fund to fully embrace the strategy."
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "265.0500",
            "open": "3,070.3500",
            "close": "3,002.6000",
            "high": "3,219.1500",
            "low": "2,954.1000"
        },
        "market_summary": "### ETH/USD Market Briefing\n\n* **Key Drivers:** Increased adoption of **DeFi** protocols and the expansion of **neobank-like services** are driving demand for **ETH**, while the **proof-of-stake transition** has created additional lockup mechanisms.\n* **Price Action:** The **ETH/USD** pair is experiencing **bullish momentum** as investors seek **yield-generating opportunities**, with **Aave's** new retail crypto yield app offering up to **6.5% annualized yield**.\n* **Technical Outlook:** Immediate support is near the **$1,800** level, with resistance at **$2,000**, as the **50-day moving average** continues to trend upwards.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Ethereum Holders Sell 3x Faster Than Bitcoin Investors, Says Glassnode - CoinMarketCap",
                "source": "CoinMarketCap",
                "url": "https://coinmarketcap.com/academy/article/ethereum-holders-sell-3x-faster-than-bitcoin-investors-says-glassnode",
                "body": "Every transaction involving stablecoins, token swaps on decentralized exchanges, or smart contract interactions demands payment in Ethereum.\nEthereum and Bitcoin News\nLong-term Ethereum holders are moving their coins at triple the rate of Bitcoin investors, revealing fundamental differences in how the two largest cryptocurrencies function within the digital asset ecosystem. Blockchain analytics provider Glassnode released findings showing Ethereum circulation patterns reflect its utility-driven nature compared to Bitcoin's store-of-value characteristics.\nNetwork activity for Ethereum stems from its role in powering thousands of decentralized applications that require Ethereum for gas fees. Every transaction involving stablecoins, token swaps on decentralized exchanges, or smart contract interactions demands payment in Ethereum. This constant operational need creates higher turnover compared to Bitcoin's primary function as a long-term investment asset.\nGlassnode characterized Bitcoin as behaving like the digital savings product it was designed to be, with coins largely hoarded and minimal turnover. Recent patterns show Bitcoin supply increasingly migrating into long-term storage solutions rather than remaining on exchanges. The cryptocurrency maintains its reputation as digital gold among investors seeking macro hedge positions.\nApproximately 25% of all Ethereum sits locked in native staking protocols or exchange-traded fund products, according to the report. Despite this significant illiquid portion, the remaining circulating supply moves through markets more actively than Bitcoin. Ethereum's proof-of-stake transition created additional lockup mechanisms while maintaining the network's transaction-intensive nature.\nSmart contract platform requirements distinguish Ethereum's usage patterns from Bitcoin's investment-focused approach. The network supports DeFi protocols, NFT marketplaces, and tokenized asset systems that collectively drive consistent demand beyond speculative trading. These applications require users to hold and spend Ethereum for network participation rather than passive storage.\nThe divergence reflects each blockchain's core design philosophy and practical application in crypto markets. Bitcoin's fixed supply and limited programmability support its macro hedge narrative, while Ethereum's flexible smart contract environment necessitates ongoing network activity. Market analysts suggest these distinct characteristics will continue to shape how investors interact with each cryptocurrency as institutional adoption expands across both assets."
            },
            {
                "title": "DeFi Lender Aave to Roll Out Retail Crypto Yield App on Apple’s App Store - CoinDesk",
                "source": "CoinDesk",
                "url": "https://www.coindesk.com/business/2025/11/17/defi-lender-aave-to-roll-out-retail-crypto-yield-app-on-apple-s-app-store",
                "body": "DeFi Lender Aave to Roll Out Retail Crypto Yield App on Apple’s App Store\nWith the Aave App, users will be able to earn over 5% annual yield on their deposits, higher than money market funds, the protocol said in a blog post.\nWhat to know:\n- Aave is offering a savings account-like app offering over 5% annualized yield, initially available on Apple's App Store.\n- The app allows deposits from bank accounts, debit cards or in stablecoins, with offering balance protection up to $1 million, the protocol said in a blog post.\n- Aave's move is part of a trend in decentralized finance (DeFi) protocols expanding to offer neobank-like services.\nAave\nWith the Aave App, users will be able to earn up to 6.5% annualized yield, higher than money market funds, leveraging Aave's infrastructure lending protocol, and can deposit funds from bank accounts, debit cards or in stablecoins, according to a blog post on Monday. It also offers \"balance protection\" on deposits up to $1 million.\nAave's move fits into a broader trend of decentralized finance (DeFi) crypto projects branching out to offer neobank-like products directly to consumers. Staking protocol\nRetail crypto yield platforms, which grew popular in the 2020-21 crypto bull cycle, suffered a big setback following the spectacular blowups of centralized lending platforms such as Celsius and Block.fi in 2022, portending a severe crypto winter.\nAave's expansion comes after acquiring last month San Francisco-based fintech company Stable Finance for developing a consumer savings app. Aave has gathered $70 billion in deposits and boasts 2.5 million in users, the blog post said.\nMore For You\nProtocol Research: GoPlus Security\nWhat to know:\n- As of October 2025, GoPlus has generated $4.7M in total revenue across its product lines. The GoPlus App is the primary revenue driver, contributing $2.5M (approx. 53%), followed by the SafeToken Protocol at $1.7M.\n- GoPlus Intelligence's Token Security API averaged 717 million monthly calls year-to-date in 2025 , with a peak of nearly 1 billion calls in February 2025. Total blockchain-level requests, including transaction simulations, averaged an additional 350 million per month.\n- Since its January 2025 launch , the $GPS token has registered over $5B in total spot volume and $10B in derivatives volume in 2025. Monthly spot volume peaked in March 2025 at over $1.1B , while derivatives volume peaked the same month at over $4B.\nDappRadar Shuts Down, Citing ‘Financially Unsustainable’ Market\nLaunched in 2018, the platform had grown into one of the most prominent analytics hubs for on-chain activity.\nWhat to know:\n- DappRadar, a once widely-used platform for tracking decentralized applications, announced via its X account on Monday that it will be shutting down.\n- Launched in 2018, the platform had grown into one of the most prominent analytics hubs for on-chain activity.\n- The team shared that running the platform became “financially unsustainable in the current environment.\""
            },
            {
                "title": "2025 On-Chain Movement Review Report: Making DeFi More DeFi - PANews",
                "source": "PANews",
                "url": "https://www.panewslab.com/en/articles/9dfa2030-4824-4813-b5dc-0ea4a735c7b4",
                "body": "Author: Zuo Ye\nWithin a month, the crypto market experienced two shocks, October 11th and November 3rd. Whether DeFi still has a future has become a common question. At this time, it is a good time to observe the current DeFi market structure and the direction of change.\nFrom a macro perspective, DeFi is rapidly shedding the \"second system effect,\" and the impact of stablecoins on traditional banks and the payment industry is becoming increasingly real, as evidenced by the Federal Reserve's attempt to provide streamlined master accounts. Institutional DeFi represented by Aave, Morpho, and Anchorage is changing the operating model of traditional finance, while Uniswap's plan to open its fee switch and the ongoing battle of Perp DEX represented by Hyperliquid continue.\nThe immaturity of DeFi lies in choosing a noble death for the sake of ideals. We are far from declaring DeFi fully mature and only needing large-scale adoption. Two dark clouds still linger in the sky of DeFi:\n- Who is the ultimate lender in the entire on-chain economic system? Morgan created the Federal Reserve, so what mechanism should assume a similar role in DeFi?\n- Beyond the endless repackaging of existing DEX/Lending/Stable products, how can truly original DeFi tracks or mechanisms be developed?\nPrice is the result of a game.\nBut, as long as you're connected to the internet, I'll be right beside you.\nWe are often blinded by the omnipresent nature of things. In the DeFi universe, all innovations to date have revolved around DEX, Lending, and Stablecoin. This is not to say that BTC/ETH are not mechanism innovations, nor that RWA/DAT/crypto-equity/insurance are not asset innovations.\nReferring to the six pillars of on-chain protocols, BTC and Bitcoin do not inherently require any other assets or protocols. The DeFi we are talking about refers to projects that occur on public chains such as Ethereum/Solana/L2. Referring to the leverage cycle of crypto, stocks and bonds, the cost of selling innovative assets is getting higher and higher, and the entire industry is pursuing products with real profitability, such as Hyperliquid.\nImage caption: The evolution of the DeFi paradigm. Image source: @zuoyeweb3\nSince the end of DeFi Summer, DeFi innovations have been continuous improvements on existing products, assets, and established facts. For example, trading is divided into three types: spot, Perp, and Meme, which correspond to AMM/CLOB/Bonding Curve during DeFi Summer. Even the most innovative Hyperliquid has many traces of Serum.\nFrom the most micro perspective, Pendle started with the earliest fixed-income products, then embraced yield-generating stablecoins such as LST/LRT and Ethena, and Euler and Fluid both chose to build their own lending + swap products. If users set yield strategies using YBS such as Ethena, it is theoretically possible to use DEX/Lending/Stablecoin simultaneously on any chain, any protocol, and any Vault.\nWhile this synergistic effect amplifies profits, it also \"creates\" numerous liquidation tragedies and trust crises. Beyond this, there are no-go zones everywhere. Blockchain is born free, yet it is shackled everywhere.\nDecentralization is a wonderful vision, but centralization is more efficient and less competitive. Centralization of protocols is even more problematic. Aave is certainly large and secure, but this also means that you have very few more and newer options, while newcomers like Morpho/Euler can only embrace insecure administrators and \"inferior\" assets.\nUnbanked sparked a rush for stablecoins in the Third World. While it cannot be said that Aave's prudence caused Morpho's crisis, unAaved did trigger a rush among on-chain users and the younger generation for subordinated bonds, subordinated protocols, and subordinated managers.\nInnovation can only happen among marginalized groups, where the cost of trial and error is too low. Those who survive will repeatedly disrupt the established order, and Aave V4 will become more like its "
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "14.4073",
            "open": "136.3186",
            "close": "130.4920",
            "high": "143.0542",
            "low": "128.6469"
        },
        "market_summary": "### SOL/USD Market Briefing\n\n* **Key Drivers:** The launch of the VanEck Solana Staking ETF is increasing **institutional investment** in SOL, potentially driving up demand and price.\n* **Price Action:** SOL is currently trading in the **$142-$145** range, with a potential breakout above **$150** targeting the **$185-$200** resistance cluster and a long-term target of **$300**.\n* **Technical Outlook:** The Relative Strength Index (RSI) is recovering from oversold levels, and the MACD is showing early signs of trend reversal, indicating potential **bullish momentum**.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Institutional Products and the Future of Crypto Payroll - OneSafe",
                "source": "OneSafe",
                "url": "https://www.onesafe.io/blog/impact-institutional-products-crypto-payroll-defi",
                "body": "Institutional products like the Solana Staking ETF are hitting the market and seem poised to change the game for cryptocurrencies. But what does that mean for decentralized finance (DeFi) and crypto payroll? It’s a mixed bag, to say the least. On one hand, they could make it easier to access and trade crypto; on the other, they could threaten the decentralization we know and love. Let’s dive into how these dynamics are playing out.\nThe New Kid on the Block: VanEck's Solana Staking ETF\nVanEck has officially launched a Solana (SOL) staking ETF in the US, and it’s making waves. This product gives traditional investors a way to dip their toes into SOL while also earning staking rewards. Honestly, it’s a big deal for both traditional finance and the crypto world.\nThis ETF tracks SOL's price and brings in passive income through Solana’s proof-of-stake mechanism. It's the first regulated fund in the US to offer staking returns, and it might just be the bridge between traditional investors and the high-yield opportunities in DeFi. It’s a step toward crypto becoming more mainstream, especially for those who want both growth and income.\nThe Flip Side: Risks to Decentralization\nHowever, there’s a catch. The rise of institutional products like this ETF could centralize power in the hands of a few validators, which goes against the very essence of what blockchain is all about. If these products delegate large amounts of stake to a handful of custodians or validators, we could see a concentration of power that undermines decentralization.\nAdditionally, this institutional influx may weaken decentralized governance. As big money flows into centralized staking products, the role of decentralized autonomous organizations (DAOs) and community governance might take a back seat. That could mean less input from individual stakers and community members in network decisions, slowing down innovation and responsiveness.\nCrypto Payroll: A New Avenue for Financial Inclusion\nNow, let’s talk about how this ETF could impact crypto payroll for fintech startups, especially in places like Asia and Europe. A regulated product like this one boosts liquidity and creates a better financial ecosystem around Solana, making it appealing for businesses considering crypto payroll.\nFintech startups can use the Solana Staking ETF to facilitate stablecoin payments for salaries. This streamlines operations and cuts costs. With institutional backing and regulatory clarity, they might find it easier to integrate Solana-based crypto payroll solutions, making the transition between fiat and crypto payroll smoother.\nThe ETF also marks a significant step toward merging crypto yield strategies with traditional finance, which could make companies more open to adopting these solutions. Employees and companies alike could benefit from the rise of both asset appreciation and staking income.\nMarket Changes: The Effect on User Behavior\nHowever, this could lead to less active participation in DeFi among crypto enthusiasts. Staking ETFs allow investors to earn rewards without the hassle of managing wallets or using DeFi platforms. For those who prioritize convenience and regulatory safety, this might be more attractive than direct involvement in DeFi.\nBut it’s worth noting that these ETFs might not replace active DeFi participation but rather complement it. Enthusiasts who value innovation and direct control may stick with DeFi, while ETFs could attract those who are more risk-averse or less technically inclined. This could ultimately broaden the investor base rather than cannibalize DeFi participation."
            },
            {
                "title": "SOL Strategies Selected as Staking Provider for VanEck Solana ETF - Newsfile",
                "source": "Newsfile",
                "url": "https://www.newsfilecorp.com/release/274737/SOL-Strategies-Selected-as-Staking-Provider-for-VanEck-Solana-ETF",
                "body": "SOL Strategies Selected as Staking Provider for VanEck Solana ETF\nNovember 17, 2025 8:45 AM EST | Source: SOL Strategies Inc.\nToronto, Ontario--(Newsfile Corp. - November 17, 2025) - SOL Strategies Inc. (CSE: HODL) (NASDAQ: STKE) (\"SOL Strategies\" or the \"Company\"), the first publicly traded company to combine a substantial Solana treasury with a revenue-generating validator operating business, today announced its selection as a staking provider for the VanEck Solana ETF through SOL Strategies' Orangefin validator.\nVanEck has been a longstanding supporter of the Solana ecosystem. The arrangement advances SOL Strategies' mission to bridge traditional finance with decentralized infrastructure.\n\"We're excited to work with VanEck, a firm that has consistently championed the Solana ecosystem,\" said Michael Hubbard, Interim CEO of SOL Strategies. \"This selection validates our infrastructure capabilities and highlights the institutional interest in compliant, high-performance Solana staking solutions. As we continue to scale our validator operations, arrangements like this reinforce our position as a trusted institutional gateway to the Solana ecosystem.\"\n\"VanEck has long recognized Solana's potential,\" said Kyle DaCruz, Director of Digital Assets Product at VanEck. \"SOL Strategies' proven track record in validator operations and institutional focus made them a natural choice for our Solana ETF staking requirements.\"\nSOL Strategies' selection builds on its track record of institutional arrangements, including its work with Tetra Trust and other leading financial institutions. The Company operates ISO 27001 and SOC 2 certified validators that currently secure over CAD$610 million in staked assets.\nAbout SOL Strategies\nSOL Strategies Inc. (CSE: HODL) (NASDAQ: STKE) is a Canadian investment company that operates at the forefront of blockchain innovation. Specializing in the Solana ecosystem, the company provides strategic investments and infrastructure solutions to enable the next generation of decentralized applications.\nTo learn more about SOL Strategies, please visit www.solstrategies.io. A copy of this news release and all the Company's related material documents regarding the Company may be obtained under the Company's SEDAR+ profile at www.sedarplus.ca and EDGAR at www.sec.gov.\nCompany Contact:\nDoug Harris\nChief Financial Officer\ndoug@solstrategies.io\nTel: 416-480-2488\nInvestor Contact:\nJohn Ragozzino, CFA\nsolstrategies@icrinc.com\n203.682.8284\nMedia Contact:\nsolstrategies@scrib3.co\nCautionary Note Regarding Forward-Looking Information\nNeither the Canadian Securities Exchange nor its Market Regulator (as that term is defined in the policies of the Canadian Securities Exchange) accepts responsibility for the adequacy or accuracy of this release.\nThis news release contains \"forward-looking information\" within the meaning of applicable securities laws. All statements other than statements of historical fact may be forward‐looking statements and information. More particularly and without limitation, this news release contains forward‐looking statements and information relating to the Company's or the Company's management team's expectations, hopes, beliefs, intentions or strategies regarding the future, and expectations regarding the characteristics, value drivers, and anticipated benefits of the Company's business plans and operations related thereto. Forward-looking information can also be identified by the use of forward-looking terminology such as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"does not anticipate\", or \"believes\", or variations of such words and phrases or indicates that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will be\" taken, \"occur\" or \"be achieved\".\nForward-looking statements in this news release include statements regarding the Company's staking arrangement with VanEck and the Company's validator"
            },
            {
                "title": "Solana Price Prediction: Investors Are Ditching XRP for SOL – Are Institutions Quietly Choosing Sides? - Coinspeaker",
                "source": "Coinspeaker",
                "url": "https://www.coinspeaker.com/solana-price-prediction-investors-ditching-xrp-for-sol/amp/",
                "body": "Anthony Bassili, president of Coinbase Asset Management, claims that crypto investors are heavily rooting for Bitcoin (BTC) and Ethereum (ETH), while Solana (SOL) is increasingly becoming the top contender for the third rank, leaving XRP behind.\nSpeaking at The Bridge conference in New York City, Bassili noted that while Solana is not yet universally accepted as the definitive “third asset”, it is clearly the one most institutions are evaluating.\nDespite posting impressive gains this year, XRP still lags behind in key metrics that matter most to institutions, particularly network velocity and active liquidity participation.\nAccording to Bassili, without strong signals of real-world usage, major investors are unlikely to elevate XRP into the top 3.\nSOL Price Analysis: $300 Target Next?\nAs per the chart below, Solana is cooling down after a brief corrective phase, with current price action focused around the $142–$145 range.\nSOL recently broke through a short-term descending trendline as well while buyers defended the lower support band shown in green.\nIf SOL breaks above $150, the next level to keep an eye on is the broader resistance cluster between $185 and $200.\nShould bulls clear this red zone decisively, the next target is the $300 region, a potential 110% surge from current levels.\nNotably, the Relative Strength Index (RSI) is recovering from oversold levels and the MACD is giving early signs of trend reversal.\nInvestors can expect SOL to turn volatile in the short term.\nPreference for SOL\nBassili said that institutions are not merely following narratives but they are following data.\nSolana’s expanding ecosystem activity, liquidity depth, and improving market structure make it lucrative while XRPL has yet to show similar strength.\nSolana Speed Meets Bitcoin Security as $HYPER Presale Explodes Past $27 Million\nWhile Solana prepares for a major breakout, Bitcoin Hyper ($HYPER) is bringing its speed and low fees to the world of Bitcoin.\nThis new Layer-2 solution uses the same powerful tech that powers Solana apps, allowing Bitcoin holders to send transactions in seconds, pay almost no fees, and access a whole new world of crypto apps.\nBitcoin Hyper keeps Bitcoin’s rock-solid security intact while solving its biggest problems, like slow speeds and limited utility.\nNow, users can trade, stake, earn yield, and even mint NFTs without leaving the Bitcoin ecosystem.\nSo far, $27.8 million has poured into the presale, and the current token price is just $0.01325. The next increase hits in a few hours.\nEarly buyers can also stake $HYPER for up to 41% annual rewards.\nTo grab $HYPER at its current price, just head to the official Bitcoin Hyper website and connect a wallet like Best Wallet.\nYou can complete the purchase in seconds using crypto already in your wallet or simply pay with a debit or credit card.\nnext"
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "862.250",
            "open": "47,151.770",
            "close": "46,645.400",
            "high": "47,310.370",
            "low": "46,448.120"
        },
        "market_summary": "### US30 Market Briefing\n\n* **Key Drivers:** Upcoming earnings reports from major companies such as **Nvidia**, **Home Depot**, and **Walmart**, along with the release of the delayed **September jobs report**, are expected to drive market movement. The **Federal Reserve's interest rate decision** on December 10 also looms, with **rate cut odds** plummeting due to concerns about the labor market and inflation.\n* **Price Action:** The **Dow Jones** is currently down by **0.15%** at **47,147.48**, after a choppy week that saw the index fall by **0.65%** on Friday. The **Nasdaq** edged up **0.13%** to **22,900.59**, while the **S&P 500** was little changed at **6,734.11**.\n* **Technical Outlook:** Immediate support for the **Dow Jones** is near the **50-day moving average** at **46,500**, with resistance at **48,000**. The **SPDR Dow Jones Industrial Average ETF (DIA)** has an average price target of **$533.67**, implying **13.16%** upside from current prices.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "Tech Futures Rise As Google Jumps; Nvidia Earnings Loom - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-google-stock-nvidia-earnings/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #45f696b2-c442-11f0-b4dd-e8edd37f87de"
            },
            {
                "title": "Dow Jones Today: DJIA Stalls ahead of Earnings Wave as Rate Cut Odds Tumble - TipRanks",
                "source": "TipRanks",
                "url": "https://www.tipranks.com/news/dow-jones-today-djia-stalls-ahead-of-earnings-wave-as-rate-cut-odds-tumble",
                "body": "The Dow Jones (DJIA) is muted on the day as investors prepare for a busy week of earnings from several companies in the index.\nMeet Your ETF AI Analyst\n- Discover how TipRanks' ETF AI Analyst can help you make smarter investment decisions\n- Explore ETFs TipRanks' users love and see what insights the ETF AI Analyst reveals about the ones you follow.\nHome Depot (HD), which is the fourth-largest component in the Dow Jones with a 4.73% weight, will kick things off, reporting its earnings on Tuesday before the market open. The next day, Nvidia (NVDA), with a 2.44% weight, will report its earnings after the close, followed by Walmart (WMT) with a 1.35% weight on Thursday.\nAnother key event this week is the September jobs report, which includes nonfarm payrolls and the unemployment rate, on Thursday at 8:30 a.m. Eastern Time. The data, delayed from the government shutdown, will provide a much-needed update on the state of the labor market ahead of the Fed interest rate decision on December 10. Data released by the private sector during the shutdown, such as Challenger, Gray & Christmas reporting October layoffs at a 22-year high, hinted at continued jobs weakness.\nThe odds of a 25 bps rate cut next month have plummeted during the past month after several Fed officials addressed concerns about the labor market and inflation. On Monday, Fed Vice Chair Philip Jefferson backed the Fed taking a “prudent approach” to monetary policy.\n“The evolving balance of risks underscores the need to proceed slowly as we approach the neutral rate,” Jefferson said. When rates are neutral, they neither boost nor hinder economic activity.\nThe Dow Jones is down by 0.15% at the time of writing.\nWhich Stocks are Moving the Dow Jones?\nLet’s pivot to TipRanks’ Dow Jones Heatmap, which illustrates the stocks that have contributed to the index’s price action.\nNvidia (NVDA) is in the red ahead of its earnings, shrugging off a positive note from DA Davidson. The firm reiterated its $250 price target and called for “overwhelming demand for AI compute.”\nMeanwhile, Johnson & Johnson (JNJ) is trading higher after the company announced it would acquire Halda Therapeutics for $3.05 billion in cash. The transaction is expected to close within the next few months.\nElsewhere, Boeing (BA) is flat after Ethiopian Airlines and Air Senegal announced an order of 11 737-8 jets and nine 737 MAX jets, respectively. Furthermore, Amazon (AMZN) is in negative territory after disclosing that it would seek to raise $12 billion through bond sales.\nDIA Stock Moves Lower with the Dow Jones\nThe SPDR Dow Jones Industrial Average ETF (DIA) is an exchange-traded fund designed to track the movement of the Dow Jones. As a result, DIA is falling alongside the Dow Jones today.\nWall Street believes that DIA stock has room to rise. During the past three months, analysts have issued an average DIA price target of $533.67, implying upside of 13.16% from current prices. The 31 holdings in DIA carry 29 buy ratings, two hold ratings, and zero sell ratings.\nStay ahead of macro events with our up-to-the-minute Economic Calendar — filter by impact, country, and more."
            },
            {
                "title": "Dow Jones, Nasdaq, S&P 500 weekly preview: Nvidia earnings loom after choppy week - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/news/stock-market-news/dow-jones-nasdaq-sp-500-weekly-preview-nvidia-earnings-loom-after-choppy-week-4361438",
                "body": "Asia stocks slide as AI caution dents tech; Japan battered by fiscal concerns\nInvesting.com -- The Nasdaq Composite steadied on Friday as buyers returned to major technology names a day after the sector dragged Wall Street to its sharpest decline in more than a month.\nThe Nasdaq edged up 0.13% to 22,900.59, ending a three-session slide. The S&P 500 was little changed at 6,734.11, slipping 0.05%, while the Dow Jones Industrial Average fell 0.65% to 47,147.48.\nAll three had clawed back steep early losses, with the Nasdaq and S&P 500 down as much as 1.9% and 1.4% intraday and the Dow off nearly 600 points.\nThursday’s selloff marked the worst day for the major indexes since early October. The Dow sank roughly 800 points, erasing the prior day’s advance above 48,000. The Nasdaq tumbled more than 2% as heavyweight tech stocks slumped.\nFor the week, the Nasdaq slipped 0.5%, while the S&P 500 and Dow eked out modest gains of 0.1% and 0.3%.\nGet more stock picks by Wall Street analysts by upgrading to InvestingPro - get 55% off today\nAttention now turns to a light earnings slate, including results from Nvidia, and a wave of delayed government data following the end of the record federal shutdown.\nWith the government reopened, the Bureau of Labor Statistics (BLS) said it will publish the long-overdue September jobs report on Thursday. A separate release on inflation-adjusted earnings is scheduled for Nov. 21.\nLabor data carries added weight as concerns grow around a cooling U.S. job market. Federal Reserve officials, operating without fresh numbers for weeks, have been split on whether sticky inflation or weakening employment poses the bigger threat.\n“The main event for this week will be Thursday’s employment report for September,” Deutsche Bank strategists said in a note.\n“We expect headline (+75k forecast vs. +22k previously) and private (+75k vs. +38k) payrolls to rebound in September, which should keep the unemployment rate unchanged at 4.3%,” they added.\nThe most recent labor data, released on Sept. 5, showed 22,000 jobs added in August and unemployment rising to 4.3%.\nThe September payrolls report was originally slated for Oct. 3, meaning next week’s release will still leave a gap in understanding current labor conditions.\nOther agencies are also preparing to clear backlogs. The Census Bureau plans to issue delayed figures on construction spending, trade and inventories early next week, while the Bureau of Economic Analysis has yet to set a new date for its postponed first estimate of third-quarter GDP.\nAdditional catch-up reports on retail sales, wholesale prices and trade flows could follow soon.\nVolatile market braces for Nvidia earnings\nVolatility in technology shares could stay elevated this week as investors brace for quarterly results from Nvidia, the world’s most valuable company and a central force behind Wall Street’s artificial intelligence trade.\nNvidia’s rapid growth in AI chips has made it a defining barometer for the theme that has powered a broad sweep of tech stocks, along with companies tied to the massive buildout needed to support AI adoption.\nThe stock has climbed roughly 1,000% since the debut of ChatGPT in late 2022, including a gain of more than 40% this year that propelled it past the $5 trillion valuation mark last month.\nThat scale gives Nvidia outsized influence over benchmark indexes. The shares account for about 8% of the S&P 500 and nearly 10% of the Nasdaq 100, making its post-earnings reaction a potential driver of market direction.\nWall Street expects another robust quarter. Analysts forecast fiscal third-quarter earnings per share rising 53.8% from a year earlier, with revenue projected at $54.8 billion, according to LSEG.\nBeyond Nvidia, investors will also parse results from major U.S. retailers in the coming days, including Walmart and Home Depot, for further signals on consumer spending and the health of the broader market.\nWhat analysts are saying about U.S. stocks\nMorgan Stanley: \"We raise ou"
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "103.120",
            "open": "9,696.420",
            "close": "9,632.220",
            "high": "9,713.170",
            "low": "9,610.050"
        },
        "market_summary": "ERROR: Could not connect to the AI service: Response ended prematurely",
        "source_articles": [
            {
                "title": "Lloyds (LON:LLOY) Updates Amid FTSE350 Movements and Banking Sector Shifts - Kalkine Media",
                "source": "Kalkine Media",
                "url": "https://kalkinemedia.com/uk/stocks/financial/lloyds-lonlloy-updates-amid-ftse350-movements-and-banking-sector-shifts",
                "body": "Lloyds (LON:LLOY) Updates Amid FTSE350 Movements and Banking Sector Shifts\nTo keep reading, please log in to your account, create a free account, or simply fill out the form below.\nTo keep reading, please log in to your account, create a free account, or simply fill out the form below.\nFrequently Asked Questions\nLloyds has acquired Curve, providing card consolidation, digital wallet functions, and mobile financial management tools.\nBranch closures continue while AI-powered digital tools support mobile banking, enhancing customer access and account management.\nRate stability affects lending structures, interest returns, and operational planning within the domestic banking sector.\nDisclaimer\nThe content, including but not limited to any articles, news, quotes, information, data, text, reports, ratings, opinions, images, photos, graphics, graphs, charts, animations and video (Content) is a service of Kalkine Media Limited, Company No. 12643132 (Kalkine Media, we or us) and is available for personal and non-commercial use only. Kalkine Media is an appointed representative of Kalkine Limited, who is authorized and regulated by the FCA (FRN: 579414). The non-personalised advice given by Kalkine Media through its Content does not in any way endorse or recommend individuals, investment products or services suitable for your personal financial situation. You should discuss your portfolios and the risk tolerance level appropriate for your personal financial situation, with a qualified financial planner and/or adviser. No liability is accepted by Kalkine Media or Kalkine Limited and/or any of its employees/officers, for any investment loss, or any other loss or detriment experienced by you for any investment decision, whether consequent to, or in any way related to this Content, the provision of which is a regulated activity. Kalkine Media does not intend to exclude any liability which is not permitted to be excluded under applicable law or regulation. Some of the Content on this website may be sponsored/non-sponsored, as applicable. However, on the date of publication of any such Content, none of the employees and/or associates of Kalkine Media hold positions in any of the stocks covered by Kalkine Media through its Content. The views expressed in the Content by the guests, if any, are their own and do not necessarily represent the views or opinions of Kalkine Media. Some of the images/music/video that may be used in the Content are copyright to their respective owner(s). Kalkine Media does not claim ownership of any of the pictures displayed/music or video used in the Content unless stated otherwise. The images/music/video that may be used in the Content are taken from various sources on the internet, including paid subscriptions or are believed to be in public domain. We have used reasonable efforts to accredit the source wherever it was indicated or was found to be necessary."
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "573.150",
            "open": "23,841.690",
            "close": "23,452.690",
            "high": "23,940.940",
            "low": "23,367.790"
        },
        "market_summary": "### GER40 Market Briefing\n\n* **Key Drivers:** The German blue-chip index **GER40** is being shaped by fresh regulatory changes at Deutsche Börse, an ongoing share buyback, and renewed warnings from the **European Central Bank (ECB)** about elevated financial-market risks.\n* **Price Action:** The index is struggling to breach the **24,000**-point mark, with recent trading showing a modest loss of roughly **0.3-0.5%** versus the previous close, and currently hovering around **23,888** points.\n* **Technical Outlook:** Immediate support is near the recent lows, with resistance at the **24,000** level, and the index carrying the footprint of last week’s **1.3%** rebound.\n\n---\n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "Deutsche Börse Today – DAX Stays Below 24,000 as New Rules, Buyback and ECB Warnings Shape Frankfurt (17 November 2025) - ts2.tech",
                "source": "ts2.tech",
                "url": "https://ts2.tech/en/deutsche-borse-today-dax-stays-below-24000-as-new-rules-buyback-and-ecb-warnings-shape-frankfurt-17-november-2025/",
                "body": "The German blue‑chip index DAX and the Frankfurt Stock Exchange started the new week on a cautious note. While trading opened with small gains, the market quickly slipped back under the psychologically important 24,000‑point mark as investors weighed fresh regulatory changes at Deutsche Börse, an ongoing share buyback, and renewed warnings from the European Central Bank (ECB) about elevated financial‑market risks. [1]\nDAX on 17 November 2025: Nervous but orderly trading in Frankfurt\nAt the opening bell in Frankfurt, the DAX edged up around 0.14% to roughly 23,910 points, staying just under the 24,000 threshold that has acted as a ceiling since late October. [2]\nAs the morning session progressed, the index drifted lower again, with real‑time estimates placing the DAX in the high‑23,700s to around 23,800 points, corresponding to a modest loss of roughly 0.3–0.5% versus Friday’s close. [3]\nMarket breadth was mixed:\n- Gainers included Siemens Energy, Airbus, Rheinmetall, Heidelberg Materials and MTU Aero Engines, each up around 1–2% in early action. [4]\n- Lagging stocks featured Siemens Healthineers, Bayer, Infineon, DHL and Siemens, which started the week in the red. [5]\nDespite today’s hesitation, the DAX still carries the footprint of last week’s rebound: it gained around 1.3% over the previous week, briefly pushing as high as about 24,441 points before doubts about further U.S. Federal Reserve rate cuts capped the move. [6]\nGermany’s performance is broadly aligned with the rest of Europe. The pan‑European STOXX 600 index was down roughly 0.2% in morning trade as investors reduced risk exposure across the continent. [7]\nWhy global macro is weighing on Deutsche Börse’s markets today\nWaiting for U.S. jobs data and Nvidia\nTraders in Frankfurt are largely reacting to a global picture dominated by two forces: delayed U.S. economic data after the government shutdown and the looming earnings report from AI chipmaker Nvidia, due mid‑week. [8]\nA weekly outlook published by Deutsche Börse’s own Frankfurt portal describes a “roller‑coaster of emotions” in markets:\n- Optimism after the end of the U.S. shutdown pushed risk appetite up.\n- That optimism quickly faded as Fed officials signalled that another rate cut in December is far from guaranteed and as concerns over a potential AI bubble resurfaced. [9]\nAnalysts quoted in the piece diverge on whether current AI valuations resemble the late‑1990s dot‑com mania. One camp warns of “run‑away” pricing in U.S. tech, while others argue that leading AI firms genuinely concentrate much of the future profit growth, making simple bubble analogies misleading. What they agree on:\n- DAX level – The index closed Friday at about 23,877 points and hovered around 23,888 on Monday morning, almost unchanged. [10]\n- Sentiment vs. fundamentals – German and European equities are seen as fundamentally sound but lacking the “glamour factor” of U.S. megacap tech, which limits international investor enthusiasm. [11]\nThe euro’s surprising “safe‑haven” twist\nAdding to the cross‑winds, the euro has strengthened sharply in 2025, gaining about 12% against the U.S. dollar and touching record highs versus the yen and a two‑year high versus the British pound. [12]\nA Reuters macro column notes that investors may be rotating away from richly valued U.S. tech stocks and rebalancing across the Atlantic at the same time as leadership changes loom at the Fed and ECB over the next two years. [13]\nFor export‑oriented German blue chips listed on Deutsche Börse Frankfurt and Xetra, a strong euro is a double‑edged sword:\n- It signals confidence in the euro area and lower inflation risks.\n- But it can pressure margins for exporters by making euro‑denominated goods more expensive abroad.\nECB: high valuations, non‑bank risks in focus\nSpeaking this morning at Frankfurt Euro Finance Week, ECB Vice‑President Luis de Guindos warned that euro‑area financial‑stability vulnerabilities “remain elevated,” even though inflation is now close to 2%"
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "626.880",
            "open": "25,065.670",
            "close": "24,829.460",
            "high": "25,284.920",
            "low": "24,658.040"
        },
        "market_summary": "### NDX100 Market Briefing\n\n* **Key Drivers:** Concerns over **stretched valuations** and **softening market breadth** in the tech sector, particularly ahead of **Nvidia's earnings**, are driving market sentiment. The **Federal Reserve's next moves** and the release of the **September jobs report** are also key factors.\n* **Price Action:** The **Nasdaq 100** has been under pressure, with **Nasdaq futures** dropping **0.6%**. The index is showing **bearish momentum**, with key support levels being closely watched.\n* **Technical Outlook:** Immediate support for **Nvidia** is near the **100-day SMA** at **$179.76**, with resistance at **$200**. A break below **$177** could increase the risk of a **deeper pullback**.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "Stock market today: Dow, S&P 500, Nasdaq futures rise after stock slide deepens ahead of Nvidia earnings, jobs data - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-slump-after-stock-slide-deepens-ahead-of-nvidia-earnings-jobs-data-012021297.html",
                "body": "Stock market today: Dow, S&P 500, Nasdaq futures slump after stock slide deepens ahead of Nvidia earnings, jobs data\nUS stock futures fell Tuesday morning following a tech-led slide ahead of a pivotal earnings report from Nvidia, and the release of government shutdown-delayed labor data later in the week.\nFutures tied to the Dow Jones Industrial Average (YM=F) fell 0.3% while contracts on the S&P 500 (ES=F) slid 0.5%. Nasdaq 100 futures (NQ=F) dropped 0.6%.\n(YM=F)\nThe overnight moves follow a bruising session for equities. The Dow tumbled more than 550 points, or 1.2%, while the S&P 500 (^GSPC) and Nasdaq Composite (^IXIC) each shed nearly 1% as selling pressure intensified across big tech.\nNvidia dropped about 2% ahead of its closely watched fiscal third-quarter results due Wednesday after the bell. The chip giant’s report lands at a moment when investors are rethinking the durability of this year’s AI-fueled market rally. Concerns over stretched valuations, softening market breadth, accelerating AI-related depreciation, and a surge in Big Tech debt issuance have all added fuel to the debate.\nBeyond Nvidia, investors will parse several key data points that could shape expectations for the Federal Reserve’s next moves. Rate-cut odds have been pared back significantly: Fed funds futures now price in about a 40% chance of a cut, down from over 90% a month ago. The Fed’s October meeting minutes arrive Wednesday, followed Thursday by the September jobs report, the first major economic reading since the government shutdown delays.\nEarnings from major retailers Walmart (WMT), Home Depot (HD), and Target (TGT) are set to hit this week, offering insight into consumer strength ahead of the holiday season."
            },
            {
                "title": "Nvidia (NVDA) Earnings Stats for Nasdaq 100 Traders - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-sg/news-and-analysis/nvidia-nvda-earnings-stats-for-nasdaq-100-traders/",
                "body": "Using TradingView’s earnings-surprise metrics, Nvidia has beaten expectations in 30 of its past 31 releases. The lone miss in November 2022 came just a month after the October 2022 market low — and the stock has since rallied roughly 1,800%.\nBut concerns around valuation remain front and centre. Investors increasingly argue that AI-hardware growth is fully priced in, while hyperscalers may be nearing a pause after massive capex cycles. Microsoft and Nvidia have poured vast sums into AI infrastructure, yet the rapid rise of cheaper and open-source AI alternatives is making it harder to justify Nvidia’s runaway multiple. If the market’s favourite momentum engine finally stumbles, it could trigger a wide-ranging de-risking across tech and the broader equity market.\nView related analysis:\n- Nasdaq 100 Lags Dow Jones: Divergent Signals Among Nvidia, Apple, Meta\n- The stats are working against bitcoin bulls today\n- ASX 200 Market Outlook: Tech Rout Deepens, Financials Slide, ANZ Reverses\n- ASX 200 Slides Further as Tech, Discretionary and Real Estate Crack\nNvidia (NVDA) Technical Outlook: Weekly Chart Signals Rising Downside Risk\nThe weekly chart shows a bearish engulfing candle forming around 200 two weeks ago, just beneath its all-time high. It was the most volatile week in six months, volume expanded during the prior two bearish weeks, and a clear bearish divergence appeared on the weekly RSI (14). The character of the longer-term uptrend has shifted, and traders should be alert to the risk of a deeper pullback. Nvidia now needs to keep beating earnings expectations and convince investors that meaningful growth is still attainable later in the cycle, despite rising scepticism and cheaper competitors entering the market.\nChart analysis by Matt Simpson - data source: TradingView Nvidia (NVDA)\nNvidia (NVDA) Earnings Trends: How NVDA Typically Trades Around Results\nThe chart highlights Nvidia’s price behaviour around earnings, using NYSE data from LSEG back to 2015. It’s immediately clear that Thursday delivers the strongest and most volatile returns in the days surrounding the release.\nRemember: T0 captures the period after Wednesday’s close and before Thursday’s open, as Nvidia reports after the bell on Wednesday.\n- Post-earnings (T+1) shows an average gain of 3.5% and a median gain of 2.9%. The tight gap between the median and average suggests returns are broadly consistent rather than skewed by a few outsized moves.\n- T+2 to T+4 also show average positive returns, but the moves are small enough to attribute to Nvidia’s broader long-term uptrend. Median returns are notably softer, with T+2 low and T+4 slipping to –0.5%.\n- Volatility peaks at T+1 (post earnings) with an average high-to-low range of 6.6% and median range of 4.3%\n- Volatility remains slightly elevated between T2 to T4\n- Nvidia has also tended to soften ahead of the event. The final trading day before earnings shows an average return of –0.3% and a median of –0.5%, indicating that a modest dip into the release is typical.\nChart analysis by Matt Simpson - data source: NYSE, LSEG\nNvidia (NVDA) Daily Technical Outlook: Key Support Levels Ahead of Earnings\nGiven Nvidia’s strong history of beating expectations and its tendency to rally post-earnings, it’s notable that the share price is still holding above key support. A bullish hammer formed around the 180 level, followed by a two-bar bullish reversal that established a higher low. The 100-day SMA (179.76) and a high-volume node (HVN) at 179.27 sit just beneath price, reinforcing this support cluster.\nUnless Nvidia breaks from its long-running trend with a weak result, the near-term bias favours a bounce. Bulls can justify a constructive stance while price holds above 177.76, with a retest of 200 in focus.\nHowever, with the weekly chart warning that a broader top may be forming, I’m also watching for a swing high. Whether that develops straight after earnings or later, a break below 177 increases the risk of a deeper pull"
            },
            {
                "title": "Stock market today: Dow, Nasdaq, S&P 500 wobble as investors look ahead to Nvidia earnings, jobs report - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-slide-as-sell-off-resumes-ahead-of-nvidia-earnings-jobs-data-181130773.html",
                "body": "US stocks saw a third day of losses on Monday amid doubts about interest rate cuts, as investors looked ahead to high-stakes Nvidia (NVDA) earnings and the delayed September jobs report.\nThe tech-heavy Nasdaq Composite (^IXIC) erased modest gains to fall over 0.8%, while the S&P 500 (^GSPC) dropped 0.9%. The Dow Jones Industrial Average (^DJI) also slipped around 1.2%, or more than 550 points.\nWall Street is already getting set for Nvidia's (NVDA) earnings on Wednesday, always an intensely scrutinized event. But the stakes are even higher this time amid doubts about Big Tech valuations and hefty AI spending. The chipmaker's results and outlook will test faith on Wall Street that earnings will continue to drive stock gains and that the tech sell-off is a blip. Shares fell nearly 2% on Monday as a filing showed that Thiel Macro, Palantir (PLTR) co-founder Peter Thiel's hedge fund, sold its stake in the AI chipmaker.\nA bright spot for tech came after Berkshire Hathaway (BRK-B) disclosed it has taken a nearly $5 billion stake in Alphabet (GOOG, GOOGL). The move — likely one of the last under Warren Buffett's leadership — is a rare tech bet by the conglomerate, one that markets will set against AI trade concerns. The Google parent's stock popped about 3%.\nMeanwhile, investors are hoping to get an official snapshot of the labor market with the long-awaited release of September's jobs report on Thursday. This week's delayed monthly picture of the US jobs market will come under high scrutiny, as the more cautious tone struck by Federal Reserve officials recently throws doubt on the central bank's rate move next month. Traders are now pricing in a 45% chance of a rate cut, compared with 62% a week ago.\nIn other earnings this week, investors will get fresh insight into consumer strength as retailers led by Walmart's (WMT) report. Home Depot (HD), Target (TGT), Lowe's (LOW), and Gap (GAP) are others on this week's docket.\nBitcoin (BTC-USD), meanwhile, is serving as a health check for the crypto market at large. Since its early October peak, the price of the cryptocurrency has dropped from a record high of over $126,000 to below $92,000 per token.\nLIVE COVERAGE IS OVER22 updates\nLaura Bratton\nStocks see third day of losses\nThe major US stock indexes posted losses for the third consecutive trading session on Monday, as Wall Street looked ahead to Nvidia's (NVDA) earnings and jobs data later this week amid doubts about the central bank's path to interest rate cuts.\nThe tech-heavy Nasdaq Composite (^IXIC) erased a slight gain to end the session down 0.8%, and the S&P 500 (^GSPC) shed 0.9%. The Dow Jones Industrial Average (^DJI) slipped around 1.2%.\nThe Financial, Energy, and Technology Sectors (XLF, XLE, XLK) led losses on Monday. Cryptocurrencies and Big Tech stocks — save for Alphabet (GOOGL), Broadcom (AVGO) and Tesla (TSLA) — ended the session on a downbeat note, with Nvidia leading the Mag 7 declines.\nInes Ferré\nStakes are high for Nvidia earnings this week\nWith stocks headed toward their third consecutive day of losses, crypto tumbling, and the VIX (^VIX), seen as a fear gauge, rising — a lot is riding on this week's earnings announcement from AI chip giant Nvidia (NVDA) when it reports on Wednesday after the bell.\n\"A positive surprise by NVIDIA and a recovery to new highs there, now down 12% from its all-time high, would re-energize the entire market,\" said Louis Navellier, founder of Navellier & Associates.\nNavellier pointed out that recent revelations of high-profile investors SoftBank and Peter Thiel's fund selling their positions in Nvidia have \"put a chill on the shares.\" There are concerns about circular finance agreements between OpenAI (OPAI.PVT), the creator of ChatGPT, and several tech companies.\n\"If Nvidia delivers strong beats and, more importantly, strong guidance, these concerns will be mitigated and the AI theme will be reaffirmed, leading the market higher,\" he said.\nAlphabet reaches all-time high as Berkshire buys sh"
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "142.740",
            "open": "6,745.580",
            "close": "6,678.990",
            "high": "6,783.240",
            "low": "6,640.500"
        },
        "market_summary": "### SPX500 Market Briefing\n\n* **Key Drivers:** None of the provided articles mention the SPX500 or any relevant financial news that could impact the index.\n* **Price Action:** No information available from the provided articles to analyze the current price action of the SPX500.\n* **Technical Outlook:** Without relevant data or news, it's impossible to provide a technical outlook for the SPX500 based on the given articles.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "Ely S. Parker becomes first Native American posthumously admitted to NY bar - CNN",
                "source": "CNN",
                "url": "https://www.cnn.com/2025/11/15/us/ely-s-parker-lawyer-ny-bar",
                "body": "Ely S. Parker, a Tonawanda Seneca from western New York, never took no for an answer.\nAt the start of the Civil War, Parker’s offer to enlist was rejected outright by another New Yorker, Secretary of State William H. Seward, who – according to historians – told the Seneca leader the war dividing America “was an affair between white men and one in which the Indian was not called on to act.”\n“Go home, cultivate your farm, and we will settle our own troubles among ourselves without any Indian aid,” Seward told Parker, who also unsuccessfully petitioned Congress to grant him US citizenship so he could enlist. Native Americans would not be made citizens until 1924.\nBut Parker had connections: He was a close friend of future Union Army Commander Ulysses S. Grant, who eventually intervened and endorsed his commission as captain. He would become a top aide to the Union Army’s most revered general.\nOn Friday, in a ceremonial courtroom in downtown Buffalo, supporters and direct descendants of Parker gathered for a celebration of his resiliency, with the New York Supreme Court Appellate Division, Fourth Department posthumously admitting him to the bar – 176 years after he had been denied because Native Americans were not considered US citizens.\n“The posthumous admission to the bar is fitting and deserving of a man who lived his life with integrity,” said C. Joseph Genetin-Pilawa, an associate professor of history at George Mason University who has written extensively about Parker. “He didn’t give up. He continued to fight for what he believed in.”\nParker is the first Native American posthumously admitted to the bar in US history, according to legal experts. The petition for admission was made on behalf of his great-great-great-grandniece, Melissa Parker Leonard, whose father, Alvin, often played the chief in historical reenactments. The effort dates to 2020, when former Texas appellate Justice John Browning, a law professor at Faulkner University, first approached Alvin Parker, who died in 2022.\n“Despite all the odds, all the adversity, the Seneca people still reside in western New York,” Parker Leonard, a 42-year-old educator and vice president of The Buffalo History Museum, told CNN.\n“It’s recognition not only for Ely, but for anyone who had a role in keeping us here … I really believe my relatives back then, 200 years ago, were desperately trying to maintain their land because they were thinking of us and the generations to come.”\n‘Weight of his community was on his shoulders’\nAt the Erie County Court Building on Friday, the bar admission ceremony opened with a recitation of the Thanksgiving address – an invocation within Indigenous Haudenosaunee communities that gives thanks to the earth and its abundance.\n“Yes, the day has come,” said Justice Gerald Whalen, presiding judge of the appellate division, calling the moment “the last steps on the long road to correcting a historic injustice.”\n“Despite his exclusion, Ely Parker served his community, his nation and this country in a manner that will serve as an inspiration to generations to come,” Whalen said.\nParker was born in 1828 on the Tonawanda Seneca Reservation in New York. His birth name was Ha-sa-no-an-da, which means “Leading Name,” according to the bar admission petition and other biographical information. During his formative years, in 1838, their ancestral land was taken from the Senecas through a treaty historians have called fraudulent.\nHe studied at a Baptist mission school, where he adopted the name of a minister named “Ely.” The petition said Parker excelled in debate and oratory in White schools. He learned to defend himself in more ways than one.\n“Once or twice I have been severely abused,” he once wrote in a letter to a friend, according to the Historical Society of the New York Courts. “But I returned blow for blow with savage ferocity. Whether I gained the upper hand of my antagonist I leave the public to decide. For mind you, these quarrels were public. Bad business"
            },
            {
                "title": "Michael Penix Jr.’s Injury Marks the End of a Grand Falcons Experiment - Sports Illustrated",
                "source": "Sports Illustrated",
                "url": "https://www.si.com/nfl/michael-penix-injury-falcons-grand-experiment",
                "body": "Michael Penix Jr.’s Injury Marks the End of a Grand Falcons Experiment\nWhat is most painful about the news of Michael Penix Jr.’s injury is the undercurrent of finality to a grand experiment. We can sit here and make fun of Falcons GM Terry Fontenot for a building process that felt a little more like a tech startup launch—sweeping hype, flashy objects, visions of the future we only read about in comic books (no Steve Ballmer dancing to the Rolling Stones, as far as I can tell)—but isn’t this what it’s all about? At 3–7, Atlanta’s season is not over, per se, but the idea that this team can be what we dreamt it could is starting to look like it is.\nThe Falcons are not just falling behind in the NFC South, but falling behind in the world the team created around drafting one outsized talent after another each of the past five years.\nA tight end, Kyle Pitts, over Ja’Marr Chase and Penei Sewell? Right now, it seems obvious but back then, we’d never seen a player at that position with such wingspan and grace. He looked like Mr. Fantastic.\nA running back, Bijan Robinson, over Jalen Carter or Christian Gonzalez? Well, sure, because when you already have Mr. Fantastic, you need the Human Torch as well.\nPenix, when you already have Kirk Cousins? Please don’t make me draw out this analogy because I’m running out of Fantastic Four characters. But you get the picture. We siphoned all these players to a coaching staff full of former Rams staffers, the kind of people who make superheroes come to life, and for a moment, it made sense to have your dessert first. To build a team outside-in. To believe that the flying car can, well, actually fly. We ignored Penix’s injury history (two torn ACLs in college) because we had to. We ignored the reality of a player built like Pitts because we wanted to. We ignored the highs and lows of possessing an outlier talent like Robinson because that’s what it’s like to hold the Hope Diamond in your hand. Half the time, you’re just worried about someone breaking it or enough people not looking at it.\nWe bring all this up because, as much as today is about Penix, it’s not just about him. It’s about the plan and the suspicions that we pushed away. It’s about what the Falcons could have been and what they gave up to get here. It’s about asking ourselves and the Falcons asking themselves, honestly, if they would do it all again, knowing the consequences.\nAtlanta will finish out the season with Kirk Cousins, who still appears to be in recovery from a season-ending Achilles injury that occurred in 2023 with the Vikings before he signed a four-year, $180 million deal in free agency with Atlanta. At 3–7, the 2026 first-round pick that the Falcons handed the Rams for the right to crawl back into the latter stages of the first round last year for James Pearce Jr. (an all-out defensive blitz to upgrade a unit that had struggled, in part, because the Falcons had leaned into building this next-gen offense) is now a top-10 pick—a disastrous proposition not just for Atlanta but for every other team in the NFL seeing a Super Bowl contender getting access to a potential premium player.\nWhen Penix returns to the field, what should it look like responsibly? Are the builders and theorists behind this roster still going to be there? Are the ones who inherit it buying into the idea that this is a superteam?\nThose are the conversations that need to be happening in Atlanta now, even though the Falcons, losers of five straight, including the past two in overtime, have a soft landing on the schedule with the Saints and the Jets coming up. Wins can only obscure that nagging, big-picture question for so long. Nothing but a seven-game heater that somehow propels Atlanta into the playoffs with wins over the Seahawks, Rams and Buccaneers in the process—seven games that give us at least some consistent glimpse of the Fantastic Four—will stop the hangover from creeping in.\nStill, there’s undoubtedly a part of every Falcons fan that would take t"
            },
            {
                "title": "Kris Jenner Says Robert Kardashian Sr.'s Family Was More Involved After She 'Finally' Welcomed a Son - People.com",
                "source": "People.com",
                "url": "https://people.com/kris-jenner-says-robert-kardashian-sr-family-more-involved-after-having-son-11851058",
                "body": "NEED TO KNOW\n- Kris Jenner is remembering how her late ex-husband Robert Kardashian Sr.'s family reacted to hearing she was finally expecting a boy\n- The mom of six said Kardashian Sr.'s Armenian side of the family was overjoyed to learn she was expecting a boy\n- Kris shares four of her kids — Kim, Khloé, Kourtney and Rob — with her late ex-husband\nKris Jenner is remembering how her late ex-husband Robert Kardashian Sr.'s family reacted when she finally welcomed a boy.\nThe Kardashian-Jenner matriarch, 70, appeared on an episode of Jay Shetty's On Purpose podcast on Monday, Nov. 17, and was asked to share one thing that each of her kids has taught her. When she spoke about her son, Rob, 38, Jenner remembered that Kardashian Sr.'s side of the family celebrated like it was \"New Year's Eve\" upon hearing she'd had a boy.\n\"Rob was just a joy, but he was the boy. You know, Robert Kardashian Sr. came from a big Armenian family, and they were praying for a boy from day one,\" said Jenner. \"So it was always, ‘I hope it’s the boy! I hope it’s the boy!’ And ‘It’s going to be Robert Jr.’ and blah blah blah.\"\nNever miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories.\nRelated Stories\nHowever, the mom of six — who had three girls before welcoming her son — joked that it was \"another girl\" after \"another girl.\"\n\"And so when Robert was born, it was like all the Armenians were rejoicing. My mother and father-in-law were so happy, and all their friends,\" remembered Jenner. \"And I remember she ran to the hospital with this beautiful diamond brooch that she gave me. It was so joyful, and it was like New Year’s Eve.\"\nJenner said it was \"really special\" to see Kardashian Sr.'s family's culture and experience how they celebrated having a boy in the family.\n\"Because suddenly when Robert was born, the Armenian side of my in-laws really kicked in over at my house,\" she explained. \"It’s like, ‘We’re going to make, you know, these Armenian meals,’ and trying to teach the kids to speak a little Armenian. Which, you know, didn’t go that far.\"\n\"But it was a lot of fun to learn about that and finally to have the boy that they had been hoping for all that time. And then, so that was joyful,\" she continued. \"He taught me a lot about what that meant and having probably what they considered more of the head of the family, because I had a son. And what that was like. That was just such a beautiful experience, to have a boy.\"\nKris shares her daughters Kim Kardashian, Khloé Kardashian and Kourtney Kardashian Barker and son Rob with late ex-husband Kardashian Sr. She is also mom to daughters Kendall Jenner and Kylie Jenner with ex Caitlin Jenner.\nBack in July, Rob called into sister Khloé Kardashian's podcast Khloé in Wonder Land and spoke about being a father to his 9-year-old daughter Dream, whom he shares with ex Blac Chyna. As he spoke about how he felt being a father has affected him, Rob noted that he once thought he'd have lots of kids.\n\"It's definitely changed me. It's definitely made me more grounded and I'm instead focusing my energy on other things,\" Rob said of fatherhood. \"I'm all about my daughter.\"\n\"I always thought I would have like five children and this and that so long ago,\" he continued. \"I couldn't even imagine handling five children.\"\n\"It's definitely given me a lot of responsibility cause you're taking care of another human,\" he said. \"There's so much that goes into it...it's definitely a lot, but I love it. I'm very lucky, Dream makes it very easy. She's very smart and she's a good kid. But it's still very hard.\""
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "1,000.000",
            "open": "50,370.900",
            "close": "49,790.190",
            "high": "50,470.900",
            "low": "49,470.900"
        },
        "market_summary": "### JPN225 Market Briefing\n\n* **Key Drivers:** Weakness in tech shares and concerns over the U.S. economic outlook are driving the Nikkei index lower, while a **weak yen** is supporting exporters' profits due to an expansionary fiscal policy under Prime Minister Sanae Takaichi.\n* **Price Action:** The Nikkei 225 index has dropped over **3%**, breaking below key psychological levels, and is nearing the **48,500** support level, showing significant **bearish** momentum.\n* **Technical Outlook:** Immediate support is near **48,500**, with resistance at **49,500**, and the 50-day moving average is also a key level to watch; if the price breaks these levels, **47,000** and **45,170** are the next downside levels of note.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "Nikkei index briefly falls over 2% on weak tech shares, U.S. economic woes - Japan Wire by KYODO NEWS",
                "source": "Japan Wire by KYODO NEWS",
                "url": "https://english.kyodonews.net/articles/-/65101",
                "body": "TOKYO - The Nikkei stock index dropped over 3 percent Tuesday afternoon, as heavyweight technology issues were sold following losses on Wall Street amid anxiety about the U.S. economic outlook.\nAt 1:19 p.m., the 225-issue Nikkei Stock Average was down 1,570 points, or 3.12 percent, from Monday at 48,753.27.\nThe Tokyo market was hit by selling of heavyweights SoftBank Group and Tokyo Electron.\nSemiconductor-linked shares also dragged down the Nikkei index, tracking overnight declines in their U.S. counterparts and amid profit-taking ahead of U.S. chip giant Nvidia Corp.'s earnings announcement slated for Wednesday.\nOn the currency market, the yen briefly moved around the 180 line against the euro, after reaching in New York overnight its weakest level since the single European currency was introduced in 1999."
            },
            {
                "title": "Takaichi trade fuels weak yen, giving Japan Inc. profit boost - Nikkei Asia",
                "source": "Nikkei Asia",
                "url": "https://asia.nikkei.com/business/markets/currencies/takaichi-trade-fuels-weak-yen-giving-japan-inc.-profit-boost",
                "body": "CurrenciesTakaichi trade fuels weak yen, giving Japan Inc. profit boost\nCurrency touches 9-month low against dollar, supporting exporters' bottom line\nThe yen has fallen faster against other currencies since Sanae Takaichi was elected as Japan's prime minister as she pushes for an expansionary fiscal policy.\nJADA NAGUMO, SHOTARO TANI and YUICHI SHIGA\nNovember 18, 2025 11:11 JST\nTOKYO -- The Japanese yen is declining rapidly against the dollar. While the currency's depreciation has led to speculation about the possibility of intervention in the foreign exchange market, it has also raised hopes among exporters for stronger earnings."
            },
            {
                "title": "Nikkei 225 Slides 3% as Yields Spike; USD/JPY Reverses Lower - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en/news-and-analysis/nikkei-225-slides-3pct-as-yields-spike-usd-jpy-reverses-lower/",
                "body": "- Nikkei down ~3% as Japanese yields surge\n- Yen firms, signalling carry unwind\n- Nikkei nearing key 48,500 support\n- USD/JPY pivoting around 155.05 for direction\nSummary\nWhether you want to pin it on the escalating spat with China over Taiwan, concerns over the fiscal outlook amid speculation about another sizeable stimulus package being considered by the new government, or simply the bearish price action seen on Wall Street to begin the week, it’s been a nasty Tuesday session for Japanese markets. The Nikkei is off around 3% as Japanese government bond yields rupture higher across the back end of the curve, as seen in the chart below. Even with the fiscal concerns, the Japanese yen has caught a bid, hinting the rout in risk may be prompting an unwind in carry positions.\nSource: TradingView\nNikkei Nears Key Levels\nSource: TradingView\nYou can see the Nikkei 225 contract is quickly closing in on 48,500, a level that acted as both support and resistance earlier this year. That’s the near-term focal point should the rout extend. If it does, it would bring the April uptrend into play, along with the 50-day moving average. The latter was ignored for long periods last year but still needs to be on the radar. If the price were to break those, 47,000 and 45,170 are the next downside levels of note. On the topside, 49,500 previously offered support, so it may flip to resistance should we see a squeeze. 51,500 is a more significant level found above.\nThe message from RSI (14) and MACD is one of shifting price momentum. The former is now trending lower beneath 50, indicating building downside strength. MACD remains in positive territory but has already crossed the signal line from above, producing a warning for bulls that directional risks may be turning lower.\nCarry Trade Unwinds Underpin Yen?\nSource: TradingView\nDespite concerns about Japan’s fiscal outlook given moves in long bond yields, USD/JPY has reversed its earlier gains that saw it briefly trade at levels not seen since February, leaving it marginally below the highs struck last week. Price action around 155.05 may prove instructive on where directional risks lie as we enter the European session, providing a level where setups could be built around.\nShould the unwind extend further, shorts could be set beneath 155.05 with a stop above. The October uptrend, 153.60 or 153.00 screen as potential targets. Given the coiling wedge pattern the price finds itself trading in, a break of wedge support may encourage other bears to join the move, potentially seeking a return to the October lows.\nAlternatively, should USD/JPY push back above 155.05, the option would be there to initiate longs with a stop beneath for protection, targeting either the session highs, uptrend resistance or 156.50 resistance.\nMomentum indicators continue to deliver bullish signals, with RSI (14) and MACD flatlining well above neutral territory. Topside strength isn’t building, but it’s not weakening either, favouring bullish setups. However, given elevated risk aversion, more emphasis should be placed on price action rather than retention of a set directional bias."
            }
        ]
    }
]