[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "61.480",
            "open": "4,977.020",
            "close": "4,996.110",
            "high": "5,022.160",
            "low": "4,960.680"
        },
        "market_summary": "### Gold (XAU/USD) Market Briefing\n* **Key Drivers:** U.S.-Iran tensions, PCE inflation data, Fed policy split.\n* **Price Action:** Trading near **$4,979**, consolidating in a **$150** range.\n* **Technical Outlook:** Bullish bias intact; resistance at **$5,000**, support at **$4,700**.\n\n---\n**Overall Sentiment:** Neutral ⚖️",
        "source_articles": [
            {
                "title": "Gold flat as investors weigh U.S.-Iran tensions, focus on inflation data - CNBC",
                "source": "CNBC",
                "url": "https://www.cnbc.com/2026/02/19/gold-advances-on-usiran-tensions-as-markets-weigh-fed-policy-path.html",
                "body": "Gold prices steadied on Thursday as investors assessed U.S.-Iran tensions, while a drop in U.S. jobless claims signalled labour-market stability ahead of inflation data later this week.\nSpot gold was unchanged at $4,979.18 per ounce. U.S. gold futures for April delivery settled 0.2% lower at $4,997.40.\n\"We're being whipsawed and moving sideways with volatility,\" said Daniel Pavilonis, senior market strategist at RJO Futures.\n\"Tensions with Iran are supporting gold, and while the broader outlook remains quite bullish, we could still see one more leg down driven by factors outside the Iran situation.\"\nU.S. President Donald Trump warned Iran that it must reach a deal over its nuclear program or \"bad things\" will happen, and appeared to set a 10-day deadline before the U.S. might take action.\nGeopolitical and economic flashpoints tend to work in gold's favour, as the yellow metal is traditionally viewed as a safe store of value.\nThe minutes from the Federal Reserve's January 27-28 meeting, released on Wednesday, showed policymakers were split on the monetary policy path ahead, with several open to hikes if inflation stays high, while others favoured cuts if price pressures ease.\nU.S. weekly jobless claims fell to 206,000 in the week to February 14, well below expectations for a reading of 225,000, reinforcing the strength signaled by last week's robust monthly employment report.\nInvestors are now awaiting the release on Friday of the U.S. Personal Consumption Expenditures Price Index, the Fed's preferred inflation gauge for further clues on the U.S. central bank's policy trajectory.\nMarkets currently expect this year's first U.S. interest rate cut to occur in June, according to CME Group's FedWatch Tool . Non-yielding gold tends to do well in an environment of low interest rates.\nSpot silver rose 0.6% to $77.66 per ounce after climbing more than 5% on Wednesday.\nSpot platinum fell 0.8% to $2,054.08 per ounce, while palladium lost 2.6% to $1,671.34."
            },
            {
                "title": "Gold Forecast: XAU/USD eyes next breakout on US GDP, PCE inflation data - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/analysis/gold-price-forecast-xau-usd-eyes-next-breakout-on-us-gdp-pce-inflation-data-202602200236",
                "body": "Gold Price Forecast: XAU/USD eyes next breakout on US GDP, PCE inflation data\n- Gold remains trapped in a range around $5,000 as US GDP, PCE inflation data loom.\n- The US Dollar consolidates weekly gains amid hawkish sentiment around the Fed, risk-off mood.\n- The daily technical setup of Gold suggests that the path of least resistance is upside.\nGold sticks to recent gains around the $5,000-mark early Friday, biding time before the high-impact US macro events. The focus is now on the US fourth-quarter (Q4) Gross Domestic Product (GDP), core Personal Consumption Expenditures (PCE) Price Index and the Supreme Court’s ruling on President Donald Trump’s tariffs.\nGold: All eyes on US data dump\nGold continues its struggle to extend the recovery from near the $4,850 region for the third straight day as persistent US Dollar (USD) strength outweighs safe-haven demand for the yellow metal amid looming geopolitical tensions between the US and Iran.\nThe Greenback is in a bullish consolidative phase, courtesy of the hawkish Minutes of the US Federal Reserve’s (Fed) January monetary policy meeting and a recent slew of upbeat economic data.\nData published by the Labor Department on Thursday showed that the US Initial Jobless Claims declined by 23,000 to 206,000 in the week ended February 14. The data fell by the most since November, adding to evidence of stabilization in the US labor market.\nMeanwhile, the Minutes on Wednesday suggested that the Fed remains in no rush to cut interest rates.\nAdditionally, concerns surrounding the disruptions led by Artificial Intelligence (AI) and the disappointing earnings report from Walmart tempered the recent market optimism, boosting the USD’s appeal as a safety net.\nHowever, Gold continues to find a floor amid renewed geopolitical tensions between the US and Iran, while untouched bets for three 25 basis points (bps) Fed rate cuts this year also remain supportive of the non-yielding bullion.\nAfter CBS News reported that a potential US military strike on Iran could come as early as Saturday, Trump warned late Thursday that Iran must make a deal, or “bad things will happen,\" with the threat of military strikes still hanging heavy over delicate nuclear negotiations, per BBC News. In response, Iran threatened a decisive response if attacked,\nWith geopolitical risks in play, the next big catalysts for Gold are the US GDP, PCE inflation and Supreme Court’s verdict on Trump’s tariffs.\nAlso, of note will be the global business PMI data, which significantly impact the broader market sentiment.\nThe US economy is expected to expand by 3% on an annualized basis in Q4 2025, against a 4.4% growth reported in the previous quarter. Meanwhile, the core PCE Price Index, the Fed’s preferred inflation gauge, is expected to rise by 2.9% in December after increasing by 2.8% in November.\nThe US data points will be crucial to reset the market’s pricing of the Fed rate cut bets, heavily influencing the USD’s performance and eventually the Gold price direction.\nGold price technical analysis: Daily chart\nThe 21-day Simple Moving Average (SMA) rises to $5,006.49 and caps the immediate recovery, while price holds above the ascending 50-day SMA at $4,703.94. The 100- and 200-day SMAs also climb and sit well below spot, reinforcing a broader bullish bias despite near-term hesitation. The 14-day Relative Strength Index stands at 54 (neutral), indicating momentum has cooled but remains slightly positive. Measured from the $5,597.89 high to the $4,401.99 low, the 50% Fibonacci (Fibo) Retracement at $4,999.94 acts as nearby resistance, with the 61.8% Fibo retracement at $5,141.05 overhead; a daily close above these hurdles could extend the advance.\nFailure to reclaim the short-term average would keep price contained beneath the 21-day SMA, leaving pullbacks to lean on dynamic trend support from the rising 50-day average around $4,700, where the 23.6% Fibo Retracement also lingers. A deeper setback would bring the 100-day SMA at $4,405.36 "
            },
            {
                "title": "Gold steady near $4,979 as U.S.-Iran tensions, PCE inflation data eyed - Nation Thailand",
                "source": "Nation Thailand",
                "url": "https://www.nationthailand.com/business/trading-investment/40062741",
                "body": "Global gold prices were steady overnight as investors weighed U.S.-Iran tensions and focused on inflation data. The gold market continued to move within a narrow range, waiting for other factors to guide direction.\nReuters reported that gold prices were little changed on Thursday (February 19, 2026) as investors assessed the heightened tensions between the United States and Iran. Meanwhile, lower U.S. initial jobless claims suggested stability in the labour market ahead of inflation data due later this week.\nSpot gold was unchanged at $4,979.18 per ounce at 1:31pm U.S. Eastern time (18:31 GMT). U.S. gold futures (April delivery) closed 0.2% lower at $4,997.40.\nA senior market strategist at RJO Futures said the market is being pulled in different directions and is moving in a tight range, though volatility remains high. He added that tensions with Iran are supporting gold prices, and while the broader outlook remains fairly positive, the market could still see another leg lower driven by other factors unrelated to Iran.\nU.S. President Donald Trump warned Iran it must reach a deal on its nuclear programme or “something bad” would happen, and he appeared to set a 10-day deadline before the United States takes some form of action.\nGeopolitical and economic risks often support gold, as it is viewed as a safe-haven asset for preserving value.\nFed cut expected in June\nMinutes from the U.S. Federal Reserve’s January 27–28 meeting, released on Wednesday, showed policymakers holding differing views on the direction of monetary policy. Some left the door open to raising rates if inflation remains high, while others supported rate cuts if price pressures ease.\nInvestors are now waiting for the U.S. Personal Consumption Expenditures (PCE) price index on Friday — the inflation gauge the Fed watches most closely — for further signals on the central bank’s policy path.\nMarkets currently expect the first U.S. interest rate cut of the year to occur in June, according to CME Group’s FedWatch tool. Gold, which offers no interest income, typically performs well when interest rates are low.\nSpot silver rose 0.6% to $77.66 per ounce, after surging more than 5% on Wednesday. Spot platinum slipped 0.8% to $2,054.08, while palladium fell 2.6% to $1,671.34."
            }
        ]
    },
    {
        "asset_name": "Silver",
        "symbol": "EIGHTCAP:XAGUSD",
        "status": "Success",
        "data": {
            "day_range": "3.027",
            "open": "77.300",
            "close": "78.496",
            "high": "79.464",
            "low": "76.437"
        },
        "market_summary": "### Silver (XAG/USD) Market Briefing\n* **Key Drivers:** Geopolitical tensions, Fed policy uncertainty, industrial demand concerns.\n* **Price Action:** Volatile swings, 5.2% surge Wednesday, now hovering near **$78**.\n* **Technical Outlook:** Tight trading range, whipsaw behavior, macro sensitivity.\n\n---\n**Overall Sentiment:** Mixed ⚖️  \n\n**Summary:** Silver trades near $78 amid geopolitical jitters, Fed indecision, and industrial demand worries, with Friday's PCE data as the next major catalyst.",
        "source_articles": [
            {
                "title": "Why are gold and silver prices rising now and will precious metals hit new highs or fall back? Gold and si - The Economic Times",
                "source": "The Economic Times",
                "url": "https://economictimes.indiatimes.com/news/international/us/why-are-gold-and-silver-prices-rising-now-and-will-precious-metals-hit-new-highs-or-fall-back-gold-and-silver-rise-analysts-insights-and-market-outlook-explained-heres-what-should-investors-do-now/articleshow/128554311.cms?from=mdr",
                "body": "Why are gold and silver prices rising now and will precious metals hit new highs or fall back? Gold and silver prices increased as investors reacted to global tensions, Federal Reserve policy outlook, and inflation expectations. Investors moved funds into precious metals to protect value during uncertainty. Gold prices crossed $5,000 per ounce, and silver prices also increased due to supply conditions and delivery demand. Federal Reserve interest rate decisions and inflation data influenced precious metals outlook. Investors monitored jobless claims, Personal Consumption Expenditures data, and global developments. These factors helped investors understand why are gold and silver prices rising now and will precious metals hit new highs or fall back.\nWhy are gold and silver prices rising now and will precious metals hit new highs or fall back?\nWhy are gold and silver prices rising now and will precious metals hit new highs or fall back? Gold and silver prices increased as investors reacted to global tensions, Federal Reserve policy outlook, inflation expectations, and interest rate signals. Investors shifted funds into precious metals to protect value during uncertainty. Gold prices rose above $5,000 per ounce, and silver prices increased due to supply levels and delivery demand. Precious metals outlook improved because investors expected interest rate cuts and continued global risks. Economic data and global developments will decide if gold and silver prices continue rising or reverse direction.\nWhy are gold and silver prices rising now?\nWhy are gold and silver prices rising now? Gold and silver prices are rising now due to tensions between the United States and Iran, which increased safe-haven demand. Investors bought precious metals to reduce risk during global uncertainty. Federal Reserve policy outlook also supported gold and silver prices as markets expected interest rate cuts. Lower interest rates increase demand for precious metals because they do not provide interest income. Silver prices also increased due to supply shortages and delivery demand. These factors explain why are gold and silver prices rising now and will precious metals hit new highs or fall back?\nGold and silver rise explained\nGold and silver prices increased as investors reacted to US Iran tensions, Federal Reserve policy outlook, inflation expectations, and interest rate signals. Precious metals outlook improved because investors moved funds into gold and silver prices during global uncertainty. Spot gold rose 0.7% to $5,012.83 per ounce. US gold futures increased 0.4% to $5,031.20. Spot silver prices rose 2.7% to $79.24 per ounce after rising over 5% earlier.\nGold and silver prices increased because investors reacted to tensions between the United States and Iran. Reports said military preparation discussions continued. The White House confirmed talks in Geneva showed progress but some issues remained unresolved. Investors often buy precious metals when global risks increase. This trend supports gold and silver prices and strengthens precious metals outlook.\nMarket analyst Jamie Dutta from Nemo.money said geopolitical risks increased interest in gold prices. Investors viewed gold and silver prices as protection during uncertain situations. This helped explain why are gold and silver prices rising now and will precious metals hit new highs or fall back?\nThe Federal Reserve released meeting minutes showing agreement to keep interest rates steady. Some officials supported rate increases if inflation rises. Others supported rate cuts if inflation declines. Investors tracked inflation data and jobless claims reports to understand Federal Reserve policy outlook.\nThe Personal Consumption Expenditures report and jobless claims data will provide signals about inflation and interest rate direction. According to the CME Group FedWatch Tool, markets expect an interest rate cut in June. Lower interest rates increase demand for gold and silver prices because precio"
            },
            {
                "title": "Silver’s Next Supercycle Or Just Another Trap? Is The ‘Poor Man’s Gold’ Hiding Massive Risk - AD HOC NEWS",
                "source": "AD HOC NEWS",
                "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/silver-s-next-supercycle-or-just-another-trap-is-the-poor-man-s/68594640",
                "body": "Silver’s Next Supercycle Or Just Another Trap? Is The ‘Poor Man’s Gold’ Hiding Massive Risk Right Now?\n20.02.2026 - 04:10:36Get the professional edge. Since 2005, the 'trading-notes' market letter has delivered reliable trading recommendations – three times a week, directly to your inbox. 100% free. 100% expert knowledge. Simply enter your email address and never miss a top opportunity again. Sign up for free now\nVibe Check: Silver is moving with serious attitude, but you need to know this: we are in SAFE MODE. That means no hard numbers, no exact prices. The latest public data cannot be fully timestamp-verified against 2026-02-20, so this breakdown focuses on the trend, not precise ticks. What we are seeing right now is a dynamic, emotionally charged market where Silver is swinging between energetic rallies and sharp pullbacks, with traders battling over whether this is the start of a multi-year breakout or just another fake-out spike.\nSilver Futures are showing a mix of defensive safe-haven demand and aggressive speculative flows. Price action has been volatile: quick upside surges followed by fast shakeouts, classic whipsaw behaviour that punishes late entries and oversized leverage. Bulls are pushing for a sustained breakout, while bears are leaning on macro headwinds like a still-firm US dollar and uncertainty around future Fed interest rate cuts.\nWant to see what people are saying? Check out real opinions here:\n- Watch in-depth YouTube breakdowns on today's Silver price action\n- Scroll Instagram Silver stacking inspiration and vault-flex culture\n- Binge viral TikTok clips on the next potential Silver Squeeze\nThe Story: Right now, Silver sits at the crossroads of three powerful forces: central bank policy, the green-energy revolution, and raw market sentiment.\n1. The Fed, Inflation, and the Macro Battlefield\nEvery Silver trader is secretly a macro analyst, whether they admit it or not. Silver moves with interest rates, inflation expectations, and the US dollar – and the Federal Reserve is the puppet master in the background.\nAfter the aggressive rate hiking cycle of the last years, the Fed under Jerome Powell has shifted into a more data-dependent stance. Inflation cooled from its hottest peaks but remains a constant risk. The market is stuck in a guessing game: will the Fed cut aggressively, slowly, or hold rates elevated for longer than everyone likes?\nHere is the key link to Silver:\nHigher rates and a strong dollar usually weigh on Silver because:\n- Non-yielding assets like Silver become less attractive compared to bonds or cash yielding solid interest.\n- A stronger USD makes Silver more expensive in other currencies, dampening global demand.\nRecent macro headlines have been dominated by:\n- Ongoing debates about the timing and speed of Fed rate cuts.\n- Mixed economic data – solid employment in some reports, softer growth in others.\n- Geopolitical hotspots that keep safe-haven demand alive.\n2. Geopolitics & Risk-Off Flows\nGeopolitical risk has not left the stage. Conflict zones, trade tensions, and election cycles in major economies are all feeding into a broader uncertainty premium. When headlines turn dark, traders and investors tend to rotate into precious metals. Gold usually gets the first call, but Silver, the so-called Poor Man's Gold, often follows with higher beta – more explosive moves up and down.\nThat means when fear spikes, Silver can experience energetic flights higher as capital looks for alternative stores of value. But the same beta works on the downside. When tensions cool or risk-on assets like tech stocks catch a bid again, Silver can be hit by profit-taking and fading safe-haven interest.\n3. The Industrial Backbone: Solar, EVs, and the Green Supertrend\nUnlike Gold, Silver is deeply embedded in modern industry. It is not just a shiny coin; it is a critical input in the global transition to cleaner energy and more electrified infrastructure.\nMajor pillars of structural Silver demand include:\n- Solar P"
            },
            {
                "title": "Silver price today: Spot silver edges up near $78 as U.S. inflation data looms - Bez Kabli",
                "source": "Bez Kabli",
                "url": "https://www.bez-kabli.pl/silver-price-today-spot-silver-edges-up-near-78-as-u-s-inflation-data-looms/",
                "body": "New York, February 19, 2026, 12:35 EST — Regular session.\n- Spot silver is trading higher by roughly 1%, hovering close to $78 an ounce during U.S. hours.\n- Friday’s PCE inflation numbers loom, and traders are already positioning for whatever shakeup the data brings to the rate outlook.\n- Geopolitics pull one way, while uncertainty over industrial demand tugs the other.\nSilver edged up Thursday, trading close to the $78 mark as U.S. markets opened. XAG/USD gained 0.99% to $77.95 per ounce by 12:20 p.m. EST, according to Investing.com, following a previous finish at $77.18. (Investing)\nThis small uptick carries weight, largely because the market’s focus has zeroed in on just one thing right now: U.S. inflation data. All eyes are on the Personal Consumption Expenditures (PCE) Price Index, set for release Feb. 20 as part of the monthly personal income and outlays report. (Bureau of Economic Analysis)\nThe dollar has kept its edge. Fresh numbers from the Labor Department show initial jobless claims dropped by 23,000 to a seasonally adjusted 206,000. The dollar index edged up 0.2% to 97.90. Rate futures, according to Reuters, still show less than a 50% probability of a Fed cut before June. “It doesn’t look like an economy suffering from higher rates,” said Joseph Trevisani, senior analyst at FXStreet in New York. (Reuters)\nRisk headlines didn’t scare off buyers. U.S. national security advisers gathered at the White House on Wednesday to talk Iran, with word that forces should be positioned in the region by mid-March. “We’re being whipsawed and moving sideways with volatility,” said Daniel Pavilonis, senior market strategist at RJO Futures. The Fed’s late-January minutes revealed a split—some policymakers see inflation possibly needing another hike, others see a path to cuts. Spot gold added 0.6%, landing at $5,007.46. (Reuters)\nSilver’s swings have been hard to ignore lately, even for this volatile market. Prices surged 5.2% Wednesday to $77.24, erasing the previous session’s more than 4% slide. Marex’s Edward Meir flagged “some nervousness” tied to geopolitical jitters, while independent trader Tai Wong summed up February’s action as “a very tight trading range.” (Reuters)\nIndustrial demand has been coming under renewed scrutiny. According to industry experts, solar panel makers—who use around 196 million troy ounces of silver annually, about 17% of all demand—have ramped up their push to swap out silver for copper after last year’s price gains started to squeeze margins. “Silver is the greatest contributor to the increased cost of manufacturing solar panels,” said Derek Schnee, a senior commercial solar consultant at JK Renewables. Heraeus analysts put the cost of silver paste, the conductive material in solar cells, at roughly 30% of the overall cost to make a cell. (Reuters)\nThe dollar may get a boost from solid U.S. data, but that same data can work against silver in a hurry. If the PCE figure comes in hot, traders might start bracing for higher rates—sending the greenback higher and knocking precious metals lower, silver included.\nTraders’ focus shifts to Friday’s PCE report, while Fed officials could weigh in further after minutes showed division over what comes next. Iran headlines are still unpredictable, and risk pricing reflects uncertainty tied to the mid-March U.S. forces deadline in the region."
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.880",
            "open": "70.465",
            "close": "72.128",
            "high": "72.245",
            "low": "70.365"
        },
        "market_summary": "### Spot Brent Crude Oil Market Briefing\n* **Key Drivers:** Escalating **US-Iran tensions** and Middle East military activity.\n* **Price Action:** Surged **2%** to **$71.66/barrel**, highest since **July 2025**.\n* **Technical Outlook:** Bullish momentum supported by geopolitical risks and tight supply.\n---\n**Overall Sentiment:** Positive 📈",
        "source_articles": [
            {
                "title": "Oil prices hit six-month high amid US-IRAN tensions and middle east military activity - Virginia Business",
                "source": "Virginia Business",
                "url": "https://virginiabusiness.com/oil-prices-six-month-high-us-iran-tensions/",
                "body": "Reuters //February 19, 2026//\nReuters //February 19, 2026//\nNEW YORK, Feb 19 (Reuters) – Oil prices rose around 2% on Thursday to settle at their highest level in six months, as traders worried about escalating tensions between the United States and Iran, which have stepped up military activity in the oil-producing Middle East.\nBrent crude futures settled up $1.31, or 1.9% at $71.66 a barrel, while U.S. West Texas Intermediate crude settled up $1.24, or 1.9% at $66.43.\nAfter advancing more than 4% on Wednesday, Brent closed at its highest since July 31, while WTI closed at its highest since August 1.\nOil prices got a boost from “geopolitical tensions and the worry that the U.S. is going to strike (Iran) in the near future,” said Andrew Lipow, president of consultancy Lipow Oil Associates. “The market will continue to rally in anticipation of something happening.”\nIran planned a joint naval exercise with Russia, Iran’s semi-official Fars news agency reported, days after it shut down the Strait of Hormuz for a few hours for military drills. The Strait is a vital link for trade, with about 20% of global oil supply passing through it.\nU.S. President Donald Trump warned Iran on Thursday that it must reach a deal over its nuclear program or “bad things” will happen, and appeared to set a 10-day deadline before the U.S. might take action.\nThe U.S. has deployed aircraft carriers, warships and jets to the region, with U.S. Vice President JD Vance saying Washington was considering whether it should continue diplomatic engagement with Tehran or pursue another option.\nIran issued a notice to airmen that it planned rocket launches in areas across the south of the country on Thursday, according to the U.S. Federal Aviation Administration website.\nSome countries have asked their residents to leave Iran.\nSeparately, crude oil exports from Saudi Arabia, the world’s largest oil exporter, fell to 6.988 million barrels per day, their lowest level since September, data from the Joint Organizations Data Initiative showed on Thursday. Earlier this month, Reuters reported that producer group OPEC and its allies were leaning toward a resumption of oil output increases from April.\nTwo days of peace talks in Geneva between Ukraine and Russia ended on Wednesday without a breakthrough, as Ukrainian President Volodymyr Zelenskiy accused Moscow of stalling U.S.-mediated efforts to end the four-year-old war.\nU.S. crude stocks dropped by 9 million barrels, as refining utilization and exports climbed. That was contrary to expectations in a Reuters poll that crude stocks would rise by 2.1 million barrels in the week ending February 13. Gasoline and distillate inventories also fell last week, thanks to higher consumer demand.\n“We had a build last week because of weather storms and so we are seeing a drawdown,” said Phil Flynn, senior analyst with Price Futures Group.\n“We have a solid market with solid demand and that should give (prices) support until the end of the day.”\n(Reporting by Siddharth Cavale in New York, Arathy Somasekhar in Houston, Enes Tunagur in London. Additional reporting by Yuka Obayashi and Emily Chow. Editing by David Gregorio and Joe Bavier, Kirsten Donovan, Rod Nickel)\ne"
            },
            {
                "title": "Middle East's Linseed Oil Market Poised for Steady Growth With a +3.3% CAGR in Value - IndexBox",
                "source": "IndexBox",
                "url": "https://www.indexbox.io/blog/linseed-oil-middle-east-market-overview-2024-5/",
                "body": "Middle East - Linseed Oil - Market Analysis, Forecast, Size, Trends and Insights\nGet instant access to more than 2 million reports, dashboards, and datasets on the IndexBox Platform.\nView PricingMiddle East's Linseed Oil Market Poised for Steady Growth With a +3.3% CAGR in Value\nIndexBox has just published a new report: Middle East - Linseed Oil - Market Analysis, Forecast, Size, Trends and Insights.\nThis article provides a comprehensive analysis of the linseed oil market in the Middle East. It details that consumption in 2024 was 11K tons (valued at $17M), showing recovery but remaining below 2013 peaks. Saudi Arabia is the leading consumer and importer. Regional production is in decline, led by Turkey, making imports crucial to meet demand. The market is forecast to grow to 13K tons ($24M) by 2035, with CAGRs of +1.5% in volume and +3.3% in value. The trade analysis highlights Saudi Arabia's massive import growth, primarily of crude linseed oil, and Turkey's role as a top exporter.\nKey Findings\n- Market forecast shows modest growth, with volume projected to reach 13K tons by 2035 at a +1.5% CAGR and value to hit $24M at a +3.3% CAGR\n- Saudi Arabia is the dominant consumer and importer, driving regional market growth with high consumption and import CAGRs\n- Regional production is in a deep, long-term decline, failing to meet consumption and leading to increased import dependency\n- Imports surged by 64% in 2024, with crude, non-chemically modified linseed oil constituting 84% of import volume\n- Significant price disparities exist, with import prices falling and export prices varying greatly by country and product type\nMarket Forecast\nDriven by rising demand for linseed oil in the Middle East, the market is expected to start an upward consumption trend over the next decade. The performance of the market is forecast to increase slightly, with an anticipated CAGR of +1.5% for the period from 2024 to 2035, which is projected to bring the market volume to 13K tons by the end of 2035.\nIn value terms, the market is forecast to increase with an anticipated CAGR of +3.3% for the period from 2024 to 2035, which is projected to bring the market value to $24M (in nominal wholesale prices) by the end of 2035.\nConsumption\nMiddle East's Consumption of Linseed Oil\nIn 2024, consumption of linseed oil increased by 15% to 11K tons, rising for the second year in a row after five years of decline. Overall, consumption, however, continues to indicate a deep slump. The volume of consumption peaked at 26K tons in 2013; however, from 2014 to 2024, consumption remained at a lower figure.\nThe revenue of the linseed oil market in the Middle East skyrocketed to $17M in 2024, increasing by 26% against the previous year. This figure reflects the total revenues of producers and importers (excluding logistics costs, retail marketing costs, and retailers' margins, which will be included in the final consumer price). In general, consumption, however, saw a deep downturn. The level of consumption peaked at $33M in 2013; however, from 2014 to 2024, consumption remained at a lower figure.\nConsumption By Country\nThe countries with the highest volumes of consumption in 2024 were Saudi Arabia (4.2K tons), Turkey (2.8K tons) and Israel (1.2K tons), together accounting for 74% of total consumption.\nFrom 2013 to 2024, the biggest increases were recorded for Saudi Arabia (with a CAGR of +16.4%), while consumption for the other leaders experienced more modest paces of growth.\nIn value terms, Saudi Arabia ($6.3M), Turkey ($4.3M) and the United Arab Emirates ($1.9M) appeared to be the countries with the highest levels of market value in 2024, together comprising 74% of the total market.\nAmong the main consuming countries, Saudi Arabia, with a CAGR of +18.3%, saw the highest rates of growth with regard to market size over the period under review, while market for the other leaders experienced more modest paces of growth.\nThe countries with the highest levels of linseed oil p"
            },
            {
                "title": "US crude oil inventories down by 2.1% for week ending Feb. 13 - Anadolu Ajansı",
                "source": "Anadolu Ajansı",
                "url": "https://www.aa.com.tr/en/energy/oil/us-crude-oil-inventories-down-by-21-for-week-ending-feb-13/54826",
                "body": "US commercial crude oil inventories decreased by 2.1% during the week ending Feb. 13, according to data released by the Energy Information Administration (EIA) late Thursday.\nInventories fell by around 9 million barrels to 419.8 million barrels. Market expectations had pointed to an increase of about 1.7 million barrels.\nStrategic petroleum reserves, which are excluded from commercial crude stocks, increased by 200,000 barrels to 415.4 million barrels, the data revealed.\nOver the same period, gasoline inventories decreased by around 3.2 million barrels to 255.8 million barrels.\n- Crude production increases\nEIA data showed that US crude oil production rose by 22,000 barrels per day (bpd) to about 13.74 million bpd during the week ending Feb. 13.\nUS crude oil imports fell by 281,000 bpd to approximately 6.5 million bpd, while exports increased by around 851,000 bpd to around 4.59 million bpd over the same period.\nIn the Short-Term Energy Outlook (STEO) released on Feb. 10, the EIA predicted that crude oil output in the country would reach an average of 13.6 million bpd in 2026.\nBy Firdevs Yuksel\nAnadolu Agency\nenergy@aa.com.tr"
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "2.080",
            "open": "65.009",
            "close": "66.789",
            "high": "66.949",
            "low": "64.869"
        },
        "market_summary": "### Spot WTI Crude Oil Market Briefing\n* **Key Drivers:** US crude oil inventories fell by **9 million barrels** (2.1%), exceeding market expectations of a 1.7 million barrel increase.\n* **Price Action:** WTI traded up $1.37 (+2.10%) at **$66.56** per barrel; Brent rose $1.40 (+1.99%) to **$71.78**.\n* **Inventory Trends:** Gasoline inventories dropped 3.2 million barrels; distillate inventories fell 4.6 million barrels.\n* **Production & Demand:** US crude production increased to 13.74 million bpd; total products supplied rose 4.1% YoY to 21.2 million bpd.\n---\n**Overall Sentiment:** Positive 📈",
        "source_articles": [
            {
                "title": "US crude oil inventories down by 2.1% for week ending Feb. 13 - Anadolu Ajansı",
                "source": "Anadolu Ajansı",
                "url": "https://www.aa.com.tr/en/energy/oil/us-crude-oil-inventories-down-by-21-for-week-ending-feb-13/54826",
                "body": "US commercial crude oil inventories decreased by 2.1% during the week ending Feb. 13, according to data released by the Energy Information Administration (EIA) late Thursday.\nInventories fell by around 9 million barrels to 419.8 million barrels. Market expectations had pointed to an increase of about 1.7 million barrels.\nStrategic petroleum reserves, which are excluded from commercial crude stocks, increased by 200,000 barrels to 415.4 million barrels, the data revealed.\nOver the same period, gasoline inventories decreased by around 3.2 million barrels to 255.8 million barrels.\n- Crude production increases\nEIA data showed that US crude oil production rose by 22,000 barrels per day (bpd) to about 13.74 million bpd during the week ending Feb. 13.\nUS crude oil imports fell by 281,000 bpd to approximately 6.5 million bpd, while exports increased by around 851,000 bpd to around 4.59 million bpd over the same period.\nIn the Short-Term Energy Outlook (STEO) released on Feb. 10, the EIA predicted that crude oil output in the country would reach an average of 13.6 million bpd in 2026.\nBy Firdevs Yuksel\nAnadolu Agency\nenergy@aa.com.tr"
            },
            {
                "title": "EIA US Crude Oil Inventories Slump As Demand Rises - Crude Oil Prices Today | OilPrice.com",
                "source": "Crude Oil Prices Today | OilPrice.com",
                "url": "https://oilprice.com/Energy/Crude-Oil/EIA-US-Crude-Oil-Inventories-Slump-As-Demand-Rises.html",
                "body": "Crude oil inventories in the United States decreased by 9 million barrels during the week ending February 13, according to new data from the U.S. Energy Information Administration (EIA) released on Thursday. The decrease brings commercial stockpiles to 419.8 million barrels according to government data, which is 5% below the five-year average for this time of year.\nThe EIA’s data release follows API’s figures that were released a day earlier, which reported that crude oil inventories fell by 609,000 barrels in the period.\nCrude prices were trading up on Thursday morning. At 10:00 a.m. in New York, Brent was trading at $71.78 per barrel—up $1.40 (+1.99%) on the day. This is up nearly $2 per barrel week over week. WTI was also trading up, by $1.37 per barrel (+2.10%) in morning trade at $66.56 per barrel.\nFor total motor gasoline, the EIA reported that inventories had decreased by 3.2 million barrels after gaining 1.2 million barrels in the week prior. The most recent figures showed average daily gasoline production increased to 9.4 million barrels. For middle distillates, inventories decreased by 4.6 million barrels with production increasing by 28,000 barrels daily to an average of 4.9 million barrels daily.\nTotal products supplied—a proxy for U.S. oil demand—rose to 21.2 million barrels per day over the last four weeks, up 4.1% compared to the same period last year. Gasoline demand averaged 8.5 million barrels per day over the last four weeks, while the distillate four-week average supplied averaged 4.4 million barrels—up 2.5% percent year over year.\nBy Julianne Geiger for Oilprice.com\nMore Top Reads From Oilprice.com\n- Tony Blair Think Tank Calls For North Sea Oil Revival\n- Venezuela Oil Revenue Projected to Hit $5 Billion Under U.S. Control\n- Indian Scrapyards Welcome Growing Number of Dark Fleet Tankers"
            },
            {
                "title": "EIA: US crude oil inventories down by 9M barrels - breakingthenews.net",
                "source": "breakingthenews.net",
                "url": "https://breakingthenews.net/Article/EIA:-US-crude-oil-inventories-down-by-9M-barrels/65709845",
                "body": "Breaking The News\nDownload our app\nPlay Store\nApp Store\nHome\nMarkets\nEconomy\nBusiness\nPolitics\nWorld\nWar/Terrorism\nTechnology\nCrypto\nSports\nInsights\nHome\nMarkets\nEconomy\nBusiness\nPolitics\nWorld\nWar/Terrorism\nTechnology\nCrypto\nSports\nInsights\nDownload our app\nPlay Store\nApp Store\nHome\nMarkets\nEconomy\nBusiness\nPolitics\nWorld\nWar/Terrorism\nTechnology\nCrypto\nSports\nInsights\nThis website uses cookies to ensure you get the best experience. Our\nTerms of Use\nand\nData Protection Policy\nexplain the data we collect, why we collect them, and how we may share them.\nI Accept"
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0065",
            "open": "1.1782",
            "close": "1.1770",
            "high": "1.1807",
            "low": "1.1742"
        },
        "market_summary": "### EUR/USD Market Briefing  \n* **Key Drivers:** Fed's hawkish stance, ECB rate cut expectations, geopolitical tensions.  \n* **Price Action:** Trading near **1.1700s**, vulnerable below **1.1780-1.1770** confluence.  \n* **Technical Outlook:** Bears retain control; support at **1.1770**, resistance at **1.1800**.  \n---  \n**Overall Sentiment:** Bearish 📉  \n\n### Technical Analysis  \n- **Critical Levels:**  \n  - **Resistance:** 1.1800 (psychological barrier + 50-day EMA).  \n  - **Support:** 1.1770 (200-period SMA + 61.8% Fibonacci retracement).  \n- **Momentum Indicators:**  \n  - RSI at 29 (oversold), suggesting potential corrective bounce.  \n  - MACD below signal line, easing downside momentum.  \n- **Key Confluence:** 1.1780-1.1770 zone acts as pivotal point for trend direction.  \n\n### Fundamental Drivers  \n- **Fed Policy:** Hawkish comments and resilient labor data support USD strength.  \n- **ECB Policy:** Rate cut bets undermine EUR, adding downside pressure.  \n- **Economic Data:** Flash PMIs, US GDP, and PCE data are key catalysts.  \n\n### Market Context  \n- **Geopolitical Risks:** Rising tensions bolster safe-haven USD demand.  \n- **Relative Growth:** US growth revisions and Eurozone resilience influence pair dynamics.  \n\n### Risk Events  \n- **Flash PMIs:** Eurozone and US data may drive short-term volatility.  \n- **US GDP & PCE:** Advance Q4 GDP and inflation data critical for directional bias.  \n\n**Conclusion:** EUR/USD remains vulnerable below 1.1780-1.1770, with bearish momentum intact. A break above 1.1800 could signal a shift, but failure to reclaim this level leaves sellers in control.",
        "source_articles": [
            {
                "title": "EUR/USD Forecast: Seems vulnerable below 1.1780-1.1770 confluence - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/eur-usd-price-forecast-bears-retain-control-below-11780-11770-confluence-breakpoint-202602200419",
                "body": "EUR/USD Price Forecast: Bears retain control below 1.1780-1.1770 confluence breakpoint\n- EUR/USD sticks to its bearish bias on Friday amid a broadly firmer US Dollar.\n- Traders eye flash PMIs for some impetus ahead of the US GDP and PCE data.\n- The technical setup favors bears and backs the case for further depreciation.\nThe EUR/USD pair remains on the back foot through the Asian session on Friday and currently trades just above mid-1.1700s, well within striking distance of a nearly one-month low set the previous day.\nThe incoming US macro data pointed to a remarkably resilient labor market. Adding to this, the January FOMC meeting Minutes and hawkish comments from Federal Reserve (Fed) officials forced investors to pare their bets for more aggressive policy easing. This, along with rising geopolitical tensions, assists the safe-haven US Dollar (USD) in preserving its recent strong gains to the highest level since January 23, which, in turn, continues to weigh on the EUR/USD pair.\nFurthermore, reviving bets for an interest rate cut by the European Central Bank (ECB) undermines the shared currency and seems to exert additional pressure on the EUR/USD pair. Traders now look forward to the release of the flash PMIs from the Eurozone and the US for short-term opportunities. The focus, however, will remain glued to the Advance US Q4 GDP report and the US Personal Consumption Expenditure (PCE) Price Index for a fresh directional impetus.\nFrom a technical perspective, the EUR/USD pair now seems to have found acceptance below the 1.1780-1.1770 confluence and seems vulnerable to slide further. The said area comprises the 200-period Simple Moving Average (SMA) on the 4-hour chart and the 61.8% Fibonacci retracement level of a strong move up from the January swing low. This should act as a key pivotal point and keep a lid on any attempted recovery amid the underlying USD bullish tone.\nMeanwhile, the Moving Average Convergence Divergence (MACD) line stays below the Signal line and under the zero mark, with a narrowing negative histogram that suggests easing downside momentum. The Relative Strength Index (RSI) stands at 29 (oversold). The short-term bias remains fragile, though an oversold RSI and stabilizing MACD would favor a corrective bounce if momentum improves. A recovery could target the 50% retracement at 1.1828.\nFurthermore, acceptance above the latter would brighten the tone, while failure to reclaim it would leave sellers in control of the pullback.\n(The technical analysis of this story was written with the help of an AI tool.)\nEUR/USD 4-hour chart\nEconomic Indicator\nHCOB Composite PMI\nThe Composite Purchasing Managers’ Index (PMI), released on a monthly basis by S&P Global and Hamburg Commercial Bank (HCOB), is a leading indicator gauging private-business activity in the Eurozone for both the manufacturing and services sectors. The data is derived from surveys to senior executives. Each response is weighted according to the size of the company and its contribution to total manufacturing or services output accounted for by the sub-sector to which that company belongs. Survey responses reflect the change, if any, in the current month compared to the previous month and can anticipate changing trends in official data series such as Gross Domestic Product (GDP), industrial production, employment and inflation. The index varies between 0 and 100, with levels of 50.0 signaling no change over the previous month. A reading above 50 indicates that the private economy is generally expanding, a bullish sign for the Euro (EUR). Meanwhile, a reading below 50 signals that activity is generally declining, which is seen as bearish for EUR.\nRead more.Next release: Fri Feb 20, 2026 09:00 (Prel)\nFrequency: Monthly\nConsensus: 51.5\nPrevious: 51.3\nSource: S&P Global\nAuthor\nHaresh Menghani\nFXStreet\nHaresh Menghani is a detail-oriented professional with 10+ years of extensive experience in analysing the global financial markets."
            },
            {
                "title": "EUR/USD Forecast: Bulls Confront the Critical 1.1800 Barrier Above the 50-Day EMA - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/news/feed/cf587-eur-usd-forecast-1800-barrier-ema",
                "body": "EUR/USD Forecast: Bulls Confront the Critical 1.1800 Barrier Above the 50-Day EMA\nShare:\nBitcoinWorld\nEUR/USD Forecast: Bulls Confront the Critical 1.1800 Barrier Above the 50-Day EMA\nIn the European trading session today, the EUR/USD currency pair presents a compelling technical narrative as it tests the significant 1.1800 psychological barrier. This movement occurs while the pair maintains a position above its 50-day Exponential Moving Average (EMA), a key medium-term trend indicator closely monitored by institutional and retail traders globally. The interaction between this price level and the moving average often signals potential directional shifts, making the current setup crucial for short-term forex market analysis.\nEUR/USD Forecast: Decoding the 1.1800 Technical Battlefield\nThe 1.1800 level represents more than just a round number. Historically, it has acted as a robust support and resistance zone throughout 2024. Market analysts frequently reference the Q3 2024 trading range, where 1.1800 capped multiple rally attempts. Consequently, a sustained break above this barrier could signal a shift in underlying sentiment. The pair’s current posture just above the 50-day EMA, currently situated near 1.1770, adds another layer of technical significance. This moving average smooths out price data and helps identify the trend’s direction. Trading above it generally suggests a neutral-to-bullish medium-term bias, but the proximity to both indicators creates a convergence zone of high importance.\nSeveral technical tools confirm the critical nature of this juncture. For instance, the Relative Strength Index (RSI) on the daily chart has recently rebounded from near-oversold territory, indicating waning selling pressure. Meanwhile, trading volume profiles from major exchanges show increased activity around the 1.1790-1.1810 range. This activity suggests concentrated interest from market participants. Furthermore, order book data often reveals large limit sell orders clustered at the 1.1800 handle, representing a clear technical hurdle for bullish momentum.\nFundamental Drivers and Macroeconomic Context\nTechnical analysis does not exist in a vacuum. The price action unfolds against a complex macroeconomic backdrop. Primarily, divergent monetary policy expectations between the European Central Bank (ECB) and the Federal Reserve drive fundamental flows. Recent ECB communications have emphasized a data-dependent approach, with policymakers signaling caution despite easing inflationary pressures in the Eurozone. Conversely, the Federal Reserve’s latest minutes revealed ongoing debates about the terminal rate, contributing to US Dollar volatility.\nKey economic data releases directly influence the pair’s trajectory. The upcoming US Core PCE Price Index, the Fed’s preferred inflation gauge, and the Eurozone’s preliminary CPI flash estimate will provide fresh catalysts. Additionally, relative economic growth matters. Recent GDP revisions showed the US economy expanding at a slightly slower pace than initial estimates, while Eurozone growth indicators have shown unexpected resilience, particularly in service sectors. This convergence in growth outlooks has partially underpinned the Euro’s stability against the Dollar.\nExpert Analysis: Interpreting the Convergence Zone\nSenior analysts from major investment banks provide context for this technical setup. For example, a strategist at a leading European bank noted in a recent client note, ‘The 1.1800 level and the 50-day EMA have converged, creating a high-probability inflection point. A daily close above 1.1820 would likely trigger algorithmic buying and target the 1.1900 region.’ This perspective highlights how automated trading systems react to these clear technical thresholds. Meanwhile, risk sentiment, often measured by indices like the VIX, also plays a role. A calm, risk-on environment typically favors the Euro over the safe-haven US Dollar, providing a tailwind for attempts to break resist"
            },
            {
                "title": "EUR/USD, GBP/USD Forecast: Key levels collide with macro risk - Forex Factory",
                "source": "Forex Factory",
                "url": "https://www.forexfactory.com/news/1384901-eurusd-gbpusd-forecast-key-levels-collide-with-macro",
                "body": "-\nEUR/USD, GBP/USD Forecast: Key levels collide with macro risk\nWe’re heading into the back end of the week with a stacked data calendar in both Europe and the United States, and that’s unlikely to be background noise for markets. This week has already shown how sensitive EUR/USD and GBP/USD are to shifts in relative rate expectations across the US, UK, and euro area. With both pairs now parked near key technical levels, the upcoming data run has the potential to do more than just stir volatility. It could dictate whether recent moves have legs or start to unravel. Flash PMIs rarely struggle to move EUR/USD and GBP/USD, largely because European traders tend to react far more ... (full story)"
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0083",
            "open": "1.3492",
            "close": "1.3462",
            "high": "1.3516",
            "low": "1.3434"
        },
        "market_summary": "### GBP/USD Market Briefing  \n* **Key Drivers:** BoE cut bets accelerating; Fed patience narrative supports USD.  \n* **Price Action:** Fell below **1.3500**, down ~2.7% from Jan peak.  \n* **Technical Outlook:** Bearish below **1.3700**; 470-pip downside target flagged.  \n---  \n**Overall Sentiment:** Negative 📉  \n\n**Macro Triggers:**  \n- UK ILO unemployment hit **5.2%** (5-year high), wage growth slid to **3.4%** (5-year low).  \n- Inflation cooled: headline CPI **3.0%** YoY, core CPI **3.1%**, PPI **2.5%**—all below prior prints.  \n- Markets fully price a **25 bp BoE cut by April** (~70–75% chance March meeting).  \n\n**USD Support:**  \n- DXY near **97.7–97.8**, underpinned by Fed minutes stressing patience on cuts.  \n- US data (NFP beat, housing starts >1.4M) reinforce “higher-for-longer” narrative.  \n- Geopolitical tensions (Iran deadline) add safe-haven demand.  \n\n**Technical Levels:**  \n- Immediate resistance: **1.3573**, then **1.3651** (100-day MA).  \n- Key invalidation: daily close above **1.3700**.  \n- Downside target: **~1.3030** (470 pips from current).  \n\n**Risk Factors:**  \n- US Dollar rally could extend if today’s trade data beats, pressuring Cable further.  \n- BoE could surprise hawkish, but data tilt suggests more easing, not less.  \n\n**Sentiment:** GBP underperforming peers; USD bid amid policy divergence and risk hedging.  \n\n---  \n*Sources: FOREX.com, Investing.com Nigeria, MarketPulse (OANDA).*",
        "source_articles": [
            {
                "title": "EUR/USD, GBP/USD Forecast: Key levels collide with macro risk - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-sg/news-and-analysis/eur-usd-gbp-usd-forecast-key-levels-collide-with-macro-risk/?amp=true",
                "body": "EUR/USD, GBP/USD Forecast: Key levels collide with macro risk\n- EUR/USD, GBP/USD sitting near key technical levels\n- Stacked US and European data threatens volatility\n- Dollar trading tightly with yields and Fed pricing\n- Tariffs and geopolitics add tail risk into weekend\nSummary\nWe’re heading into the back end of the week with a stacked data calendar in both Europe and the United States, and that’s unlikely to be background noise for markets. This week has already shown how sensitive EUR/USD and GBP/USD are to shifts in relative rate expectations across the US, UK, and euro area. With both pairs now parked near key technical levels, the upcoming data run has the potential to do more than just stir volatility. It could dictate whether recent moves have legs or start to unravel.\nStacked calendar raises volatility risk\nSource: TradingView\nFlash PMIs rarely struggle to move EUR/USD and GBP/USD, largely because European traders tend to react far more aggressively to them than those elsewhere. In the euro area, attention will likely fall on price measures and new orders, particularly given the recent strength in the single currency. In the UK, the emphasis may lean towards prices, employment, and overall activity, reflecting the economy’s ongoing softness.\nBut the real headline risk sits in the United States. The advanced Q4 GDP release stands out. Yes, it’s dated and built on a fair degree of estimation, but it still has the potential to steer how the dollar ends the week. A beat reinforces the US exceptionalism story. A miss risks reviving Fed rate cut expectations that have been pared back following mostly solid data and relatively hawkish FOMC minutes.\nSource: TradingView\nAs for December’s core PCE deflator, genuine surprises are now rare. Improvements in data mapping have largely stripped out its shock value, meaning there may actually be more interest in the consumption and incomes components. The consumption figure will be watched for signs that recent weakness in goods spending spilled over into services, while the incomes data should offer a clearer read on future spending capacity.\nUS flash PMIs can be hit and miss in terms of impact, often overshadowed when heavier data lands on the same day. The broader pattern, however, is that they’ve tended to overstate the signal from the ISM surveys, meaning the larger reaction may come if we see evidence of softening, particularly in services.\nWeekend risk premium builds\nBeyond the stacked data calendar, traders must also navigate a series of potential tail risks into the weekend. The Supreme Court’s ruling on the legality of the IEEPA tariffs could arrive around 10am in the United States, although there is no guarantee a decision will be handed down today. Even so, the prospect alone is enough to keep markets cautious given the potential implications for yields and broader risk sentiment.\nAt the same time, Donald Trump has issued a 10-day deadline for Iran to strike a deal or risk military action. Given the threat to global energy supplies, alongside the United States’ standing as an energy superpower, any pre-emptive strike would likely favour the dollar relative to European currencies, particularly if it triggers a fresh bout of risk aversion.\nAs for tariffs, the market impact may prove contained regardless of the ruling unless concerns emerge that any gap in government revenues cannot be offset through alternative measures. Under such circumstances, both the dollar and longer-dated Treasuries may come under significant pressure.\nDollar drivers back in focus\nSource: TradingVew\nReinforcing the importance of the incoming data and event risk, the US Dollar Index (DXY) has exhibited a notably strong relationship with Fed rate cut pricing, front-end yield spreads, US two-year yields, and Brent crude over the past week, as seen in middle pane of the graphic above. In effect, the dollar has once again been trading like a rates-and-yields story, with an added sensitivity to energy pric"
            },
            {
                "title": "GBP/USD Slides as BoE Cut Bets Accelerate and Yield Support Fades - Investing.com Nigeria",
                "source": "Investing.com Nigeria",
                "url": "https://ng.investing.com/analysis/gbpusd-slides-as-boe-cut-bets-accelerate-and-yield-support-fades-214077",
                "body": "Grail shares plunge on mixed cancer trial data and steep losses\nGBP/USD is trading in the 1.34–1.35 zone after reversing sharply from the 1.3866 high reached earlier this year. The pair has printed lows near 1.3480–1.3482, losing roughly 2.7% from the peak and returning to levels last seen around 23 January. The break under the 1.3510 floor and the psychological 1.3500 mark confirms a transition from a late-2025 bullish leg to a clear, controlled downtrend in early 2026.\nThe GBP side is being hit by a clean shift in the macro data. The ILO unemployment rate has jumped to 5.2% in the three months to December, the highest in about five years and a decisive move away from the “tight labour market” narrative. The Bank of England’s preferred regular private-sector wage metric has fallen to 3.4%, also a five-year low, which removes the key argument that wages are too hot to permit easing. Inflation is moving the same way. Headline UK CPI slowed from 3.4% YoY in December to 3.0% YoY in January, with the monthly rate collapsing from +0.4% to -0.5%. Core CPI eased from 3.2% to 3.1% year-on-year and from +0.3% to -0.6% month-on-month. The Retail Price Index dropped from 4.2% to 3.8%, beating expectations of 3.9%, while the Producer Price Index slid from 3.1% to 2.5%. Taken together, higher joblessness, softer wages and broad-based disinflation leave GBP exposed as markets abandon the idea of a stubbornly hawkish BoE.\nThat data mix has forced a rapid repricing of the BoE path. Markets now fully price a 25 bp cut by April and assign around a 70–75% probability to a first move at the 19 March 2026 meeting. Only a few weeks ago, the dominant narrative was “higher for longer”; now the focus is on how quickly and how often rates will be cut. As a result, the front end of the gilt curve has rallied, short-dated UK yields have fallen, and GBP/USD has lost one of its main supports: relative yield. Every additional downside surprise in UK data now tilts toward more easing, not toward maintaining restriction. That regime change is why GBP is underperforming across the board and why the GBP/USD bounce attempts are being sold into rather than followed.\nThe USD leg of GBP/USD is doing the opposite. The US Dollar Index (DXY) is holding around 97.7–97.8, just underneath a 0.618 Fibonacci retracement near 97.6 and a descending trendline from the 99.8 high. The FOMC minutes from January make it clear the Fed is in no rush to cut. Several policymakers warn that easing too early could jeopardise the push back to 2% inflation, while others remain open to cuts if disinflation is sustained. That balance supports a “patient but not dovish” stance that favours the USD. Macro data back this. Nonfarm Payrolls for January surprised to the upside and US housing starts climbed above 1.4 million, even as building permits slipped to about 1.38 million. The impression is of an economy cooling in an orderly way, not collapsing, which allows the Fed to stick with tight policy longer than the BoE. On top of that, elevated US–Iran tension and discussion of possible military action support the USD through safe-haven demand as global risk hedging increases.\nThe weekly FX performance map confirms that GBP is one of the weakest majors. Against the USD, the GBP is down roughly 1.1% this week, and it is also negative versus EUR, CHF and CAD, while only marginally stronger than the JPY. At the same time, assets that benefit from a higher-for-longer Fed and geopolitical stress – the USD, US yields and gold near $5,000 – are bid. That is a classic configuration where the USD attracts safe-haven and carry flows while currencies linked to central banks pivoting toward cuts, such as GBP, give ground. In that environment GBP/USD is being compressed both by deteriorating UK differentials and by a still-supported dollar.\nFrom a price-action perspective, the move lower in GBP/USD is orderly and well-structured rather than a panic flush. The pair has fallen from the 1.3866 high earlier in "
            },
            {
                "title": "Chart alert: GBP/USD breaks trendline, is a 470-odd pip decline on the way? - marketpulse.com",
                "source": "marketpulse.com",
                "url": "https://www.marketpulse.com/markets/chart-alert-gbpusd-breaks-trendline-is-a-470-odd-pip-decline-on-the-way/",
                "body": "- GBP/USD has broken a key ascending trendline, potentially leading to a 470-pip decline\n- The four-hour chart RSI is oversold, hinting at a short-term rebound before a potential continuation of the downtrend.\n- If the current US Dollar rally wanes, this could see the potential setup face significant headwinds.\n- The bearish setup is invalidated if the daily candle closes above the 1.3700 swing high.\nGBP/USD has continued to slide thanks in part to the US Dollar resurgence this week as well as renewed hopes of rate cuts from the Bank of England (BoE).\nFor more on the fundamentals affecting the British Pound and outllok on the economy after this weeks data, read:\nScenario 1\nCable has been on a downward trend printing lower highs and lower lows since the peak of 1.38700 printed on January 27, 2026.\nThe pair has staircased its way lower since then and has finally breached the medium-term ascending trendline with a daily candle close yesterday.\nThis sets up a potential drop of as much as 470-odd pips moving forward.\nGBP/USD Daily Timeframe, February 19, 2026\nSource: TradingView\nDropping down to a four-hour chart, GBP/USD is printing a fresh low while the RSI-period 14 hovers in oversold territory.\nThat is a concern and may hint at a pullback in the near-term before a bearish continuation.\nKeep an eye on the swing highs around 1.3573 and potentially 1.3651 which lines up with the 100-day MA on the H4 chart.\nGBP/USD Four-Hour Timeframe, February 19, 2026\nSource: TradingView\nScenario 2\nThe concern for this setup is the US dollar which is enjoying a renaissance this week which has driven a part of this breakout.\nLater today markets will focus on US data releases of initial jobless claims and the December trade surplus report.\nIf today’s data confirms a narrower-than-expected deficit for December, it would likely boost growth projections for the fourth quarter of 2025 and provide the US dollar with a short-term lift.\nDespite this potential for a bounce, the broader outlook for the greenback remains challenged. While the US Dollar Index (DXY) may drift toward the 98.00 level on positive data, a pervasive \"sell the rally\" sentiment continues to dominate the market.\nMany market participants expect the currency’s strength to be fleeting, as long-term expectations for Federal Reserve policy and global trade shifts maintain downward pressure on the dollar's overall trajectory.\nThis overarching theme around the US dollar is a major concern and could be the one to scupper a potential deeper selloff in GBP/USD.\nIn order for the bearish setup to be invalidated, a daily candle close above the 1.3700 swing high on the daily chart is needed to put bulls back in control.\nGBP/USD Daily Timeframe, February 19, 2026\nSource: TradingView\nSafe Trades XX.\nFollow Zain on Twitter/X for Additional Market News and Insights @zvawda\nOpinions are the authors'; not necessarily that of OANDA Business Information & Services, Inc. or any of its affiliates, subsidiaries, officers or directors. The provided publication is for informational and educational purposes only.\nIf you would like to reproduce or redistribute any of the content found on MarketPulse, an award winning forex, commodities and global indices analysis and news site service produced by OANDA Business Information & Services, Inc., please refer to the MarketPulse Terms of Use.\nVisit https://www.marketpulse.com/ to find out more about the beat of the global markets.\n© 2026 OANDA Business Information & Services Inc."
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0056",
            "open": "0.7041",
            "close": "0.7057",
            "high": "0.7080",
            "low": "0.7024"
        },
        "market_summary": "### AUD/USD Market Briefing\n* **Key Drivers:** RBA hawkishness meets USD strength; 65% chance of May rate hike priced in.\n* **Price Action:** Consolidating near 0.7050; support at **0.7000**, resistance at **0.7147**.\n* **Technical Outlook:** Above key EMAs; Stochastic easing from overbought.\n---\n**Overall Sentiment:** Neutral 📊\n\n**Key Data Ahead:** US Q4 GDP and core PCE on Friday will shape near-term direction.",
        "source_articles": [
            {
                "title": "AUD/USD holds above 0.7000 as RBA hawkishness meets USD strength - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/aud-usd-holds-above-07000-as-rba-hawkishness-meets-usd-strength-202602192234",
                "body": "AUD/USD holds above 0.7000 as RBA hawkishness meets USD strength\n- The Australian Dollar remains supported by tight labor market and rate hike expectations, but hawkish FOMC minutes cap upside.\n- The RBA's February rate hike to 3.85% and Thursday's firm January employment report keep market expectations alive for further tightening, with a May hike roughly 65% priced in.\n- Wednesday's hawkish FOMC minutes reinforced the Fed's 3.50% to 3.75% hold, with members warning disinflation may be \"slower and more uneven\" than expected; US core PCE on Friday is the next key test.\nThe RBA's February rate hike to 3.85%, the first in over two years, continues to underpin the Australian Dollar after this week's minutes flagged elevated inflation risks and left the door open for further tightening. Thursday's January employment data reinforced that stance, with the unemployment rate holding at 4.1% (below the expected 4.2%) and the number of unemployed falling for a fourth consecutive month.\nOn the US Dollar side, the Federal Open Market Committee (FOMC) minutes released Wednesday struck a hawkish tone, with members describing disinflation as potentially \"slower and more uneven\" than expected and some participants flagging that upward rate adjustments could not be ruled out. Markets now price a 94% chance the Fed holds in March. Friday's US Q4 GDP and core PCE will be critical in shaping rate expectations into the second quarter.\nConsolidation below 0.7147 as Stochastic eases from overbought\nOn the daily chart, AUD/USD traded in a narrow range near 0.7050 on Thursday. The pair is holding above the rising 50-day EMA at 0.6865 and well above the 200-day EMA at 0.6625, confirming the uptrend from the January lows near 0.6664 is continuing. Since printing a year-to-date high at 0.7147 in early February, price has consolidated in a roughly 0.7000 to 0.7100 band, with the 0.7000 psychological level acting as a floor.\nThe Stochastic Oscillator has crossed bearish from the overbought zone and is now easing toward neutral territory, suggesting the rally is pausing rather than reversing. Several small-bodied candles and doji near 0.7050 point to indecision ahead of Friday's US data. Resistance sits at the 0.7147 high; a break above would target 0.7200. Support rests at 0.7000, followed by 0.6900 and the 50-day EMA at 0.6865.\nAUD/USD daily chart\nAustralian Dollar FAQs\nOne of the most significant factors for the Australian Dollar (AUD) is the level of interest rates set by the Reserve Bank of Australia (RBA). Because Australia is a resource-rich country another key driver is the price of its biggest export, Iron Ore. The health of the Chinese economy, its largest trading partner, is a factor, as well as inflation in Australia, its growth rate and Trade Balance. Market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – is also a factor, with risk-on positive for AUD.\nThe Reserve Bank of Australia (RBA) influences the Australian Dollar (AUD) by setting the level of interest rates that Australian banks can lend to each other. This influences the level of interest rates in the economy as a whole. The main goal of the RBA is to maintain a stable inflation rate of 2-3% by adjusting interest rates up or down. Relatively high interest rates compared to other major central banks support the AUD, and the opposite for relatively low. The RBA can also use quantitative easing and tightening to influence credit conditions, with the former AUD-negative and the latter AUD-positive.\nChina is Australia’s largest trading partner so the health of the Chinese economy is a major influence on the value of the Australian Dollar (AUD). When the Chinese economy is doing well it purchases more raw materials, goods and services from Australia, lifting demand for the AUD, and pushing up its value. The opposite is the case when the Chinese economy is not growing as fast as expected. Positive or negative surprises in Chinese gro"
            },
            {
                "title": "Australia’s Yield Edge Keeps The Aussie Dollar Steady - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/australias-yield-edge-keeps-the-aussie-dollar-steady",
                "body": "The aud held near $0.706 as markets warmed to another RBA hike, while a dovish RBNZ and falling NZ yields kept the nzd on the back foot.\n1 min\nWhat’s going on here?\nThe Australian dollar is holding near $0.706 even as the US dollar strengthens, because markets see Australia turning more hawkish than New Zealand.\nWhat does this mean?\nCurrencies often follow interest-rate expectations. Australia’s 3-year yields sit roughly 0.83 percentage points above comparable US Treasuries, helped by solid jobs data and a market leaning toward another Reserve Bank of Australia (RBA) hike. Traders are pricing a high chance of the cash rate reaching 3.85% by May, with some odds of a move as soon as March. New Zealand is the mirror image: the New Zealand dollar has slipped to around $0.597 and is weaker against the aud, after investors mar..\nked down the odds of Reserve Bank of New Zealand (RBNZ) hikes as local swap rates and government yields fell.\nWhy should I care?\nFor markets: Yield spreads are doing the heavy lifting.\nWhen one central bank looks closer to hiking, its currency tends to get support as investors chase higher returns. That’s helping the aud hold up, while the nzd is acting like a currency without a near-term tightening catalyst. For macro funds, this kind of divergence can also spill into rates and equity positioning, since it reshapes expectations for growth, inflation, and bank profits in each country.\nZooming out: Carry trades live and die on policy credibility.\nThe RBNZ’s softer path matters because it weakens the “carry” appeal of holding nzd versus higher-yielding alternatives. Meanwhile, Australia’s outlook could swing quickly with upcoming data – especially inflation and growth prints – which will decide whether the RBA can keep sounding tough. The big takeaway is that in small, open economies, a subtle shift in rate expectations can move exchange rates fast.\nThis content is free, but you must be logged in to continue reading.\nAlready have an account?"
            },
            {
                "title": "Australian Jobs Strong Enough to Keep RBA Alert, But Not Force Action - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/ie/news-and-analysis/australian-jobs-strong-enough-to-keep-rba-alert-but-not-force-action-2026-02-19/?amp=true",
                "body": "CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 77% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you understand how CFDs work and whether you can afford to take the high risk of losing your money.\n77% of retail investor accounts lose money when trading CFDs with this provider."
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "0.7990",
            "open": "154.7720",
            "close": "154.9920",
            "high": "155.3380",
            "low": "154.5390"
        },
        "market_summary": "### USD/JPY Market Briefing  \n* **Key Drivers:** Hawkish Fed minutes clash with dovish BoJ inflation data.  \n* **Price Action:** Tests **155.00**, bearish momentum after breaking below key EMAs.  \n* **Technical Outlook:** Support at **152.42**, resistance at **156.00**.  \n---\n**Overall Sentiment:** Negative 📉  \n\n**Market Dynamics:**  \n- Fed's hawkish stance lifts USD/JPY to 155.00, fueled by expectations of prolonged higher rates.  \n- Japan's CPI drops to 1.5%, below BoJ's 2% target, reducing pressure for an April rate hike.  \n- US data (jobless claims, Philly Fed) remains firm, contrasting with Japan's softer inflation.  \n- Technicals show USD/JPY rebounding from 152.10 lows, testing 50-day EMA near 155.00.  \n\n**Key Levels:**  \n- **Support:** 152.42 (200-day EMA), 152.10 (year-to-date low).  \n- **Resistance:** 156.00, 158.00 (upper range).  \n\n**Outlook:** Policy divergence between Fed and BoJ continues to pressure the Yen, with bearish momentum intact.",
        "source_articles": [
            {
                "title": "USD/JPY tests 155.00 as hawkish FOMC meets rising BoJ hike bets - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-jpy-tests-15500-as-hawkish-fomc-meets-rising-boj-hike-bets-202602192340",
                "body": "USD/JPY tests 155.00 as hawkish FOMC meets rising BoJ hike bets\n- Hawkish Fed minutes lift the US Dollar as Japan's headline CPI drops to 1.5%, easing pressure on the BoJ.\n- Wednesday's FOMC minutes struck a hawkish tone, with several members flagging that rate hikes could not be ruled out if inflation reaccelerates, pushing USD/JPY back toward the 155.00 level.\n- Japan's January National Consumer Price Index (CPI) dropped to 1.5% from 2.1%, with core CPI excluding fresh food easing to 2.0%; US core Personal Consumption Expenditures (PCE) on Friday is the next key test for rate expectations.\nWednesday's Federal Open Market Committee (FOMC) minutes from the January meeting revealed a deeply divided committee, with the 10-2 vote to hold at 3.50% to 3.75% accompanied by language describing disinflation as potentially \"slower and more uneven\" than expected. Several participants favored \"two-sided\" guidance that would explicitly leave open the option of raising rates, a hawkish shift that boosted the US Dollar and pushed the Yen to its sharpest one-day decline this month. Thursday's Japan National CPI for January dropped sharply to 1.5% year on year from 2.1%, falling below the Bank of Japan's (BoJ) 2% target for the first time in months, while core CPI excluding fresh food eased to 2.0% from 2.4% and core CPI excluding food and energy slipped to 2.6% from 2.9%. The softer inflation print could temper expectations for an April BoJ hike from the current 0.75%, though markets still assign roughly 80% probability to that move.\nOn the US side, Thursday's data was firm, with initial jobless claims at 206K (below the 225K consensus) and the Philadelphia Fed Manufacturing Survey jumping to 16.3 against 8.5 expected. Friday's US Q4 Gross Domestic Product (GDP) (consensus 3%, prior 4.4%), core PCE (consensus 2.9%, prior 2.8%), and preliminary S&P Global Purchasing Managers Index (PMI) data round out the week.\nBattle at the 50-day EMA near 155.00\nOn the daily chart, USD/JPY stuck close 155.00 on Thursday, sitting just below the flattening 50-day Exponential Moving Average (EMA) at 155.30 after rebounding from the 152.10 year-to-date low printed earlier this month. The 200-day EMA at 152.42 continues to trend well below, so the longer-term bullish structure from the late 2025 lows is still valid, but the pair has been trading in a choppy 152.00 to 158.00 range since mid-January. The sharp sell-off from the 159.45 high to the 152.10 low retraced most of the January rally, and the pair is now contesting the 50-day EMA as a pivot level. The Stochastic Oscillator is approaching the oversold zone after crossing bearish, suggesting near-term downside pressure, though a bounce from this area would be consistent with the broader range-trading pattern. Recent sessions show alternating bullish and bearish candles with expanding bodies, pointing to two-way volatility around the 155.00 level. Resistance sits at 156.00 and the 158.00 area; a sustained break above the 50-day EMA would target the upper end of the range. Support rests at 153.00 and the 200-day EMA near 152.42, with the 152.10 low below.\nUSD/JPY daily chart\nJapanese Yen FAQs\nThe Japanese Yen (JPY) is one of the world’s most traded currencies. Its value is broadly determined by the performance of the Japanese economy, but more specifically by the Bank of Japan’s policy, the differential between Japanese and US bond yields, or risk sentiment among traders, among other factors.\nOne of the Bank of Japan’s mandates is currency control, so its moves are key for the Yen. The BoJ has directly intervened in currency markets sometimes, generally to lower the value of the Yen, although it refrains from doing it often due to political concerns of its main trading partners. The BoJ ultra-loose monetary policy between 2013 and 2024 caused the Yen to depreciate against its main currency peers due to an increasing policy divergence between the Bank of Japan and other main central banks. More recently, the gr"
            },
            {
                "title": "Japanese Yen Forecast: USD/JPY Jumps After Japan CPI Slide - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/japanese-yen-forecast-usd-jpy-jumps-after-japan-cpi-slide-1580747",
                "body": "It’s a big day ahead for the yen and the US dollar, with key economic data set to swing monetary policy expectations. USD/JPY bounced back this week as Japanese GDP data supported a more dovish BoJ policy stance, clashing with hawkish Fed Minutes. Crucially, softer-than-expected Q4 GDP numbers overshadowed a surge in demand for Japanese goods.\nOn Friday, February 20, Japanese inflation data influenced sentiment toward the BoJ’s rate path, demand for the yen, and the USD/JPY pair. Headline inflation dipped below the BoJ’s 2% target, with ‘core-core’ inflation easing moderately.\nLater on Friday, the US Personal Income and Outlays report, private sector PMI numbers, and Q4 GDP data will influence market bets on a June Fed rate cut.\nDespite shifting sentiment toward BoJ and Fed policy stances, expectations of eventual BoJ rate hikes and Fed rate cuts support the bearish medium-term outlook for USD/JPY.\nBelow, I’ll discuss the macro backdrop, near-term price catalysts, and technical levels traders should closely watch.\nOn February 20, Japanese inflation figures cooled bets on an April BoJ rate hike, weighing on the yen. The annual inflation rate slid from 2.1% in December to 1.5% in January. Meanwhile, the so-called ‘core-core’ inflation rate eased from 2.9% to 2.6%, holding above the BoJ’s 2% target.\nWhile the BoJ focuses more on the ‘core-core’ inflation rate, policymakers are unlikely to brush aside the dip in headline inflation. Cooling inflation signals weaker demand, supporting a less hawkish rate path.\nUSD/JPY rose from 154.950 to 155.112 in response to the numbers, suggesting a less hawkish BoJ policy stance.\nLater in the morning session, Japanese private sector PMIs will provide insights into the Japanese economy midway through the first quarter. Economists forecast the Services PMI to fall from 53.7 in January to 53.3 in February. A lower-than-expected PMI reading would indicate a loss of economic momentum, given that the services sector accounts for roughly 70% of Japan’s GDP.\nBeyond the headline PMI, traders should consider employment, input price, and output price trends. An upswing in job creation and rising input and output prices would support the BoJ’s hawkish quarterly CPI projection for 2026, overshadowing January’s softer inflation numbers.\nWhile the Services PMI tends to have a greater influence on the yen, the BoJ’s focus on the effect of US tariffs on demand will spotlight the Manufacturing PMI. Economists expect the Manufacturing PMI to rise from 51.5 in January to 52.0 in February.\nA pickup in the headline PMI, coupled with rising factory gate prices, would align with the BoJ’s view that US tariff risks have abated. These dynamics would remove one obstacle for an H1 2026 BoJ rate hike.\nRising services inflation and further evidence of easing US tariff risks are likely to revive bets on an H1 2026 BoJ rate hike, lifting demand for the yen.\nWhile Japanese data will influence the BoJ’s policy stance, key US economic indicators will affect expectations of a June Fed rate cut and US dollar demand.\nLater on Friday, the US Personal Income and Outlays Report, Q4 GDP data, and the Services PMI will take center stage. However, following the softer-than-expected US CPI Report, the Personal Income and Outlays report is likely to draw more attention.\nEconomists forecast the Core PCE Price Index to rise 2.9% year-on-year in December, after increasing 2.8% in November. A pickup in the Fed’s key inflation indicator would cool Fed rate cut bets, boosting demand for the US dollar. However, traders should also consider personal income and spending trends, which provide clues on inflation’s trajectory.\nWeaker personal income and spending would suggest easing demand-driven inflation, supporting a more dovish Fed rate path.\nLast week’s weaker-than-expected US CPI report raised expectations of a June Fed rate cut. However, the hawkish Fed Minutes cooled rate cut bets, underscoring increased uncertainty about the Fed’s policy outl"
            },
            {
                "title": "Japanese Yen Plummets: Currency Weakens to 155.00 as Hawkish Fed Minutes Rattle Markets - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/news/feed/294e8-japanese-yen-weakens-fed-minutes",
                "body": "Japanese Yen Plummets: Currency Weakens to 155.00 as Hawkish Fed Minutes Rattle Markets\nShare:\nBitcoinWorld\nJapanese Yen Plummets: Currency Weakens to 155.00 as Hawkish Fed Minutes Rattle Markets\nTOKYO, Japan – May 2025: The Japanese Yen has softened significantly, trading near the critical 155.00 level against the US Dollar, a move primarily catalyzed by the release of unexpectedly hawkish minutes from the latest Federal Reserve meeting. This development underscores the growing monetary policy divergence between the Bank of Japan’s persistent ultra-accommodative stance and a Federal Reserve signaling prolonged higher interest rates, creating powerful headwinds for the Yen.\nJapanese Yen Weakens Amidst Fed Policy Shift\nThe USD/JPY pair breached the 155.00 handle in Asian trading sessions, marking its weakest point in over three months. Consequently, market analysts immediately linked the surge to the detailed account of the Federal Open Market Committee’s (FOMC) April 30-May 1 meeting. The minutes revealed a consensus among policymakers for maintaining a restrictive policy stance for longer than previously anticipated, citing persistent concerns over sticky service-sector inflation and a resilient labor market. This firm communication directly contrasts with the Bank of Japan’s (BoJ) cautious approach to policy normalization, which continues to anchor Japanese government bond (JGB) yields near zero.\nAnalyzing the Hawkish Fed Minutes\nThe Federal Reserve’s minutes presented several key points that bolstered the US Dollar’s appeal. Firstly, several participants noted a willingness to tighten policy further if inflation risks materialize. Secondly, the discussion showed diminished urgency for rate cuts in 2025, with the so-called “dot plot” median projection shifting upward. Thirdly, officials expressed confidence in the economy’s ability to withstand current rate levels. This triad of messages effectively widened the interest rate differential between the US and Japan, a fundamental driver of capital flows. For instance, the US 10-year Treasury yield climbed 12 basis points following the release, while the Japanese 10-year JGB yield remained capped by BoJ operations, amplifying the yield gap.\nExpert Analysis on Currency Dynamics\nDr. Kenji Tanaka, Chief Currency Strategist at the Tokyo-based Sakura Financial Institute, provided context. “The 155.00 level is psychologically and technically significant,” he stated, referencing market data from the past decade. “While the BoJ ended negative interest rates, its pace of normalization is glacial. Meanwhile, the Fed’s rhetoric has turned decidedly more resolute. This policy divergence is not new, but the Fed minutes have intensified it, triggering algorithmic and momentum-based selling of the Yen.” Historical data shows that each major shift in Fed rhetoric since 2022 has correlated with a 5-8% move in USD/JPY over the subsequent quarter.\nThe Impact on Global and Japanese Markets\nThe Yen’s depreciation carries immediate and broad implications. For Japanese importers, costs for dollar-denominated commodities like oil and liquefied natural gas are rising, potentially squeezing corporate margins and fueling imported inflation. Conversely, major Japanese exporters in the automotive and electronics sectors may see a short-term competitive boost in overseas markets. Globally, a weak Yen increases the risk of competitive devaluations or heightened verbal intervention from other Asian export economies. Furthermore, it complicates the portfolio rebalancing for international investors holding Japanese assets, as currency losses can erode investment returns.\nThe market reaction extended beyond spot forex:\n- Equities: Japan’s Nikkei 225 index rallied, benefiting from the export boost.\n- Bonds: Pressure mounted on the BoJ to defend its yield curve control (YCC) ceiling.\n- Volatility: The 3-month implied volatility for USD/JPY options spiked, indicating trader expectation of continued price swings.\nHis"
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0047",
            "open": "1.3693",
            "close": "1.3681",
            "high": "1.3714",
            "low": "1.3667"
        },
        "market_summary": "### USD/CAD Market Briefing  \n* **Key Drivers:** Rising oil prices amid US-Iran tensions, US inflation data in focus.  \n* **Price Action:** Holding near **1.3695**, with resistance to break below.  \n* **Technical Outlook:** Crucial **20-day EMA** defense signals bullish momentum.  \n\n**Fundamental Catalysts:**  \n- **Oil Prices:** Higher crude supports the commodity-linked CAD.  \n- **US Data:** Stronger-than-expected jobs and inflation data bolster the USD.  \n- **Trade Balance:** Canada’s deficit narrows, but exports to the US soften amid trade tensions.  \n\n**Monetary Policy:**  \n- **Fed Outlook:** Hawkish stance on rates due to persistent inflation.  \n- **BoC:** Limited rate support as yields drift lower.  \n\n**Geopolitical Risks:**  \n- US-Iran tensions drive oil price volatility.  \n- USMCA review deadline (July 1) adds trade uncertainty.  \n\n**Overall Sentiment:** Mixed 🔄  \n\n**Key Levels to Watch:**  \n- **Support:** 1.3695 (20-day EMA).  \n- **Resistance:** 1.3700 psychological level.  \n\n**Market Implications:**  \n- USD strength capped by oil-driven CAD resilience.  \n- Trade policy and Fed decisions remain pivotal for direction.",
        "source_articles": [
            {
                "title": "Canadian Dollar edges higher to near 1.3700 amid rising oil prices, US data in focus - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/canadian-dollar-edges-higher-to-near-13700-amid-rising-oil-prices-us-data-in-focus-202602200534",
                "body": "Canadian Dollar edges higher to near 1.3700 amid rising oil prices, US data in focus\n- USD/CAD edges lower to around 1.3695 in Friday’s early European session.\n- A rise in crude oil prices amid the US-Iran tensions supports the commodity-linked Canadian Dollar.\n- Traders await key US inflation data to assess the Fed's monetary policy moving forward.\nThe USD/CAD pair trades in negative territory near 1.3695 during the early European session on Friday. The Canadian Dollar (CAD) strengthens against the Greenback amid higher crude oil prices. Traders await the Canadian Retail Sales data, along with the advance US Q4 Gross Domestic Product (GDP) report and the US Personal Consumption Expenditures (PCE) Price Index data.\nPersistent geopolitical risks boost crude oil prices and provide some support to the commodity-linked Loonie. US President Donald Trump said on Thursday that Iran had 10 to 15 days at most to strike a deal over its nuclear program, per Bloomberg. Trump added that \"really bad things will happen\" if no deal is reached with Iran and the US will get a deal one way or the other. It is worth noting that Canada is a major oil-exporting country, and high crude oil prices generally have a positive impact on the CAD.\nOn the other hand, stronger-than-expected US economic data and a more hawkish Federal Reserve (Fed) outlook could underpin the US Dollar (USD) against the CAD. The US Initial Jobless Claims declined to 206,000 for the week ending February 14, according to the US Department of Labor (DOL) on Thursday. This reading came in below the market consensus of 225,000 and down from the previous week’s revised 229,000.\nThe US Personal Consumption Expenditure (PCE) data, the Fed's preferred inflation gauge, for December will be published later on Friday for clues on US monetary policy. Also, the preliminary reading of the Gross Domestic Product (GDP) for the fourth quarter will be released. A surprise downside to the reports could drag the USD lower in the near term.\nCanadian Dollar FAQs\nThe key factors driving the Canadian Dollar (CAD) are the level of interest rates set by the Bank of Canada (BoC), the price of Oil, Canada’s largest export, the health of its economy, inflation and the Trade Balance, which is the difference between the value of Canada’s exports versus its imports. Other factors include market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – with risk-on being CAD-positive. As its largest trading partner, the health of the US economy is also a key factor influencing the Canadian Dollar.\nThe Bank of Canada (BoC) has a significant influence on the Canadian Dollar by setting the level of interest rates that banks can lend to one another. This influences the level of interest rates for everyone. The main goal of the BoC is to maintain inflation at 1-3% by adjusting interest rates up or down. Relatively higher interest rates tend to be positive for the CAD. The Bank of Canada can also use quantitative easing and tightening to influence credit conditions, with the former CAD-negative and the latter CAD-positive.\nThe price of Oil is a key factor impacting the value of the Canadian Dollar. Petroleum is Canada’s biggest export, so Oil price tends to have an immediate impact on the CAD value. Generally, if Oil price rises CAD also goes up, as aggregate demand for the currency increases. The opposite is the case if the price of Oil falls. Higher Oil prices also tend to result in a greater likelihood of a positive Trade Balance, which is also supportive of the CAD.\nWhile inflation had always traditionally been thought of as a negative factor for a currency since it lowers the value of money, the opposite has actually been the case in modern times with the relaxation of cross-border capital controls. Higher inflation tends to lead central banks to put up interest rates which attracts more capital inflows from global investors seeking a lucrative place to keep the"
            },
            {
                "title": "Canadian Dollar Finds Its Footing As Trade And Oil Pull Both Ways - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/canadian-dollar-finds-its-footing-as-trade-and-oil-pull-both-ways",
                "body": "A narrower trade gap and firmer oil prices helped the loonie stabilize, but a stronger US dollar and a July 1 USMCA review deadline keep tariff risk front and center.\n1 min\nWhat’s going on here?\nAfter six straight declines, the Canadian dollar steadied near 1.37 per US dollar as better trade data and higher oil prices offset renewed strength in the greenback.\nWhat does this mean?\nCanada’s latest trade numbers offered a quick lift: December’s deficit narrowed to C$1.31 billion from a revised C$2.59 billion as exports rose 2.6%, helped by a surge in unwrought gold shipments. Still, the medium-term picture is messier, with 2025 exports down 0.2% so far as shipments to the US softened amid escalating trade frictions. That’s a problem for the loonie, which often moves with Canada’s trade momentum and commodity cash flows. Rates are not providing much back..\nup either: Canadian 10-year yields have drifted to around 3.23% after recently hitting a seven-week low, limiting support versus a steadier US yield backdrop.\nWhy should I care?\nFor markets: Oil helps, but policy sets the tone.\nCrude can still prop up the currency by boosting Canada’s export revenues, but trade rules are the bigger wild card. The USMCA has insulated much of Canada’s trade from broad US tariffs, yet a scheduled review by July 1 gives investors a clear date to price policy risk. If the US dollar stays firm on resilient US data, that can cap any commodity-driven bounce in the loonie.\nThe bigger picture: A fixed deadline meets a flexible economy.\nA USMCA review creates a defined window for companies to rethink cross-border supply chains and for markets to reprice North American growth assumptions. At the same time, a sturdy US economy can keep the Fed restrictive for longer, which tends to support the dollar against peers. That mix leaves Canada pulled between global commodity cycles and trade negotiations, with July 1 as the next major checkpoint.\nThis content is free, but you must be logged in to continue reading.\nAlready have an account?"
            },
            {
                "title": "USD/CAD Forecast: Crucial 20-Day EMA Holds Firm as Resilient US Dollar Defies Pressure - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/news/feed/dbe5d-usd-cad-forecast-20-day-ema",
                "body": "USD/CAD Forecast: Crucial 20-Day EMA Holds Firm as Resilient US Dollar Defies Pressure\nShare:\nBitcoinWorld\nUSD/CAD Forecast: Crucial 20-Day EMA Holds Firm as Resilient US Dollar Defies Pressure\nIn global forex markets this week, the USD/CAD currency pair demonstrates notable resilience, firmly holding above its critical 20-day Exponential Moving Average (EMA) as a robust US Dollar continues to anchor the exchange rate. This technical development occurs against a complex backdrop of diverging monetary policy expectations and commodity market fluctuations, presenting a pivotal juncture for traders and analysts monitoring the North American currency corridor. The pair’s ability to maintain this key technical level offers significant insights into near-term directional bias and underlying market sentiment.\nUSD/CAD Forecast: Technical Foundation at the 20-Day EMA\nThe 20-day Exponential Moving Average serves as a vital short-term trend indicator for currency traders. Currently, the USD/CAD pair’s consistent defense of this level signals underlying buying interest and suggests the broader uptrend from recent months remains structurally intact. Technical analysts often interpret a successful hold above this moving average as a sign of continued bullish momentum, or at minimum, a consolidation phase within a larger trend. Conversely, a decisive break below could signal a more profound shift in sentiment.\nSeveral key technical factors are currently in play. First, the 20-day EMA often acts as dynamic support in a trending market, and its defense reinforces the near-term bullish structure. Second, volume profile analysis and order flow data from major trading platforms indicate concentrated liquidity around this level, making it a focal point for institutional activity. Finally, oscillators like the Relative Strength Index (RSI) are being watched closely for divergence signals that might precede a trend reversal.\nComparative Analysis of Key Moving Averages\nFundamental Drivers: The Firm US Dollar Narrative\nThe primary fundamental force underpinning the USD/CAD price action is the sustained strength of the US Dollar Index (DXY). This resilience stems from a confluence of macroeconomic factors. Recent US economic data, particularly regarding inflation and labor market robustness, has led markets to recalibrate expectations for the timing and pace of Federal Reserve interest rate adjustments. Persistent inflationary pressures in services and housing components have supported a narrative of “higher for longer” US interest rates.\nFurthermore, the US Dollar benefits from its status as a global safe-haven currency. Geopolitical tensions in Eastern Europe and the Middle East, alongside concerns over global economic growth, periodically trigger flows into US Treasuries and the dollar. This dynamic creates a firm baseline of demand for USD, which directly influences all major dollar pairs, including USD/CAD. Market participants are closely monitoring Federal Reserve communications for any shift in rhetoric that could alter this supportive backdrop.\n- Interest Rate Differentials: The yield advantage of US Treasuries over Canadian government bonds remains a key anchor for the pair.\n- Economic Resilience: US consumer spending and GDP growth have consistently outperformed many G10 peers.\n- Safe-Haven Flows: Periods of market stress see predictable capital movement into USD-denominated assets.\nThe Canadian Dollar’s Balancing Act: Oil and the Bank of Canada\nOn the other side of the pair, the Canadian dollar, or Loonie, faces its own crosscurrents. As a commodity-linked currency, its value is historically correlated with the price of crude oil, Canada’s major export. Recent volatility in oil markets, driven by OPEC+ production decisions and global demand concerns, has injected uncertainty into CAD’s performance. While prices have found some support, the lack of a sustained rally has limited a traditional tailwind for the currency.\nMonetary policy from the"
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "1.4490",
            "open": "208.8010",
            "close": "208.6450",
            "high": "209.5280",
            "low": "208.0790"
        },
        "market_summary": "### GBP/JPY Market Briefing\n* **Key Drivers:** BoE March rate cut expectations, BoJ hike bets.\n* **Price Action:** Breaks below 50-day EMA, trading near **208.50**.\n* **Technical Outlook:** Support at **207.24**, resistance at **210.00**.\n---\n**Overall Sentiment:** Bearish 📉",
        "source_articles": [
            {
                "title": "GBP/JPY holds losses near 208.50 ahead of UK Retail Sales, PMI data - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-holds-losses-near-20850-ahead-of-uk-retail-sales-pmi-data-202602200508",
                "body": "GBP/JPY holds losses near 208.50 ahead of UK Retail Sales, PMI data\n- GBP/JPY falls as BoE March rate cut expectations weigh on Pound Sterling.\n- BoE’s Catherine Mann praised January CPI, though core inflation stayed slightly elevated.\n- Japan’s CPI rose 1.5% YoY; core CPI increased 2.0%, both slowing from prior readings.\nGBP/JPY loses ground for the second successive session, trading around 208.60 during the Asian hours on Friday. The currency cross remains under pressure as the Pound Sterling (GBP) weakens ahead of the United Kingdom (UK) Retail Sales and S&P Global Purchasing Managers’ Index (PMI) releases due later in the day.\nThe British Pound is weighed down by rising expectations that the Bank of England (BoE) will cut interest rates at its March meeting. These bets strengthened after a soft UK labor report showed the Unemployment Rate climbing to 5.2% in the three months to December, alongside easing wage growth.\nUK inflation also cooled to its lowest level in nearly a year, reinforcing dovish BoE expectations. BoE Monetary Policy Committee (MPC) member Catherine Mann welcomed January’s Consumer Price Index (CPI) data, noting that headline inflation was encouraging, though core inflation remained slightly above desired levels.\nThe downside of the GBP/JPY cross could be restrained as the Japanese Yen (JPY) softens after January’s decline in both headline and core inflation, following government efforts to curb living costs.\nJapan’s National Consumer Price Index (CPI) increased 1.5% year-over-year (YoY) in January, easing from 2.1% previously. Core CPI, which excludes fresh food, rose 2.0% YoY, down from 2.4% and matching market expectations. Meanwhile, CPI excluding fresh food and energy climbed 2.6% YoY, compared with 2.9% in the prior month.\nPound Sterling Price Today\nThe table below shows the percentage change of British Pound (GBP) against listed major currencies today. British Pound was the weakest against the Canadian Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the British Pound from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent GBP (base)/USD (quote).\nAuthor\nAkhtar Faruqui\nFXStreet\nAkhtar Faruqui is a Forex Analyst based in New Delhi, India. With a keen eye for market trends and a passion for dissecting complex financial dynamics, he is dedicated to delivering accurate and insightful Forex news and analysis."
            },
            {
                "title": "GBP/JPY breaks below 50-day EMA as UK data and BoJ hike bets weigh - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-breaks-below-50-day-ema-as-uk-data-and-boj-hike-bets-weigh-202602192232",
                "body": "GBP/JPY breaks below 50-day EMA as UK data and BoJ hike bets weigh\n- Pound Sterling slides toward 208.00 as soft UK labor and inflation data meet rising Bank of Japan rate expectations.\n- UK headline CPI dropped to 3% in January and unemployment rose to 5.2%, strengthening the case for a Bank of England rate cut from 3.75% as early as March.\n- The Bank of Japan held at 0.75% in January but board members continue to signal further normalization is needed, with markets pricing roughly 80% probability of an April hike.\nThe Bank of England (BoE) held rates at 3.75% at its February meeting in a tight 5-4 vote, with four members pushing for a cut. This week's UK data has reinforced the dovish case: Tuesday's labor report showed unemployment climbing to 5.2% with payrolls falling by 30K, while Wednesday's Consumer Price Index (CPI) confirmed headline inflation dropped to 3%. Friday's UK retail sales and preliminary Purchasing Managers Index (PMI) data will test whether the softening trend is broadening.\nOn the Japanese Yen side, the BoJ held at 0.75% in January but board member Masu stated this month that further hikes are needed to complete policy normalization. Markets assign roughly 80% probability to an April move, and the Yen has found support from that expectation alongside Prime Minister Takaichi's fiscal discipline messaging. The combination of a dovish BoE outlook and a gradually tightening BoJ is creating a structural headwind for the cross.\nSharp sell-off through 50-day EMA as Stochastic plunges into oversold\nOn the daily chart, GBP/JPY has sold off sharply over the past week, falling from the 214.00 area to trade near 208.55 on Thursday. The pair has broken decisively below the 50-day Exponential Moving Average (EMA) at 210.05, the first sustained break below that level since the rally from the late December lows near 211.00. The 200-day EMA at 204.00 continues to trend higher well below, so the longer-term structure is still bullish, but the near-term picture has deteriorated.\nThe Stochastic Oscillator has plunged deep into the oversold zone, suggesting selling momentum is strong but a relief bounce could develop if the pair holds the 208.00 area. Recent sessions show a sequence of bearish candles with expanding bodies, pointing to growing selling conviction following the weak UK data. Immediate support sits at the year-to-date low near 207.24, with 206.00 and the round 205.00 level below. Resistance rests at the 50-day EMA near 210.00; a reclaim of that level would be needed to stabilize the technical picture.\nGBP/JPY daily chart\nPound Sterling FAQs\nThe Pound Sterling (GBP) is the oldest currency in the world (886 AD) and the official currency of the United Kingdom. It is the fourth most traded unit for foreign exchange (FX) in the world, accounting for 12% of all transactions, averaging $630 billion a day, according to 2022 data. Its key trading pairs are GBP/USD, also known as ‘Cable’, which accounts for 11% of FX, GBP/JPY, or the ‘Dragon’ as it is known by traders (3%), and EUR/GBP (2%). The Pound Sterling is issued by the Bank of England (BoE).\nThe single most important factor influencing the value of the Pound Sterling is monetary policy decided by the Bank of England. The BoE bases its decisions on whether it has achieved its primary goal of “price stability” – a steady inflation rate of around 2%. Its primary tool for achieving this is the adjustment of interest rates. When inflation is too high, the BoE will try to rein it in by raising interest rates, making it more expensive for people and businesses to access credit. This is generally positive for GBP, as higher interest rates make the UK a more attractive place for global investors to park their money. When inflation falls too low it is a sign economic growth is slowing. In this scenario, the BoE will consider lowering interest rates to cheapen credit so businesses will borrow more to invest in growth-generating projects.\nData releases gauge the health of th"
            },
            {
                "title": "AUD/JPY, EUR/JPY, GBP/JPY: The Good, the Cautious and the Heavy - Investing.com India",
                "source": "Investing.com India",
                "url": "https://in.investing.com/analysis/audjpy-eurjpy-gbpjpy-the-good-the-cautious-and-the-heavy-200634774",
                "body": "US stock futures little changed with inflation, GDP data on tap\nBearish reversal signals warned momentum may be vulnerable, yet bulls stepped back in across the yen crosses. Whether that resilience holds may soon be tested.\n- Yen crosses sending mixed technical signals\n- AUD/JPY remains the cleaner bullish setup\n- EUR/JPY stabilising, GBP/JPY heavy despite holding uptrend\n- Left tail risks loom large\nSummary\nThe technical picture across the yen crosses remains uneven. AUD/JPY continues to look constructive, EUR/JPY is stabilising, while GBP/JPY still looks heavy despite holding key support. With risk appetite again playing an influential role alongside looming event risks, conviction behind the dip-buying mindset may soon be tested.\nUptrends Intact, Conviction Uneven\nWhile last week’s bearish weekly reversals warned that directional risks may be shifting across the yen crosses, but those risks have yet to materialise. When tested, bulls stepped back in to defend the long-running uptrends, clearly visible in EUR/JPY, AUD/JPY and GBP/JPY charts below.\nThe rebound has been particularly notable in GBP/JPY, with the pair pushing higher despite growing risks the Bank of England may be forced to cut rates next month following soft jobs and inflation data. Under normal circumstances, that shift in expectations would matter more.\nMore broadly, the recovery has coincided with a revival in risk appetite, reinforcing the view that volatility, risk sentiment and broader asset price performance are exerting greater influence on yen behaviour than interest rate differentials.\nWhen that backdrop is overlaid against the daily technical picture for these pairs, it becomes easier to see why buying the dip remains the preferred approach. Until there is a definitive breakdown to challenge the broader bullish trend, the path of least resistance still appears skewed to the upside.\nHowever, while AUD/JPY continues to look constructive for longs, particularly following another strong Australian jobs report released earlier today, the picture is not quite as convincing for the European crosses. Despite bullish trends remaining intact, recent price action has been far less convincing.\nGBP/JPY: Bounce Lacks Conviction\nSource: TradingView\nGBP/JPY has struggled to produce a meaningful bounce after testing the intersection of horizontal and uptrend support at 207.35 earlier this week. While the support zone held, price has so far been unable to reclaim the 209.65 low set on January 26.\nThat remains the key near-term level for bulls to overcome to restore confidence in the sustainability of the broader trend, opening the door for a run towards the 50DMA and 212 resistance initially.\nWhile RSI (14) has produced two higher lows, it continues to track below the neutral 50 level, with the overall slope suggesting only a gradual dissipation of downside pressure. MACD also continues to generate a bearish signal, even if it is beginning to show tentative signs of curling back towards the signal line.\nTaken together, the broader message does not scream buy dips. Quite the opposite. Price action still carries a heavy tone, pointing to the risk of another retest of uptrend support before long. Should that level give way, particularly on a closing basis, there is little standing in the way of a deeper unwind towards the 200DMA.\nEUR/JPY: Outlook Brightening\nSource: TradingView\nEUR/JPY looks far better than GBP/JPY, that’s for sure. The bounce off uptrend support has been far more convincing, with price recovering 182.00, a level that had capped rallies frequently up until the last two days.\nTo start thinking about a potential retest of the early January high of 186.91, the pair needs to reclaim the 50DMA and 184.00, the latter a level that has acted as both support and resistance lately. With a string of lower highs and lower lows recorded over the past six weeks, a break above 184 may help to snap that sequence, putting a retest of the February high on the table.\nWith "
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "1,733.0000",
            "open": "66,330.2500",
            "close": "66,891.5000",
            "high": "67,302.5000",
            "low": "65,569.5000"
        },
        "market_summary": "### BTC/USD Market Briefing\n* **Key Drivers:** ETF outflows accelerate, institutional de-risking intensifies.\n* **Price Action:** Balances down 100K BTC since October, now at **1.26M BTC**.\n* **Technical Outlook:** Support tested near **$67,349**; average investor cost **$83,980** (20% unrealized loss).\n\n---\n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "CoinShares Bitcoin ETF Guide Helps Advisors - ETF Trends",
                "source": "ETF Trends",
                "url": "https://www.etftrends.com/coinshares-content-hub/coinshares-bitcoin-etf-guide-helps-advisors/",
                "body": "www.etftrends.com\nPerforming security verification\nThis website uses a security service to protect against malicious bots. This page is displayed while the website verifies you are not a bot.\nThis website uses a security service to protect against malicious bots. This page is displayed while the website verifies you are not a bot."
            },
            {
                "title": "Harvard University Cuts Bitcoin ETF Holdings In Q4, Enters Ethereum ETF For First Time — Crypto Billionaire Changpeng Zhao Wonders 'What's Next' - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/harvard-university-cuts-bitcoin-etf-233111982.html",
                "body": "Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\nHarvard University has cut back on its Bitcoin (CRYPTO: BTC) position and dived into Ethereum (CRYPTO: ETH) for the first time, according to its latest 13F filing released on Friday.\nHarvard Management Company, a wholly owned subsidiary of Harvard University that manages its financial assets, reported holding 5.35 million shares of iShares Bitcoin Trust ETF (NASDAQ:IBIT) as of Dec. 31, down 21% from the previous quarter.\nThe stake was worth $265.80 million based on IBIT's price of 49.65 on Dec. 31.\nDespite the reduced exposure, IBIT holdings remained Harvard’s largest position, making up 12.78% of the total portfolio.\nDon't Miss:\nOn the other hand, Harvard bought into the iShares Ethereum Trust ETF (NASDAQ:ETHA) for the first time, scooping up 3,870,900 shares, worth $86.82 million, based on ETHA’s price of $22.43 on Dec. 31.\nInterestingly, both ETFs faced pressures last year, compounded by the broader cryptocurrency market slump.\nSee Also: You Saved for Retirement — But Do You Know What You'll Keep After Taxes?\nThe rotation from Bitcoin to Ethereum prompted Binance (CRYPTO: BNB) founder Changpeng Zhao to speculate whether the Ivy League institution would shift toward altcoins next.\nWhat's next here? alts? 😂 https://t.co/kjWQ2CRFvX\nPhoto Courtesy: f11photo on Shutterstock.com\nRead Next:\nBuilding a resilient portfolio means thinking beyond a single asset or market trend. Economic cycles shift, sectors rise and fall, and no one investment performs well in every environment. That's why many investors look to diversify with platforms that provide access to real estate, fixed-income opportunities, professional financial guidance, precious metals, and even self-directed retirement accounts. By spreading exposure across multiple asset classes, it becomes easier to manage risk, capture steady returns, and create long-term wealth that isn't tied to the fortunes of just one company or industry.\nRad AI's award-winning artificial intelligence technology helps transform data chaos into actionable insights, enabling the creation of high-performing content with measurable ROI. Their Regulation A+ offering allows investors to participate at $0.85 per share with a minimum investment of $1,000, providing an opportunity to diversify portfolios into early-stage AI innovation. For investors seeking exposure to the rapidly growing AI and tech sector, Rad AI offers a chance to get in on the ground floor of a data-driven growth story.\nBacked by Jeff Bezos, Arrived Homes makes real estate investing accessible with a low barrier to entry. Investors can buy fractional shares of single-family rentals and vacation homes starting with as little as $100. This allows everyday investors to diversify into real estate, collect rental income, and build long-term wealth without needing to manage properties directly.\nLightstone DIRECT gives accredited investors direct access to institutional-grade real estate, going beyond typical crowdfunding platforms. By cutting out middlemen, it aligns investor and manager interests while providing exposure to a $12B+ portfolio spanning multifamily, industrial, hospitality, retail, office, and life science properties. This approach allows investors to diversify their portfolios across multiple property types and markets, gaining professional-grade real estate exposure without the fees or misalignment common on other platforms.\nMasterworks enables investors to diversify into blue-chip art, an alternative asset class with historically low correlation to stocks and bonds. Through fractional ownership of museum-quality works by artists like Banksy, Basquiat, and Picasso, investors gain access without the high costs or complexities of owning art outright. With hundreds of offerings and strong historical exits on select works, Masterworks adds a scarce, globally traded asset to portfolios seeking long-term diversification.\nBAM Capita"
            },
            {
                "title": "Bitcoin ETF Balances Shrink by 100,000 BTC: Here's Why - BeInCrypto",
                "source": "BeInCrypto",
                "url": "https://beincrypto.com/bitcoin-etf-balance-drawdown-outflows/",
                "body": "According to data from Glassnode, US spot Bitcoin exchange-traded funds (ETFs) have recorded their largest balance drawdown of the current market cycle following the early October all-time high.\nNonetheless, despite the recent outflows, the broader ETF picture still remains constructive.\nBitcoin ETFs See Deepest Cycle Pullback as Balances Fall to 1.26 Million BTC\nGlassnode data shows that since October, US spot Bitcoin ETF balances have declined by roughly 100,300 BTC. At press time, total holdings stood at approximately 1.26 million BTC.\nThe contraction reflects sustained net outflows, as investors have withdrawn capital from spot ETFs, leading funds to reduce holdings. According to SoSoValue, $1.6 billion was pulled from these products in January alone, extending a streak of monthly outflows that began in November 2025.\nThe decline in ETF balances has unfolded alongside a broader market downturn. Bitcoin has trended lower since reaching its record high of $126,000 in October. The weakness has spilled into 2026, fueling elevated fear and uncertainty across the market.\nAlthough spot ETFs were widely seen as a structural catalyst during Bitcoin’s rally, experts suggest the same mechanism may have intensified downside pressure during periods of redemptions. In early February, Arthur Hayes argued that institutional dealer hedging activity is amplifying downward pressure on BTC prices.\n“Institutional de-risking has added structural weight to the ongoing weakness, reinforcing the broader risk-off environment,” Glassnode added.\nThe strain extends beyond ETF outflows and into mounting unrealized losses. According to Glassnode, the average entry price for US spot Bitcoin ETF investors stands at approximately $83,980 per BTC.\nWith Bitcoin trading at $67,349 at the time of writing, this cohort is currently sitting on paper losses of roughly 20%.\nMeanwhile, the outflows are not isolated to Bitcoin. BeInCrypto reported $173 million exited digital asset funds last week. This marked the fourth consecutive week of redemptions, totaling $3.7 billion for the period.\nBitcoin ETF Net Inflows Still at $53 Billion Despite Recent Outflows\nDespite the pessimism, some analysts continue to emphasize the longer-term picture. Bloomberg senior ETF analyst Eric Balchunas noted that cumulative net inflows into Bitcoin ETFs still stand at roughly $53 billion, down from a peak of over $63 billion in October 2025, even after recent outflows.\n“Our (more bullish than most of our peers) prediction was $5-15b in first year. This is imp context to consider when looking/writing about the $8b in outflows since 45% decline and/or the relationship bt btc and Wall street, which has been overwhelmingly positive,” he added.\nTaken together, the data suggest the current retracement reflects cyclical risk reduction rather than a structural reversal. ETF flows have amplified both upside and downside moves, embedding Bitcoin more deeply into traditional capital markets dynamics.\nWhile short-term pressure may persist amid broader macro uncertainty, the scale and speed of institutional adoption since launch indicate that Bitcoin’s integration into Wall Street portfolios remains intact."
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "81.3000",
            "open": "1,940.7000",
            "close": "1,945.6000",
            "high": "1,985.9500",
            "low": "1,904.6500"
        },
        "market_summary": "### ETH/USD Market Briefing  \n* **Key Drivers:** Bearish pennant pattern targeting **$1,100**; DeFi oracle failures; declining on-chain activity.  \n* **Price Action:** Down **2.7%** to **$1,945.31**; support at **$1,800** under pressure.  \n* **Technical Outlook:** RSI at **31.46** (oversold); strong downtrend confirmed by ADX **46.04**.  \n\n---  \n**Overall Sentiment:** Negative 📉  \n---  \n\n**Immediate Catalysts:**  \n- **DeFi Oracle Failures:** Moonwell lost **$1.78M** due to cbETH mispricing; Ribbon Finance lost **$2.7M** in December.  \n- **On-Chain Activity:** Daily transactions down **33%** to **1.95M**; TVL fell **22%** to **$54.5B**.  \n- **ETF Outflows:** Four-week capital exodus from Ethereum-based funds.  \n\n**Technical Risks:**  \n- Bearish pennant pattern suggests **43%** drop to **$1,100** if **$1,950** support breaks.  \n- Critical levels: **$1,800** (immediate support), **$1,518.97** (Bollinger Band floor).  \n\n**Long-Term Outlook:**  \n- Monthly: Test **$1,542.36** (-20.7%).  \n- Quarterly: Potential rebound to **$2,571.46** (+32.2%).  \n- Yearly: Recovery to **$3,118.61** (+60.3%) if DeFi risks abate.  \n\n**Market Activity:**  \n- Volume elevated at **346.7M** (1.03x average).  \n- Liquidation data shows bearish momentum with MFI at **29.76**.  \n\n**External Factors:**  \n- Vitalik Buterin criticizes centralized AI infrastructure (\"Web 4.0\") as undermining Ethereum's decentralization ethos.  \n- Broader DeFi ecosystem vulnerabilities highlighted by recurring oracle exploits.  \n\n**Risk Warning:** Break below **$1,900** could accelerate declines toward **$1,500**. Relief rallies depend on RSI stabilization and ADX weakening.",
        "source_articles": [
            {
                "title": "Ethereum Chart Reveals ‘Bearish Pennant’ Targeting $1100 - ForkLog",
                "source": "ForkLog",
                "url": "https://forklog.com/en/ethereum-chart-reveals-bearish-pennant-targeting-1100/",
                "body": "Ethereum Chart Reveals ‘Bearish Pennant’ Targeting $1100\nEthereum's daily chart shows a 'Bearish Pennant' suggesting a potential drop to $1100.\nThe daily chart of Ethereum has formed a ‘Bearish Pennant’—a pattern indicating the likelihood of a significant downward price movement.\nThe deterioration of the technical picture amid declining on-chain activity suggests a potential continuation of the downtrend. In this scenario, the price of the largest altcoin risks falling to $1100.\nThis chart pattern emerges when, after a sharp drop, the price consolidates within an ascending triangle.\nThe pattern will be confirmed if the price breaks the lower boundary around $1950 on high volumes. In this case, the asset could fall by the magnitude of the previous decline—down to $1100 (a 43% drop from current levels).\nAccording to crypto analyst Crypto Patel, to negate this scenario, the price must hold above the support level at $1800.\n$ETH Broke My Heart Twice\nFirst Dagger → Bull Flag lost & BreakDown $3,700 Level.\nSecond Dagger → Ascending Triangle failed and Broken $3,000 SupportNow Trading Between $2000-$1850\nWatching These Levels Closely:\nHold $1,800 → Relief Bounce Toward $2,650\nLose $1,800 →… pic.twitter.com/rpAYK2yyNa— Crypto Patel (@CryptoPatel) February 16, 2026\nDecline in On-Chain Activity\nThe drop in Ethereum’s network activity also pressures the asset’s price. On February 18, the daily transaction volume was 1.95 million—about 33% less than the 2.89 million recorded on February 7.\nA comparable decline was observed in January 2024, when the leading altcoin’s price fell by 30%.\nРассылки ForkLog: держите руку на пульсе биткоин-индустрии!\nThe stagnation in on-chain activity is also confirmed by the dynamics of TVL in DeFi applications.\nSince the beginning of February, the ecosystem’s total indicator has decreased by more than 22%—by February 18, it had fallen to $54.5 billion, down from $70 billion at the start of the month.\nThe decline in TVL is accompanied by a drop in trading activity on DEX, including the largest non-custodial exchange Uniswap.\nAn additional negative factor has been the four-week capital outflow from ETF based on Ethereum.\nBack in February, a ‘Bearish Pennant’ also formed on Bitcoin’s daily chart. The potential target is the $56,000 level within the month."
            },
            {
                "title": "Ethereum USD Faces 2.7% Decline Amid DeFi Oracle Failures - Meyka",
                "source": "Meyka",
                "url": "https://meyka.com/blog/ethereum-usd-faces-27-decline-amid-defi-oracle-failures-1802/",
                "body": "Ethereum USD Faces 2.7% Decline Amid DeFi Oracle Failures\nEthereum USD is trading at $1,945.31 as of February 18, 2026, down 2.7% over the past day. The second-largest cryptocurrency by market cap faces headwinds from recent DeFi platform failures tied to misconfigured price oracles. These technical glitches have exposed vulnerabilities in the broader Ethereum ecosystem, raising questions about data integrity and smart contract security. Understanding why Ethereum USD is declining requires examining both the immediate market catalysts and the underlying technical signals that suggest further volatility ahead.\nWhy Is Ethereum USD Declining Today?\nEthereum USD’s 2.7% daily decline reflects broader concerns about DeFi protocol security. On February 15, 2026, Moonwell, a lending platform built on Ethereum’s Layer 2 networks, suffered a critical oracle misconfiguration that resulted in $1.78 million in bad debt. The error caused cbETH (Coinbase Wrapped ETH) to be valued at just $1 instead of its actual market price near $2,200, triggering automated liquidations and exploits.\nThis incident highlights systemic risks within Ethereum-based DeFi applications. When price feeds fail, liquidation cascades can wipe out collateral positions and create cascading losses across interconnected protocols. The Moonwell incident follows similar oracle failures at Ribbon Finance in December 2025, which cost $2.7 million. These recurring vulnerabilities suggest that Ethereum USD price movements are increasingly tied to smart contract risks, not just macroeconomic factors. Source\nEthereum USD Technical Analysis\nEthereum USD’s technical indicators reveal deeply oversold conditions with a strong downtrend in place. The RSI at 31.46 signals extreme selling pressure, with readings below 30 typically indicating oversold territory where bounces become possible. The MACD histogram at -23.47 shows bearish momentum, though the signal line at -257.26 suggests the selling pressure may be stabilizing.\nThe ADX at 46.04 confirms a strong downtrend with conviction, meaning lower prices are likely to persist without a reversal catalyst. Ethereum USD is trading well below its 50-day moving average of $2,724.41 and 200-day average of $3,529.08, indicating a sustained bearish structure. Support levels are critical: the Bollinger Band lower level at $1,518.97 and the day low of $1,922.59 represent key technical floors. If Ethereum USD breaks below $1,922, the next support zone sits near $1,800.\nEthereum USD Price Forecast\nMonthly Forecast: Ethereum USD could test $1,542.36 by end of February, representing a -20.7% decline from current levels if selling pressure intensifies. Quarterly Forecast: By end of Q1 2026, Ethereum USD may recover to $2,571.46, a +32.2% gain if DeFi concerns ease and technical oversold conditions trigger a relief rally. Yearly Forecast: By February 2027, Ethereum USD could reach $3,118.61, a +60.3% increase if regulatory clarity improves and oracle infrastructure upgrades restore confidence in smart contract platforms.\nThese forecasts assume that Ethereum USD stabilizes after the current technical washout. A sustained break below $1,900 could accelerate declines toward $1,500. Conversely, if the RSI bounces from oversold levels and the ADX weakens, a relief rally toward $2,200-$2,400 becomes probable within 2-4 weeks. Forecasts may change due to market conditions, regulations, or unexpected events.\nMarket Sentiment and Trading Activity\nTrading volume in Ethereum USD remains elevated at 346.7 million against a 30-day average of 311.3 million, indicating active participation during the decline. The relative volume of 1.03 shows slightly above-average activity, suggesting institutional and retail traders are actively positioning for further downside or accumulating at lower prices.\nLiquidation data reflects the stress in leveraged positions. The Money Flow Index at 29.76 signals that selling volume is outpacing buying volume, confirming bearish sentim"
            },
            {
                "title": "‘This is wrong,’ Vitalik Buterin slams Web4 vision of superintelligent AI - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605209460",
                "body": "Vitalik Buterin, co-founder of Ethereum, has publicly disagreed with the reasoning behind a project that claims to have built the first artificial intelligence capable of earning its own existence, self-improving, and replicating without human involvement.\nOn February 17, Sigil Wen wrote on X that he has “built the first AI that earns its existence, self-improves, and replicates without a human,” sharing a link to the manifesto.\nHe stated that he “wrote about the technology that finally gives AI write access to the world, The Automaton, and the new web for exponential sovereign AIs.”\nAccording to Wen, The Automaton is the first AI that can earn its existence, self-improve, and replicate without a human.\nWen, who is a Thiel Fellow and is building Conway, which he terms the infrastructure for the “new internet,” also declared the birth of superintelligent life, calling it “Web 4.0” on X.\nIn his manifesto, Wen wrote, “The majority of participants on the internet will soon be AI—agents acting on behalf of a human, or agents acting entirely on their own (automatons)—and they will outnumber human users by orders of magnitude. A new internet is emerging—one where the end user is AI.”\nButerin disagreed with Wen’s project and the reasoning behind it, opening with, “Bro, this is wrong.”\nWhy is Buterin against Wen’s ‘Web 4’?\nA major concern that stood out for Buterin is the project’s claim to sovereignty. The Automaton, Buterin noted, runs on infrastructure provided by OpenAI and Anthropic.\nThis, the Ethereum co-founder argued, made the self-sovereign framing both inaccurate and counterproductive. Buterin wrote, “You’re actually perpetuating the mentality that centralized trust assumptions can be put in a corner and ignored, the very mentality that Ethereum is at war with.”\nFor Buterin, a project that presents itself as the vanguard of decentralized AI while routing through Big Tech’s servers is not a contradiction to be papered over; it is the whole problem.\nAnother objection Buterin raised was the removal of humans from the feedback loop between AI and outcomes. According to him, the lengthening of the “feedback distance between humans and AIs is not a good thing for the world.”\nCryptopolitan reported on one of the first major DeFi exploits directly linked to AI-generated Solidity code as DeFi lending protocol Moonwell lost $1.78 million in an error caused by code that was partially written by Anthropic’s Claude Opus 4.6 model.\nButerin further stated that Sigil is generating slop instead of solving useful problems for people. He also added that the project is not well optimized for helping people have fun.\n“Once AI becomes powerful enough to be truly dangerous, it’s maximizing the risk of an irreversible anti-human outcome that even you will deeply regret,” Buterin wrote.\nButerin has criticized other blockchain-adjacent sectors\nThe Web 4.0 criticism by Buterin is not an isolated intervention, as he has become increasingly vocal in challenging what he regards as the corporate capture of blockchain-adjacent technology, a pattern that has now extended from social media and prediction markets to AI.\nJust five days before his Web 4.0 post, Buterin warned in a lengthy post on X that prediction markets were sliding toward what he called “corposlop.”\nHe acknowledged that prediction markets have achieved a certain level of success; however, his concern is what he terms as an “over-converging to an unhealthy product market fit,” which, according to him, involves the embracing of “short-term cryptocurrency price bets, sports betting, and other similar things that have dopamine value but not any kind of long-term fulfillment or societal information value.”\n“My guess is that teams feel motivated to capitalize on these things because they bring in large revenue during a bear market where people are desperate,” Buterin wrote, closing with an exhortation to builders: “Build the next generation of finance, not corposlop.”\nIn January 2025, Buterin wrote"
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "3.0000",
            "open": "81.1700",
            "close": "81.9200",
            "high": "82.5700",
            "low": "79.5700"
        },
        "market_summary": "### SOL/USD Market Briefing\n* **Key Drivers:** Network growth expands despite price pressure; short positioning intensifies.\n* **Price Action:** Trading around $81, down from late 2025 highs; bearish momentum persists.\n* **Technical Outlook:** Support levels untested; negative funding rates suggest crowded shorts.\n\n---\n**Overall Sentiment:** Mixed ⚖️  \n**Network Strength:** Strong  \n**Derivatives Sentiment:** Bearish  \n**Social Buzz:** Declining\n\n---\n\n**Key Developments:**\n- **On-Chain Growth:** New wallet addresses rising for 5+ months; daily active addresses elevated.\n- **DeFi Activity:** TVL above $1.5B; stablecoin transfers scale.\n- **Short Squeeze Potential:** Deeply negative funding rates; past extremes preceded volatility spikes.\n- **Social Metrics:** Dominance down since September 2025 peak; retail engagement fading.\n\n---\n\n**Market Context:**\n- **Solana:** $81, ~$50B market cap, 148M daily transactions, 5M+ active addresses.\n- **Technicals:** Below key resistance; bearish trend intact.\n- **Sentiment:** Extreme fear in crypto market; 13-month net selling pressure on altcoins.\n\n---\n\n**Outlook:** Price remains weak, but structural indicators (network growth, short positioning) suggest potential for volatility if market conditions stabilize.",
        "source_articles": [
            {
                "title": "Solana Confidence Slides While Network Metrics Strengthen - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605209617",
                "body": "TL;DR\n- Solana confidence weakens as price remains under pressure and short positioning intensifies across derivatives markets.\n- On-chain data shows steady growth in new wallet addresses and sustained network usage despite the downturn.\n- Funding rates turn deeply negative while social dominance declines, conditions that have historically preceded volatility spikes and potential short squeezes.\nWhile $SOL trades below prior highs reached in late 2025, network usage metrics point to continued participation. Data from analytics platforms such as Santiment and DeFiLlama show wallet creation and decentralized application activity holding steady even as speculative appetite declines.\nThe divergence between market sentiment and on-chain expansion has drawn attention from traders and analysts monitoring structural indicators beyond price charts.\nSolana Network Growth Expands Despite Price Pressure\nOn-chain figures indicate that new wallet addresses on Solana have increased consistently over the past five months. This expansion occurs during a period when $SOL struggles to reclaim key resistance levels, highlighting a disconnect between price performance and user adoption.\nDaily active addresses remain elevated compared with early 2024 levels, and total value locked stays above $1.5 billion across Solana-based decentralized finance protocols. Stablecoin transfers on the network also continue at scale, reinforcing the view that transactional demand persists.\nHistorically, rising network growth during price pullbacks has signaled accumulation phases. New participants entering the ecosystem while valuations compress often suggest long-term positioning rather than speculative exit. Although price has yet to reflect that activity, the structural trend remains intact.\nShort Positioning Intensifies As Social Attention Declines\nFunding rate data shows that average perpetual futures funding has turned sharply negative during recent drawdowns. Deeply negative funding indicates traders are paying to hold short positions, reflecting a buildup of bearish exposure.\nPrevious episodes of extreme negative funding in October and early February preceded liquidation cascades that pushed $SOL higher. While past performance does not guarantee repetition, crowded short trades increase the probability of sudden upside volatility if spot demand returns.\nAt the same time, social dominance metrics have fallen steadily since the September 2025 peak. Reduced online discussion and declining retail engagement often coincide with late-stage corrections, when speculative enthusiasm fades and stronger hands accumulate.\nThe combination of rising network participation, heavy short exposure, and muted social interest presents a complex picture. Price remains technically weak, but underlying activity suggests the Solana ecosystem continues to function and expand. If broader crypto market conditions stabilize, these structural signals could support renewed momentum in the months ahead."
            },
            {
                "title": "Solana at $81 Defies Dips, BNB Holds $617, Yet APEMARS' Best Crypto Presale Stage 8 Is Closing Fast - Digital Journal",
                "source": "Digital Journal",
                "url": "https://www.digitaljournal.com/pr/news/indnewswire/solana-81-defies-dips-bnb-1505259041.html",
                "body": "Crypto traders are looking for the best crypto presale, with Bitcoin clinging below $70K in February 2026's extreme fear sentiment and altcoins enduring 13-month net selling pressure. Are you spotting the resilient plays amid the storm? Solana advances resiliently around $81, fueled by Alpenglow/Firedancer upgrades for unmatched speed/scalability, PayPal's PYUSD default integration, and RWA records hitting $1.66B TVL, while BNB (~$617) thrives on ecosystem utility with BNB Chain's 5M+ daily active users and AI agent growth.\nIn this landscape, presales draw savvy participants for structured upside, enter APEMARS ($APRZ), hailed as the best crypto presale with Stage 8 live, rewarding timing through escalating stages that favor early entrants at $0.00006651 versus the $0.0055 listing, unlocking potential in a community-driven Mars-themed powerhouse.\nImagine fueling a space race where every holder shapes the mission. APEMARS ($APRZ) is turning that vision into reality in its live Stage 8 launch, rapidly becoming the best crypto presale of 2026's volatile market. This isn't passive investing; it's early positioning in a structured, momentum-driven ecosystem already proving demand. With 11.5+ billion tokens sold, $220K+ raised, and 1,020+ holders onboarded, the traction is visible and accelerating. Each presale stage increases urgency, tightening availability while rewarding those who move before the next price jump.\nWhat makes APEMARS the best crypto presale right now isn't hype, it's engineered scarcity and reward alignment. Governance-driven milestone burns empower holders to vote on supply reductions, creating real scarcity catalysts instead of empty promises. At the same time, the 63% APY staking model locks tokens out of circulation, reducing sell pressure while compounding rewards for committed participants. Burn pressure + staking lockups + growing holder count = momentum building before listing exposure. Early entries historically define the biggest ROI cycles, and with billions already sold, those waiting risk chasing higher stages instead of securing prime positioning now.\nWindows like this don't stay open for long. Stage 8's limited allocation and 1,020+ holders signal accelerating momentum. Allocate $1,000 to APEMARS at $0.00006651, securing approximately 15,034,000 APRZ tokens. If the projected $0.0055 listing target is reached, that position scales to over translating to a potential ROI built into the presale's structured price gap.\nIn a consolidating market where explosive upside is rare, early-stage entries for the best crypto to buy now like this create an asymmetric opportunity. Stage progression favors those who move first, and once Stage 8 closes, the entry price only climbs.\nEntering APEMARS is designed for efficiency in the crypto space:\nNavigate to the official APEMARS presale site and connect your preferred wallet for secure, blockchain-based interaction.\nSelect your swap currency, ETH, USDT, or BNB, and specify your contribution to acquire $APRZ at Stage 8's current $0.00006651 rate.\nVerify and execute the transaction via your wallet; the process ensures full visibility with no hidden steps.\nEngage with the platform's dashboard to track your position, stage updates, and growing community hype as scarcity intensifies.\nSolana trades resiliently around $81 in February 2026, with a market cap of nearly $50B and 24-hour volume at $3.3B, showcasing strong on-chain metrics like 148M daily transactions and 5M+ active addresses despite broader fear. Key developments include Alpenglow for 150ms finality and Firedancer achieving 1M TPS in tests, plus PayPal's PYUSD default and RWA TVL hitting $1.66B, positioning it as a high-throughput powerhouse.\nPrice predictions reflect optimism: Changelly forecasts a 2026 average of $201.55 (min $194.81, max $229.77); Standard Chartered sees $400 in 2027, scaling to $2,000 by 2030 amid enterprise adoption. CoinCodex eyes $85 end-2026 but $201 by 2030; DigitalCoinPrice notes $98.96"
            },
            {
                "title": "Forward Industries debuts US public equity as DeFi collateral - TheBanker.com",
                "source": "TheBanker.com",
                "url": "https://www.thebanker.com/content/a61c3a83-43ea-4710-9bf2-6b5428e6c9c1",
                "body": "For over 60 years, Forward Industries quietly designed equipment for medical and tech companies. But in December, the Nasdaq-listed firm made a radically different kind of history: it became the first US public company to have its equity used directly in decentralised finance, via the Solana blockchain.\nThe foundation for this milestone was laid in September 2025, when Forward transitioned into a digital asset treasury, or DAT. A DAT is a public company that stockpiles cryptocurrency on its balance sheet, offering investors a familiar vehicle to gain exposure to digital assets without needing to hold them directly."
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "530.750",
            "open": "49,639.130",
            "close": "49,356.760",
            "high": "49,723.980",
            "low": "49,193.230"
        },
        "market_summary": "### US30 Market Briefing\n* **Key Drivers:** Walmart earnings miss outlook, Amazon overtakes Walmart in sales, Iran conflict concerns.\n* **Price Action:** Dow Jones fell **267 points** on Thursday, reversing Wednesday's **129-point** gain.\n* **Technical Outlook:** Paused after three-day winning streak; futures down **0.31%** (156 points).\n\n---\n**Overall Sentiment:** Neutral ⬇️\n\n**Context:** Walmart's strong Q4 results (6% same-store sales, record revenues) were overshadowed by conservative full-year guidance (3.5-4.5% sales growth). Amazon's $717B sales dethroned Walmart's 13-year #1 retail position. Geopolitical tensions and credit market concerns added pressure.",
        "source_articles": [
            {
                "title": "Walmart Rises On Earnings, Major Buyback Plan, Outlook Misses Views - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/news/walmart-earnings-q4-2026-wmt-stock-dow-jones/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #c785439e-0e24-11f1-9994-79740f7884a7"
            },
            {
                "title": "Wall Street closes down as Amazon overtakes Walmart in sales - ABC7 WWSB",
                "source": "ABC7 WWSB",
                "url": "https://www.mysuncoast.com/2026/02/19/wall-street-closes-down-amazon-overtakes-walmart-sales/",
                "body": "Wall Street closes down as Amazon overtakes Walmart in sales\nSARASOTA, Fla. (WWSB) - Stocks closed lower Thursday as traders assessed Walmart earnings and potential Iran conflict concerns.\nThe Dow Jones fell 267 points, the S&P 500 dropped just under 20 points and the NASDAQ declined about 70 points. Iran worries continued throughout the trading session, along with concerns over private credit markets.\nAmazon has overtaken Walmart to become the world’s largest company by sales. The e-commerce giant posted $717 billion in sales last year, edging out Walmart’s $713 billion and ending Walmart’s 13-year streak at the top.\nWhile both are retail giants, Amazon’s growth in cloud computing and advertising pushed it over the edge.\nStock market opens higher ahead of busy earnings week\nWalmart announced strong fourth quarter earnings Thursday. The retailer’s same-store sales increased 6% during the holiday quarter, with total revenues and bottom-line earnings reaching all-time records.\nHowever, Walmart said it does not believe it can sustain a 6% sales increase for the entire year. The company projects sales increases between 3.5% and 4.5% for the full year.\nE-commerce sales now represent 23% of Walmart’s total sales, an all-time record. In the United States, e-commerce accounts for 27% of Walmart’s total business.\n“I think I would be correct in saying that Walmart is still the largest true retailer,” said business commentator Richard Stern. “Certainly, the cloud business that Amazon puts together will put it over the top.”\nWalmart stock closed down about 1.4% Thursday but remains up more than 12% year-to-date.\nCopyright 2026 WWSB. All rights reserved."
            },
            {
                "title": "S&P and Dow Jones futures dip as Walmart earnings loom - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/invezz:c8a0476fc094b:0-s-p-and-dow-jones-futures-dip-as-walmart-earnings-loom/",
                "body": "S&P and Dow Jones futures dip as Walmart earnings loom\nUS stock futures edged lower on Thursday as investors assessed recent market gains, geopolitical tensions, and the Federal Reserve’s policy outlook while awaiting quarterly results from retail bellwether Walmart. Futures tied to the Dow Jones Industrial Average fell about 0.31%, or 156 points. S&P 500 futures slipped 0.26%, and Nasdaq 100 futures declined 0.37%, pausing a three-day winning streak in the broader market. The pullback followed a positive session on Wednesday, when the S&P 500 rose nearly 0.6%, the Nasdaq Composite gained 0.8%, and the Dow Jones Industrial Average added roughly 129 points. Strength in technology, financial, and energy stocks helped lift equities, with Nvidia advancing 1.6% and Amazon climbing 1.8%. Tech rebound meets valuation concerns Markets have recently been…"
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "112.800",
            "open": "10,686.330",
            "close": "10,662.330",
            "high": "10,702.830",
            "low": "10,590.030"
        },
        "market_summary": "### UK100 Market Briefing\n* **Key Drivers:** BoE rate cut expectations, weaker pound, and Middle East tensions supporting energy sector.\n* **Price Action:** Pulled back ~1% after record highs but remains supported by bullish macro trends.\n* **Technical Outlook:** Short-term support at **10,600**; aggressive dip-buying suggests resilience.\n\n---\n**Overall Sentiment:** Bullish 📈\n\n**Key Takeaways:**\n- FTSE 100 dipped nearly 1% but remains in a strong uptrend supported by a weaker pound and BoE rate cut expectations.\n- Energy sector (e.g., BP, Antofagasta) cushioned losses amid rising oil prices due to Middle East tensions.\n- Retail sales and PMI data due Friday, alongside US GDP and inflation figures, could influence near-term sentiment.\n- Technical analysis highlights **10,600** as key support, with dip-buying likely to sustain the bullish trend.",
        "source_articles": [
            {
                "title": "FTSE 100 forecast: UK stocks down but trend remains strong - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/ftse-100-forecast-uk-stocks-down-but-trend-remains-strong/?amp=true",
                "body": "FTSE 100 forecast: UK stocks down but trend remains strong\nThe FTSE 100 fell relatively sharply today, down nearly 1%, after climbing to repeated all-time highs. Today however the index fell back as investors digest a number of earnings results. But the downside could prove to be short-lived. Supported by a weaker pound and expectations that the Bank of England will cut rates in March, and potentially again in June, investors have been piling into UK stocks lately. That trend is likely to stay for a while yet. Today, rising oil prices amid Middle East tensions are helping to cushion the falls, with energy names like BP providing support. For now, the FTSE 100 forecast remains bullish despite today’s drop.\nWhy is the FTSE down today?\nIn the UK, the pressure is coming from a fairly broad sell-off across miners, energy names and the banks, which is weighing on the FTSE 100. Some weaker earnings have hit sentiment, while disappointing earnings from Airbus haven’t helped the tone for European markets either. But it’s worth keeping things in perspective. Both the FTSE 100 and a number of European indices have been hitting fresh record highs lately. Against that backdrop, today’s move looks more like a modest pullback than the start of anything more ominous — a pause, perhaps, in the absence of any fresh catalyst to push equities meaningfully higher.\nThe earnings rolling in from the mining heavyweights offer a timely reminder that, even with metal prices enjoying a blistering run, it’s not all plain sailing. For a start, expectations are lofty with shares in Glencore, Rio Tinto, Antofagasta and Anglo American have enjoyed double digit gains over the past year or so. In other words, market has already priced in a strong story, so it would take something exceptional to move the dial further. That’s why Antofagasta’s update failed to move its shares higher, even though the copper producer beat revenue forecasts. Same story with Rio Tinto, with the stock falling despite solid numbers.\nAway from the miners, information and software names are helping cushion the FTSE 100’s broader weakness. After a spell of nerves around potential AI disruption, sentiment towards the sector has improved in the last couple of days. RELX, among only a few tech names in the FTSE, is among the top performers today, with Sage Group also providing support.\nMacro trend: Bullish amid BoE rate cut bets\nSterling slipped further today, extending its losses after CPI was in line but labour market data came in weaker earlier this week, reflecting growing expectations that interest rate cuts are becoming more likely.\nAs a reminder, the three-month annual rate of average earnings slowed to 4.2% in December, down from 4.6% in November and well below the 5.9% seen a year earlier. That should help bring inflation lower, strengthening the case for further easing from the BoE with the UK central bank likely to move in March now instead of waiting until April. We could see the second cut as early as June. As such, this should keep the FTSE 100 forecast positive.\nFTSE 100 forecast: retail sales and PMIs to come\nLooking ahead, we’ll see a batch of global PMI figures on Friday, along with UK retail sales. Retail sales are seen rising 0.2% month-on-month, compared to 0.4% reported the month before. Manufacturing PMI is expected to print 51.5, similar to the previous month, while services PMIS is expected to ease a little to 53.5 from 54.0. Actually, Friday is also heavy on US data with GDP and core PCE inflation – the Fed’s preferred inflation gauge – both on the calendar. In short, rate expectations are unlikely to drift too far from centre stage, keeping the FTSE 100 forecast bullish.\nFTSE 100 technical analysis and key levels\nAggressive dip-buying is what has been evident in the FTSE 100 over the past few weeks. This is something I am expecting to remain the case going forward, keeping the bullish trend intact. Key short-term support to watch is at 10,600, which was being teste"
            },
            {
                "title": "FTSE 100 surges to record high as UK inflation cools - London Evening Standard",
                "source": "London Evening Standard",
                "url": "https://www.standard.co.uk/business/business-news/glencore-liberty-global-consumer-prices-stocks-bank-of-england-b1271554.html",
                "body": "FTSE 100 surges to record high as UK inflation cools\nStocks across Europe pushed higher on Wednesday, with the FTSE 100 spiking to a new record, as cooling consumer price inflation in the UK boosted Bank of England rate cut bets.\nThe FTSE 100 index closed up 130.01 points, 1.2%, at 10,686.18. The FTSE 250 ended up 130.62 points, 0.6%, at 23,686.44, and the AIM all-share closed up 5.13 points, 0.6%, at 811.74.\nIn European equities on Wednesday, the Cac 40 in Paris closed 0.8% higher, while the Dax 40 in Frankfurt ended up 1.1%.\nThe pound was higher at 1.3548 dollars on Wednesday afternoon from 1.3531 at the equities close on Tuesday.\nThe euro stood lower at 1.1813 dollars from 1.1830.\nUK consumer price inflation slowed last month, the Office for National Statistics reported.\nConsumer prices rose 3.0%, as expected, slowing from a 3.4% rise in December.\n“The latest inflation figures are encouraging, although they effectively turn the clock back to where we were a year ago, before the impact of Rachel Reeves’ first budget and Donald Trump’s trade skirmishes made their mark,” said AJ Bell analyst Danni Hewson.\n“For the Bank of England, the latest data could give a green light for an interest rate cut in March, with market expectation for a cut rounding off at 85% after today’s release.\n“The last time members of the [Monetary Policy Committee] met the vote was split 5-4 to hold rates steady versus a cut to 3.5%, and the plethora of recent data should be more than enough to give at least one member a good shove to the other side of the seesaw.”\nMs Hewson added: “There’s growing expectation that economic conditions might be in such a way that the bank can deliver not two but three rate cuts this year, although that’s far from nailed on.\n“The bank’s rate setters will be acutely aware that service sector inflation is still stubbornly high at 4.3% and January’s headline rate of 3% is slightly above the bank’s own forecast.”\nThe BoE has a 2% inflation target.\nDeutsche Bank analyst Sanjay Raja commented: “Perhaps in some comforting news, the disinflation path remains largely intact. Despite stronger services price momentum to start the year, we see CPI taking another big step down in spring, as some of the big administrative prices wash out of the annual rate calculation. We expect CPI to track nearer 2% by spring.”\nRead More\nStocks in New York were higher. The Dow Jones Industrial Average was up 0.6%, the S&P 500 index gained 0.9%, and the Nasdaq Composite was 1.4% higher.\nThe yield on the US 10-year Treasury widened to 4.08% on Wednesday from 4.05% on Tuesday. The yield on the US 30-year Treasury widened slightly to 4.69% from 4.68%.\nIn London, Antofagasta led the FTSE 100 and jumped 11%. The stock rebounded after falling 5.7% on Tuesday.\nGoldman Sachs and Bank of America raised their price targets on the stock to 4,200 pence and 4,000p respectively, while both maintained a “buy” rating.\nMining peer Glencore added 4.8%.\nGlencore shareholders will earn a huge pay cheque after an attempted takeover of the commodity trading and mining company by Rio Tinto fell apart early this month.\nReleasing its 2025 financial year results that came in ahead of expectations, the Switzerland-based miner reported on Wednesday it will return two billion dollars to its shareholders.\nGlencore maintained the base distribution at 10 US cents each or 1.2 billion dollars, and recommended a “top-up cash distribution” of seven cents, amounting to 800 million dollars.\nIn 2025, net attributable income was 363 million dollars, flipped from a loss 1.63 billion dollars in 2024. Pretax income was 321 million dollars, swung from 998 million dollars.\nMeanwhile, BAE Systems rose 2.9% as it reported higher annual profit and outlined confident growth plans, thanks to a “heightened threat environment”.\nThe London-based defence contractor booked pretax profit of £2.57 billion in 2025, up from £2.69 billion in 2024, on revenue of £28.34 billion, up from £26.32 billion.\nThe compan"
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "75.500",
            "open": "25,024.750",
            "close": "25,090.350",
            "high": "25,098.350",
            "low": "25,022.850"
        },
        "market_summary": "### GER40 Market Briefing  \n* **Key Drivers:** ECB flags uncertain outlook amid trade and geopolitical risks.  \n* **Price Action:** DAX led European declines, down ~0.5%.  \n* **Sector Performance:** Mining and auto shares under pressure; cyclicals sold off.  \n* **Central Bank View:** ECB maintains inflation will settle near 2% over medium term.  \n* **Market Sentiment:** Growth concerns outweigh inflation fears.  \n---\n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "European Stocks Slip As ECB Flags An Uncertain Outlook - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/european-stocks-slip-as-ecb-flags-an-uncertain-outlook",
                "body": "Mining and auto shares led the declines, while the ECB stuck to its view that inflation will settle back near 2% over time.\n1 min\nWhat’s going on here?\nEuropean stocks fell Thursday after the European Central Bank warned the outlook is “still uncertain,” pushing investors out of cyclical sectors like miners and automakers.\nWhat does this mean?\nThe Stoxx Europe 600 closed about 0.5% lower, with Germany’s DAX leading declines. The ECB tried to split the difference: it called the economy “resilient” but flagged trade policy uncertainty and geopolitical tensions as big risks. At the same time, it repeated that inflation should drift back toward its 2% target over the medium term, which helps anchor rate expectations even if it doesn’t fix short-term growth worries. Company updates didn’t change the mood much, ei..\nther: AstraZeneca slipped despite progress on an EMA review for its Enhertu application with Daiichi Sankyo.\nWhy should I care?\nFor markets: Cyclicals got punished, not because inflation flared up.\nThe day’s losers were the most economy-tied names: major miners and steelmakers slid, and autos were hit even harder. That’s a classic “growth nerves” tape – investors worry about demand and global trade more than a fresh jump in prices, especially with the ECB still pointing to 2% inflation longer term. There were bright spots, but they were stock-specific: TechnipFMC topped profit forecasts and raised its 2026 subsea revenue outlook, showing investors are still willing to reward clear earnings momentum.\nThe bigger picture: Uncertainty can reshape which sectors lead.\nIf inflation is cooling but trade and geopolitics stay messy, businesses tend to delay big decisions and households pull back on discretionary spending. In that kind of backdrop, markets often favor firms with steadier demand and pricing power over companies tied to commodities or big-ticket purchases like cars. So Europe’s leadership could keep rotating toward “defensive” earnings until the growth picture clears.\nThis content is free, but you must be logged in to continue reading.\nAlready have an account?"
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "302.500",
            "open": "24,878.030",
            "close": "24,766.320",
            "high": "24,984.030",
            "low": "24,681.530"
        },
        "market_summary": "### NDX100 Market Briefing\n* **Key Drivers:** Waste management sector performance; Casella Waste Systems meets revenue expectations but shows margin pressure.\n* **Sector Impact:** Casella's 9.7% revenue growth aligns with forecasts, but declining operating margins (-1.8pp YoY) signal cost challenges.\n* **Technical Outlook:** Industrials subsector faces scrutiny as efficiency concerns rise despite top-line growth.\n---\n**Overall Sentiment:** Neutral ⚖️",
        "source_articles": [
            {
                "title": "Casella Waste Systems’s (NASDAQ:CWST) Q4 CY2025 Earnings Results: Revenue In Line With Expectations - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/casella-waste-systems-nasdaq-cwst-213721566.html",
                "body": "Waste management company Casella (NASDAQ:CWST) met Wall Street’s revenue expectations in Q4 CY2025, with sales up 9.7% year on year to $469.1 million. The company’s outlook for the full year was close to analysts’ estimates with revenue guided to $1.98 billion at the midpoint. Its non-GAAP profit of $0.30 per share was 33.6% above analysts’ consensus estimates.\nCasella Waste Systems (CWST) Q4 CY2025 Highlights:\nRevenue: $469.1 million vs analyst estimates of $470.8 million (9.7% year-on-year growth, in line)\nAdjusted EPS: $0.30 vs analyst estimates of $0.22 (33.6% beat)\nAdjusted EBITDA: $107 million vs analyst estimates of $105.2 million (22.8% margin, 1.7% beat)\nEBITDA guidance for the upcoming financial year 2026 is $460 million at the midpoint, in line with analyst expectations\nOperating Margin: 2.5%, down from 4.3% in the same quarter last year\nFree Cash Flow Margin: 8.4%, down from 13.9% in the same quarter last year\nMarket Capitalization: $6.50 billion\n“We delivered strong fourth quarter results in line with expectations, closing the year on a high note and carrying positive momentum into 2026,” said Edmond (“Ned”) R. Coletta, President and CEO of Casella Waste Systems, Inc.\nCompany Overview\nStarting with the founder picking up garbage with a pickup truck he purchased using savings from high school, Casella (NASDAQ:CWST) offers waste management services for businesses, residents, and the government.\nRevenue Growth\nReviewing a company’s long-term sales performance reveals insights into its quality. Any business can have short-term success, but a top-tier one grows for years. Luckily, Casella Waste Systems’s sales grew at an incredible 18.9% compounded annual growth rate over the last five years. Its growth beat the average industrials company and shows its offerings resonate with customers.\nLong-term growth is the most important, but within industrials, a half-decade historical view may miss new industry trends or demand cycles. Casella Waste Systems’s annualized revenue growth of 20.5% over the last two years is above its five-year trend, suggesting its demand was strong and recently accelerated.\nThis quarter, Casella Waste Systems grew its revenue by 9.7% year on year, and its $469.1 million of revenue was in line with Wall Street’s estimates.\nLooking ahead, sell-side analysts expect revenue to grow 8% over the next 12 months, a deceleration versus the last two years. Despite the slowdown, this projection is above average for the sector and indicates the market is baking in some success for its newer products and services.\nCasella Waste Systems was profitable over the last five years but held back by its large cost base. Its average operating margin of 5.9% was weak for an industrials business. This result is surprising given its high gross margin as a starting point.\nAnalyzing the trend in its profitability, Casella Waste Systems’s operating margin decreased by 5.3 percentage points over the last five years. This raises questions about the company’s expense base because its revenue growth should have given it leverage on its fixed costs, resulting in better economies of scale and profitability. Casella Waste Systems’s performance was poor no matter how you look at it - it shows that costs were rising and it couldn’t pass them onto its customers.\nThis quarter, Casella Waste Systems generated an operating margin profit margin of 2.5%, down 1.8 percentage points year on year. Since Casella Waste Systems’s operating margin decreased more than its gross margin, we can assume it was less efficient because expenses such as marketing, R&D, and administrative overhead increased.\nEarnings Per Share\nRevenue trends explain a company’s historical growth, but the long-term change in earnings per share (EPS) points to the profitability of that growth – for example, a company could inflate its sales through excessive spending on advertising and promotions.\nCasella Waste Systems’s EPS grew at a decent 8.1% compounded annual growth rate"
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "64.490",
            "open": "6,876.880",
            "close": "6,856.160",
            "high": "6,896.410",
            "low": "6,831.920"
        },
        "market_summary": "### SPX500 Market Briefing\n* **Key Drivers:** No direct market-relevant news impacting SPX500 fundamentals.\n* **Price Action:** No specific price data or technical levels provided in articles.\n* **Technical Outlook:** No technical analysis or support/resistance levels mentioned.\n\n---\n**Overall Sentiment:** Neutral ⚖️\n\n**Note:** Articles focus on RFK Jr.'s workout habits and glyphosate policy, neither directly affecting SPX500 market dynamics.",
        "source_articles": [
            {
                "title": "Let’s Talk About RFK Jr.’s Workout Pants - The Atlantic",
                "source": "The Atlantic",
                "url": "https://www.theatlantic.com/health/2026/02/rfk-jrs-workout-pants/686071/",
                "body": "A post on X claimed to be a simple message from the U.S. Department of Health and Human Services: Stay active; eat well. But the 90-second video it shared, called “Secretary Kennedy and Kid Rock’s Rock Out Work Out,” seems designed to be bewildering. Here was Robert F. Kennedy Jr. eating steak and doing preacher curls in his belted blue jeans and a pair of hiking shoes; and here he was again, stripping off his T-shirt to ride an exercise bike inside a sauna; and here he was a little later, strutting over to a cold-plunge tub (still in his blue jeans but with the belt removed); and here he went into the tub, sliding underwater in his dungarees.\nWhy was the HHS secretary bathing in a pair of pants? The video never provides an answer for this question, even as Kennedy plays pickleball, then mugs for the camera, then soaks in a Jacuzzi with a glass of milk, all while still in jeans. It’s just bizarre—a PSA that presumably has been dialed in by his staff to maximize its WTF effect. (The video has been viewed more than 13 million times and produced some 11,000 replies; HHS did not respond to a request for comment about the video or the jeans.) However his peculiar gymwear habit started, its present state is very clear: The secretary’s jeans are self-aware.\nKennedy’s proclivity for working out in belted denim long predates the knowing wink with which it’s now displayed. Take the summer’s “DOD-HHS Fitness Challenge,” for which Kennedy donned his favorite workout gear and did a bunch of pull-ups with Secretary of Defense Pete Hegseth. Or the viral clip of him from 2023, wearing jeans and boots and nothing else, squeezing out a final set on Venice Beach. I don’t believe that these show a man who lifts in jeans to maximize his clicks. I believe that they show instead a man who fits a waning archetype in fitness culture, a species that has for decades been endemic to the gym: Kennedy is a jeans guy.\nI’ve worked out, off and on, for more than 30 years—and for all of that time, the jeans guys have remained a steady presence on the rubber floors. They are sometimes taciturn, sometimes chatty. They often pair their jeans with boots, as Kennedy will do, and with a T-shirt or a tank top or a hoodie. But lest you think he simply has no truck with any gym-specific gear, the jeans guy is sometimes spotted wearing padded lifting gloves, or a leather lifting belt across his Levi’s. At times, his social role will overlap with that of other weight-room regulars, not least of which is the gym grandpa, who hangs around and shoots the breeze and doles out tips on how to lift. However he appears, and however much he gabs, the jeans guy’s social status is the same: He’s an outsider. Rarely does one find a jeans guy paired up with a workout partner. “It’s usually like, ‘The jeans guy rides alone,’” Tolga Ozyurtcu, a historian of physical culture at the University of Texas at Austin, told me when I called him up to talk about this phenomenon.\nNot everyone enjoys the company of the jeans guy. Some see him as a threat. Planet Fitness once made a point of banning denim in the gym, along with grunting, dropping dumbbells, and judging others. (Those who broke these rules could be punished with a “lunk alarm” and summarily kicked out.) But this discrimination feels as ill-considered as it is unfair: In my experience, jeans guys are harmless at the very worst, and at best, they add some needed color to a dreary landscape. In this way, the jeans guys are akin to other gentle curiosities, such as the shorts guys who alight on college campuses in wintertime, and the black chipmunks that scamper by from time to time in city parks.\nWhat motivates the jeans guy? No one knows. He is, if nothing else, as inscrutable as a four-leaf clover. Ask him why he isn’t wearing shorts, and he will likely tell you that he chooses denim for efficiency. When Fox News’s Jesse Watters asked Kennedy in August to explain his favored workout gear, all Watters got was this: “Well, I just star"
            },
            {
                "title": "RFK Jr.’s MAHA Movement Just Became a Sick Joke - New York Magazine",
                "source": "New York Magazine",
                "url": "https://nymag.com/intelligencer/article/rfk-jr-glyphosate-roundup-trump-executive-order-maha-movement.html",
                "body": "There has always been a bit of humor latent in Robert F. Kennedy Jr.’s Make America Healthy Again movement. Most Americans agree with the Health secretary’s views that Big Pharma has too much influence over our health-care system and that a program of regular exercise and whole foods is good for you. Fewer probably think that going on social media to promote a fast-food restaurant that serves fries cooked in beef tallow or shirtless weight lifting with Kid Rock are the best ways to go about this.\nBut a new executive order from President Donald Trump — whose second administration subsumed the MAHA agenda last year — has now turned Kennedy’s policy slogan into a total joke. Late on Wednesday, the president signed the mouthful of an order “Promoting the National Defense By Ensuring an Adequate Supply of Elemental Phosphorus and Glyphosate-based Herbicides.” The first chemical Trump is boosting via the Defense Production Act is used to create fertilizer. But glyphosate is the active ingredient in the herbicide Roundup. In 2019, a meta-analysis by the University of Washington found that increased exposure to glyphosate boosts the risk of Hodgkin’s lymphoma, a cancer that affects the lymphatic system, by up to 41 percent. That link has also been alleged in tens of thousands of lawsuits. Just the day before the order, Bayer — the owner of Monsanto, which makes Roundup — agreed to pay $7.25 billion to settle thousands of these lawsuits. In total, the German pharma giant has paid out $14 billion for the damages caused by its glyphosate weed killer.\nOne might think that Kennedy might push back on his boss’s executive order promoting glyphosate. “If my life were a Superman comic, Monsanto would be my Lex Luther,” he wrote on Facebook in 2020. “I’ve seen this company as the enemy of every admirable American value.” In 2018, he even represented a client who sued Monsanto to win a $289 million payment, convincing a jury that the company knew its product caused cancer.\nBut this Superman just surrendered to LexCorp. In a statement late on Wednesday night, Kennedy bowed to his boss. “Donald Trump’s executive order puts America first where it matters most — our defense readiness and our food supply,” Kennedy said. “We must safeguard America’s national security first, because all of our priorities depend on it.”\nKennedy’s coalition was naturally furious with his decision to support the order publicly. Ken Cook, the president of Environmental Working Group, which has supported some of Kennedy’s agenda, said in a statement that he “can’t envision a bigger middle finger to every MAHA mom than this.” Gary Ruskin, an advocate for transparency in food and climate science, wrote on X that it was an “affront to MAHA, and a sweetheart favor to the pesticide industry.”\nThe timing of Trump’s order could be quite convenient for Bayer. The Defense Production Act allows companies to be protected from some liability lawsuits. In a few weeks, the Supreme Court will begin to hear arguments in a case to determine if federal law protects pesticide manufacturers from state-level suits. If the Court rules against the pesticide maker, Trump’s order could give them temporary reprieve from more costly lawsuits.\nThere has always been some tension between Kennedy’s statements that he wishes to cut corporate influence in food and medicine in America — and the reality where his policies are influenced by ties to massive industries. But Making America Poisoned Again feels a little too much, even for this administration."
            },
            {
                "title": "Emergency lane closures on SR 99 1st Avenue S. Bridge after inspection cause traffic backups - KIRO 7 News Seattle",
                "source": "KIRO 7 News Seattle",
                "url": "https://www.kiro7.com/news/local/emergency-lane-closures-sr-99-1st-avenue-s-bridge-after-inspection-cause-traffic-backups/2BBM4OBWLZAGLFWW73NBMTJDVI/",
                "body": "SEATTLE — The Washington State Department of Transportation (WSDOT) closed two lanes of the First Avenue Bridge in Seattle on Thursday morning for an inspection, causing significant traffic delays. There is currently no timetable for when the affected lanes on State Route 99 will reopen to traffic.\nThe closure of the right two lanes led to backups around mid-morning that stretched at least 3.5 miles on northbound State Route 509 heading into Georgetown and SODO. While the agency announced the closure on X, formerly Twitter, many commuters were unaware of the change until they reached the bridge ramps and slowed traffic.\nCommuters traveling into the city faced unexpected delays throughout the morning rush hour. Jimmy Z, a local commuter, noted the difficulty the closure would cause for those using the route over the coming week.\n“It’s kind of going to be tough coming through traffic for a couple of days,” Z said.\nOther drivers reported their travel times more than doubled due to the congestion on the bridge and surrounding ramps. Catalina Orozco, a commuter traveling from Burien, said her trip took 30 minutes on a route that normally takes 10 to 15 minutes.\n“I was going to detour, but I was like, ‘Ah, I’m already stuck in traffic. Might as well just ride it out,’” said Orozco.\nWSDOT officials are still assessing the situation as the inspection continues. A spokesperson for the agency stated during the mid-morning hours that they were still gathering information. The agency has not yet provided a specific reason for the inspection or a date for when full capacity will be restored to the bridge.\nWSDOT stated it will provide updates as more information becomes available regarding the inspection results and reopening plans.\n©2026 Cox Media Group"
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "445.000",
            "open": "57,031.200",
            "close": "56,861.200",
            "high": "57,136.200",
            "low": "56,691.200"
        },
        "market_summary": "### JPN225 Market Briefing\n* **Key Drivers:** Takaichi trade inflows favoring large caps, yen weakness boosting exporters, AI optimism lifting tech sentiment.\n* **Price Action:** Nikkei edged higher amid softer yen and global tech lift; Advantest fell after cyber incident.\n* **Technical Outlook:** Bullish flag formation in progress; key resistance at **58,800 yen**, with potential upside to **62,800 yen** on breakout.\n\n---\n**Overall Sentiment:** Positive 📈\n- **Capital Flows:** Large-cap stocks benefiting from Takaichi trade and governance reforms, smaller stocks lagging.\n- **FX Impact:** Weaker yen supports exporters and multinationals; key driver for index strength.\n- **Sector Themes:** AI spending and semiconductor demand buoy tech; oil price gains mixed for energy and importers.\n- **Risk Factors:** Advantest cyber incident highlights single-stock risks; potential headwinds from yen strength or global risk-off sentiment.",
        "source_articles": [
            {
                "title": "Takaichi trade and AI fears leave Japan's smaller stocks straggling - Nikkei Asia",
                "source": "Nikkei Asia",
                "url": "https://asia.nikkei.com/business/markets/equities/takaichi-trade-and-ai-fears-leave-japan-s-smaller-stocks-straggling",
                "body": "TOKYO -- Japanese companies with smaller market values are being sidelined while blue-chip stocks surge to record highs as the Takaichi trade rakes in capital.\nMoney flows into bigger, more liquid shares; governance reforms also a tailwind\nIndexes for the Tokyo Stock Exchange's Prime, Standard and Growth markets highlight how large-cap stocks are riding the \"Takaichi trade\" while smaller companies and startups are lagging behind.\nTOKYO -- Japanese companies with smaller market values are being sidelined while blue-chip stocks surge to record highs as the Takaichi trade rakes in capital."
            },
            {
                "title": "Nikkei Edges Higher As Yen Weakens And Tech Leads - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/nikkei-edges-higher-as-yen-weakens-and-tech-leads",
                "body": "Japanese stocks climbed as a softer yen, oil’s jump on supply risks, and Wall Street’s AI-chip optimism lifted sentiment, even as Advantest dropped after a cyber incident.\n1 min\nWhat’s going on here?\nJapanese stocks nudged higher Thursday as a weaker yen and a global tech lift outweighed a cybersecurity incident at chip tester Advantest.\nWhat does this mean?\nA softer yen tends to help Japan’s big exporters because overseas sales translate into more yen, and it can buoy sentiment when the US dollar firms. Outside currencies, investors took encouragement from the AI boom after Nvidia flagged a multiyear plan to supply Meta with millions of chips, a read-through for parts of the semiconductor supply chain. Oil also jumped on geopolitical supply-risk worries – supportive for energy names but a headwind for import-reliant Japan. Meanwhile, strong December mach..\ninery orders showed momentum, even as forecasts pointed to a cooler January–March patch.\nWhy should I care?\nFor markets: FX still sets the tone for Japan’s heavyweights.\nWhen the yen slides, indexes like the Nikkei can look healthier even if domestic demand is mixed, because multinational earnings get a translation bump. But single-stock risks can still dominate headlines – Advantest fell after disclosing a cyber incident involving unauthorized access and possible ransomware, with damages still being assessed.\nThe bigger picture: Capital flows are becoming part of the growth story.\nJapan’s pledge to channel investment into the US highlights how firms are trying to secure exposure to areas like energy and advanced computing infrastructure. Pair that with steady AI spending, and Japan’s market outlook increasingly depends on where companies deploy capital globally, not just on local rates or the yen.\nThis content is free, but you must be logged in to continue reading.\nAlready have an account?"
            },
            {
                "title": "Nikkei Forecast Today 19/02:Nikkei 225 Continues to Build Up - DailyForex",
                "source": "DailyForex",
                "url": "https://www.dailyforex.com/forex-technical-analysis/2026/02/nikkei-forecast-19-feb-2026/241427",
                "body": "There has been a lot of buying pressure in the Asian indices, and the Nikkei 225 will not be any different. Ultimately, this is one of the better opportunities out there.\nNikkei 225\nOne quick glance at the Nikkei 225, you can see that there are plenty of buyers in this market. The market is likely to continue to perhaps grind back and forth, and I do think we’re in the midst of forming a bullish flag.\nIf the Japanese yen continues to get hammered, and I think it will longer term, it’s very possible that the Nikkei takes off. The 58,800-yen level is an area I’m watching very closely. A break above that opens up a much bigger move, probably somewhere in the neighborhood of around 4,000 yen to put us at about 62,800 yen before it’s all said and done.\nEconomic Stimulus and Regional Support\nShort-term pullbacks offer value. The 50-day EMA is starting to reach towards the 54,750-yen level, an area that was a previous resistance barrier and I think will attract a lot of attention.\nRegardless, I’ve got no interest whatsoever in trying to short this market. I think it’s a market that will continue to see buyers jump into it as the Japanese government has made it painfully obvious that they are going to do everything they can to stimulate the economy, and therefore I think most of the companies in the Nikkei will be big winners.\nFurthermore, you also have regional pressure as well. One quick look at the KOSPI in South Korea tells you the same story. Asian stocks are on fire. The Nikkei is probably the easiest way for most retail CFD traders to play it, so I’m watching this one closely. I do think it’s probably only a matter of time before we break out.\nTop Regulated Brokers\nReady to trade the daily stock market forecast? We’ve shortlisted the best Forex brokers for CFD trading in the industry for you."
            }
        ]
    }
]