[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "99.800",
            "open": "4,195.960",
            "close": "4,171.100",
            "high": "4,245.150",
            "low": "4,145.350"
        },
        "market_summary": "### Gold (XAU/USD) Market Briefing\n\n* **Key Drivers:** The **US Dollar's** strength, fueled by **hawkish** Federal Reserve signals, is pressuring **Gold** prices, while central bank buying and geopolitical instability provide underlying support.\n* **Price Action:** **Gold** broke below the key level of **$4,150**, showing **bearish** momentum, with immediate support at **$4,100** and resistance at **$4,210** and **$4,245**.\n* **Technical Outlook:** The Relative Strength Index (RSI) and Moving Average Convergence Divergence (MACD) indicate **negative** signals, suggesting a potential slide to **$4,050**, which could be seen as a buying opportunity by long-term investors.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "The US Dollar’s strength is causing Gold prices (XAU/USD) to decline during volatile trading sessions - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/the-us-dollars-strength-is-causing-gold-prices-xau-usd-to-decline-during-volatile-trading-sessions/",
                "body": "Gold prices are dropping amid a fluctuating trading session, impacted by a robust US Dollar due to risk-averse sentiment. The precious metal fell below a previous resistance level at $4,150 before the US market opened, touching intraday lows of around $4,130.\nA bearish trend appears as the Relative Strength Index (RSI) and Moving Average Convergence Divergence (MACD) show negative signals. Support stands at $4,100, near a trendline from early November, with a further focus on $4,050.\nResistance Levels For Gold\nImmediate resistance levels are at $4,210 and $4,245, with bulls needing to exceed these to aim for highs near $4,380. Gold has long served as a store of value, perceived as a safe haven during uncertain times.\nCentral banks, the largest gold holders, added 1,136 tonnes in 2022, reflecting high purchase rates especially by countries such as China, India, and Turkey. Gold typically inversely relates to the US Dollar and Treasuries, usually rising as the Dollar drops, allowing diversification.\nGeopolitical instability and recession fears can prompt Gold price hikes, as it climbs with lower interest rates but falls with higher ones. The US Dollar’s behaviour significantly influences Gold movements.\nGiven the current pullback in gold, we are watching the US Dollar’s strength closely, as it is the main driver of this move. The Dollar Index (DXY) has climbed back above the 106.00 level this week, fueled by Federal Reserve officials hinting that a December 2025 rate cut is now less likely. This sentiment is pushing gold below the key $4,150 support area.\nFed’s Influence On Gold\nThe Fed’s hawkish tone is supported by recent economic data, which we must factor into our strategies. The latest Consumer Price Index report for October 2025 showed inflation remaining unexpectedly stubborn at 3.5%, while the last jobs report added a solid 210,000 nonfarm payrolls. This strong data gives the central bank justification to delay easing, putting continued pressure on non-yielding assets like gold.\nFor the immediate weeks ahead, the bearish technical signals suggest a defensive posture is warranted. We see the break below $4,150 opening the door to the next support level at $4,100. Derivative traders could consider buying put options with a strike price near $4,100 or using bear call spreads to profit from a potential slide or sideways movement.\nHowever, we must remember the significant underlying support from central bank buying, which has been a powerful trend since the record purchases seen back in 2022. The World Gold Council confirmed this trend continued, with over 1,000 tonnes added to reserves in 2024 and another 950 tonnes purchased in the first three quarters of 2025. This persistent demand suggests that a deeper sell-off toward the $4,050 level would likely be viewed as a major buying opportunity by long-term players.\nTherefore, a contrarian strategy could involve positioning for a bounce from those lower levels. Selling cash-secured puts with a strike price around $4,050 could allow traders to collect premium while waiting for a potential entry point. If the market shows signs of bottoming out at that trendline support, we would see it as a signal to shift from a defensive to a cautiously bullish stance."
            },
            {
                "title": "Gold and silver prices drop sharply on hawkish Fed signals and easing safe-haven demand - The New Indian Express",
                "source": "The New Indian Express",
                "url": "https://www.newindianexpress.com/business/2025/Nov/15/gold-and-silver-prices-drop-sharply-on-hawkish-fed-signals-and-easing-safe-haven-demand",
                "body": "Gold and silver prices in the global markets fell significantly on Friday as investor sentiment weakened following a series of hawkish comments from US Federal Reserve officials. The remarks dampened expectations of a possible interest-rate cut in December, pushing traders to reassess their positions in precious metals.\nThe decline was further reinforced by the resolution of the US government shutdown. With the shutdown ending, concerns about economic disruption eased, reducing the safe-haven appeal that had recently supported bullion prices.\nMarket analysts noted that the combination of firmer rate-cut expectations being pushed back and a fading flight-to-safety trade weighed heavily on both gold and silver through the session. Since these metals offer no yield, higher-for-longer interest rates make them less attractive compared with interest-bearing assets.\nExperts believe that the current softness in bullion may persist in the near term. Unless there is a renewed surge in risk aversion or a clear shift in the Federal Reserve’s policy tone, gold and silver could remain under pressure as investors track upcoming US economic data and policy statements.\nIndia\nThe price trend in India for gold and silver showed a mixed but steady trend on Saturday, November 15, with both metals holding near recent highs despite a brief phase of consolidation. Domestic prices reflected the influence of global market cues, currency movements and the easing of festival-driven demand.\nGold prices remained firm, with 24-carat rates across major cities hovering around Rs 1.27 lakh per 10 grams. The metal has been under mild pressure after US Federal Reserve officials signalled a cautious stance on cutting interest rates. Their comments strengthened the US dollar, reducing the appeal of non-interest-bearing assets like gold. Even so, domestic demand from weddings and jewellery buyers kept prices supported, and local premiums remained intact in several markets.\nSilver prices softened slightly after their sharp rise in recent weeks. Rates on November 15 averaged around Rs 1.73–1.75 lakh per kilogram in key cities, including Chennai. The marginal dip followed a surge during the festive season, when industrial offtake and retail buying pushed silver to record levels. As festival demand tapered, premiums eased, but the broader uptrend stayed in place due to strong global industrial demand, particularly from electronics and clean-energy sectors.\nMarket analysts noted that both metals are in a consolidation phase after significant gains. Gold is trading just below its recent peak and could resume its upward move if global uncertainty persists or if the dollar weakens. Silver continues to show higher volatility and remains sensitive to shifts in industrial demand and speculative activity.\nFor buyers, the current level represents a stable but elevated price zone. Jewellery demand is expected to remain steady through the ongoing wedding season, while investors may prefer to wait for clearer global signals before making large purchases. The next direction for both metals will likely be shaped by US economic data, upcoming central bank communication and any movement in the rupee against the dollar.\nKey drivers behind global price trend\nThe precious metals lost ground as investors reassessed the outlook for US monetary policy. Since bullion offers no yield, expectations of higher-for-longer interest rates tend to reduce its appeal. Recent remarks from Federal Reserve officials, which played down the likelihood of a December rate cut, added to the pressure and weakened sentiment across precious metals. The prolonged US government shutdown had earlier created gaps in key economic data, making the policy path harder to gauge and pushing markets to temper their rate-cut expectations even further.\nWith the shutdown now resolved, the urgency for safe-haven assets has eased. During the weeks of political uncertainty, delayed economic indicators and disruptions in governme"
            },
            {
                "title": "SBI Research Reveals Crucial Inflation Insight, Retail Inflation May Turn Negative Without Gold Impact - Free Press Journal",
                "source": "Free Press Journal",
                "url": "https://www.freepressjournal.in/business/sbi-research-reveals-crucial-inflation-insight-retail-inflation-may-turn-negative-without-gold-impact",
                "body": "Mumbai: SBI Research put out a report with a cool finding about India's retail inflation. Guess what? If you take gold out of the stuff we use to measure prices (CPI), inflation could be negative for the next couple of months. That means prices might actually drop a bit!\nLast October, India's inflation was super low at just 0.25 percent. This was because veggies, beans, spices, fruits, oils, and fats got cheaper.\nGold's Crazy Impact on Inflation\nSo, gold prices shot up, making personal care and effects inflation jump to a wild 57.8 percent! But, without gold, the main inflation number goes down to -0.57 percent. Regular inflation stayed about the same in October, but take out gold, and it drops to 2.6 percent. Those GST changes we had are helping lower inflation a lot, more than we thought.\nInflation Varies by State\nInflation is doing all sorts of different things depending on where you are. Kerala's got the highest at 8.56 percent, but Jammu & Kashmir and Karnataka are chilling below 3 percent. Out of 22 states, 12 have negative inflation, and the others are really low.\nRBI's Tricky Situation\nThe report says that low inflation and fast GDP growth (over 7 percent) are making things tough for the Reserve Bank of India (RBI). Next month, they have to be careful to help the economy grow but also not let prices go wild. Plus, the inflation numbers coming out for November and December, along with the Q3 GDP numbers, will help the RBI figure out what to do next.\nThe report also says that the RBI didn't change rates last time, so they don't have many options now. Any rate cuts they do will have to be done really carefully. Since inflation might stay low for a while, the RBI has to handle low prices and still help the economy grow."
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.095",
            "open": "62.765",
            "close": "63.108",
            "high": "63.650",
            "low": "62.555"
        },
        "market_summary": "### Spot Brent Crude Oil Market Briefing\n\n* **Key Drivers:** Geopolitical tensions in the Middle East, particularly the conflict between Israel and Hamas, and the seizure of a Marshall Islands-flagged oil tanker by Iran, are **bullish** factors. However, OPEC's warning of a potential **oil surplus** in 2026 and rising US inventories are **bearish**.\n* **Price Action:** Currently trading near **$88** per barrel, with a potential range of **$93** to **$102** per barrel in a \"small disruption\" scenario, and up to **$157** per barrel if the Middle East conflict broadens.\n* **Technical Outlook:** Immediate support is near the recent low of **$62.53**, with resistance at **$90** per barrel.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "Oil could surge to record $157 per barrel if Middle East turmoil spreads: World Bank [Video] - AOL.com",
                "source": "AOL.com",
                "url": "https://www.aol.com/oil-could-surge-record-157-150129151.html?utm_source=chatgpt.com",
                "body": "Oil could surge to record $157 per barrel if Middle East turmoil spreads: World Bank\nOil could surge up to a record $157 per barrel if the Middle East conflict broadens and creates a large disruption in the markets, the World Bank has warned.\nThe grim forecast is part of the institution's Commodity Markets Outlook, where it lays out three risk scenarios amid the ongoing war between Israel and Hamas and the continuing conflict in Ukraine.\nIn a “large disruption” scenario the global oil supply would fall by 6 million to 8 million barrels per day. That would drive prices up by 56% to 75% initially to between $140 and $157 a barrel, says the report.\nThe World Bank also describes a \"medium disruption\" risk scenario in which crude reaches $109 to $121 per barrel. In the case of a \"small disruption\" oil prices would increase to a range of $93 to $102 a barrel.\nThe report says high prices of oil and other commodities \"would intensify food insecurity in the region and across the world.\"\n“If a severe oil price shock materializes, it would push up food price inflation that has already been elevated in many developing countries,” said Ayhan Kose, the World Bank’s deputy chief economist.\nAdvertisement\nUnder the World Bank’s baseline outlook, crude is expected to average $90 a barrel in the current quarter before declining to an average of $81 a barrel in 2024 as the global economy slows.\nWest Texas Intermediate (CL=F) and Brent (BZ=F) crude futures hovered above $82 and $88 per barrel Tuesday midday, down about 8% over the last 10 days.\nPrices surged more than 4% in one day after Hamas attacked Israel earlier this month, amid fears the fighting would bring in nearby Iran, an oil-producing country.\nThe World Bank report points out the conflict's modest impact on commodity prices so far reflects a more diversified world oil supply market, individual countries' petroleum reserves, and reduced overall oil dependence.\nInes Ferre is a senior business reporter for Yahoo Finance. Follow her on Twitter at @ines_ferre.\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\nRead the latest financial and business news from Yahoo Finance"
            },
            {
                "title": "Oil Prices Slip As Supply Forecast Clouds The Outlook - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/oil-prices-slip-as-supply-forecast-clouds-the-outlook",
                "body": "OPEC's fresh warning of a 2026 oil surplus and higher US inventories are putting more weight on already weakening crude prices.\n3 days ago • 1 min\nJoin the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nOil prices slipped again this week, with both brent crude and WTI falling after reports showed rising US oil stockpiles and OPEC warned of a potential supply glut coming in 2026.\nWhat does this mean?\nBrent crude dipped to $62.53 a barrel and WTI to $58.31, as traders grappled with growing signs of oversupply. Fresh figures from the American Petroleum Institute revealed US crude inventories rose by 1.3 million barrels for the week ending November 7, underscoring worries about excess supply. Meanwhile, shrinking gasoline and distillate stockpiles hinted at a patchy but still present demand for fuel. The biggest shakeup came from OPEC’s latest outlook, which now sees a surplus rather than a deficit in 2026. That shift has analysts at DBS Bank and Haitong Securities sounding cautious, with OPEC's new expectation and expanding US stockpiles both adding to a bearish mood around oil prices.\nWhy should I care?\nFor markets: Supply worries keep investors on edge.\nOil futures have wobbled as traders react to OPEC’s updated surplus forecast and growing US reserves. Investors are weighing what this means for major energy stocks, with some reducing bets on oil-related assets. Refining margins and demand trends are in the spotlight as analysts look for fresh signs the sector could steady, though persistent supply growth may keep oil prices muted well into the new year.\nThe bigger picture: Lower prices could ripple through the global economy.\nOPEC’s revised projections aren’t just swaying traders – they could shape long-term investments in the energy sector. Should supply keep outstripping demand, some oil-producing countries could be forced to consider output cuts to support budgets. On the flip side, lower oil prices might offer a silver lining for energy-importing economies, softening inflation and giving consumers a bit more spending room.\nMentioned in story\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article is based on reporting by MT Newswires. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies.\nGet the two biggest stories in finance, and the reasons why you should care, delivered to your inbox every day."
            },
            {
                "title": "Iran says it seized Marshall Islands-flagged oil tanker in Gulf - Middle East Eye",
                "source": "Middle East Eye",
                "url": "https://www.middleeasteye.net/news/iran-says-it-seized-marshall-islands-flagged-oil-tanker-gulf",
                "body": "Iran says it seized Marshall Islands-flagged oil tanker in Gulf\nIran confirmed on Saturday that it had seized a Marshall Islands-flagged oil tanker in the Gulf.\nLocal media said the Islamic Revolutionary Guards Corps (IRGC) seized the tanker, which was carrying petrochemical cargo bound for Singapore, on Friday.\nThe authorities said \"the tanker was in violation for carrying unauthorised cargo\" without providing specifics.\n\"Yesterday morning at 7.30 [4am GMT], after a judicial authority ordered the seizure of the cargo of an oil tanker with the trade name Talara and the flag of the Marshall Islands, the Islamic Revolutionary Guard Corps (IRGC) rapid reaction units of the naval forces monitored its movements and intercepted and seized it,\" said a statement from the IRGC.\nEllie Shafik of Vanguard Tech told AFP it was \"unclear\" what the actual reason was for the seizure.\nNew MEE newsletter: Jerusalem Dispatch\nSign up to get the latest insights and analysis on Israel-Palestine, alongside Turkey Unpacked and other MEE newsletters\n\"Iran will likely frame this as a judicially ordered, law-based action, masking what may just be a strategic seizure,\" Shafik said.\nThe seizure comes as tensions between Iran and the West have continued to mount over the country's nuclear programme.\nWidespread United Nations sanctions, including an arms embargo, against Iran were reinstated in September, following the collapse of nuclear negotiations.\nOmani-mediated talks between Iran and the United States collapsed in June after Israeli and American strikes on Iran, bringing diplomatic progress to a halt.\nTehran maintains that its nuclear programme is peaceful and denies any intention to develop nuclear arms.\nThe reimposed sanctions were a \"snapback\" mechanism from the 2015 nuclear agreement, which had suspended penalties in exchange for restrictions on Iran's nuclear programme.\nThat deal began to unravel after US President Donald Trump withdrew in 2018 and reimposed crippling US sanctions, including efforts to block Iranian oil exports, plunging Iran deeper into economic crisis.\nMiddle East Eye delivers independent and unrivalled coverage and analysis of the Middle East, North Africa and beyond. To learn more about republishing this content and the associated fees, please fill out this form. More about MEE can be found here."
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.080",
            "open": "58.525",
            "close": "58.695",
            "high": "59.300",
            "low": "58.220"
        },
        "market_summary": "### Spot WTI Crude Oil Market Briefing\n\n* **Key Drivers:** OPEC's warning of a potential **2026 oil surplus** and rising **US oil inventories** are weighing on crude prices, while recent **Ukrainian drone strikes** and **US sanctions on Russian oil** are introducing **supply chain disruptions**.\n* **Price Action:** **WTI** prices have been volatile, recently falling to **$58.31** a barrel before jumping over **2%** due to the drone strike and sanctions, showcasing **bullish momentum** in response to supply threats.\n* **Technical Outlook:** Immediate support is near the recent low of **$58.31**, with resistance at the pre-disruption high, indicating a potential **bearish** trend reversal due to **oversupply concerns** and a **shifting OPEC outlook**.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "PA Oil & Gas Weekly Compliance Dashboard - Nov. 8 to 14 - One Owner Abandons 36 Conventional Wells; Failed To Cleanup Shale Gas Spill For 498 Days - PA Environment Digest Blog",
                "source": "PA Environment Digest Blog",
                "url": "http://paenvironmentdaily.blogspot.com/2025/11/pa-oil-gas-weekly-compliance-dashboard_15.html",
                "body": "Follow these links to spreadsheets showing the violations and inspections occurring between November 8 to 14--\nClick Here for violations issued. Click Here for inspection entries.\n[Note: There were many more violations issued by DEP than PA Environment Digest can highlight here.]\nEnforcement Actions Taken Last Week\nSo far this year, DEP took these actions as of November 7--\n-- NOVs Issued In Last Week: 184 conventional, 9 unconventional\n-- Year To Date - NOVs Issued: 5,226 conventional and 1,125 unconventional\n-- Enforcements 2025: 384 conventional and 143 unconventional (orders, agreements)\n-- Inspections Last Week: 502 conventional and 375 unconventional\n-- Year To Date - Inspections: 17,546 conventional and 22,306 unconventional\nRock Oil Resources LLC Issued Violations For 36 Abandoned Conventional Wells\nOn November 6 & 7, 2025, the Department of Environmental Protection inspected 36 conventional oil and gas wells owned by Rock Oil Resources LLC and found them continued to be abandoned and not plugged in Allegheny Township, Venango County for 639 days and counting. The original violations for abandonment and failing to submit annual production, waste generation/disposal and well integrity reports were issued on February 5, 6 & 7, 2024. Read more here.\n3 More Abandoned Conventional Wells\nKriebel Natural Gas Co LLC\nNovember 12, 2025 routine inspection of the SH Bollinger 1 conventional well in Kiskiminetas Township, Armstrong County found the well abandoned and not plugged. The owner failed to submit production, waste generation and well integrity reports. Response requested by November 28. DEP inspection report. Kriebel Natural Gas holds 1,680 permits.\nRonald D. Meyer\nNovember 13, 2025 routine inspection of the Rowland 2 2 conventional well in Le Boeuf Township, Erie County found the well abandoned and not plugged. The owner failed to submit production, waste generation and well integrity reports. Response requested by December 11. DEP inspection report. Ronald Meyer holds 1 permit.\nNorbert J. Cross\nOctober 31, 2025 routine inspection of the Norbert & Nancy Cross 3 conventional well in Waterford Township, Erie County found the well abandoned and not plugged. The well was never inspected. Failed to submit production, waste generation and well integrity reports. Research found the owner passed away in 2008 as well as his brothers and the wells have not been tended since their passing. DEP inspection report. Norbert Cross held 3 permits.\n591 Abandoned Conventional Well Violations In 2025\nSo far in 2025, DEP issued or continued 591 violations to 120 conventional oil and gas well owners for abandoning and not plugging their wells.\nIn 2024, DEP issued 860 new or continued violations to conventional oil and gas well owners for abandoning and not plugging their wells.\nThe violations were issued to these conventional owners in 2025: 3D Resources LLC ; All American Energy Inc.; Amer Natural Resources LLC; WB Anderson; Apex Energy (PA), LLC; Apollo Resources LLC; ARG Resources Inc.; Baird Oil Co.; Carol A. Morrison Baker; Baron Crest Energy Co.; Bialy Gas Production LLC; Blackrock Enterprises LLC; Darrel B. Blauser; JJ Bucher Producing Corp; Chris E. Burke; Cohen IND Inc.; Consolidated Coal Co.; Dorothy Craft; Edward E. & Frederick J. Craig; Edward E. Craig; Norbert J. Cross; Crude A Co - Randy L. Larkin; Dannic Energy Corp.; Harold H. Davis; Lewis E. Davis; Paul H. Deeter; Delong Oil Inc.; Developed Resources, Inc.; Randy A. Dietterich; Diversified Production LLC; East Resources Inc.; Eastern Gas Trans & Storage Inc.; Eastern Natural Resources LLC; Elder Oil & Gas Co; Equitrans LP; EQT Production Co.; Exotic Oil & Gas LLC; Ex-Treme Oil And Gas LLC; Glade Resource Developers; Greenway Energy LLC; H & S Gas & Oil; Michael Harju; Donald S. Kelly; Harry L. King; Thomas A. Hodge; Horizontal Exploration LLC; Howard Drilling Inc.; Robert L. Hunter; Iron Pennsylvania Land LLC; Donald Jeannerett; JPS Lawncare & Landscaping; Mary Jane Katchmark"
            },
            {
                "title": "Oil Prices Slip As Supply Forecast Clouds The Outlook - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/oil-prices-slip-as-supply-forecast-clouds-the-outlook",
                "body": "OPEC's fresh warning of a 2026 oil surplus and higher US inventories are putting more weight on already weakening crude prices.\n3 days ago • 1 min\nJoin the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nOil prices slipped again this week, with both brent crude and WTI falling after reports showed rising US oil stockpiles and OPEC warned of a potential supply glut coming in 2026.\nWhat does this mean?\nBrent crude dipped to $62.53 a barrel and WTI to $58.31, as traders grappled with growing signs of oversupply. Fresh figures from the American Petroleum Institute revealed US crude inventories rose by 1.3 million barrels for the week ending November 7, underscoring worries about excess supply. Meanwhile, shrinking gasoline and distillate stockpiles hinted at a patchy but still present demand for fuel. The biggest shakeup came from OPEC’s latest outlook, which now sees a surplus rather than a deficit in 2026. That shift has analysts at DBS Bank and Haitong Securities sounding cautious, with OPEC's new expectation and expanding US stockpiles both adding to a bearish mood around oil prices.\nWhy should I care?\nFor markets: Supply worries keep investors on edge.\nOil futures have wobbled as traders react to OPEC’s updated surplus forecast and growing US reserves. Investors are weighing what this means for major energy stocks, with some reducing bets on oil-related assets. Refining margins and demand trends are in the spotlight as analysts look for fresh signs the sector could steady, though persistent supply growth may keep oil prices muted well into the new year.\nThe bigger picture: Lower prices could ripple through the global economy.\nOPEC’s revised projections aren’t just swaying traders – they could shape long-term investments in the energy sector. Should supply keep outstripping demand, some oil-producing countries could be forced to consider output cuts to support budgets. On the flip side, lower oil prices might offer a silver lining for energy-importing economies, softening inflation and giving consumers a bit more spending room.\nMentioned in story\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article is based on reporting by MT Newswires. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies.\nGet the two biggest stories in finance, and the reasons why you should care, delivered to your inbox every day."
            },
            {
                "title": "Oil Prices Climb As Attacks And Sanctions Shake Supply Lines - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/oil-prices-climb-as-attacks-and-sanctions-shake-supply-lines",
                "body": "Brent and WTI crude jumped after a Ukrainian drone strike and new US sanctions on Russian oil, despite oversupply concerns and a shifting OPEC outlook.\n2 days ago • 2 mins\nJoin the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nBrent and WTI crude prices leapt more than 2% after a Ukrainian drone strike hit a major Russian oil port, while new US sanctions on Russian oil giants added fresh fuel to supply worries.\nWhat does this mean?\nOil markets, recently weighed down by fears of oversupply, made a rapid U-turn after news broke that a Ukrainian drone strike damaged the Novorossiysk oil depot—a critical Russian export hub on the Black Sea. That disruption rattled supply chains, sending Brent and WTI futures sharply higher after days of declines. Adding to the turmoil, the US slapped new sanctions on Lukoil and Rosneft, cutting off many transactions after November 21. JPMorgan reports about 1.4 million barrels per day of Russian oil are now stuck on tankers, struggling to find buyers amid tightening sanctions—a hurdle likely to grow as restrictions take hold. On top of this, OPEC revised its forecast to a slight global oil surplus by 2026, while the US reported higher-than-expected crude inventories. All together, these twists have made oil prices extra jumpy as traders try to make sense of the latest disruptions.\nWhy should I care?\nFor markets: Supply risks keep oil traders guessing.\nThis week’s rally shows how quickly oil markets can flip when new supply threats pop up. Even though OPEC sees a mild surplus ahead, immediate incidents—like attacks and sanctions—are keeping traders on edge. With Russian oil piling up on tankers and US stockpiles climbing, the near-term outlook is murky. All this uncertainty is fueling more volatility and a cautious approach from investors.\nThe bigger picture: Energy security moves to the forefront.\nGeopolitical flare-ups and sanctions are pushing energy security up the agenda for governments and companies alike. The difficulty moving Russian oil, shifting OPEC forecasts, and changing US inventories are prompting new strategies around where and how countries get their energy. This isn’t just about short-term price moves—these changes could reshape the way oil flows globally for years to come.\nMentioned in story\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies.\nGet the two biggest stories in finance, and the reasons why you should care, delivered to your inbox every day."
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0077",
            "open": "1.1591",
            "close": "1.1633",
            "high": "1.1656",
            "low": "1.1579"
        },
        "market_summary": "### EUR/USD Market Briefing\n\n* **Key Drivers:** The **Euro** remains strong amidst **USD** weakness, with the **EUR/USD** pair holding above **1.1600**. The **Fed's hawkish stance** and mixed **Eurozone data** contribute to the pair's stability.\n* **Price Action:** The pair is showing **bullish momentum**, with a weekly 0.51% rise, and is currently navigating a narrow channel between **1.1650** and **1.1665** resistance levels.\n* **Technical Outlook:** Immediate support is near the **1.1600** level, with **1.1500** serving as deeper structural support. Resistance levels are at **1.1659** (50-day moving average), **1.1665**, and **1.1720**.\n\n---\n**Overall Sentiment:** Neutral/Bullish ️",
        "source_articles": [
            {
                "title": "Euro Forecast: EUR/USD, EUR/JPY Show Relative Strength Amidst Major FX Consolidation - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/euro-forecast-eur-usd-eur-jpy-show-relative-strength-amidst-major-fx-consolidation/?amp=true",
                "body": "Euro Forecast: EUR/USD, EUR/JPY Show Relative Strength Amidst Major FX Consolidation\nEuro Forecast\nThe Euro remains as one of the stronger currencies in the FX market and that’s on display best in EUR/JPY, where a strong Euro and weak Japanese Yen have combined to drive the pair to fresh all-time-highs, with the pair stalling just before its first ever test of the 180 psychological level.\nWhile most global central banks would probably like to see some element of currency weakness at the moment, the fact that the Bank of Japan is in a position where it’s difficult to hike rates and the European Central Bank has already cut rates quite a bit, there’s been a defined fundamental bias on the long side of the pair that can remain attractive as we move into next week.\nI’ve been focusing on the long side of the pair and on EUR/JPY specifically as a way to work with Japanese Yen weakness that does not involve the US Dollar, because if we look at USD/JPY, we can see a bullish backdrop since the 140.00 support hold in April and even as DXY set fresh lows on day one of Q3 or on the Fed’s rate cut on September 17th, USD/JPY has continued into higher-lows. The major pair had its first test of the 155.00 handle in nine months last week, and that makes the prospect of chasing USD/JPY a bit more daunting, although I don’t expect 155.00 to bring on the intervention order from the Japanese Finance Ministry.\nEUR/USD\nIn the major pair of EUR/USD, I’m still considering it as one of the more attractive venues for USD-weakness, as I had looked at in the Tuesday webinar. Bulls took a step forward this week in pushing a breakout from a falling wedge pattern to continue a series of higher-highs and lows that started after a failed run from bears at a really big level.\nA week earlier, EUR/USD was trading below the 1.1500 level and I warned then that a clean break of a major psychological level like that was not something that I was expecting. That led to a pullback to a Fibonacci level by the end of that week, and that Fibonacci level at 1.1593 remains a big spot for the pair as it’s now higher-low support potential after functioning as prior resistance.\nEUR/USD Four-Hour Chart\nChart prepared by James Stanley; data derived from Tradingview\nEUR/USD Daily\nFrom the daily chart we can see that bulls aren’t exactly home free here, and this echoes the broader DXY backdrop where the Dollar set a fresh four-month-high two weeks ago and has been in pull back since. But – price in DXY held a big spot of support at the Fibonacci level of 98.98, and in EUR/USD, there’s still a claim for bearish structure on the daily chart.\nThis puts emphasis on a couple of key levels. First, it’s the swing high at 1.1668, which held two highs on the daily before sellers pushed down for a fresh low. And then it’s the Fibonacci level at 1.1686, which held the daily high on October 17th before the bearish trend got back in order.\nIf bulls can pose a break above those levels, particularly with a closed daily bar, it’s going to look more attractive for bullish potential in the pair – and for traders looking to work with USD-weakness, I still think this is one of the more attractive backdrops for such.\nAbove 1.1686 is the 1.1717 level followed by 1.1748, which was support-turned-resistance in September and early-October, just as the pair started to turn.\nEUR/USD Daily Chart\nChart prepared by James Stanley; data derived from Tradingview\nEUR/JPY\nI talk a lot about the Japanese Yen and it’s been an interesting year for the currency, both from a technical and fundamental point of view. USD/JPY was hit hard when recession fears were taking over in the US and that pushed USD/JPY down for another test of the 140.00 handle in April.\nBut – since then – USD/JPY has been showing higher-highs and lows and this made the pair as one of the more attractive majors to work with USD-strength, so that when we did have episodes like the early-October breakout in DXY, USD/JPY showed that quite well. And as a"
            },
            {
                "title": "EUR/USD Weekly Forecast: Holds Firm Ahead of Major Releases - Forex Crunch",
                "source": "Forex Crunch",
                "url": "https://www.forexcrunch.com/blog/2025/11/15/eur-usd-weekly-forecast-holds-firm-ahead-of-major-releases/",
                "body": "- The EUR/USD weekly forecast indicates a bullish bias, with the dollar under pressure amid growing economic concerns.\n- The probability of a December Fed cut reduced from 70% to 50% by Friday due to market caution and lack of visibility into economic data.\n- Traders look forward to the FOMC Minutes, NFP, and PMIs for fresh impetus.\nThe EUR/USD forecast indicates a modestly bullish tone, as the pair trades above 1.1600 after advancing for the second consecutive week, amid steady Eurozone data and mixed Fed signals.\n-Are you looking for automated trading? Check our detailed guide-\nThe Eurozone data offered little support to the shared currency. The Q3 GDP rose by 0.2% QoQ and 1.4% YoY, signaling a stable economic momentum. Industrial production and sentiment data revealed mixed figures.\nMeanwhile, some ECB officials and President Christine Lagarde reaffirmed that the central bank remains vigilant and the euro holds a strong position in terms of economic and monetary policy.\nFrom the US, the dollar remained under pressure last week, despite optimism surrounding the end of the US shutdown. Markets awaited the delayed economic release, which the shutdown had halted. Softer labor data pressured the dollar. Meanwhile, hawkish remarks from Fed officials, including Schmid, Kashkari, Bostic, and others, reduced expectations of a December cut.\nOn Friday, markets priced in a 50% probability of a December Fed cut, down from 70% the previous week. The development stemmed from policymakers emphasizing caution and transparency in the economic conditions before implementing further easing measures. The Fed Chair Powell’s statement regarding uncertainty over the December rate cut contributed to investor cautiousness.\nEUR/USD Weekly Key Events\nThe significant events in the coming week include:\n- EUR G20 Meeting\n- Fed’s Williams Speech\n- Fed’s Kashkari Speech\n- FOMC Minutes\n- Continuing Jobless Claims\n- Initial Jobless Claims\nNext week, traders anticipate the FOMC minutes, the G20 meeting, and speeches by Fed officials for further insights into policy cues and global risk sentiment. Markets also expect the long-overdue US NFP report on Thursday. However, the schedule is not clear yet.\nEUR/USD Weekly Technical Forecast: Wobbling Near Key DMAs\nThe EUR/USD daily chart shows the pair in a slight bullish tone earlier in the week after stabilizing above the 1.1600 level. However, the broader trend remains neutral. The upside momentum remains limited, as the pair remains below the key 50-, 100-, and 200-day MAs.\n-If you are interested in forex day trading, then have a read of our guide to getting started-\nThe RSI holds near the mid-50s, indicating fading selling pressure. Breaking above the 1.1650 level could trigger a sustained recovery towards yearly highs. Conversely, failure to hold above the 1.1600 level could lead to renewed downside pressure.\nSupport Levels\n- 1.1600\n- 1.1500\n- 1.1375\nResistance Levels\n- 1.1665\n- 1.1720\n- 1.1800\nLooking to trade forex now? Invest at eToro!\n67% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money."
            },
            {
                "title": "EUR/USD Price Forecast - Eur Holds 1.1600 as Fed Cuts Drop to 56% and Eurozone GDP Hits 1.4% - TradingNEWS",
                "source": "TradingNEWS",
                "url": "https://www.tradingnews.com/news/eur-usd-price-forecast-euro-holds-11600-fed-ressistance-cut-odds-drop-56-percent",
                "body": "EUR/USD Price Forecast - Euro Holds 1.1600 as Fed Resistance Cuts Odds Drop to 56% and Eurozone Growth Rebounds to 1.4%\nThe Euro stabilizes after a weekly 0.51% rise, supported by revised GDP and stalled U.S. data releases, while the Fed’s hawkish stance and the DXY bounce from 98.99 set the stage for a breakout | That's TradingNEWs\nEUR/USD Price Dislocation And Policy Divergence\nThe EUR/USD pair holds the 1.1600 line after a turbulent week that redefined the balance between U.S. policy uncertainty and Eurozone stability. The pair’s ability to end the week 0.51% higher, despite a 0.10% Friday pullback, reflects how aggressively markets repriced December rate-cut expectations from 70% earlier to 56% as hawkish Federal Reserve voices overwhelmed the absence of U.S. economic data during the shutdown. The U.S. Dollar Index rebounded to 99.31 after tagging 98.99, a Fibonacci pivot that halted a two-day sell-off and prevented EUR/USD from claiming a breakout above the 1.1659 50-day moving average. That failed breach kept 1.1659 as the ceiling, while 1.1600 remained the battlefield where intraday longs and shorts clashed into the weekend.\nEUR/USD And The Shifting Federal Reserve Narrative\nThe Fed delivered one of its most divided communication weeks of the year. Jeffrey Schmid, Kashkari, Musalem, Collins, Bostic, and other regional presidents leaned toward a more restrictive stance, warning that inflation remained “too hot” and policy was “only modestly restrictive.” Schmid’s pushback was especially impactful because he dissented at the last meeting and signaled he would likely oppose any December cut without forceful evidence of deterioration. In contrast, Stephen Miran doubled down on his dovish view, emphasizing that the latest data—what little was available—should push the Fed toward easing, not away from it. Meanwhile, Powell’s carefully-neutral tone, combined with Williams’ restrained messaging, locked markets in a holding pattern. With no labor data, no CPI, and no clarity due to the shutdown’s backlog, EUR/USD reacted to rhetoric rather than fundamentals, producing intraday spikes that failed to establish follow-through beyond the 1.1659 resistance.\nEUR/USD Anchored By Eurozone Stability And Revised Growth Data\nThe Eurozone provided a measurable counterbalance to U.S. policy turbulence. Revised Q3 GDP moving from 1.3% to 1.4% year-over-year, alongside a 0.2% quarterly gain, gave the euro just enough structural support to absorb dollar strength. Industrial production and sentiment data were mixed, but the absence of contraction allowed EUR/USD to remain resilient even as the U.S. dollar tried to rebound from deep oversold conditions. Christine Lagarde emphasized the bloc’s steady footing and reiterated vigilance without signaling policy urgency, a tone that contrasted sharply with the Fed’s contradictory messaging. The Eurozone data did not ignite a full bullish move, but it reinforced the floor above 1.1583, the 20-day moving average, and maintained 1.1500 as the deeper structural support that separates short-term noise from a real trend reversal.\nRead More\n-\nAlphabet Google Stock Price Forecast - GOOG Shares Surges Toward $288 as Massive $40B AI Investment\n15.11.2025 · TradingNEWS ArchiveStocks\n-\nXRP ETFs Ignite Wall Street: XRPI at $13.30 and XRPR at $18.61 as XRP-USD Stabilizes Near $2.25\n15.11.2025 · TradingNEWS ArchiveCrypto\n-\nNatural Gas (NG=F) Drops to $3.89 as Türkiye Spot Prices Spike and Global LNG Demand Accelerates\n15.11.2025 · TradingNEWS ArchiveCommodities\n-\nStock Market Today: Nasdaq Rebounds to 22,900 as NVDA Stock at $190 and MU Rally While Dow Falls to 47,147\n15.11.2025 · TradingNEWS ArchiveMarkets\n-\nUSD/JPY Price Forecast - Yen Surges Toward 154.60 as Fed Shifts to Neutral and Japan Raises Intervention Warnings\n15.11.2025 · TradingNEWS ArchiveForex\nEUR/USD Technical Posture And Momentum Alignment\nThe technical map shows EUR/USD navigating a narrow channel between resistance at 1.1650–1.1665 and foundational"
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0115",
            "open": "1.3127",
            "close": "1.3189",
            "high": "1.3216",
            "low": "1.3100"
        },
        "market_summary": "### GBP/USD Market Briefing\n\n* **Key Drivers:** Weaker-than-expected UK retail sales and rising unemployment to **5.0%** are increasing pressure on **GBP/USD**, while a **hawkish** tone from the Federal Reserve strengthens the dollar.\n* **Price Action:** Broke below the key psychological level of **1.3170**, showing significant **bearish** momentum, with the pair trading near **1.3130** and **1.3149**.\n* **Technical Outlook:** Immediate support is near **1.3010**, with resistance at **1.3170** and **1.3188**, capped by descending trendline resistance, and deeper support levels at **1.3058**, **1.3012**, and **1.2831**.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "GBP/USD Drops to 1.3130 as UK Retail Sales Miss, Unemployment Hits 5.0% and Dollar Strengthens - TradingNEWS",
                "source": "TradingNEWS",
                "url": "https://www.tradingnews.com/news/gbp-usd-price-forecast-pound-slumps-toward-13130",
                "body": "GBP/USD Price Forecast - Pound Slumps Toward 1.3130 as UK Data Softens\nWeak retail sales, rising unemployment to 5.0%, manufacturing at –1.7%, GDP at –0.1%, and a £30B fiscal gap pressure GBP/USD while the USD rebounds | That's TradingNEWS\nGBP/USD Macro-Pressure Repricing And Structural Weakness Under Tightening UK Data And Dollar Recovery\nGBP/USD trades in a compressed and fragile structure as the pair slides toward 1.3130, 1.3149, and repeatedly retests the 1.3010–1.3170 zone while the market digests an unusually dense cluster of UK macro readings, political developments, and a reawakening USD bid that has resurfaced across all major FX complexes. What is happening in GBP/USD right now is not drifting sentiment—it is a direct and violent repricing driven by a sequence of data points that landed far weaker than expected across retail activity, labour markets, industry output and housing conditions. Retail sales slowed to 1.5%, crushing the 2.4% expectation and disappointing even the prior 2.0%, signalling consumers are retrenching. The labour market corrected aggressively as Claimant Count Change surged to 29,000, nearly double the 17,600 forecast, while unemployment pushed to 5.0% and wage growth slipped to 4.8% from 5.0%, reinforcing the pressure on households. This contraction in both spending and income momentum fed directly into GBP/USD weakness, pushing the pair below 1.3170, 1.3150, and back toward its seven-month lows near 1.3149.\nGrowth Deterioration And Industrial Collapse Deepen Downside Pressure On GBP/USD\nIndustry data intensified the bearish load on the pound. Manufacturing production collapsed –1.7%, more than double the –0.7% estimate, while industrial production fell –2.0% versus –0.5% expected, confirming a broad slowdown in real economy output. GDP readings offered no relief: monthly GDP printed –0.1% against a flat estimate, and preliminary quarterly GDP came in at only 0.1% instead of 0.2%. Housing sentiment reinforced the contractionary theme as the RICS House Price Balance fell to –19%, missing the –14% projection and holding only marginally better than last month’s –17%, confirming the property market is losing confidence and liquidity. All these indicators collectively spell a deteriorating economic base—one that forces GBP/USD traders to reassess whether the softening trajectory leaves the pair vulnerable to further slides toward 1.3058, 1.3012, or the deeper wave projection around 1.2831 derived from the extended corrective structure from 1.3787.\nFiscal Instability And Political Risk Amplify Sterling Volatility Across GBP/USD\nThe political layer worsened the sell-off. The UK government’s decision to scrap planned income tax increases created significant unease about fiscal discipline, echoing the structural fragility seen in the 2022 mini-budget shock. With a budget deficit near £30 billion, the market is now questioning how the government will stabilize finances without added revenue. This is why GBP/USD reacted instantly—dropping to 1.3130, then 1.3149, and retesting 1.3150 during the Asian session. Investors immediately remembered the near-parity collapse from 2022, and the pound began to price a risk premium for policy inconsistency. The debt-to-GDP ratio hovering around 97.1% deepens investor scepticism and reduces the market’s willingness to re-rate the pound higher until a credible fiscal trajectory emerges. This created the environment where every recovery attempt was sold into, preventing sustained rebounds above 1.3170–1.3188, the exact region capped by descending trendline resistance.\nUSD Strength And The Repricing Of Federal Reserve Expectations Reinforce GBP/USD Downside\nThe USD side of the cross turned simultaneously stronger. Markets scaled back expectations for a December Fed rate cut as officials adopted a more hawkish tone, replaying the 2024 “higher for longer” dynamic. Treasury yields recovered, money markets reduced rate-cut probability, and demand for USD surged across majors—i"
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0056",
            "open": "0.6538",
            "close": "0.6528",
            "high": "0.6580",
            "low": "0.6523"
        },
        "market_summary": "### AUD/USD Market Briefing\n\n* **Key Drivers:** The Australian dollar remains **resilient** despite **bearish momentum**, supported by strong domestic data, including an unemployment rate of **4.3%** and an addition of **42.2k** jobs.\n* **Price Action:** The AUD/USD pair closed under **0.6550**, with the price remaining above the **50-** and **200-MA**, indicating support near **0.6500** and **0.6460** levels.\n* **Technical Outlook:** Immediate support is near **0.6500**, with resistance at **0.6560**, and a break above **0.6550** could ignite **upside continuation**, while a break below **0.6500** could trigger **downside pressure** towards **0.6400** and **0.6350**.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "AUD/USD Weekly Forecast: Aussie Holds Firm Ahead of RBA, FOMC Minutes - Forex Crunch",
                "source": "Forex Crunch",
                "url": "https://www.forexcrunch.com/blog/2025/11/15/aud-usd-weekly-forecast-aussie-holds-firm-ahead-of-rba-fomc-minutes/",
                "body": "- The AUD/USD weekly forecast indicates bearish momentum despite the resilient Australian dollar.\n- Australia’s unemployment data fell to 4.3% in October, with an addition of 42.2k jobs.\n- Traders anticipate the FOMC and RBA meeting minutes along with speeches by Fed officials next week.\nThe AUD/USD weekly forecast reflects a broader selling pressure, as the pair closed under 0.6550 by the end of the week. Despite an earlier rebound, the lifted greenback and an uncertain Fed policy stance weighed on the pair. However, the Australian dollar remained resilient amid strong domestic data and a stabilizing situation with China.\n-Are you looking for automated trading? Check our detailed guide-\nThe previous week’s unemployment data revealed a drop to 4.3% in October, with an increase in employment by 42.2k. Meanwhile, 55.3k full-time positions were added to the economy. These figures point towards a cautious RBA stance for 2025.\nChina’s upbeat data, showing a 4.9% rise in industrial production and 2.9% growth in October retail sales, further lifted the Aussie. However, if China’s economic growth declines, it could weigh on the AUD.\nFrom the US, the dollar remained pressured due to the uncertain economic outlook this week. The federal shutdown had halted the release of primary economic data, leading to a volatile and uncertain situation regarding inflation and employment figures.\nMeanwhile, reduced expectations for a December Fed cut, down from 70% this week to 50% on Friday, slightly lifted the greenback. Hawkish Fedspeak revealed caution about further monetary easing, boosting the dollar despite prevailing economic concerns.\nAUD/USD Key Events Next Week\nThe significant events in the coming week include:\n- RBA Meeting Minutes\n- Westpac Leading Index (MoM)\n- Wage Price Index (QoQ)\n- Fed’s Williams Speech\n- Fed’s Kashkari Speech\n- FOMC Minutes\n- Continuing Jobless Claims\n- Initial Jobless Claims\nIn the coming week, traders will look forward to the continuation of initial jobless claims and the Fed’s official speeches for further policy direction. Additionally, next week’s RBA meeting minutes and FOMC minutes will guide traders on the economic outlook and future interest rate decisions.\nAUD/USD Weekly Technical Forecast: Consolidation Above 0.6500\nThe AUD/USD daily chart indicates the pair is in a neutral phase, trading above 0.6500. The price remains above the 50- and 200-MA, suggesting some support near the 0.6500 and 0.6460 levels.\n-If you are interested in forex day trading, then have a read of our guide to getting started-\nThe RSI holds near 50, indicating a consolidation, as markets await a catalyst to initiate a breakout. A break above 0.6550 could ignite the upside continuation. On the contrary, a break below 0.6500 could trigger downside pressure towards 0.6400 and 0.6350.\nSupport Levels\n- 0.6460\n- 0.6400\n- 0.6350\nResistance Levels\n- 0.6560\n- 0.6600\n- 0.6630\nLooking to trade forex now? Invest at eToro!\n67% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money."
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "0.8860",
            "open": "154.7610",
            "close": "154.5060",
            "high": "155.0100",
            "low": "154.1240"
        },
        "market_summary": "### USD/JPY Market Briefing\n\n* **Key Drivers:** The **Bank of Japan's** policy uncertainty and the **Federal Reserve's** shift to a more **neutral** stance, combined with a widening **US-Japan yield gap** of **3.5%** (**4.00%** in the US vs **0.5%** in Japan), are driving **USD/JPY**.\n* **Price Action:** Reached a nine-month high of **155.044** and ended the week at **154.52**, up **0.72%** for the week, with current prices hovering around **154.60**, reflecting **bullish momentum**.\n* **Technical Outlook:** Immediate support is near **153.62**, with resistance at **155.00**. The **50-day moving average** is also providing support, currently at **152.80**.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Japanese Yen Weekly Forecast: USD/JPY Holds Highs as Key Data Looms - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/japanese-yen-weekly-forecast-usd-jpy-holds-highs-as-key-data-looms-1561378",
                "body": "Bank of Japan policy uncertainty collided with fading Fed rate cut bets, sending USD/JPY to a nine-month high of 155.044. The Japanese government’s fiscal policy plans and ultra-loose monetary policy stance also weighed on the yen as intervention threats fell on deaf ears.\nThe US government reopening, combined with FOMC members downplaying the chances for a December Fed rate cut, boosted demand for the greenback. Despite the US government reopening, a lack of key US inflation and jobs data left traders and the Fed focused on tariffs and inflation, a growing concern among FOMC members.\nUSD/JPY ended the week at 154.52, up 0.72% for the week ending November 14.\nIn the week ahead, several crucial Japanese economic indicators could shift sentiment toward the BoJ rate path, potentially triggering a USD/JPY reversal. Rising bets on a December or potentially January rate hike would narrow the US-Japan rate differential in favor of the yen.\nKey stats include third-quarter GDP, trade, inflation, and flash private sector PMI numbers.\nOn Monday, November 17, third-quarter Japanese GDP numbers are likely to fuel speculation about a BoJ rate hike. Economists forecast the economy to contract by 0.6% quarter-on-quarter (QoQ) in Q3 after expanding 0.5% in the previous quarter.\nAn economic contraction would reflect the effect of US tariffs on external demand, dampening bets on a December rate hike. BoJ policymakers raised concerns about US trade policies adversely affecting the Japanese economy. For context, Japan’s trade-to-GDP ratio sits above 45%, underscoring the importance of external demand for the economy.\nNotably, the third quarter numbers will not reflect the full effect of the US lowering tariffs on Japanese goods to 15% in September. Nevertheless, weakening external demand would likely fuel calls from policymakers for more time to assess the effects of tariffs on the economy.\nPrivate consumption trends will also face scrutiny amid concerns over the weaker Japanese yen pushing import prices higher. Rising import prices could weaken household purchasing power, potentially curbing consumption, while pushing consumer prices higher.\nEconomists expect private consumption to rise 0.1% QoQ, down from 0.4% in the third quarter.\nWhile economists expect external demand to weaken in the third quarter, October’s trade data could shift sentiment. Economists forecast Japanese exports to rise 1.1% year-on-year (YoY) in October, down sharply from 4.2% in September. Meanwhile, economists expect imports to fall 0.7% (September: +3.3%), signaling weakening domestic demand.\nCooling external demand may further reduce expectations of a BoJ rate hike, weighing on the yen.\nCrucially, waning demand could indicate a further loss of economic momentum early in Q4, signaling a more dovish BoJ policy stance.\nOn Friday, November 21, traders should brace for Japanese inflation figures and flash PMI numbers, which are likely to face intense market scrutiny.\nEconomists forecast the so-called ‘core-core’ inflation rate to rise from 3% in September to 3.1% in October. Rising import prices could push inflation higher, potentially fueling calls for tighter monetary policy to support the yen. Hotter-than-expected inflation numbers may revive hopes for a BoJ rate hike, bolstering demand for the yen.\nMeanwhile, Japan’s PMI reports will provide traders further insights into economic momentum midway through the fourth quarter. The S&P Global Services PMI will be the focal point, given that the services sector contributes over 70% to Japan’s GDP.\nEconomists expect the Services PMI to drop from 53.1 in October to 52.8 in November. A sharper-than-expected drop would likely point to a less hawkish BoJ rate path, weighing on the yen.\nFollow our real-time updates to stay ahead of USD/JPY market developments.\nAlthough Japanese data, BoJ commentary, and intervention jitters will influence yen demand, traders should closely track delayed US data and Fed speeches.\nAs Japan’s policy out"
            },
            {
                "title": "USD/JPY Price Forecast - Yen Surges Toward 154.60 as Fed Shifts to Neutral and Japan Raises Intervention Warnings - TradingNEWS",
                "source": "TradingNEWS",
                "url": "https://www.tradingnews.com/news/usd-jpy-price-forecast-yen-surges-toward-154-fed-shifts",
                "body": "USD/JPY Price Forecast - Yen Surges Toward 154.60 as Fed Shifts to Neutral and Japan Raises Intervention Warnings\nA jump from 153.62 to 154.60 reflects collapsing U.S. rate-cut expectations, a 4.00% vs 0.5% yield gap and BOJ caution | That's TradingNEWS\nUSD/JPY’s Repricing As Policy Divergence Widens And The Pair Trades Near 154.60\nUSD/JPY enters a critical phase as the exchange rate hovers around 154.60, recovering from an earlier drop toward 153.62, creating the strongest stretch of upward momentum in almost nine months. The price action reflects a fundamental reshaping of rate expectations between the Federal Reserve and the Bank of Japan, but the underlying forces driving this push are far more complex than a simple yield differential. Over the past five sessions, USD/JPY has gained more than 0.8%, a move powered by rising confidence in sustained U.S. rate stability combined with intense uncertainty stemming from the U.S. government shutdown, which left October CPI unreleased and pushed traders into a data-vacuum environment where policy commentary carries disproportionate weight.\nFederal Reserve Signals A Longer Plateau At 4.00% And Its Impact On USD/JPY Microstructure\nThe Federal Reserve’s shift from dovish assumptions to a more patient holding stance has realigned the forward curve. A month ago, futures implied only a 5.49% chance of maintaining rates at 4.00% in December, with markets betting aggressively on a cut to 3.75%. That probability has now surged to 54.25%, a tenfold reversal that directly strengthens USD demand across global currency baskets. Markets are adjusting not only to the Fed’s refusal to promise cuts but to policymakers signaling the need for clarity on inflation and employment data that were never published due to the shutdown. Without CPI, the retail market and institutional desks rely on Fed speeches, and the messaging is unified: caution, patience, and a willingness to hold rates unchanged. This creates a critical asymmetry for USD/JPY, as Japan offers no equivalent upward adjustment in yields, amplifying demand for U.S. fixed-income assets.\nBank Of Japan’s Neutral Stance And Japan’s Fiscal Expansion Undermine Yen Stability\nThe Bank of Japan approaches its December 18–19 policy meeting with no urgency to alter its 0.5% benchmark rate despite internal discussions hinting at future tightening under stronger domestic conditions. The broader Japanese policy backdrop tilts in the opposite direction: aggressive fiscal spending initiatives paired with a BOJ hesitant to materially tighten create a structurally weaker yen. Japan’s Finance Minister has publicly expressed concern over the yen’s weakness and signaled readiness to monitor the currency with urgency. However, these statements alone carry little weight without matching policy action, and traders remember well that intervention levels sat near 150–152 in 2022, making current levels historically vulnerable. Still, intervention risk is not symmetrical; the government tolerates gradual Yen depreciation but reacts sharply to fast disorderly moves. With USD/JPY testing 154+, this becomes a tactical risk embedded into all long positions.\nBond Market Dynamics Reinforce The USD Advantage And Anchor USD/JPY Above Key Thresholds\nThe U.S.–Japan yield gap remains one of the widest globally, with the U.S. at 4.00% and Japan near 0.5%, creating a structural carry incentive favoring USD/JPY upside. The U.S. bond market is recovering as rate-cut bets collapse, drawing foreign capital into Treasuries for yield capture. In contrast, Japanese government bonds offer limited attractiveness, allowing outflows into higher-yielding USD assets. As long as this disparity persists, dollar demand continues to anchor USD/JPY near long-term highs, and the pair remains supported on dips, as seen in the rebound from 153.62 back to 154.60. The global risk environment further pushes investors into the USD as a defensive liquidity asset, particularly given the uncertainties create"
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0053",
            "open": "1.4000",
            "close": "1.4032",
            "high": "1.4038",
            "low": "1.3985"
        },
        "market_summary": "### USD/CAD Market Briefing\n\n* **Key Drivers:** A growing interest rate gap between the US and Canada, along with ongoing trade tensions, has driven the **Canadian dollar** lower, making **USD/CAD** rise past **1.37**.\n* **Price Action:** Currently hovering near **1.4025**, with expectations to remain around **1.40** into the end of **2025**, before drifting lower to **1.33** by late **2026** and **1.30** by **2027** as the interest rate gap narrows.\n* **Technical Outlook:** The **Canadian dollar** is expected to stage a stronger comeback as the **Fed** eases and the **Bank of Canada** becomes more **hawkish** by late **2026**, with **1.40** acting as a near-term resistance and **1.33** as a potential support level in the medium term.\n\n---\n**Overall Sentiment:** **Bearish** for **USD/CAD**",
        "source_articles": [
            {
                "title": "Interest Rate Gaps Weigh Down The Canadian Dollar - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/interest-rate-gaps-weigh-down-the-canadian-dollar",
                "body": "Scotiabank expects the loonie to recover as the Fed and Bank of Canada policies align, but ongoing US trade issues still cast a shadow.\n1 day ago • 2 mins\nJoin the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nThe Canadian dollar has tumbled this year, with Scotiabank pointing to a growing interest rate gap versus the US, ongoing trade tensions, and recent market swings.\nWhat does this mean?\nThe Federal Reserve kept rates steady while the Bank of Canada cut rates in October, making the contrast between the two countries’ monetary policies the widest it’s been in years. That gap has pushed Canadian assets out of favor, sending the loonie lower and driving usd/cad past 1.37 in early November. Trade friction with the US and jittery markets haven’t helped matters either. That said, Scotiabank highlights a few silver linings—fiscal support from Ottawa and easier money conditions are helping growth at home. Policymakers now say more rate cuts may not do much, and deeper trade issues aren’t easily solved by monetary policy. Looking ahead, Scotiabank expects that when the Fed eventually begins to ease and Canada’s central bank gets more hawkish by late 2026, the rate gap could narrow—and the Canadian dollar could stage a stronger comeback.\nWhy should I care?\nFor markets: Rate realignment could turn the loonie’s luck.\nThe loonie’s slide has been a defining currency story this year, driven by shifting policy and persistent trade uncertainty. Scotiabank now expects usd/cad to hit 1.40 by late 2025, before narrowing to 1.33 by late 2026 and 1.30 by 2027 as US and Canadian interest rates move closer together. That shift could set Canadian stocks and bonds up for a brighter outlook once currency pressures start to ease.\nThe bigger picture: Cross-border dynamics hold all the cards.\nThe Canadian dollar’s fate is closely tied to decisions made in Washington as much as Ottawa, and lingering trade risks keep policymakers on edge. Even with a rosier forecast, open US–Canada disputes could limit gains. For investors and businesses, it’s a reminder that North America’s economic currents run both ways—moves south of the border can send ripple effects across Canadian markets.\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article is based on reporting by MT Newswires. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies.\nGet the two biggest stories in finance, and the reasons why you should care, delivered to your inbox every day."
            },
            {
                "title": "Scotiabank US Dollar To Canadian Dollar Forecast: USD/CAD Expected To Drift Lower 2026-2027 - Exchange Rates Org UK",
                "source": "Exchange Rates Org UK",
                "url": "https://www.exchangerates.org.uk/news/44565/2025-11-15-scotiabank-us-dollar-to-canadian-dollar-forecast-usd-cad-expected-drift-lower-2026-2027.html",
                "body": "The US Dollar to Canadian Dollar (USD/CAD) exchange rate hovered near 1.4025 on Thursday, but Scotiabank expects the pair to move steadily lower over the coming years as interest-rate differentials shift decisively in favour of the Canadian dollar.\nThe bank argues that the CAD’s recent weakness has been “fundamentally driven,” reflecting the two Bank of Canada cuts delivered in September and October.\nWith those moves now behind us, Scotiabank believes Canadian policy settings are “closer to neutral,” while fiscal support from the Federal Budget will help underpin domestic growth.\nFrom here, the bank sees the Fed–BoC policy gap narrowing meaningfully, a trend it says should guide USD/CAD lower through the forecast horizon.\nSeasonal patterns may still be a headwind into early next year, but Scotiabank expects those to flip and provide renewed CAD support in Q2 2026.\nScotiabank’s baseline projection is for USD/CAD to remain around 1.40 into the end of 2025, before drifting lower as the rate gap closes.\nThrough 2026, the bank expects the pair to move closer to 1.33, with further CAD gains pushing USD/CAD down toward 1.30 by the end of 2027, as the Canadian dollar benefits from firmer fundamentals and a more balanced policy backdrop.\nScotiabank remains bearish on USD/CAD, arguing that the structural drivers now favour a stronger Canadian dollar rather than sustained USD resilience.\nCurrent USD/CAD rate: 1.40252.\nFurther CAD forecasts here and the latest updated USD/CAD sentiment survey results here."
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "1.1040",
            "open": "203.0810",
            "close": "203.7960",
            "high": "204.0610",
            "low": "202.9570"
        },
        "market_summary": "### GBP/JPY Market Briefing\n\n* **Key Drivers:** The pair is influenced by the **deteriorating UK economic base**, with **weak retail sales**, **rising unemployment** to **5.0%**, and a **£30 billion fiscal gap**, pressuring **GBP**. Meanwhile, a **stronger USD** due to **hawkish** Federal Reserve expectations and **recovered Treasury yields** also impacts the cross.\n* **Price Action:** GBP/JPY rose to **204.04** but failed to break **204.22 resistance**, retreating afterwards. The pair needs a firm break of **204.22** to suggest a larger rally resumption towards **205.03**.\n* **Technical Outlook:** Immediate support is at **202.31**, with resistance at **204.22**. A break of **202.31** could turn the bias downside towards **199.04**. In the bigger picture, a firm break of **208.09** is needed to resume the uptrend from **123.94**, targeting **220.90**.\n\n---\n**Overall Sentiment:** Neutral",
        "source_articles": [
            {
                "title": "GBP/USD Drops to 1.3130 as UK Retail Sales Miss, Unemployment Hits 5.0% and Dollar Strengthens - TradingNEWS",
                "source": "TradingNEWS",
                "url": "https://www.tradingnews.com/news/gbp-usd-price-forecast-pound-slumps-toward-13130",
                "body": "GBP/USD Price Forecast - Pound Slumps Toward 1.3130 as UK Data Softens\nWeak retail sales, rising unemployment to 5.0%, manufacturing at –1.7%, GDP at –0.1%, and a £30B fiscal gap pressure GBP/USD while the USD rebounds | That's TradingNEWS\nGBP/USD Macro-Pressure Repricing And Structural Weakness Under Tightening UK Data And Dollar Recovery\nGBP/USD trades in a compressed and fragile structure as the pair slides toward 1.3130, 1.3149, and repeatedly retests the 1.3010–1.3170 zone while the market digests an unusually dense cluster of UK macro readings, political developments, and a reawakening USD bid that has resurfaced across all major FX complexes. What is happening in GBP/USD right now is not drifting sentiment—it is a direct and violent repricing driven by a sequence of data points that landed far weaker than expected across retail activity, labour markets, industry output and housing conditions. Retail sales slowed to 1.5%, crushing the 2.4% expectation and disappointing even the prior 2.0%, signalling consumers are retrenching. The labour market corrected aggressively as Claimant Count Change surged to 29,000, nearly double the 17,600 forecast, while unemployment pushed to 5.0% and wage growth slipped to 4.8% from 5.0%, reinforcing the pressure on households. This contraction in both spending and income momentum fed directly into GBP/USD weakness, pushing the pair below 1.3170, 1.3150, and back toward its seven-month lows near 1.3149.\nGrowth Deterioration And Industrial Collapse Deepen Downside Pressure On GBP/USD\nIndustry data intensified the bearish load on the pound. Manufacturing production collapsed –1.7%, more than double the –0.7% estimate, while industrial production fell –2.0% versus –0.5% expected, confirming a broad slowdown in real economy output. GDP readings offered no relief: monthly GDP printed –0.1% against a flat estimate, and preliminary quarterly GDP came in at only 0.1% instead of 0.2%. Housing sentiment reinforced the contractionary theme as the RICS House Price Balance fell to –19%, missing the –14% projection and holding only marginally better than last month’s –17%, confirming the property market is losing confidence and liquidity. All these indicators collectively spell a deteriorating economic base—one that forces GBP/USD traders to reassess whether the softening trajectory leaves the pair vulnerable to further slides toward 1.3058, 1.3012, or the deeper wave projection around 1.2831 derived from the extended corrective structure from 1.3787.\nFiscal Instability And Political Risk Amplify Sterling Volatility Across GBP/USD\nThe political layer worsened the sell-off. The UK government’s decision to scrap planned income tax increases created significant unease about fiscal discipline, echoing the structural fragility seen in the 2022 mini-budget shock. With a budget deficit near £30 billion, the market is now questioning how the government will stabilize finances without added revenue. This is why GBP/USD reacted instantly—dropping to 1.3130, then 1.3149, and retesting 1.3150 during the Asian session. Investors immediately remembered the near-parity collapse from 2022, and the pound began to price a risk premium for policy inconsistency. The debt-to-GDP ratio hovering around 97.1% deepens investor scepticism and reduces the market’s willingness to re-rate the pound higher until a credible fiscal trajectory emerges. This created the environment where every recovery attempt was sold into, preventing sustained rebounds above 1.3170–1.3188, the exact region capped by descending trendline resistance.\nUSD Strength And The Repricing Of Federal Reserve Expectations Reinforce GBP/USD Downside\nThe USD side of the cross turned simultaneously stronger. Markets scaled back expectations for a December Fed rate cut as officials adopted a more hawkish tone, replaying the 2024 “higher for longer” dynamic. Treasury yields recovered, money markets reduced rate-cut probability, and demand for USD surged across majors—i"
            },
            {
                "title": "GBP/JPY Weekly Outlook - Action Forex",
                "source": "Action Forex",
                "url": "https://www.actionforex.com/technical-outlook/gbpjpy-outlook/619398-gbp-jpy-weekly-outlook-433/",
                "body": "GBP/JPY roses strongly to 204.04 last week but failed to break through 204.22 resistance and retreated. Initial bias remains neutral this week first. On the upside, firm break of 204.22 will suggest that larger rally from 184.53 is ready to resume through 205.03. However, break of 202.31 minor support will turn bias to the downside towards 199.04, to extend the corrective pattern from 205.30 with another falling leg.\nIn the bigger picture, price actions from 208.09 (2024 high) are seen as a corrective pattern which might have completed at 184.35. Firm break of 208.09 high will resume the up trend from 123.94 (2020 low). Next target is 61.8% projection of 148.93 to 208.09 from 184.35 at 220.90. However, decisive break of 197.47 support will dampen this view and extend the corrective pattern with another fall.\nIn the long term picture, there is no sign that the long term up trend from 122.75 (2016 low) has concluded. But firm break of 208.09 is needed to confirm resumption. Otherwise, more medium term range trading could still be seen."
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "2,836.0000",
            "open": "94,985.1700",
            "close": "95,202.5000",
            "high": "96,745.5000",
            "low": "93,909.5000"
        },
        "market_summary": "### BTC/USD Market Briefing\n\n* **Key Drivers:** Institutional investment in **Bitcoin ETFs** is on the rise, with **Harvard University** increasing its stake by **257%** in the third quarter, making the iShares Bitcoin Trust its largest disclosed position with **6.8 million shares** valued at **$442.8 million**.\n* **Price Action:** **Bitcoin** has recovered above **$102,000** after a temporary decline, with **long-term investors** accumulating assets, including over **$1.3 billion** in **Ethereum** acquired by large holders.\n* **Technical Outlook:** Immediate support is near the **$100,000** level, with resistance at **$104,000**, and a potential target of **$110,000** if **bullish momentum** persists.\n\n---\n**Overall Sentiment:** Cautiously **bullish** ️",
        "source_articles": [
            {
                "title": "Bitcoin ETF Becomes Harvard’s Top Holding After 257% Stake Increase - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/bitcoin-etf-becomes-harvard-top-105441128.html",
                "body": "Harvard University has expanded its Bitcoin ETF holdings by 257% in the third quarter, making the iShares Bitcoin Trust its largest disclosed position with 6.8 million shares valued at $442.8 million as of September 30.\nThe move represents one of the most significant institutional endorsements of Bitcoin exposure among elite university endowments, ranking Harvard as the 16th-largest holder of the BlackRock-managed fund.\nThe latest 13F filing shows Harvard increased its stake from 1.9 million shares reported in June, while simultaneously growing its gold ETF holdings by 99% to 661,391 shares worth $235 million.\nBloomberg ETF analyst Eric Balchunas noted the rarity of top-tier endowments purchasing ETFs, calling it “as good a validation as an ETF can get.“\nInstitutional Shift Marks Reversal of Academic Skepticism\nHarvard’s substantial Bitcoin allocation stands in contrast to earlier predictions from its own economics faculty.\nKenneth Rogoff, a Harvard professor and former chief economist of the International Monetary Fund, stated in 2018 that Bitcoin would more likely trade at $100 than $100,000 within a decade.\n“I think bitcoin will be worth a tiny fraction of what it is now if we’re headed out 10 years from now,” Rogoff told CNBC, adding that removing money laundering and tax evasion would leave Bitcoin with “very small” transaction uses.\nHe argued that government regulation would trigger price drops, though he acknowledged such frameworks would take time to develop globally.\nRogoff recently reflected on his earlier assessment, acknowledging that he had misjudged Bitcoin’s role in the global underground economy and underestimated the regulatory conflicts of interest.\n“I was far too optimistic about the US coming to its senses about sensible cryptocurrency regulation,” he wrote in his new book Our Dollar, Your Problem.\nHe added that he “did not anticipate a situation where regulators, and especially the regulator in chief, would be able to brazenly hold hundreds of millions (if not billions) of dollars in cryptocurrencies seemingly without consequence given the blatant conflict of interest.“\nBalchunas referenced Rogoff’s earlier skepticism, noting it “must feel so great” for Bitcoin advocates to see Harvard’s institutional validation.\nThe $443 million position represents approximately 0.75% of Harvard’s $57 billion endowment.\nHowever, Bitwise analyst Ryan Rasmussen predicts that this allocation will grow to 1% and eventually 5% as peer institutions follow suit."
            },
            {
                "title": "Bitcoin ETFs: Why They Matter and What’s Next? - OneSafe",
                "source": "OneSafe",
                "url": "https://www.onesafe.io/blog/bitcoin-etf-outflows-reshaping-crypto-landscape",
                "body": "Bitcoin Exchange-Traded Funds (ETFs) are investment tools that let investors get a piece of the Bitcoin pie without actually buying the digital currency. Trading on conventional stock exchanges makes them easier for many investors, including big institutions. These ETFs are significant because they boost liquidity, help stabilize prices, and create a regulated arena for crypto investments. Come 2025, Bitcoin ETFs are ruling the crypto landscape, with titans like BlackRock and Fidelity at the helm.\nThe Impact of Bitcoin ETF Outflows on Market Liquidity\nBack in early November 2025, Bitcoin ETFs saw nearly half a billion dollars in outflows. This raised eyebrows about liquidity in the crypto market. Macro pressures and shifts in how institutions feel about crypto were the main culprits, triggering a risk-off attitude. As a result, Bitcoin dropped below $104,000, with Ethereum and DeFi assets also taking a hit. This situation lays bare how exposed the crypto market is to outside economic factors and how interconnected various crypto assets can be.\nHow European SMEs Can Respond to Bitcoin ETF Liquidity Issues\nFor small and medium-sized enterprises (SMEs) in Europe looking to dive into crypto, the liquidity issues stemming from Bitcoin ETFs come with both setbacks and openings. They need to keep several points in mind:\nThe European regulatory scene isn't as open as that of the U.S. and is far more fragmented. Directives like UCITS require diversification, limiting access to Bitcoin ETFs for retail investors. This means SMEs must navigate a complex compliance web to successfully integrate crypto into their financial plans. The volatility of Bitcoin's price can disrupt cash flow if payments or reserves are held in Bitcoin without efficient conversion methods. SMEs should have solid risk management tactics to counter these operational hazards. Despite regulatory roadblocks, regulated Bitcoin ETPs (Exchange-Traded Products) are on the rise in Europe, adding liquidity and market access for SMEs. Using Bitcoin as a reserve asset can bolster the financial resilience of these companies.\nWhat Bitcoin ETF Outflows Mean for Asian Fintech Startups\nAsian fintech startups can take advantage of Bitcoin ETF outflows to refine their crypto payroll offerings. The market instability presents an opportunity to pitch their solutions as reliable and efficient. They might consider:\nIncorporating stablecoins into their payroll systems to sidestep the volatility linked with Bitcoin ETF outflows, guaranteeing employees stable pay. Using blockchain technology to lower transaction fees, speed up payments, and improve transparency, making crypto payroll more appealing to a tech-savvy workforce. Offering real-time or near real-time payment options to enhance worker liquidity and satisfaction, crucial during economic uncertainty. Staying ahead of regulatory compliance will build trust and ensure that their payroll solutions align with evolving regulations in Asia.\nAre Bitcoin ETFs Still a Smart Bet for Institutions?\nEven after the recent outflows, Bitcoin ETFs are still a sound investment for institutions in 2025. The structural benefits they provide make them the go-to option for large capital allocators. Some key takeaways include:\nBitcoin ETFs have established themselves as the primary vehicle for institutional exposure to cryptocurrencies, with big players like BlackRock controlling a huge share of the market. These ETFs offer straightforward operations and deep liquidity, eliminating many compliance hassles that often accompany direct cryptocurrency investments. Institutional money can help stabilize Bitcoin markets, absorbing liquidity shocks and lessening extreme price fluctuations, making Bitcoin a better diversification option. Institutions are advised to take a measured approach, gradually allocating a portion of their portfolios to digital assets while contemplating diversification into established cryptocurrencies like Ethereum and Solana.\nIn conclusi"
            },
            {
                "title": "Bitcoin News Update: CFTC's Broader Role in Crypto Regulation Ignites Discussion on Clearer Rules - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605065982",
                "body": "The regulatory environment for cryptocurrencies in the United States is experiencing a significant transformation as legislators and industry leaders push for the Commodity Futures Trading Commission (CFTC) to take on a more expansive role in overseeing digital assets. This shift is exemplified by a new crypto market structure bill put forward by Senators John Boozman and Cory Booker, which aims to place spot digital commodity trading under the CFTC’s authority, moving away from the Securities and Exchange Commission’s (SEC) current enforcement-centric strategy.\nThere is also a notable rise in institutional interest in cryptocurrencies, with major entities such as Harvard University’s $55 billion endowment making significant investments. The endowment recently revealed a $443 million holding in BlackRock’s\nRockToken, a New Zealand-based platform specializing in infrastructure-backed crypto investment contracts, is also attracting attention from long-term investors. The company offers a range of plans—from the entry-level “Genesis Pass” to the premium “Whale Reserve” contracts—enabling users to earn yields on Bitcoin,\nMarket trends are pointing toward cautious optimism. The conclusion of a 43-day U.S. government shutdown in November 2025 brought temporary stability to crypto markets, with Bitcoin recovering above $102,000. Experts attribute this rebound to renewed regulatory clarity as both the SEC and CFTC resumed their activities. Blockchain data also shows that long-term investors are accumulating assets, with over $1.3 billion in Ethereum acquired by large holders, indicating sustained confidence in crypto despite short-term price swings\nThis regulatory evolution is not without its hurdles. Some critics caution that overlapping responsibilities between the SEC and CFTC could lead to regulatory confusion, though advocates believe the proposed legislation will create a more streamlined oversight process. Bernstein analysts, however, maintain that the U.S. is well-placed to emerge as a global leader in crypto, citing its robust infrastructure and flexible regulatory approach. Together with increased institutional involvement and DeFi advancements, these factors could reshape the role of crypto in the international financial system"
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "143.0000",
            "open": "3,164.1300",
            "close": "3,153.9500",
            "high": "3,227.7500",
            "low": "3,084.7500"
        },
        "market_summary": "### ETH/USD Market Briefing\n\n* **Key Drivers:** Ethereum's utility-focused nature, driven by its use in **DeFi**, **smart contracts**, and **staking mechanisms**, is contrasting its store-of-value reputation with that of **Bitcoin**.\n* **Price Action:** Currently trading near **$3,208**, down **4.5%** over the past week, with a recent all-time high of **$4,946**.\n* **Technical Outlook:** Immediate support is near the **50-day moving average**, with resistance at the **recent high of $4,946**.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "Ethereum Holders Are More Willing Than Bitcoin Investors to Part With Coins: Glassnode - Decrypt",
                "source": "Decrypt",
                "url": "https://decrypt.co/348827/ethereum-holders-more-willing-bitcoin-investors-part-coins-report",
                "body": "In brief\n- ETH holders move, sell, and spend their digital coins more than BTC investors, Glassnode data shows.\n- This is because the Ethereum network powers crypto applications, which use ETH as gas fees.\n- Bitcoin holders, on the other hand, tend to keep their coins in storage and treat BTC as \"digital gold.\"\nBitcoin holders are still the true \"diamond hands\" investors compared to Ethereum buyers, according to a new report, with the latter coins being moved and spent far more than the original so-called digital gold.\nBlockchain data firm Glassnode said in a new report—citing data collected before this week's crypto crash—that BTC moves less frequently than ETH, behaving more like a \"digital savings asset.\"\nETH moves far more as it functions as \"digital oil,\" which is both stockpiled and actively used as network fuel and collateral.\n\"Bitcoin behaves like the digital savings asset it was designed to be, in that coins are largely hoarded, turnover is low, and recent behavior shows that more supply is migrating into long-term hold wrappers rather than sitting on exchanges,\" the report said.\n\"Ethereum's behavior also reflects the inherent properties of a high transaction smart contract platform,\" it added, \"with a large anchored base from native staking, with the addition of recent market forces adding an investor component through ETFs.\"\nThe report goes on to note why: Ethereum's use in smart contracts, which hold the code that powers a wide array of decentralized applications, DeFi platforms, and tokenized assets.\nAs Glassnode notes, \"ETH's long-term holders are mobilizing their old coins at a rate that's 3x faster than BTC's long-term holders, signaling ETH's long-term holders are more willing to part with their coins, pointing to utility-driven behavior.\"\nEthereum powers crypto applications, ranging from stablecoins to decentralized finance exchanges. To make transactions sending digital dollars or to swap tokens on a decentralized crypto exchange, users need to pay gas fees in ETH.\nIt is because of the Ethereum network's use cases that, despite the approval of exchange-traded funds now trading on traditional stock exchanges, ETH still works less like a store-of-value asset compared to BTC—and that the coins are less dormant.\nStill, ETH still can have store-of-value use cases, Glassnode noted, explaining that \"one out of every four ETH is locked in native staking and ETFs.\"\nEthereum's price recently stood at nearly $3,208, down 4.5% over the past week. The coin was slow in reaching an all-time high but finally did so in August, breaking a nearly four-year-old record. It has traded well below that level—$4,946—in recent weeks.\nBitcoin was recently trading at $95,992, falling by nearly 6% over the past seven days. The coin's all-time high stands at $126,088, touched in October."
            },
            {
                "title": "Ethereum News Update: Ethereum’s Versatility Poses a Challenge to Bitcoin’s Reputation as Digital Gold - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605065679",
                "body": "Ethereum investors are offloading their tokens at a pace that is triple that of\nBitcoin\nholders,\nas highlighted in a recent study\n. This contrast highlights Ethereum's transformation into a utility-focused asset, setting it apart from Bitcoin’s reputation as a digital store of value. The analysis notes that those holding Ethereum for the long term tend to move their assets more often, influenced by its use in decentralized finance (DeFi), smart contracts, and staking mechanisms.\nThe statistics show that a quarter of all Ethereum is tied up in staking or exchange-traded funds (ETFs), yet the overall activity among long-term ETH holders is still much greater than that of Bitcoin holders. This trend illustrates Ethereum’s dual identity: it serves both as a reserve for institutions and as an active currency for on-chain operations. In comparison, Bitcoin’s pattern is more similar to gold,\nwith more than 61% of its coins remaining untouched for over a year\nand a daily movement rate of only 0.61%.\nThe pace at which Ethereum is being utilized is picking up as more institutions get involved.\nFirms such as\nBit Digital\nand BitMine are rapidly building up their ETH reserves, with\nBit Digital announcing a fivefold jump\nin its Ethereum holdings, reaching 153,000 ETH in the third quarter of 2025. Samir Tabar, CEO of Bit Digital, pointed out that staking profits—which totaled $2.9 million in Q3—are set to become the company’s main revenue stream as it shifts away from mining Bitcoin. Likewise, BitMine, which owns more than 3.5 million ETH valued at $11 billion,\nhas shifted its brand to concentrate on Ethereum treasury management\n.\nGlassnode’s research also reveals fundamental shifts in the market. The amount of both Bitcoin and\nEthereum\nheld on exchanges is dropping as more assets move into ETFs and institutional investment vehicles. For Ethereum, this has resulted in a “productive float,” with 16% of its supply engaged in liquid staking and collateral-backed systems,\nfueling DeFi platforms\n. On the other hand, Bitcoin’s slow-moving nature strengthens its role as a savings vehicle, with more of its supply being locked away for the long term.\nThese developments have major market consequences. Ethereum’s high transaction activity underpins its importance in blockchain-based applications, while Bitcoin’s relative inactivity reinforces its use as a safeguard against economic instability.\nExperts observe\nthat investors should distinguish between the two: Bitcoin is best for preserving capital, whereas Ethereum offers access to a rapidly expanding suite of financial products.\nYet, Ethereum’s increased turnover also brings certain risks. Some analysts, including 10x Research,\ncaution that its high activity could point to underlying vulnerabilities\nwhen compared to Bitcoin’s dominance in institutional portfolios. Even so, the growth of Ethereum staking and ETF products indicates that demand for its practical uses is likely to continue, even if the broader market experiences turbulence.\nTo sum up, the active behavior of Ethereum holders highlights its unique position as both a value reserve and a functional asset. As the cryptocurrency sector evolves, recognizing these differing paths will be essential for investors aiming to balance the stability of Bitcoin with the innovative potential of Ethereum."
            },
            {
                "title": "BNB Chain leads DeFi growth despite “Red October” market correction - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/news/feed/fa4cc-bnb-stands-out-as-the-only-large",
                "body": "BNB Chain leads DeFi growth despite “Red October” market correction\nShare:\nBNB increased its monthly market cap by 6.2% to stand out as the only large-cap to finish in the green during the first red October since 2018. The total crypto market cap fell 6.1% during a volatile October, which also saw BTC’s market cap drop 4%, ADA’s value decrease by 24%, and SOL shed 12.7%.\nBinance Research has released a report discussing the monthly developments in the crypto market in October. The report stated that October was a volatile month across crypto markets, with major assets experiencing sharp corrections or selective resilience.\nIt also implied that the downturn in “Red October” was partly due to the October 10 event, which wiped out over $19 billion in positions. Broader macroeconomic factors also weighed on sentiment.\nHowever, Binance Research observed that despite the correction, the Binance token’s October rally was fueled by strong ecosystem growth. The launch of Polymarket and Myriad prediction markets, along with the rollout of Ondo Finance’s tokenized stocks and ETFs on BNB Chain, supported this growth.\nBNB Chain leads DeFi growth\nDespite the October downturn, BNB Chain led the growth of DeFi ecosystems, followed by Solana and Arbitrum. However, Ethereum and Tron posted slight drops. DeFi TVL (total value locked) also plummeted 4.85% MoM, as DeFi liquidity pulled out on market corrections.\nMeanwhile, stablecoin activity surged as investors sought safety. The total stablecoin market cap rose 3.54% as USDT continued to increase its lead over USDC.\nIn October, JPYC (pegged on Japanese Yen) and EUROD (backed by the Euro) were introduced to the BNB Chain. The two expanded the range of stablecoins tied to major currencies beyond the U.S. dollar, enhancing the efficiency of cross-border payment. Binance Research observed that BNB Chain transactions spiked 135%.\nMeanwhile, the spike was driven primarily by a memecoin frenzy that boosted token prices and attracted new traders. The memecoin excitement peaked in early October with over 100,000 new traders jumping into memecoins in a single day (October 7).\nNearly 70% of these newcomers ended up in profit, according to the report. Approximately 40 individuals earned over $1 million, and another 6,000 received $10,000 or more in compensation. However, many of these memecoins crashed by October 8 and 9.\nBinance token breaks $1,300\nThe report stated that activity on the BNB Chain not only boosted transactions but also propelled the Binance token to surpass $1,300 on October 13. Binance Research observed that even with the pullback, BNB remained up 6.6% for the month, providing the chain’s resilience.\nThe rally also appears to have been fueled by rumors that Binance co-founder Changpeng Zhao (CZ) was returning to the company. CZ previously explained that political, technical, and regulatory factors have fueled BNB’s rally.\nAccording to CZ, political shifts have previously supported the rise in BNB prices. He emphasized that the new U.S. administration has created a favorable environment for crypto. The Binance token price also jumped due to rising hopes that President Donald Trump would grant CZ a full pardon.\nMeanwhile, MEXC presented a report detailing the expected prices of BNB under different scenarios. In the bull scenario, BNB is expected to test the prior resistance of $1,300-$1,400 in the short term (Oct-Nov).\nFor the medium term (Q4 2025), BNB prices are expected to range between $1,500 and $1,800 if the macro environment remains supportive. In the long term (by 2026), the price is expected to reach $2,292.\nIn the base case scenario, assuming normal volatility and corrections, BNB prices in the short term are expected to remain consolidated between $1,000 and $1,250. For the medium term, a gradual climb toward $1,500 is expected by the end of 2025. However, BNB is expected to maintain a conservative average price of $1,090 in the long term.\nIf you're reading this, you’re already ah"
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "7.3552",
            "open": "140.4686",
            "close": "138.8383",
            "high": "144.4066",
            "low": "137.0514"
        },
        "market_summary": "### SOL/USD Market Briefing\n\n* **Key Drivers:** Weakening institutional conviction, **structural breakdown** of multi-year trendlines, and **macro pressure** are driving the price of SOL/USD downward, despite continued **ETF inflows**.\n* **Price Action:** SOL/USD has broken below the key psychological level of **$140**, showing significant **bearish** momentum, with the next support levels at **$126** and **$100**, which aligns with the **200-week SMA**.\n* **Technical Outlook:** The **RSI** has collapsed to its lowest reading since April 2025, indicating **oversold** conditions, while the **UTXO Realized Price Distribution** shows a clear **liquidity vacuum** below **$140**, amplifying the risk of a **cascading sell-off**.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "Solana Price Forecst - SOL-USD Crashes to $140: ETF Inflows Cool as SOL Risks Drop to $100 - TradingNEWS",
                "source": "TradingNEWS",
                "url": "https://www.tradingnews.com/news/solana-price-forecast-sol-usd-slides-to-140-usd-etf-momentum",
                "body": "Solana Price Forecast - SOL-USD Slides to $140 as ETF Momentum Weakens and Multi-Year Support Snaps\nSOL Faces Its Sharpest Two-Week Drop of 2025 With ETF Inflows Slowing, RSI Hitting April Lows, and Analysts Targeting $126–$100 if Weakness Continues | That's TradingNEWS\nSOL-USD’s Multi-Layer Breakdown As Institutional Flows Cool, Technical Floors Erode, and Macro Pressure Pushes Solana Toward Its Deepest Retest Since June\nSolana (SOL-USD) enters its most critical stretch of 2025 as the token falls to $140.98, marking a 5-month low and erasing more than 34% in two weeks despite 13 straight days of ETF inflows totaling $370M and total spot ETF AUM surpassing $533M. This divergence—ETF inflows rising while price collapses—reveals a market undergoing structural stress, driven by weakening liquidity, fading momentum, and a decisive loss of multi-year bullish structures that held since January 2023. The price deterioration is now interacting with the heaviest technical zones Solana has faced this year, and every layer of data—from RSI collapse to UTXO clustering to ETF flow deceleration—confirms that the token is entering a transitional phase where bulls must defend a shrinking list of remaining supports.\nInstitutional ETF Inflows Into SOL-USD Continue, But Their Momentum Is Deteriorating Faster Than Price Action\nThe 13 consecutive days of inflows—with Thursday adding $1.49M—show institutional buyers are still allocating to SOL, yet a deeper look reveals weakening conviction. Of every ETF, only the Bitwise BSOL product attracted inflows in the latest session, marking the softest day since ETFs launched on Oct 28. Total cumulative inflows of $370M sound strong, but the trend is sharply decelerating exactly as Solana breaks key supports. The timing is crucial: Bitcoin spot ETFs saw $866M in outflows—the second-worst day since launch—while Ether ETFs lost $259.2M, dragging cumulative ETH inflows to $13.3B. Institutions are rotating out of higher-beta crypto, and even though SOL inflows remain positive, the softness tells us Solana is no longer benefiting from the aggressive accumulation phase that defined Q3–early Q4. This shift is material because ETF inflows were previously a stabilizing force; now they lag price deterioration instead of offsetting it, leaving SOL more vulnerable to technical breakdowns.\nSOL-USD Breaks Its Multi-Year Uptrend And Slips Below the 100-Week SMA, Triggering a Structural Bearish Signal for the First Time Since 2023\nSOL’s collapse from $175 → $142 snapped the multi-year trendline established at the start of January 2023, and breaking below the 100-week SMA confirms a structural trend failure. This is not noise—multi-year trend breaks signal regime changes. At $142, Solana sliced through every intermediate support between $150 → $140, leaving the next meaningful zones at $126, then the macro line at $100, which aligns with the 200-week SMA—the final anchor that preserves long-term bullish structure. The UTXO Realized Price Distribution (URPD) from Glassnode shows a clear liquidity vacuum below $140, meaning few historical buyers exist to defend this range. That gap amplifies the risk of a cascading sell-off should $140 lose cleanly. With RSI collapsing to its lowest reading since April 2025, the breakdown has momentum behind it, not exhaustion.\nETF Demand Meets Technical Failure: SOL-USD’s 34% Two-Week Collapse Highlights an Extreme Divergence Between Fundamentals and Price\nFor the first time this year, Solana’s rising institutional interest and its collapsing spot price are moving in opposite directions. ETF buyers are still accumulating, but they are no longer absorbing sell-side pressure. Solana fell 34% in 14 days, even though inflows continued every single day—something that did not happen during the June, March, or January corrections. This reversal signals that broader macro factors—particularly the $95K Bitcoin drawdown, ETH slipping below $3,200, and a multi-sigma move in traditional risk assets—are"
            },
            {
                "title": "\"Solana Plummets: Has Solana Lost the Blockchain Battle?\" - InvestX",
                "source": "InvestX",
                "url": "https://investx.fr/en/crypto-news/solana-plummets-has-solana-lost-the-blockchain-battle/",
                "body": "Solana Plummets: Has Solana Lost the Blockchain Battle?\nCritics within the crypto community are questioning Solana's stability, branding it the weakest top 10 blockchain. With SOL's underwhelming performance and accusations of being a \"scam chain,\" investors are on alert. Explore the concerns and technical weaknesses gripping the Solana network.\nTranslated on November 15, 2025 at 15:10 by Simon Dumoulin\nCopié\nCatastrophic Performance: Solana Lagging Behind the Market\nThe underperformance of Solana is now impossible to ignore. While Bitcoin and Ethereum maintain relatively solid levels, SOL is currently trading nearly 50% below its all-time high. This valuation gap becomes particularly problematic when compared to other layer 1 networks that have better weathered the market correction.\nThe numbers speak for themselves: since November 2024, SOL has been accumulating bearish signals. The token struggles to defend key support levels, and every rebound attempt results in violent rejection. Trading volumes also show traders’ growing disinterest, who now prefer to position themselves in assets deemed more resilient.\nThe 2-week Order Block is even more revealing. Massive smart money distribution could push Solana’s price down to $40 in the coming months.\nStructural Flaws Weakening the Ecosystem for Solana\nBeyond simple price action, Solana faces recurring structural problems. Network outages remain a major pain point. Despite promises of improvement, the blockchain has experienced several complete shutdowns in recent months, undermining the credibility of an infrastructure that claims to be ultra-performant.\nValidator concentration also raises questions. Unlike Ethereum or Bitcoin, the Solana network suffers from excessive centralization, with a handful of actors controlling a disproportionate share of staking. This architecture makes the network more vulnerable to coordinated attacks and manipulation.\nDespite everything, on-chain data, such as TVL and stablecoins, continue to grow. Moreover, Solana ETFs have outperformed those of ETH and BTC in recent weeks. Even though the medium term seems blocked by massive profit-taking, Solana remains a giant of tomorrow.\nCompetitive Environment: More Credible Alternatives\nFacing these difficulties, other blockchains are capitalizing on Solana’s weaknesses. Avalanche, Polygon and Base are now attracting developers seeking stability and decentralization. These networks offer more balanced compromises between scalability and security, without sacrificing availability.\nThe layer 1 market is ruthless. Institutional investors, increasingly present, favor proven infrastructure. Ethereum remains the undisputed reference for institutional DeFi, while new generations like Sui or Aptos chip away at market share with innovative technical propositions. Solana finds itself stuck in an uncomfortable middle ground.\nThe question of long-term viability will always arise. But the correction will have more to do with a tenseanduncertain context rather than a loss of fundamentals.\nCharles Ledoux is a Bitcoin and blockchain technology specialist. A graduate of the Crypto Academy, he has been a Bitcoin miner for over a year. He has written numerous masterclasses to educate newcomers to the industry and has authored over 2,000 articles on cryptocurrency. Now, he aims to share his passion for crypto through his articles for InvestX.\nDISCLAIMER\nThis article is for informational purposes only and should not be considered as investment advice. Some of the partners featured on this site may not be regulated in your country. It is your responsibility to verify the compliance of these services with local regulations before using them.\nDISCLAIMER\nThis article is for informational purposes only and should not be considered as investment advice. Trading cryptocurrencies involves risks, and it is important not to invest more than you can afford to lose.\nInvestX is not responsible for the quality of the products or services prese"
            },
            {
                "title": "Solana News Update: Solana's DeFi Expansion Poses a Threat to Ethereum's Leading Position as Buybacks Drive Further Development - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605065208",
                "body": "The DeFi sector is experiencing significant changes as Solana-based projects such as Pump.fun emerge as influential forces for the 2025–2030 cryptocurrency era. With increased token repurchases, heightened network engagement, and strategic rivalry transforming the landscape, market experts are reassessing the future price outlook for Solana’s core tokens.\nPump.fun, a prominent DeFi application on\nSolana\n, has\nrapidly advanced its standing\nby implementing assertive token buyback initiatives. Since July 15, 2025, the platform has reacquired $173.7 million in PUMP tokens, cutting the available supply by 10.928%.\nThis approach, together with Solana’s soaring decentralized exchange (DEX) transaction volumes—reaching $5.11 billion in daily trades—has\nreinforced Pump.fun’s significance within the network\n. The buyback activity aligns with a broader movement of capital retention in Solana’s DeFi ecosystem, as participants increasingly favor yield opportunities over simply holding stablecoins\nbased on recent market insights\n.\nAt the same time, Solana’s influence in DeFi continues to grow. By November 2025, the platform’s DEX trading volumes surpassed those of\nEthereum\n($3.8 billion) and\nBNB\nChain ($2.95 billion),\nindicating a preference for faster blockchain solutions\n. This\nupward trend\nis fueled by Solana’s development activity score of 21.5, outpacing Ethereum’s 14.3, and a three-day increase of 2.9 million SOL staked,\ntemporarily limiting the supply on exchanges\n. Experts point out that institutional investments and broader economic factors will likely influence whether Solana’s value can surpass the $180 barrier, which currently has a\n29% likelihood, compared to a 62% chance of retreating\nto the $150 support level.\nAlthough Ethereum still holds 67.65% of the total value locked in DeFi, it is facing increasing competition from Solana and\nTron\n.\nTron’s 25.78% portion of stablecoin issuance\n—a vital area within DeFi—has narrowed Ethereum’s previous 55.55% dominance, emphasizing the value of affordable and efficient networks. While Solana’s 8.9% share is much smaller than Ethereum’s, it demonstrates a rising demand for scalability, especially among individual users and developers. “The rivalry is pushing Ethereum to evolve,” a blockchain analyst commented, “but Solana’s expanding developer community and active address numbers indicate it’s becoming a permanent fixture.”\nWider market developments add further layers.\nFlutter Entertainment is making moves\ninto prediction markets, launching FanDuel Predicts in December 2025 to offer contracts on sports and financial outcomes. This initiative brings fresh liquidity to platforms with DeFi-like features, potentially broadening capital movement. Likewise,\nPollard Banknote’s third-quarter revenue increase\n—driven by lottery deals in California and Belgium—shows how traditional gaming is adapting to digital trends, though it remains separate from crypto-native platforms.\nPump.fun’s future depends on maintaining scarcity through ongoing buybacks while capitalizing on Solana’s technology. With growing institutional interest in Solana and technical signals pointing to short-term price swings, investors are divided between caution and optimism. “The main challenge will be whether Pump.fun can retain its users amid broader economic uncertainties,” a crypto strategist observed.\nAs 2025 progresses, the interaction between token economics, network efficiency, and regulatory changes will shape Pump.fun’s future. For now, Solana’s DeFi sector is poised for a defining moment."
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "1,000.900",
            "open": "48,323.670",
            "close": "47,522.050",
            "high": "48,435.670",
            "low": "47,434.770"
        },
        "market_summary": "### US30 Market Briefing\n\n* **Key Drivers:** Limited information available due to access restrictions on relevant articles, but general market trends suggest **inflation concerns** and **monetary policy** decisions are influencing the index.\n* **Price Action:** Unable to retrieve current price levels, but **market volatility** is expected to continue, potentially affecting the **US30** index with **bullish** or **bearish** momentum.\n* **Technical Outlook:** Typical support levels for the **US30** include the **50-day moving average**, often around **34,000**, and resistance near **35,000**, but current data is not available for precise analysis.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "Dow Jones Futures: Will Nvidia Revive Or Ruin Rocky Market? What To Do Now. - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-nvidia-earnings/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #d3482296-c2af-11f0-a284-ae7aa3332a24"
            },
            {
                "title": "Will Banco Macro S.A. ADR stock outperform Dow Jones - Earnings Summary Report & Daily Stock Momentum Reports - newser.com",
                "source": "newser.com",
                "url": "https://chat.whatsapp.com/Dc1Db3u2ixeCszyeBLI4eY",
                "body": "Stay connected with voice and video.\nSay it with stickers, voice, GIFs and more.\nMessaging features you need to connect in groups.\nStay updated on topics you care about.\nGet help with anything, all with the safety and privacy on WhatsApp.\nShare your everyday with photos, videos and voice notes.\nLayers of protection to help you stay safe.\nFollow this link to join"
            },
            {
                "title": "Will Innovator U.S. Equity Accelerated 9 stock outperform Dow Jones - Weekly Earnings Recap & Low Drawdown Investment Strategies - newser.com",
                "source": "newser.com",
                "url": "https://chat.whatsapp.com/Dc1Db3u2ixeCszyeBLI4eY",
                "body": "Stay connected with voice and video.\nSay it with stickers, voice, GIFs and more.\nMessaging features you need to connect in groups.\nStay updated on topics you care about.\nGet help with anything, all with the safety and privacy on WhatsApp.\nShare your everyday with photos, videos and voice notes.\nLayers of protection to help you stay safe.\nFollow this link to join"
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "181.870",
            "open": "9,890.680",
            "close": "9,751.180",
            "high": "9,922.130",
            "low": "9,740.260"
        },
        "market_summary": "### UK100 Market Briefing\n\n* **Key Drivers:** The **FTSE 100** has risen **19%** in 2025, with dividend stocks like **HSBC** and **Aviva** offering attractive yields and potential for growth.\n* **Price Action:** Stocks like **HSBC** and **Aviva** have seen significant gains, with **HSBC** rising **43%** and **Aviva** rising **38%** in 2025, yet still offer **dividend yields** of **4.8%** and **5.9%** respectively.\n* **Technical Outlook:** These stocks appear **undervalued** based on expected earnings, with **HSBC** trading on a forward **P/E ratio** of **10.2** and **Aviva** on a **PEG multiple** of **0.5**, indicating potential for further growth.\n\n---\n**Overall Sentiment:** Positive ️",
        "source_articles": [
            {
                "title": "I can’t believe how cheap these 5-star income stocks are today… - Yahoo Finance UK",
                "source": "Yahoo Finance UK",
                "url": "https://uk.finance.yahoo.com/news/t-believe-cheap-5-star-071100893.html",
                "body": "2025 has proved another strong year for UK shares. The FTSE 100 and FTSE 250 have risen 19% and 7% respectively. And yet these indexes remain packed with great-value income stocks as we look towards 2026.\nThe following dividend stocks carry enormous dividend yields at today’s prices. But that’s not all, as they also look cheap based on expected earnings.\nHere’s why I think they demand serious attention right now.\nHSBC\nThe HSBC (LSE:HSBA) share price has risen 43% in the year to date. And yet, at £11.18, its dividend yield remains at a robust 4.8%, beating the broader FTSE average of 3.1%.\nOn top of this, predicted dividend growth over the medium term pushes the yield to 5.4% in 2026 and 5.7% in 2027.\nThese robust dividend projections are underpinned by HSBC’s Solvency II capital ratio of 14.5%. This is the strongest across the UK banking sector, and at the top end of the bank’s 14% to 14.5% range.\nThe bank’s Asian focus leaves it exposed to China’s spluttering economy and wider regional issues caused by trade tariffs. So that robust balance sheet helps to at least safeguard HSBC’s progressive dividend policy.\nThat’s not to say I’m expecting a crisis to come along, mind. Indeed, HSBC’s decision to upgrade full-year profit forecasts in late October underlines its reslience to tough conditions. Net interest income is tipped at $43bn, a target Hargreaves Lansdown analysts describe as “a little conservative and… an easy hurdle to clear“.\nI believe HSBC is in great shape to deliver robust earnings and dividend growth over time as wealth levels in emerging markets boom. Yet, I don’t think this is reflected in the bank’s current valuation. It trades on a forward price-to-earnings (P/E) ratio of 10.2 times.\nAviva\nAviva‘s (LSE:AV.) share price has also enjoyed similarly impressive gains in 2025. At 655.4p, it’s risen 38% in value, driven by signs of impressive resilience in difficult conditions. Just on Thursday (13 November), it projected it would reach £2.2bn of operating profit in 2025, a full year ahead of target.\nYet, despite its price gains, investors can still get excellent value for money from the insurance giant. Its dividend yield for 2025 is 5.9%. This rises to 6.3% for next year and 6.8% for 2027.\nLike HSBC shares, Aviva shares also look cheap based on expected earnings. A prospective P/E of 12.5 doesn’t look much to shout about. However, its corresponding price-to-earnings growth (PEG) multiple of 0.5 does.\nAny reading below one implies that a share is undervalued.\nAs with HSBC, dividend forecasts are given strength by Aviva’s impressive financial foundations. Its Solvency ratio was down in the year to September, but remained at a rock-solid 177%. This matters for a company that earns most of profits from the UK, where growth and inflationary pressures are growing."
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "570.400",
            "open": "24,421.720",
            "close": "24,084.720",
            "high": "24,515.220",
            "low": "23,944.820"
        },
        "market_summary": "### GER40 Market Briefing\n\n* **Key Drivers:** The German Blue-Chip Index, **GER40**, faces a critical technical test as it hovers near the **200-day moving average**, a key trend indicator, following sector-specific headwinds while global peers advance.\n* **Price Action:** The index has retreated to **47,209 points**, positioning itself precariously close to a significant support level, with a **Relative Strength Index** of **62.4 points**, indicating **overbought conditions** that may limit additional near-term gains.\n* **Technical Outlook:** Immediate support is at the **200-day moving average**, with a decisive break below this level potentially triggering **accelerated selling pressure**, while resistance is expected at recent highs, influenced by the performance of key stocks like **Mercedes-Benz**, which has shown **bullish momentum** in the electric vehicle segment.\n\n---\n**Overall Sentiment:** Cautious ️",
        "source_articles": [
            {
                "title": "German Blue-Chip Index Faces Critical Technical Test - AD HOC NEWS",
                "source": "AD HOC NEWS",
                "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/german-blue-chip-index-faces-critical-technical-test/68362189",
                "body": "German Blue-Chip Index Faces Critical Technical Test\n16.11.2025 - 05:44:02Dow Jones US2605661048\nGermany’s premier stock index finds itself at a crucial technical juncture, grappling with sector-specific headwinds while global peers advance. The DAX’s recent weakness has positioned it precariously close to a significant support level, creating tension among market participants.\nMarket technicians are closely monitoring the 200-day moving average, a critical trend indicator that often determines market sentiment. The index currently hovers just above this level after retreating to 47,209 points. A decisive break below this support could trigger accelerated selling pressure. Compounding concerns, the Relative Strength Index registers at 62.4 points, indicating overbought conditions that may limit additional near-term gains.\nSector Composition Creates Performance Divergence\nThe DAX’s Read more..."
            },
            {
                "title": "7 Electric Vehicles With Realistic EPA Range Ratings - DAX Street",
                "source": "DAX Street",
                "url": "https://daxstreet.com/list/325727/7-electric-vehicles-with-realistic-epa-range-ratings/",
                "body": "The electric vehicle revolution has brought remarkable advancements in battery technology and energy efficiency, yet one persistent challenge continues to perplex potential EV buyers: the gap between advertised EPA range estimates and real-world driving performance.\nWhile the Environmental Protection Agency’s standardized testing provides a benchmark for comparing vehicles, laboratory conditions rarely mirror the complexities of actual highway driving, varied weather conditions, and diverse driving styles that EV owners experience daily.\nRange is considered one of the most important factors when it comes to all-electric cars, and unfortunately, many shoppers have discovered that their new EV falls significantly short of its official ratings when put through real-world testing scenarios.\nThis disconnect has fueled range anxiety and skepticism about electric vehicle adoption, particularly among those considering their first EV purchase.\nHowever, not all electric vehicles suffer from optimistic range claims. Some manufacturers have engineered their EVs to not only meet but occasionally exceed EPA estimates in independent real-world testing.\nThese vehicles represent the gold standard in honest range ratings, offering buyers realistic expectations and genuine confidence for long-distance travel.\nEach has demonstrated the ability to deliver on its EPA promises under varying conditions, from highway cruising to mixed city-suburban driving.\nWhether you’re a daily commuter seeking reliable transportation or an adventure enthusiast planning cross-country road trips, these seven electric vehicles prove that range anxiety doesn’t have to define the EV ownership experience.\n1. Mercedes-Benz EQS 450+ SUV\nThe Mercedes-Benz EQS 450+ SUV stands as a testament to German engineering excellence in the electric vehicle segment, particularly when it comes to delivering on range promises.\nThis luxury electric SUV doesn’t just meet expectations it consistently exceeds them in real-world testing, making it one of the most reliable range performers in the entire EV market.\nOn the Edmunds EV Range Test, the EQS 450+ achieved 407 miles, which is a 20.1% improvement over its 339-mile EPA range estimate.\nThis exceptional performance places it among the elite EVs that actually surpass their official ratings, a rare achievement that speaks volumes about Mercedes’ conservative approach to range claims and the vehicle’s exceptional efficiency engineering.\nThe secret to the EQS SUV’s impressive real-world performance lies in several key factors. The 2024 model received a larger battery with a maximum capacity of 118 kWh, compared to the 2023 model’s 108.4-kWh pack, providing more energy storage without compromising the vehicle’s already impressive efficiency.\nThe aerodynamic design, despite being an SUV form factor, helps minimize energy consumption at highway speeds where many EVs struggle to maintain their EPA estimates.\nBeyond just range capability, the EQS 450+ delivers exceptional energy efficiency. The EPA expected it to use 39 kWh per 100 miles, but testing showed 32.7 kWh per 100 miles a significant improvement that translates to lower charging costs and fewer stops on long journeys.\nThis efficiency advantage means owners can maximize their charging sessions and spend less time tethered to charging stations. The interior of the EQS SUV embodies Mercedes’ commitment to luxury, featuring the brand’s signature MBUX Hyperscreen that spans nearly the entire dashboard width, creating an immersive digital experience.\nThe cabin is whisper-quiet, with exceptional sound insulation that makes highway cruising remarkably serene. Premium materials throughout the interior, spacious seating for up to seven passengers (in certain configurations), and advanced climate control systems ensure that maximizing range doesn’t mean sacrificing comfort.\nThe EQS 450+ SUV ranks fourth place on Edmunds’ EV Range Test leaderboard, right behind its sedan counterpart, making it the l"
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "718.370",
            "open": "25,544.050",
            "close": "25,000.590",
            "high": "25,636.420",
            "low": "24,918.050"
        },
        "market_summary": "### NDX100 Market Briefing\n\n* **Key Drivers:** The NDX100 is driven by **tech stocks** like Nvidia and Microsoft, which are experiencing **bullish momentum** due to upbeat earnings outlooks and strong demand for new products.\n* **Price Action:** The Nasdaq has notched modest gains, with a **0.1%** increase, as investors favor **tech companies** with dependable results despite an uncertain policy backdrop and fading hopes for near-term **Fed rate cuts**.\n* **Technical Outlook:** The **NDX100** is expected to continue its **bullish trend**, with **record-high forward earnings estimates** driven mostly by **tech leaders**, and support from **tighter memory chip supply** and **strong profit prospects**.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "The total return for Western Digital (NASDAQ:WDC) investors has risen faster than earnings growth over the last three years - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/total-return-western-digital-nasdaq-140010662.html?guccounter=1&guce_referrer=aHR0cHM6Ly9uZXdzLmdvb2dsZS5jb20v&guce_referrer_sig=AQAAAFteAHNQGI1ij_vGEcQE3T5jA5kWIrhb3Z9omTKZ_j0UNDZn5RmhV4Y-J2uPfOFjNjbJGBnXwVjrnGtaneIBuZniAjuZyKkngT9j3Kp0YiMcFtsi-aI7EX6iZB50ZBeF9z-P-IfeSSPDHcv3n0lNyHDbKyZr0hUhS0Nxj9zEv9xW",
                "body": "The total return for Western Digital (NASDAQ:WDC) investors has risen faster than earnings growth over the last three years\nGenerally speaking, investors are inspired to be stock pickers by the potential to find the big winners. But when you hold the right stock for the right time period, the rewards can be truly huge. One such superstar is Western Digital Corporation (NASDAQ:WDC), which saw its share price soar 328% in three years. On top of that, the share price is up 110% in about a quarter. The company reported its financial results recently; you can catch up on the latest numbers by reading our company report.\nIn light of the stock dropping 3.1% in the past week, we want to investigate the longer term story, and see if fundamentals have been the driver of the company's positive three-year return.\nWhile markets are a powerful pricing mechanism, share prices reflect investor sentiment, not just underlying business performance. One way to examine how market sentiment has changed over time is to look at the interaction between a company's share price and its earnings per share (EPS).\nDuring three years of share price growth, Western Digital achieved compound earnings per share growth of 37% per year. This EPS growth is lower than the 62% average annual increase in the share price. So it's fair to assume the market has a higher opinion of the business than it did three years ago. It is quite common to see investors become enamoured with a business, after a few years of solid progress.\nYou can see how EPS has changed over time in the image below (click on the chart to see the exact values).\nWe know that Western Digital has improved its bottom line over the last three years, but what does the future have in store? Take a more thorough look at Western Digital's financial health with this free report on its balance sheet.\nWhat About Dividends?\nIt is important to consider the total shareholder return, as well as the share price return, for any given stock. Whereas the share price return only reflects the change in the share price, the TSR includes the value of dividends (assuming they were reinvested) and the benefit of any discounted capital raising or spin-off. Arguably, the TSR gives a more comprehensive picture of the return generated by a stock. We note that for Western Digital the TSR over the last 3 years was 468%, which is better than the share price return mentioned above. The dividends paid by the company have thusly boosted the total shareholder return.\nA Different Perspective\nIt's good to see that Western Digital has rewarded shareholders with a total shareholder return of 234% in the last twelve months. Of course, that includes the dividend. That's better than the annualised return of 38% over half a decade, implying that the company is doing better recently. In the best case scenario, this may hint at some real business momentum, implying that now could be a great time to delve deeper. It's always interesting to track share price performance over the longer term. But to understand Western Digital better, we need to consider many other factors. For instance, we've identified 1 warning sign for Western Digital that you should be aware of."
            },
            {
                "title": "Zacks Research Has Strong Estimate for Nasdaq Q1 Earnings - MarketBeat",
                "source": "MarketBeat",
                "url": "https://www.marketbeat.com/instant-alerts/zacks-research-has-strong-estimate-for-nasdaq-q1-earnings-2025-11-14/",
                "body": "Nasdaq, Inc. (NASDAQ:NDAQ - Free Report ) - Equities researchers at Zacks Research increased their Q1 2026 EPS estimates for shares of Nasdaq in a research report issued on Thursday, November 13th. Zacks Research analyst Team now expects that the financial services provider will post earnings of $0.90 per share for the quarter, up from their previous forecast of $0.89. The consensus estimate for Nasdaq's current full-year earnings is $3.18 per share. Zacks Research also issued estimates for Nasdaq's Q4 2026 earnings at $0.98 EPS, FY2026 earnings at $3.71 EPS, Q3 2027 earnings at $1.03 EPS and FY2027 earnings at $4.11 EPS.\nNDAQ has been the subject of a number of other research reports. Raymond James Financial reaffirmed an \"outperform\" rating and set a $100.00 price target (up previously from $99.00) on shares of Nasdaq in a research report on Monday, October 13th. Deutsche Bank Aktiengesellschaft lifted their target price on Nasdaq from $97.00 to $105.00 and gave the stock a \"buy\" rating in a report on Friday, July 25th. Barclays set a $109.00 price target on Nasdaq and gave the company an \"overweight\" rating in a research note on Wednesday, October 22nd. Royal Bank Of Canada reiterated an \"outperform\" rating and issued a $108.00 price target on shares of Nasdaq in a research note on Thursday, October 9th. Finally, Cowen reaffirmed a \"hold\" rating on shares of Nasdaq in a research note on Wednesday, October 22nd. Fourteen research analysts have rated the stock with a Buy rating and four have given a Hold rating to the company. According to MarketBeat.com, the stock currently has a consensus rating of \"Moderate Buy\" and a consensus target price of $99.67.\nGet Nasdaq alerts:\nSign Up\nView Our Latest Analysis on Nasdaq\nNasdaq Stock Down 0.2% NDAQ traded down $0.16 during trading on Friday, hitting $87.27. The company had a trading volume of 754,872 shares, compared to its average volume of 3,293,778. The company has a quick ratio of 0.99, a current ratio of 0.99 and a debt-to-equity ratio of 0.72. The company has a market capitalization of $49.83 billion, a PE ratio of 31.13, a PEG ratio of 1.79 and a beta of 0.98. The firm's 50-day moving average price is $89.11 and its 200 day moving average price is $88.49. Nasdaq has a one year low of $64.84 and a one year high of $97.63.\nNasdaq (NASDAQ:NDAQ - Get Free Report ) last issued its quarterly earnings data on Tuesday, October 21st. The financial services provider reported $0.88 EPS for the quarter, topping the consensus estimate of $0.82 by $0.06. Nasdaq had a return on equity of 16.28% and a net margin of 19.90%.The business had revenue of $1.32 billion for the quarter, compared to the consensus estimate of $1.29 billion. During the same quarter last year, the business posted $0.74 EPS. The firm's revenue was up 14.7% compared to the same quarter last year.\nNasdaq Dividend Announcement The business also recently declared a quarterly dividend, which will be paid on Friday, December 19th. Shareholders of record on Friday, December 5th will be paid a $0.27 dividend. This represents a $1.08 annualized dividend and a yield of 1.2%. The ex-dividend date of this dividend is Friday, December 5th. Nasdaq's payout ratio is 38.57%.\nInsider Transactions at Nasdaq In other news, EVP Jeremy Skule sold 2,105 shares of the business's stock in a transaction that occurred on Monday, November 3rd. The stock was sold at an average price of $85.40, for a total transaction of $179,767.00. Following the completion of the sale, the executive vice president owned 84,974 shares in the company, valued at $7,256,779.60. The trade was a 2.42% decrease in their ownership of the stock. The transaction was disclosed in a legal filing with the SEC, which is available through this hyperlink . Insiders own 0.70% of the company's stock.\nInstitutional Trading of Nasdaq A number of hedge funds and other institutional investors have recently added to or reduced their stakes in the stock. CWM LLC lifted its position in "
            },
            {
                "title": "Tech Stocks Outshine As Traders Rethink Fed Cuts - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/tech-stocks-outshine-as-traders-rethink-fed-cuts",
                "body": "Nvidia and Microsoft climbed on upbeat outlooks while rate cut hopes faded, giving tech a leg up even as other sectors fell behind.\n1 day ago • 2 mins\nJoin the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nTech stocks kept defying gravity on Wall Street, with the Nasdaq notching modest gains even as hopes for speedy Federal Reserve rate cuts dimmed and most other sectors lagged behind.\nWhat does this mean?\nInvestors are still snapping up shares in tech giants like Nvidia and Microsoft, bucking the weaker mood elsewhere in the market. Nvidia’s 1.8% rise was fueled by Morgan Stanley’s upbeat forecast ahead of next week’s earnings, highlighting strong demand and new Blackwell chips. Microsoft added 1.4% after launching its ‘OpenAI for Ireland’ initiative to back local tech startups. Micron Technology stood out too, jumping 4.2% as analysts spotlighted tighter memory chip supply and strong profit prospects. While technology and energy led the charge, materials, communication, and financial firms dragged on the S&P 500, pushing the Dow down 0.7%. Plus, with Treasury yields rising after Fed officials poured cold water on more rate cuts, S&P 500 earnings forecasts—anchored by tech—are now at all-time highs.\nWhy should I care?\nFor markets: Tech stocks keep driving the market.\nTechnology companies are setting the pace, with Nasdaq edging up 0.1% as investors jump in on upbeat earnings outlooks for firms like Nvidia and Micron. Meanwhile, hopes for near-term rate cuts are fading, with December’s odds down to 46% according to CME’s FedWatch Tool. That could put more pressure on sectors that are less resilient if economic growth does slow.\nThe bigger picture: Earnings strength shapes market momentum.\nRecord-high forward earnings estimates for the S&P 500 are being driven mostly by tech leaders. Even as gold and silver take a back seat and oil edges up, the market is moving toward areas with real profit power. With Fed officials taking a cautious tone and inflation still a factor, investors are likely to keep favoring companies with dependable results—especially in tech—despite an uncertain policy backdrop.\nMentioned in story\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article is based on reporting by MT Newswires. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies.\nGet the two biggest stories in finance, and the reasons why you should care, delivered to your inbox every day."
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "146.240",
            "open": "6,854.140",
            "close": "6,742.420",
            "high": "6,872.920",
            "low": "6,726.680"
        },
        "market_summary": "### SPX500 Market Briefing\n\n* **Key Drivers:** None of the provided articles contain information relevant to the SPX500 or financial markets, making it challenging to identify key drivers.\n* **Price Action:** As there is no relevant information in the articles, it's impossible to discuss the current price action of the SPX500.\n* **Technical Outlook:** Without relevant data or market analysis from the provided articles, a technical outlook cannot be determined.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "Israeli army claims Gazans who arrived in S. Africa on mystery plane had been granted entry - France 24",
                "source": "France 24",
                "url": "https://www.france24.com/en/middle-east/20251115-israel-army-gazans-palestinian-refugees-south-africa-mystery-plane-granted-entry-ramaphosa",
                "body": "Israeli army claims Gazans who arrived in S. Africa on mystery plane had been granted entry\nIsraeli authorities said on Saturday that the 153 Gazans flown to South Africa earlier this week had received entry clearance from a third state before take-off. A spokesperson for the Israeli military branch overseeing the operation told FRANCE 24 that the “third country” was in fact South Africa.\nTo display this content from YouTube, you must enable advertisement tracking and audience measurement.\nOne of your browser extensions seems to be blocking the video player from loading. To watch this content, you may need to disable it on this site.\nShimi Zuaretz, a spokesman for COGAT, the Israeli body that runs civil affairs in the Palestinian territories, said the Palestinians had only been allowed to leave Gaza “after COGAT received approval from a third country to receive them”.\nLater Saturday, a spokesperson from the same branch told FRANCE 24’s correspondent in Jerusalem, Noga Tarnopolsky, that the third country was South Africa itself.\n“This is quite significant because what Israel is contending – via this admission from the spokesperson – is that South Africa invited these Gazans to come, authorised their arrival and then – facing a significant backlash from the population from South Africa and civil society groups who fear that Israel is trying to perpetrate ethnic cleansing in Gaza by sending these Gazans out – backtracked and pretended not to know anything at all,” she said.\n“So this is quite a serious change of tone from the Israel army.”\nKept on plane for hours\nAfter landing in Johannesburg on Thursday, the Gazans were kept aboard their plane for 12 hours because they did not have departure stamps from Israel in their passports.\nWatchMysterious plane carrying Gaza refugees lands in South Africa\nThe home affairs ministry finally allowed the passengers to disembark when an NGO said it would provide them with accommodation.\nThe NGO, Gift of the Givers, told South African media it did not know who had chartered the flight or a previous one that brought 176 Gazans on October 28.\nAn Israeli official who did not wish to be identified told AFP that the organisation which coordinated the transfer had submitted third-country visas to COGAT for all the evacuated residents.\n‘Mysteriously put on plane’\nSouth African President Cyril Ramaphosa told journalists on Friday that it seemed “like they were being flushed out”.\n“These are people from Gaza who somehow mysteriously were put on a plane that passed by Nairobi and came here,” he said.\nSouth Africa’s home affairs ministry said 130 of the group entered the country, while the remaining 23 took onward flights to other destinations.\nZuaretz said COGAT facilitates the departure of Gaza residents through Israel to receiving countries, for patients requiring medical treatment, dual citizens and their family members, “or those possessing visas to third countries”.\nIsrael “bases its decisions solely on requests received from foreign countries”, he added, saying the departure of more than 40,000 Gaza residents had been facilitated since the October 7, 2023 attack on Israel, which sparked the retaliatory war in the Gaza Strip.\nSouth Africa, which hosts the largest Jewish community in sub-Saharan Africa, has largely been supportive of the Palestinian cause.\nThe government filed a case against Israel with the International Court of Justice in 2023, accusing it of genocide in Gaza.\n(FRANCE 24 with AFP)"
            },
            {
                "title": "RFK Jr.’s Cheer Squad Is Getting Restless - The Atlantic",
                "source": "The Atlantic",
                "url": "https://www.theatlantic.com/health/2025/11/childrens-health-defense-vaccine-kennedy/684938/",
                "body": "Russell Brand had found his people, that much was clear. Last Saturday, in front of 800 fans in a hotel ballroom in Austin, the comedian doled out praise for Robert F. Kennedy Jr. (whom he called “Great Brother Kennedy”), disdain for the medical establishment (“flat-out evil”), and gratitude for Jesus Christ (“Thank God we have a forgiving God that died for us”). He also told a bunch of dick jokes and, later, called me a Nazi.\nAfter the show, I’d asked Brand for an interview, and he told me that the media are “Luciferian,” and that reporters are Nazis. “Do you really think that?” I asked him. “You’re more like an individual Nazi,” he said, seemingly a concession that I was just following orders. (I didn’t get the interview.)\nBrand and his fans had gathered for the annual conference of Children’s Health Defense, the anti-vaccine nonprofit founded in 2018 by the current secretary of Health and Human Services. Kennedy wasn’t there, but the movement’s other headliners were. Brand—who is awaiting trial for rape and sexual assault in the U.K. and has pleaded not guilty—was onstage with Kennedy’s wife, Cheryl Hines, to promote her memoir. Her publisher, Tony Lyons, was there in his role as president of MAHA Action, a nonprofit that holds weekly Zoom calls to galvanize support for Kennedy’s agenda. Also on the scene were Andrew Wakefield, who’s infamous for his discredited 1998 Lancet study on the measles-mumps-rubella vaccine and autism, along with newer adherents such as Bret Weinstein, the evolutionary biologist, COVID-vaccine critic, and podcast host.\nEveryone I spoke with at the conference shared a distrust of vaccines and a sense that, after they’d spent years on the fringes of scientific discourse, Kennedy’s rise to power had given them the legitimacy they once lacked. (The theme of the event was “Moment of Truth.”) As Polly Tommey, the program director of the organization’s video-and-audio operation, told the audience: “We never thought Bobby would be health secretary—I mean, come on! We’re in the best place we’ve been for ages!” But what should have been a victory lap at times felt like an attempt to rally the troops, or at least reassure them.\nKennedy’s tenure has been turbulent. In less than a year, he’s sent mixed signals about the benefits of vaccination during a measles outbreak, fired all of the CDC’s outside vaccine advisers and replaced them with his allies, axed the director of the CDC just weeks after she took the job, and stoked fears about prenatal Tylenol use as a cause of autism despite recent conflicting evidence. A string of top CDC officials, including the chief science officer, has resigned, and those who remain say morale has never been lower.\nBut the Kennedy faithful don’t care about the health secretary flouting institutional norms or sidelining subject-matter experts, because they view HHS, and the CDC in particular, as either useless or corrupt. In fact, some at the conference worried that Kennedy is not acting with enough urgency. (In an email, the HHS spokesperson Emily Hilliard wrote that Kennedy “remains committed to ensuring that all Americans have access to accurate, evidence-based information about vaccines.”)\nThey want Kennedy to investigate their belief that the government supposedly colluded with Big Pharma to hide the harms of vaccination. In a session on Saturday afternoon, former Republican Representative Dave Weldon, whose nomination to become CDC director was withdrawn in March amid outcry over his criticism of immunizations, called for the creation of an independent body to investigate vaccine-safety data and report only to Kennedy and President Donald Trump. “If it’s in the hands of the CDC, you’ll never get the answers you need,” he told the crowd. During a session titled “The Enduring Nightmare of COVID mRNA Technology,” Sherri Tenpenny, a veteran anti-vaccine activist who once said that one goal of COVID vaccination was to turn people into “transhumanist cyborgs,” called for the mRNA"
            },
            {
                "title": "UPDATE: Victims identified after rollover crash on Highway 67 S in Biloxi - WLOX",
                "source": "WLOX",
                "url": "https://www.wlox.com/2025/11/15/update-victims-identified-after-rollover-crash-highway-67-s-biloxi/",
                "body": "UPDATE: Victims identified after rollover crash on Highway 67 S in Biloxi\nBILOXI, Miss. (WLOX) - All south bound lanes of Highway 67 are reopened after a fatal crash involving a rollover Friday night.\nThe crash happened just north of the Highway 15 interchange.\nAccording to Harrison County Coroner Brian Switzer, 61-year-old Ronald Lechner, from D’Iberville, died at the scene. 36-year-old Brittany Hodges, from Ocean Springs, was taken to the hospital where she later died from her injuries.\nSwitzer said Lechner was driving north in the south bound lane of Highway 67 and hit a vehicle being driven by Hodges, causing his truck to roll over.\nSwitzer said Lechner’s seatbelt was unbuckled when he hit the other vehicle. He said Hodges’s seatbelt was buckled at the time of the crash.\nOfficials are still investigating the crash.\nSee a spelling or grammar error in this story? Report it to our team HERE.\nCopyright 2025 WLOX. All rights reserved."
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "1,395.000",
            "open": "51,387.820",
            "close": "50,057.110",
            "high": "51,387.820",
            "low": "49,992.820"
        },
        "market_summary": "### JPN225 Market Briefing\n\n* **Key Drivers:** Resolution of the US shutdown and positive company earnings are supporting **bullish momentum**, while investors weigh **inflation** concerns and **interest rate** signals from Tokyo.\n* **Price Action:** The Nikkei 225 ticked up **0.43%** to **51,281.83**, driven by **investor confidence** and **positive news** on company deals.\n* **Technical Outlook:** Immediate support is near the **50-day moving average**, with resistance at **52,000**; **robust earnings** and **buyout moves** are adding to market volatility.\n\n---\n**Overall Sentiment:** Cautiously **bullish** ↑",
        "source_articles": [
            {
                "title": "China's fine wine makes splash with Japanese palates - Nikkei Asia",
                "source": "Nikkei Asia",
                "url": "https://asia.nikkei.com/business/food-beverage/china-s-fine-wine-makes-splash-with-japanese-palates",
                "body": "TOKYO -- Fine wine made in China is starting to gain traction among aficionados in Japan.\nTop-shelf Chinese wine sells for hundreds of dollars in Japan\nSommelier Akihiko Nosaka has been enthusiastically acquiring Chinese wine for the Mandarin Oriental hotel in Tokyo. (Photo by Mina Ashikawa)\nTOKYO -- Fine wine made in China is starting to gain traction among aficionados in Japan."
            },
            {
                "title": "Nikkei Rises As Policy Moves And Company Deals Shape Markets - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/nikkei-rises-as-policy-moves-and-company-deals-shape-markets",
                "body": "Japan’s stock market gained ground after the US resolved its shutdown, while investors weighed profit jumps, big buyouts, and signals from Tokyo on inflation and rates.\n3 days ago • 2 mins\nJoin the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nJapan’s Nikkei 225 ticked up 0.43% to notch 51,281.83, as investors breathed easier after the US sidestepped a government shutdown and positive news on company earnings and deals emerged.\nWhat does this mean?\nInvestor confidence found its way back to Japanese stocks after the US resolved its shutdown standoff, calming nerves over global market uncertainty. Eyes are now on key US data releases, like September’s jobs report, which could sway expectations for future interest rate moves. But not all uncertainty is gone – the White House has warned some economic data might be withheld permanently, leaving investors in a potential information gap. On the domestic front, Prime Minister Sanae Takaichi and Bank of Japan Governor Kazuo Ueda are doubling down on supporting moderate inflation and wage growth, especially with producer prices rising 0.4% in October and 2.7% from a year ago, driven by higher costs for farm goods and metals. Company news added even more color: Yamazen dipped 2% on an acquisition, Star Micronics popped on a buyout premium, and Sumitomo Rubber shot up over 13% after reporting a massive profit boost despite softer revenue.\nWhy should I care?\nFor markets: Cautious optimism is steering investor sentiment.\nGlobal risk appetite has perked up now that the US shutdown drama has cleared, giving Japanese stocks some breathing room. Still, direction will depend on how upcoming US economic data shapes rate expectations, and whether policy signals stay steady. Robust earnings, like Sumitomo Rubber’s profit surge, are pulling in investor attention, while buyout moves by firms like Star Micronics add an extra jolt of volatility. For now, the mood is upbeat but ready to adjust as new data or policy shifts emerge.\nThe bigger picture: Japan is walking a tightrope between inflation and growth.\nProducer prices on the rise mean inflation concerns aren’t going away, so policymakers in Tokyo are sticking with low rates and pushing for wage increases to keep growth on track. At the same time, healthy dealmaking and strong profits in industries from manufacturing to rubber hint at underlying corporate strength. How Japanese and US policy coordination plays out—and how companies manage rising costs—will be key for markets and the broader economy in the months ahead.\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article is based on reporting by MT Newswires. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies.\nGet the two biggest stories in finance, and the reasons why you should care, delivered to your inbox every day."
            },
            {
                "title": "Japan suffers opportunity loss equivalent to 2.6% of GDP from labor crunch - Nikkei Asia",
                "source": "Nikkei Asia",
                "url": "https://asia.nikkei.com/economy/japan-suffers-opportunity-loss-equivalent-to-2.6-of-gdp-from-labor-crunch",
                "body": "EconomyJapan suffers opportunity loss equivalent to 2.6% of GDP from labor crunch\nNon-manufacturing sectors fall victim to hiring shortfalls and staff turnover\nLights are turned off on a floor with unused rooms due to staff shortages at a hotel in Nikko, Tochigi prefecture. (Photo by Nanami Sato)\nMOTOKAZU MATSUI and GO SAKURAI\nNovember 16, 2025 10:23 JST\nTOKYO -- Japan faces significant economic challenges due to labor shortages, and these have resulted in missed opportunities and growth headwinds. The shortfall affects multiple industries, disrupts business operations and increases the likelihood of bankruptcies, highlighting the need to enhance productivity alongside fiscal measures."
            }
        ]
    }
]