[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "121.740",
            "open": "3,999.950",
            "close": "4,110.150",
            "high": "4,117.040",
            "low": "3,995.300"
        },
        "market_summary": "### Gold (XAU/USD) Market Briefing\n\n* **Key Drivers:** Expectations of **Federal Reserve rate cuts**, steady central bank buying, firm ETF inflows, escalating trade pressure, and growing bets on lower interest rates are driving the **bullish momentum** in gold.\n* **Price Action:** Gold has broken above the key psychological level of **$4,000**, reaching a new record high of **$4,151** per ounce, driven by investors seeking safe-haven assets amidst trade tensions and potential inflation.\n* **Technical Outlook:** Immediate resistance is near the **$4,150** level, with support at **$4,000**, as gold flashes overbought signals with RSI levels at **80**.\n\n---\n**Overall Sentiment:** Positive 🚀",
        "source_articles": [
            {
                "title": "Gold hit a new record above $4,150 per ounce as traders priced in upcoming Federal Reserve rate cuts - Mitrade",
                "source": "Mitrade",
                "url": "https://www.mitrade.com/insights/news/live-news/article-3-1191248-20251014",
                "body": "After a very awkward trading session on Wall Street, the S&P 500 managed to surge by 1.6% at Monday’s market close, while the Nasdaq rallied by 2.3% and gold broke yet another record, breaking past $4,150 per ounce for the first time ever, according to data from CNBC.\nThe market rebound followed a chaotic Friday session that erased $2 trillion in value after U.S. President Donald Trump reignited trade tensions with China. This time, stocks, metals, and crypto-adjacent sectors all responded sharply as Wall Street digested Trump’s follow-up statement posted on Truth Social.\nIn the post, he hinted that the “massive increase of tariffs” he’d threatened might not happen after all. Gold didn’t wait around. It surged 2.14% to $4,103.47, after hitting an all-time high of $4,151 during intraday trading. Futures for December delivery wrapped up 3.3% higher at $4,150.\nPhillip Streible, chief market strategist at Blue Line Futures, said, “Gold could easily continue its upward momentum. We could see prices north of $5,000 by the end of 2026.” Phillip pointed to steady central bank buying, firm ETF inflows, escalating trade pressure, and growing bets on lower interest rates as core drivers of the rally.\nThe tech sector was the first to roar back. Broadcom skyrocketed 10% after announcing its OpenAI partnership. Oracle rallied over 5%, while Nvidia jumped 3% and AMD added 1%. Those gains helped push the Nasdaq up more than 2%, making it the day’s top performer.\nNearly 80% of S&P 500 components traded green. Small-caps weren’t left out either, as the Russell 2000 popped 2.5% after closing Friday down 3%.\nTrump’s Friday comments triggered the worst one-day drop in months, but his toned-down remarks over the weekend eased some of the panic. Still, the trade war clouds remain. Many U.S. tech firms depend on rare earths from China to build chips, EV parts, and consumer electronics, so this tug-of-war rattles investors quickly.\nThe Dow Jones Industrial Average rebounded 621 points, or 1.4%, clawing back about 70% of its Friday losses. The S&P 500 retraced nearly 60% of its prior dip, with optimism building ahead of earnings season.\nMarkets also reacted to growing certainty that the Federal Reserve will cut rates. Traders are now betting with 97% confidence on a 25-basis-point cut in October, and they see a 100% chance of another one in December. That’s music to the ears of gold bulls. The metal, which doesn’t pay interest, usually thrives when rates drop.\nAnalysts at Bank of America and Société Générale both predict gold to hit $5,000 by 2026. Standard Chartered raised its forecast, expecting an average price of $4,488 next year.\nSilver didn’t miss out. It spiked 3.44% to $52, after peaking at $52.12, also a record. Both gold and silver flashed overbought signals, with RSI levels at 80 and 83, respectively. Elsewhere, platinum jumped 4% to $1,650.65, while palladium added 5.23%, closing at $1,479.04.\nWall Street’s momentum is to be tested this week. The government shutdown is dragging on, and a critical payroll deadline is approaching on October 15. Also, major banks are set to report earnings starting Tuesday, with Citigroup, Goldman Sachs, Wells Fargo, JPMorgan, Bank of America, and Morgan Stanley all in focus. A wave of regional banks will follow.\nMeanwhile, after getting caught in the crossfire that saw it plunge all the way to $102,000, Bitcoin has now steadied above $115,000. Galaxy Digital weighed in on what happened, calling the event “one of the largest liquidation events in digital asset history.”\nGalaxy pointed to two triggers: a major pricing flaw on an offshore exchange, and a sudden global macro shock linked to the new tariff headlines that had already rattled markets. According to Galaxy, around $60 to $90 million worth of USDe was dumped on a large offshore platform.\nThat platform didn’t use an independent price feed; it valued collateral based on its own order-book data, and when that data tanked, it triggered an isolated depeg th"
            },
            {
                "title": "The Huge US Bond Market and the US Dollar Blow Off the “Debasement Trade” - Wolf Street",
                "source": "Wolf Street",
                "url": "https://wolfstreet.com/2025/10/13/the-huge-us-bond-market-and-the-us-dollar-blow-off-the-debasement-trade/",
                "body": "The bond market has taken the opposite bet, and the dollar has strengthened.\nBy Wolf Richter for WOLF STREET.\nA hot theme widely banded about to pump up cryptos, gold, silver, and even stocks is the so-called “currency debasement trade.” The idea is that enough traders rally behind a common theme to move prices in their direction for long enough to make a serious buck and generate fees from the trading.\nThis debasement-trade theme is a bet that government borrowing and money printing will erode the value of the US dollar dramatically and quickly, and that therefore enough investors will pile into cryptos, gold, silver, and even stocks, to cause prices of those instruments to explode. And they did.\nBut the huge bond market has taken the opposite bet, led by the $29-trillion Treasury market, the $11-trillion corporate bond market, the $9-trillion residential MBS market, the $4-trillion municipal bond market, plus the other segments of the bond market, where yields have fallen this year and have been in the same relatively narrow range for the past three years.\nThese bond investors bet that inflation will cool further over the longer horizon, and that the relatively low yields they get on their securities will therefore adequately remunerate them for inflation and for the risks they’re taking, and that the cooling of inflation will cause yields to decline further in the future, thereby pushing up prices of bonds that had been issued earlier at higher yields.\nIf the bond market were fearing a rapid and substantial debasement of the US dollar – the theme being hyped by the debasement trade promoters – it would demand much higher yields. But that hasn’t been the case.\nThe 10-year Treasury yield, for example — now barely above 4% as of Friday evening (bond markets are closed today) — has been on a downtrend this year and has been roughly in the same range for three years:\nBut, but, but, the US dollar…. The dollar’s drop during the first half of 2025 has been falsely promoted in clickbait headlines and by braindead manipulative talking heads on TV, as “the steepest decline in more than a half a century,” or whatever.\nWhat did occur is that the dollar indices had spiked in the last four months of 2024 and topped out at the very end of December. And that four-month spike was then unwound-plus-some over the six months exactly from the beginning of January through the beginning of July, with the euro and yen dominated DXY Dollar Index dropping 11% and the broader WSJ Dollar Index [BUXX] dropping 9% over the first six months of the year.\nBut even bigger six-month drops were common and bottomed out in:\n- April 2023\n- September 2020\n- November 2010\n- August 2009\n- April 2008\n- June 2007\n- Etc., all the way back to Adam and Eve.\nThe only thing that was unique about the 6-month drop in 2025 was that it started at the beginning of January. Only the start date was unique.\nThis chart shows the 6-month percentage change of the WSJ Dollar Index [BUXX], which tracks a basket of 16 major currencies.\nThe blue line indicates the 6-month 9% drop from the beginning of January through the beginning of July. Note all the even bigger 6-month drops that have dropped through the blue line over the past 23 years.\nAnd of course, the dollar has bounced back some since the beginning of July with the WSJ Dollar Index rising today to 96.4, up by 2.6% from the low at the beginning of July.\nThe 16 currencies in the trade-weighted index are: Euro, Japanese Yen, Chinese Yuan, Canadian Dollar, Mexican Peso, South Korean Won, New Taiwan Dollar, Indian Rupee, Hong Kong Dollar, Singapore Dollar, British Pound, Australian Dollar, New Zealand Dollar, Norwegian Krone, Swiss Franc, and the Swedish Krona.\nThe Fed has been doing the opposite of “money printing” for over three years, having shed $2.4 trillion in assets by now – “money unprinting?” – and it continues to shed assets under its Quantitative Tightening program, and folks promoting the debasement trade need to take a l"
            },
            {
                "title": "Bank of America hikes gold forecast to $5K an ounce as investors flock to safe-haven asset - New York Post",
                "source": "New York Post",
                "url": "https://nypost.com/2025/10/13/business/bank-of-america-hikes-gold-forecast-to-5000-an-ounce/",
                "body": "Bank of America hikes gold forecast to $5K an ounce as investors flock to safe-haven asset\nBank of America on Monday hiked its price forecast for gold to $5,000 an ounce in 2026 as investors flock to the safe-haven asset.\nThe bullish prediction follows a blowout year for the precious metal, which surged above $4,000 for the first time ever last week.\nGold notched a new all-time high of $4,079.62 on Monday after President Trump threatened a “massive increase” of tariffs on China, accusing the nation of “becoming very hostile” in its rare earth restrictions.\nFearful of heightened trade tensions, investors rushed to buy gold, which is seen as a hedge against inflation and uncertainty due to its capacity to hold value while other assets fall.\nWhile Bank of America warned of a possible near-term correction, it still expects a further upswing in 2026.\nExplore Top Gold IRAs\nAmerican Hartford Gold\nAmerican Hartford Gold is a top-rated precious metals dealer specializing in gold and silver for physical delivery or within retirement accounts. Known for its transparency, white-glove customer service, and easy-to-navigate onboarding process, the company helps investors hedge against inflation and economic volatility. Whether you’re new to gold or rolling over a 401(k) into a Gold IRA, AHG provides tailored solutions, real-time market tracking, and secure storage options — all with no hidden fees and a price match guarantee.\nGoldCo is a leading provider of gold and silver IRAs, helping investors protect and grow their retirement savings with precious metals. With a strong reputation for client satisfaction and financial education, GoldCo makes it simple to diversify your portfolio with physical gold, offering personalized consultations, secure vaulting, and tax-advantaged strategies. Its team of experts guides clients through the entire rollover process, offering transparency, competitive pricing, and long-term support.\n“Looking into 2026, a 14% increase of investment demand – similar to what we have seen this year – could lift gold to $5,000/oz,” the bank said.\nAnxiety around Trump’s tariffs and their potential to cause inflation, stubbornly high interest rates, a weaker US dollar, the government shutdown and a slow labor market have all contributed to gold’s explosive rise this year.\nThe value of gold has spiked about 50% so far in 2025, marking its best year since 1979.\nRandy Smallwood, chief executive of Wheaton Precious Metals Corp., said Friday that gold could easily climb to $5,000 an ounce within a year – and double that by the end of the decade.\n“I’m confident that we will see gold over $5,000 within the next year,” he told Bloomberg Television. “It’s a trajectory that could easily put it up to $10,000 an ounce before the end of the decade. It wouldn’t surprise me at all.”\nWheaton, which provides upfront financing to miners in exchange for discounted metals, has benefitted from a surge in prices this year as geopolitical uncertainty and a limited physical supply push investors toward gold.\nMajor stock indexes have also notched record-high after record-high this year.\nCharlie Gasparino has his finger on the pulse of where business, politics and finance meet\nSign up to receive On The Money by Charlie Gasparino in your inbox every Thursday.\nThanks for signing up!\nThe Dow Jones Industrial Average jumped 582 points, or 1.3%, on Monday as Trump tried to ease investor concerns over the weekend.\n“Don’t worry about China, it will all be fine! Highly respected President Xi just had a bad moment,” Trump said in a post Sunday on his Truth Social platform. “The USA wants to help China, not hurt it!!!”\nMeanwhile, Goldman Sachs last week hiked its December 2026 gold price forecast to $4,900, up from $4,300.\nIt cited likely central bank buying, which it expects to average 80 metric tons in 2025 and 70 tons in 2026 as banks diversify their reserves.\nDeutsche Bank analysts have also projected that gold prices could rise above $4,000 by the end of t"
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "0.985",
            "open": "63.209",
            "close": "63.597",
            "high": "64.184",
            "low": "63.199"
        },
        "market_summary": "### Spot Brent Crude Oil Market Briefing\n\n* **Key Drivers:** OPEC's unchanged outlook for the oil market, **expanding strategic oil stocks in China**, and **global oil inventory builds** are influencing **Spot Brent Crude Oil** prices.\n* **Price Action:** Currently trading around **$68** per barrel, with a slight increase in the second and third quarters of 2025, despite growing inventories.\n* **Technical Outlook:** Immediate support is near **$65**, with resistance at **$70**, as the market awaits further developments in global oil demand and supply.\n\n---\n**Overall Sentiment:** Neutral ⚖️",
        "source_articles": [
            {
                "title": "OPEC Keeps Oil Outlook Unchanged - Rigzone",
                "source": "Rigzone",
                "url": "https://www.rigzone.com/news/wire/opec_keeps_oil_outlook_unchanged-13-oct-2025-182063-article/",
                "body": "OPEC Keeps Oil Outlook Unchanged\nOPEC kept its outlook for the oil market unchanged as the group and its allies continue to add barrels to the global market.\nGlobal oil demand will grow by 1.3 million barrels a day this year and by 1.4 million in 2026, the same as previously forecast, the Organization of the Petroleum Exporting Countries said in its monthly market report on Monday.\nOPEC+ — representing the group and its allies — is adding barrels to a global market that’s expected to be in surplus next year. The group increased output by 630,000 barrels a day in September, according to the report, citing information from secondary sources.\nBrent oil futures have slumped 18% in the past year, with a big part of the drop coming since April, when the OPEC+ hikes were first announced, to the surprise of traders.\nThe projected demand for OPEC+ crude was also unchanged from last month’s report, at 42.5 million barrels a day this year. Next year, demand for the group’s crude is expected to rise to 43.1 million barrels a day.\nThis month, the OPEC+ alliance agreed to revive just 137,000 barrels a day of halted supply, a slower pace than earlier this year.\nOther key figures from the monthly report:\n- September output average about 43.05 million barrels a day.\n- Oil demand in the OECD is expected to rise by around 130,000 barrels a day, with OECD Americas leading the increase.\n- Non-OECD demand is expected to grow by around 1.2 million barrels a day.\n- Transport fuels are expected to be the key growth source for oil demand this year, with jet fuel/kerosene adding 380,000 barrels a day of demand and diesel 300,000 barrels a day.\n- Non-OPEC production is expected to grow by about 800,000 barrels a day this year, and 600,000 next year, also unchanged from last month’s assessment.\n- Brazil, Canada, the US and Argentina are set to be the main contributors to higher output.\n- OPEC+ output of natural gas liquids and non-conventional liquids is predicted to expand by 100,000 year-on-year to an average of 8.6 million barrels a day this year, and by a similar margin in 2026 to reach 8.8m million barrels day.\nWHAT DO YOU THINK?\nGenerated by readers, the comments included herein do not reflect the views and opinions of Rigzone. All comments are subject to editorial review. Off-topic, inappropriate or insulting comments will be removed."
            },
            {
                "title": "Opec Sticks With Oil Demand Forecasts - energyintel.com",
                "source": "energyintel.com",
                "url": "https://www.energyintel.com/00000199-de28-dd61-abb9-ffbfc3190000",
                "body": "Opec has left its global demand forecast for both this year and 2026 unchanged from last month and sees room for more Opec-plus oil next year, even as members of the producer group continue to unwind production cuts.\nOpec Sticks With Oil Demand Forecasts\nCopyright © 2025 Energy Intelligence Group All rights reserved. Unauthorized access or electronic forwarding, even for internal use, is prohibited.\nPublished:\nMon, Oct 13, 2025"
            },
            {
                "title": "Expanding Strategic Oil Stocks In China Support Crude Oil Prices – Analysis - eurasiareview.com",
                "source": "eurasiareview.com",
                "url": "https://www.eurasiareview.com/14102025-expanding-strategic-oil-stocks-in-china-support-crude-oil-prices-analysis/",
                "body": "Expanding Strategic Oil Stocks In China Support Crude Oil Prices – Analysis\nBy EIA\nWe estimate crude oil inventories in China increased by about 900,000 barrels per day (b/d) between January and August this year, essentially acting as a source of demand by removing barrels from the global markets.\nThe stock builds in China limited the downward price pressure we would otherwise expect to see with growing inventories, keeping the Brent crude oil spot prices in a relatively tight range around $68 per barrel (b) in the second and third quarters of 2025.\nWe estimate global petroleum inventories rose by an average of 1.8 million b/d in the second and third quarters in our October Short-Term Energy Outlook (STEO). Global oil inventories have been growing in 2025 as crude oil production from OPEC+ members and non-OPEC+ producers in North and South America has outpaced global demand growth.\nBetween April and August (the latest estimates we have), growth in China alone averaged 1.1 million b/d. Similar levels of global inventory growth would typically put downward pressure on crude oil prices; however, the price of Brent increased slightly during this period, averaging $68/b in the second quarter (2Q25) and $69/b in 3Q25.\nWe estimate total liquid fuels inventories in non-OECD countries, including China, grew by an average of 0.9 million b/d from January through August 2025. We estimate that on average, 0.9 million b/d of crude oil and condensate was added to oil inventories in China, making up most of our estimated global inventory builds of 1.4 million b/d over the same period.\nChina does not report data on its oil inventories, so we assessed China’s stock growth based on imports, exports, refining, and oil inventory data from third-party and official sources. We estimate the additions to oil inventories in China by balancing crude oil and condensate production, reported by the China National Bureau of Statistics, along with imports, refinery runs, and export data from a collection of ship-tracking and third-party sources.\nDepending on the source used and assumptions made, the range between different stock build estimates is 0.5 million b/d on average and can be as large as 1.1 million b/d, so we take an average for this comparison. Although we know some portion of China’s refinery capacity can utilize heavy fuel oil, we assume refinery run numbers are strictly crude oil for our estimates. In addition, since public reports that China directed its National Oil Companies to add barrels of oil to inventories, we assume both commercial and official government storage facilities can be considered as part of their strategic inventory stockpile.\nAlthough our estimates are based on limited information, they support the idea that inventory growth in China was not available for trade on the global market, supporting crude oil prices.\nThe numerous geopolitical risks, along with shifting global oil trade flows and increased use of shadow tanker fleets due to sanctions, increase the uncertainty around estimating global oil balances in our STEO. Although we estimate global oil inventory builds to accelerate in our STEO, averaging 2.2 million b/d on from the fourth quarter of 2025 through 2026, the portion of this estimate that will show up in visible oil inventories and influence oil prices remains uncertain.\nWe currently forecast that Brent crude oil prices will fall from an average of $68/b in September to an average of $52/b in the first quarter of 2026, when global oil inventory builds are estimated to be at their peak in our STEO. If China continues to add to oil inventories over the forecast at a rate similar to the 0.9 million b/d from January through August of this year, crude oil prices could remain higher than our forecast. Conversely, a slowdown in China’s oil inventory builds would likely put downward pressure on oil prices as more oil shows up in visible oil inventory data.\n- Principal contributors: Sean Hill, Jonathan Russo\n- Source: T"
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.020",
            "open": "59.374",
            "close": "59.634",
            "high": "60.254",
            "low": "59.234"
        },
        "market_summary": "### Spot WTI Crude Oil Market Briefing\n\n* **Key Drivers:** The **OPEC** cartel remains **bullish** on global oil demand growth, expecting it to increase by **1.3 million barrels per day** in 2025 and **1.4 million barrels per day** in 2026, driven by robust economic growth in Asia.\n* **Price Action:** Current **Brent crude oil spot prices** are around **$68 per barrel**, with expected growth in China's strategic oil stocks supporting crude oil prices, despite global oil inventories rising by an average of **1.8 million barrels per day** in the second and third quarters of 2025.\n* **Technical Outlook:** Immediate support is near the **$65 per barrel** level, with resistance at **$70 per barrel**, as OPEC's narrative of a tightening market is reinforced by a slight supply deficit of around **50,000 barrels per day** forecasted for 2026.\n\n---\n**Overall Sentiment:** Neutral ⚖️",
        "source_articles": [
            {
                "title": "OPEC Keeps Oil Outlook Unchanged - Rigzone",
                "source": "Rigzone",
                "url": "https://www.rigzone.com/news/wire/opec_keeps_oil_outlook_unchanged-13-oct-2025-182063-article/",
                "body": "OPEC Keeps Oil Outlook Unchanged\nOPEC kept its outlook for the oil market unchanged as the group and its allies continue to add barrels to the global market.\nGlobal oil demand will grow by 1.3 million barrels a day this year and by 1.4 million in 2026, the same as previously forecast, the Organization of the Petroleum Exporting Countries said in its monthly market report on Monday.\nOPEC+ — representing the group and its allies — is adding barrels to a global market that’s expected to be in surplus next year. The group increased output by 630,000 barrels a day in September, according to the report, citing information from secondary sources.\nBrent oil futures have slumped 18% in the past year, with a big part of the drop coming since April, when the OPEC+ hikes were first announced, to the surprise of traders.\nThe projected demand for OPEC+ crude was also unchanged from last month’s report, at 42.5 million barrels a day this year. Next year, demand for the group’s crude is expected to rise to 43.1 million barrels a day.\nThis month, the OPEC+ alliance agreed to revive just 137,000 barrels a day of halted supply, a slower pace than earlier this year.\nOther key figures from the monthly report:\n- September output average about 43.05 million barrels a day.\n- Oil demand in the OECD is expected to rise by around 130,000 barrels a day, with OECD Americas leading the increase.\n- Non-OECD demand is expected to grow by around 1.2 million barrels a day.\n- Transport fuels are expected to be the key growth source for oil demand this year, with jet fuel/kerosene adding 380,000 barrels a day of demand and diesel 300,000 barrels a day.\n- Non-OPEC production is expected to grow by about 800,000 barrels a day this year, and 600,000 next year, also unchanged from last month’s assessment.\n- Brazil, Canada, the US and Argentina are set to be the main contributors to higher output.\n- OPEC+ output of natural gas liquids and non-conventional liquids is predicted to expand by 100,000 year-on-year to an average of 8.6 million barrels a day this year, and by a similar margin in 2026 to reach 8.8m million barrels day.\nWHAT DO YOU THINK?\nGenerated by readers, the comments included herein do not reflect the views and opinions of Rigzone. All comments are subject to editorial review. Off-topic, inappropriate or insulting comments will be removed."
            },
            {
                "title": "Expanding Strategic Oil Stocks In China Support Crude Oil Prices – Analysis - eurasiareview.com",
                "source": "eurasiareview.com",
                "url": "https://www.eurasiareview.com/14102025-expanding-strategic-oil-stocks-in-china-support-crude-oil-prices-analysis/",
                "body": "Expanding Strategic Oil Stocks In China Support Crude Oil Prices – Analysis\nBy EIA\nWe estimate crude oil inventories in China increased by about 900,000 barrels per day (b/d) between January and August this year, essentially acting as a source of demand by removing barrels from the global markets.\nThe stock builds in China limited the downward price pressure we would otherwise expect to see with growing inventories, keeping the Brent crude oil spot prices in a relatively tight range around $68 per barrel (b) in the second and third quarters of 2025.\nWe estimate global petroleum inventories rose by an average of 1.8 million b/d in the second and third quarters in our October Short-Term Energy Outlook (STEO). Global oil inventories have been growing in 2025 as crude oil production from OPEC+ members and non-OPEC+ producers in North and South America has outpaced global demand growth.\nBetween April and August (the latest estimates we have), growth in China alone averaged 1.1 million b/d. Similar levels of global inventory growth would typically put downward pressure on crude oil prices; however, the price of Brent increased slightly during this period, averaging $68/b in the second quarter (2Q25) and $69/b in 3Q25.\nWe estimate total liquid fuels inventories in non-OECD countries, including China, grew by an average of 0.9 million b/d from January through August 2025. We estimate that on average, 0.9 million b/d of crude oil and condensate was added to oil inventories in China, making up most of our estimated global inventory builds of 1.4 million b/d over the same period.\nChina does not report data on its oil inventories, so we assessed China’s stock growth based on imports, exports, refining, and oil inventory data from third-party and official sources. We estimate the additions to oil inventories in China by balancing crude oil and condensate production, reported by the China National Bureau of Statistics, along with imports, refinery runs, and export data from a collection of ship-tracking and third-party sources.\nDepending on the source used and assumptions made, the range between different stock build estimates is 0.5 million b/d on average and can be as large as 1.1 million b/d, so we take an average for this comparison. Although we know some portion of China’s refinery capacity can utilize heavy fuel oil, we assume refinery run numbers are strictly crude oil for our estimates. In addition, since public reports that China directed its National Oil Companies to add barrels of oil to inventories, we assume both commercial and official government storage facilities can be considered as part of their strategic inventory stockpile.\nAlthough our estimates are based on limited information, they support the idea that inventory growth in China was not available for trade on the global market, supporting crude oil prices.\nThe numerous geopolitical risks, along with shifting global oil trade flows and increased use of shadow tanker fleets due to sanctions, increase the uncertainty around estimating global oil balances in our STEO. Although we estimate global oil inventory builds to accelerate in our STEO, averaging 2.2 million b/d on from the fourth quarter of 2025 through 2026, the portion of this estimate that will show up in visible oil inventories and influence oil prices remains uncertain.\nWe currently forecast that Brent crude oil prices will fall from an average of $68/b in September to an average of $52/b in the first quarter of 2026, when global oil inventory builds are estimated to be at their peak in our STEO. If China continues to add to oil inventories over the forecast at a rate similar to the 0.9 million b/d from January through August of this year, crude oil prices could remain higher than our forecast. Conversely, a slowdown in China’s oil inventory builds would likely put downward pressure on oil prices as more oil shows up in visible oil inventory data.\n- Principal contributors: Sean Hill, Jonathan Russo\n- Source: T"
            },
            {
                "title": "OPEC Remains Upbeat on Global Oil Demand Growth - Crude Oil Prices Today | OilPrice.com",
                "source": "Crude Oil Prices Today | OilPrice.com",
                "url": "https://oilprice.com/Energy/Crude-Oil/OPEC-Remains-Upbeat-on-Global-Oil-Demand-Growth.html",
                "body": "OPEC remains bullish on global oil demand growth for this year and next as it continues to unwind its crude production cuts.\nThe cartel kept unchanged its 2025 and 2026 oil demand growth forecasts in its closely-watched Monthly Oil Market Report (MOMR) for October, published on Monday.\nIn the report, OPEC expects global oil demand to grow by about 1.3 million barrels per day (bpd) this year from 2024, and reach on average 105.1 million bpd, reflecting continued robust economic growth. The view, unchanged from last month’s report, is driven by expectations of 1.2 million bpd demand growth in China, India, and other Asian markets.\n“The continued robust economic activity in Other Asia, continued recovery in global air travel, and expected healthy petrochemical feedstock requirements will all be keys to oil demand growth in 2025,” OPEC said in the October report.\n“However, uncertainties, including inflation levels, monetary tightening measures and sovereign debt levels, are to be monitored closely,” the cartel noted.\nOPEC now sees a slight supply deficit of around 50,000 barrels per day for 2026 should current output trajectories hold - a notable update from its prior forecasts that assumed more substantial shortfalls. This modest deficit reinforces OPEC’s narrative of a tightening market, even as some external forecasters continue to warn of looming surpluses.\nNext year, global oil demand is set to grow by 1.4 million bpd compared to this year, also unchanged from the September assessment of the oil-producing cartel. Emerging markets will drive next year’s demand growth, too. Average global oil demand will reach 106.5 million bpd next year, OPEC reckons.\nIn terms of products, gasoline is expected to lead oil demand growth at around 430,000 bpd year-over-year in 2026, followed by jet/kerosene demand which is set to grow by about 360,000 bpd. Petrochemical feedstock demand is forecast to grow by a combined 400,000 bpd, while diesel is projected to increase by some 190,000 bpd.\nOPEC’s bullish demand view contrasts with warnings from the International Energy Agency (IEA), which said in its September monthly report that global stocks are forecast to rise by an “untenable” 2.5 million bpd on average in the second half of 2025, “as supply far outstrips demand.” Yet, the IEA noted that geopolitical tensions, trade policies, and additional sanctions on Russia and Iran could alter market balances that currently point to a glut.\nBy Michael Kern for Oilprice.com\nMore Top Reads From Oilprice.com:\n- No Exit from Urals: Turkey’s Refineries Still Locked into Russian Supply\n- Why Luxembourg is Betting on Bitcoin for Long-Term Growth\n- Trump’s Middle East Triumph Raises Hopes for Ukraine Peace Push"
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0072",
            "open": "1.1611",
            "close": "1.1569",
            "high": "1.1629",
            "low": "1.1557"
        },
        "market_summary": "### EUR/USD Market Briefing\n\n* **Key Drivers:** French political uncertainty and **easing trade war concerns** are balancing the **EUR/USD** forecast, while the **US government shutdown** and potential for a **more dovish Fed** could strengthen the euro.\n* **Price Action:** The pair is holding above **1.1550**, despite **risk aversion** and concerns over France's political landscape, showing **bearish** momentum with immediate support around **1.1590**.\n* **Technical Outlook:** Resistance is at **1.1630**, with the **RSI and MACD** suggesting a downward trend, but the possibility of **further Fed rate cuts** could cap the dollar's upside and support the euro.\n\n---\n**Overall Sentiment:** Neutral ⚖️",
        "source_articles": [
            {
                "title": "EUR/USD forecast: Currency Pair of The Week | October 13, 2025 - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/eur-usd-forecast-currency-pair-of-the-week-october-13-2025/",
                "body": "- EUR/USD forecast in the balance amid French political uncertainty and easing trade war concerns\n- Trump strikes conciliatory tone after Friday’s 100% tariffs threat on China\n- Weak German data, French politics had held the euro back all week\nThings have calmed down almost as dramatically as the flare up on Friday when Donald Trump threatened 100% tariffs of China. Since Friday’s sharp sell-off, US equity futures have clawed back roughly half their losses, while crude oil has rebounded, and the dollar has bounded back against the likes of the yen and euro. But despite the calmer conditions, gold has hit yet another record high and is now on its 9th consecutive week of rising prices. Sentiment has been helped along by a few soothing words out of Washington. Meanwhile, the US government shutdown continues, and there are concerns it could drag on until November. The lack of any major US data releases means the dollar’s upside may well be capped after extending its recovery during the shutdown. This makes the EUR/USD forecast largely positive, especially if oil prices remain weak.\nTrump triggers TACO trade\nPresident Trump took to social media on Sunday to reassure markets, declaring, “Don’t worry about China, it will all be fine! Highly respected President Xi just had a bad moment. He doesn’t want Depression for his country, and neither do I. The U.S.A. wants to help China, not hurt it!!!”\nBeijing, for its part, urged Washington to dial down the tariff threats and return to the negotiating table to iron out their lingering trade disputes.\nTrump’s latest post on social media has triggered the so-called TACO trade (\"Trump Always Chickens Out\"), which came widespread during post April’s recovery.\nBut for a while on Friday, TACO was on no traders’ minds as markets plunged after Trump announced a hefty new 100% tariff on Chinese goods, set to take effect on 1 November. These would come on top of existing duties, alongside fresh US export controls on critical software – also kicking in on the same date. The move was in direct response to China’s recent measures, including new port fees on US vessels and sweeping restrictions on its exports of rare earths and other strategic materials.\nBut it pays to be vigilant as the situation could change dramatically again, although there’s still ample room for posturing and brinkmanship before 1 November rolls around.\nPowell and Lagarde due to speak this week\nMeanwhile, over in Washington, the government shutdown drags on with little sign of resolution. With no official data to be released, attention now turns to the central bankers gathering for the IMF’s autumn meetings. Among the highlights, Fed Chair Jerome Powell is due to speak tomorrow, followed by the ECB’s Christine Lagarde on Thursday. This is important as far at the EUR/USD forecast is concerned.\nKeep an eye on French politics\nPresident Macron has reappointed Sébastien Lecornu as Prime Minister and tasked him with presenting a revised budget to parliament. However, the proposal is widely expected to be rejected, likely triggering a vote of no confidence later this week.\nIn fact, Rassemblement National and the Union of the Right for the Republic have tabled joint motion of no confidence already. The two parties’ leaders, Le Pen and Ciotti, confirmed the motion had been officially lodged with the National Assembly.\nSo, it looks like France is likely to be without a functioning government, hardly a reassuring development for the euro. Yet, the EUR/USD has still managed to hand around above the 1.1500 handle, suggesting investors are not too alarmed just yet by the French political drama.\nStill, the ECB’s rate cutting cycle is potentially over, although if incoming data weakens further then we may see another cut in the coming meetings. According to the minutes of the central bank’s September meeting that were released last week, the ECB still sees inflation risks as balanced but leaning slightly to the downside. Several members flagged the "
            },
            {
                "title": "EUR/USD treads water above 1.1550 ahead of ZEW Survey data from Germany - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/eur-usd-treads-water-above-11550-ahead-of-zew-survey-data-from-germany-202510140339",
                "body": "EUR/USD treads water above 1.1550 ahead of ZEW Survey data from Germany\n- EUR/USD maintains its position ahead of key economic data from Germany.\n- France’s President Macron reappointed Lecornu as Prime Minister, but opposition leaders quickly filed a no-confidence motion against his government.\n- The US Dollar struggles due to rising odds of further Fed rate cuts by year-end.\nEUR/USD inches higher after registering nearly 0.5% losses in the previous session, trading around 1.1570 during the Asian hours on Tuesday. The pair holds ground ahead of the final September Harmonized Index of Consumer Prices (HICP) and ZEW Survey data from Germany.\nThe EUR/USD pair weakened as the Euro (EUR) came under pressure amid ongoing political unrest in France. President Emmanuel Macron reappointed Sebastien Lecornu as Prime Minister, who has since formed a new cabinet. However, opposition leaders Marine Le Pen and Eric Ciotti have already filed a no-confidence motion in an attempt to oust Lecornu’s government.\nThe pair draws support as the US Dollar (USD) remains subdued due to rising odds of further rate cuts by the Fed by year-end. The CME FedWatch Tool suggests that markets are now pricing in nearly a 97% chance of a Fed rate cut in October and a 92% possibility of another reduction in December.\nPhiladelphia Fed President Anna Paulson said on Monday that rising risks to the job market argue for more interest rate cuts by the US central bank, as trade tariffs now appear unlikely to push up inflation as much as expected.\nThe Greenback also struggles as traders adopt caution amid the ongoing US government shutdown weighs on the US economy. Last week’s missed paychecks and the suspension of billions of dollars’ worth of government services are likely to ripple beyond federal employees and impact the broader public.\nEuro FAQs\nThe Euro is the currency for the 19 European Union countries that belong to the Eurozone. It is the second most heavily traded currency in the world behind the US Dollar. In 2022, it accounted for 31% of all foreign exchange transactions, with an average daily turnover of over $2.2 trillion a day. EUR/USD is the most heavily traded currency pair in the world, accounting for an estimated 30% off all transactions, followed by EUR/JPY (4%), EUR/GBP (3%) and EUR/AUD (2%).\nThe European Central Bank (ECB) in Frankfurt, Germany, is the reserve bank for the Eurozone. The ECB sets interest rates and manages monetary policy. The ECB’s primary mandate is to maintain price stability, which means either controlling inflation or stimulating growth. Its primary tool is the raising or lowering of interest rates. Relatively high interest rates – or the expectation of higher rates – will usually benefit the Euro and vice versa. The ECB Governing Council makes monetary policy decisions at meetings held eight times a year. Decisions are made by heads of the Eurozone national banks and six permanent members, including the President of the ECB, Christine Lagarde.\nEurozone inflation data, measured by the Harmonized Index of Consumer Prices (HICP), is an important econometric for the Euro. If inflation rises more than expected, especially if above the ECB’s 2% target, it obliges the ECB to raise interest rates to bring it back under control. Relatively high interest rates compared to its counterparts will usually benefit the Euro, as it makes the region more attractive as a place for global investors to park their money.\nData releases gauge the health of the economy and can impact on the Euro. Indicators such as GDP, Manufacturing and Services PMIs, employment, and consumer sentiment surveys can all influence the direction of the single currency. A strong economy is good for the Euro. Not only does it attract more foreign investment but it may encourage the ECB to put up interest rates, which will directly strengthen the Euro. Otherwise, if economic data is weak, the Euro is likely to fall. Economic data for the four largest economies in the euro "
            },
            {
                "title": "Risk aversion and French political issues drive EUR/USD down to 1.1590 during early trading - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/risk-aversion-and-french-political-issues-drive-eur-usd-down-to-1-1590-during-early-trading/",
                "body": "The Euro fell below 1.1600 due to risk aversion and concerns about France’s political landscape. The possibility of a US-China trade war weighed heavily on the market, affecting the Euro (EUR).\nThe US Dollar declined after President Trump threatened tariffs on Chinese imports, though later toned down his rhetoric, providing slight relief. Europe remains focused on France’s political developments, with Sébastien Lecornu reappointed as Prime Minister and tasked with passing a strict budget.\nUS Economic Indicators\nThe US Michigan Consumer Sentiment Index was slightly below expectations, at 55.0. Meanwhile, ECB President Christine Lagarde will participate in a significant meeting of G20 finance ministers and central bankers.\nTechnical analysis shows EUR/USD under pressure below the 1.1600 mark. Indicators such as the RSI and MACD suggest a downward trend, with resistance at 1.1630 and support around 1.1590.\nThe Euro is the currency for the 19 EU countries forming the Eurozone and ranks second in global trading, with a daily turnover of $2.2 trillion. The ECB’s policies, inflation data, and trade balance are key influencers on the Euro’s value.\nWith EUR/USD struggling below 1.1600, the market is sending conflicting signals. We see immediate bearish pressure from French political uncertainty, but the US Fed is signaling more rate cuts, which is typically dollar-negative. This tug-of-war between a weak Euro and a potentially weakening Dollar creates an environment ripe for volatility.\nInfluence of Global Tensions\nThe situation in France is a key driver of euro weakness, as markets worry about the new government’s ability to pass a tough budget. We have seen this play out before, such as during the pension reform turmoil in 2023, which created headwinds for the common currency. With French government debt still hovering above 110% of GDP, any signs of fiscal instability will be punished by traders.\nHeightened US-China trade tensions are causing broad risk aversion, pushing investors toward safe havens like gold, which is now trading over $4,100 an ounce. Looking back to the 2018-2019 period, similar trade escalations caused the VIX, a measure of expected market volatility, to spike above 20 on multiple occasions. We should expect similar volatility in the coming weeks as headlines dictate market sentiment.\nFor derivative traders, this is not a time for simple directional bets; it is a time to buy volatility. The conflicting fundamental drivers mean a sharp move in either direction is possible. Purchasing straddles or strangles on EUR/USD would allow a trader to profit from a significant price swing, whether it breaks higher on Fed weakness or lower on European fears.\nThe divergence between central banks adds another layer of complexity. While we remember the European Central Bank aggressively hiking its deposit rate to 4.0% in 2023 to combat inflation, the focus now is on the Fed’s dovish pivot. This policy uncertainty makes holding long-dated options attractive, as they provide exposure to potential trend changes over the next few months.\nWith US markets closed today, lower liquidity could amplify price movements on any new developments. This environment favors strategies with defined risk, making long puts or long calls a more prudent approach than selling futures. The key is to position for a larger-than-expected move rather than betting on a specific direction."
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0051",
            "open": "1.3340",
            "close": "1.3331",
            "high": "1.3366",
            "low": "1.3315"
        },
        "market_summary": "### GBP/USD Market Briefing\n\n* **Key Drivers:** Easing **US-China tensions** and a **dovish** Federal Reserve outlook are supporting the **British Pound**, while a **weaker US Dollar** adds to the **bullish momentum**.\n* **Price Action:** The GBP/USD pair is trading around **1.3333**, after dipping **0.13%** on Monday, with **1.3300** as the immediate support level and **1.3400** as the key resistance level.\n* **Technical Outlook:** The pair is trading neutral to slightly tilted to the downside, with the **20**, **50**, and **100-day SMAs** indicating sellers are in charge, and the **Relative Strength Index (RSI)** trending downward, signaling further downside in the **Pound**.\n\n---\n**Overall Sentiment:** Neutral ⚖️",
        "source_articles": [
            {
                "title": "GBP/USD slips as Dollar rebounds, ahead of UK data and Fed speeches - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-usd-slips-as-dollar-rebounds-ahead-of-uk-data-and-fed-speeches-202510132308",
                "body": "GBP/USD slips as Dollar rebounds, ahead of UK data and Fed speeches\n- GBP/USD dips 0.13% to 1.3333 after Trump tones down tariff rhetoric, calming trade-war fears.\n- Fed’s Anna Paulson signals preference for gradual rate cuts as labor market softens.\n- UK jobs report and BoE Governor Bailey’s remarks to guide next directional move for Pound.\nThe GBP/USD ended Monday’s session with loses of 0.13% as the Greenback staged a recovery, after US President Donald Trump tempered its rhetoric on China, over the weekend. At the time of writing, the pair trades at 1.3333 as the Tuesday’s Asian session begins.\nSterling weakens as easing US–China tensions lift the Greenback amid prolonged government shutdown\nThe daily recap shows that price action reversed its course as last Friday, Trump threatened to impose 100% additional tariffs on Chinese products, as China imposed duties on US vessels, and export controls on rare earths. Nevertheless, Trump posted in his Truth Social network that everything would be “fine,” echoed later by comments of Treasury Secretary Bessent who said that US and Chinese Presidents are set to meet at South Korea towards the end of the month.\nAs tensions receded, the Dollar rallied as depicted by the US Dollar Index (DXY). The DXY, which tracks the buck’s performance against a basket of six currencies including the Pound, is up 0.40% at 99.24.\nThe US government shutdown has extended to the thirteen straight day, leaving traders leaning on the resolution of the shutdown and speeches by Fed officials. Philadelphia Fed Anna Pausol was dovish, saying that signs of weakness in the labor market suggest that the Fed should be more worried about the jobs market, than fighting inflation. She favors gradual cuts this year and in the next, as she sees policy modestly restrictive.\nAhead, the docket in the UK will feature jobs data. The ILO Unemployment Rate for the last three months to September is expected to remain unchanged at 4.7%, while Average Earnings Including and Excluding Bonuses as projected to remain unchanged, for the same period. In August, the Employment Change came at 232K.\nBesides this, traders would eye Bank of England MPC member Alan Taylor and Governor Andrew Bailey will cross the wires. Across the pond, the US economic schedule will feature speeches by Fed Governor Michelle Bowman, who shifted dovish since mid-July, Fed Chair Powell and Governor Christopher Waller. Later, Boston Fed Susan Collins, will cross the wires.\nGBP/USD Price Chart – Daily\nEconomic Indicator\nILO Unemployment Rate (3M)\nThe ILO Unemployment Rate released by the UK Office for National Statistics is the number of unemployed workers divided by the total civilian labor force. It is a leading indicator for the UK Economy. If the rate goes up, it indicates a lack of expansion within the UK labor market. As a result, a rise leads to a weakening of the UK economy. Generally, a decrease of the figure is seen as bullish for the Pound Sterling (GBP), while an increase is seen as bearish.\nRead more.Next release: Tue Oct 14, 2025 06:00\nFrequency: Monthly\nConsensus: 4.7%\nPrevious: 4.7%\nSource: Office for National Statistics\nThe Unemployment Rate is the broadest indicator of Britain’s labor market. The figure is highlighted by the broad media, beyond the financial sector, giving the publication a more significant impact despite its late publication. It is released around six weeks after the month ends. While the Bank of England is tasked with maintaining price stability, there is a substantial inverse correlation between unemployment and inflation. A higher than expected figure tends to be GBP-bearish.\nAuthor\nChristian Borjon Valencia\nFXStreet\nChristian Borjon began his career as a retail trader in 2010, mainly focused on technical analysis and strategies around it. He started as a swing trader, as he used to work in another industry unrelated to the financial markets."
            },
            {
                "title": "GBP/USD slips as US–China tensions, cool, traders eye BoE speakers - Mitrade",
                "source": "Mitrade",
                "url": "https://www.mitrade.com/insights/news/live-news/article-1-1190667-20251013",
                "body": "The Pound Sterling slides during the North American session, down 0.18% as tensions between the US and China ease, following last Friday’s escalation, that prompted investors to buy safety assets. At the time of writing, the GBP/USD trades at 1.3325 after hitting a daily high of 1.3366.\nLast week, US President Trump threatened to impose 100% duties on China’s goods as retaliation for China’s rare earth export controls. Nevertheless, Trump posted on Sunday in on Truth Social that “Don’t worry about China, it will all be fine!”\nEarlier, the Treasury Secretary Scott Bessent said that he still expects Trump to meet Chinese President Xi Jinping at the Asia-Pacific Economic Cooperation summit in South Korea later this month.\nAside from this, the lack of economic data in the US keeps traders entertained with US politics, the government shutdown and Federal Reserve officials crossing the wires.\nIn the UK, investors remain focused on the release of the Autumn budget. However, the docket will feature jobs data and Gross Domestic Product (GDP) figures in the three months to August.\nBank of England policymakers will speak this week, with six of the nine members of the Monetary Policy Committee (MPC) hitting the wires. Money markets are expecting the BoE to hold rates unchanged, pricing in the next adjustment until March 2026, as inflation is double the bank’s target.\nThe technical picture shows the GBP/USD is trading neutral to slightly tilted to the downside, as price action remains below the 20, 50 and 100-day SMAs, an indication that in the short and medium term, sellers are in charge. Additionally, the Relative Strength Index (RSI) is bearish, trending downward, a sign further downside in the Pound is expected.\nIf GBP/USD drops below 1.3300, the next support would be 1.3200, followed by the 200-day SMA at 1.3173. On the flip side, if the pair reclaims 1.3400, key resistance levels emerge, like the 20-day SMA at 1.3451, the 50-day SMA at 1.3472 and the 100-day SMA a 1.3490.\nThe table below shows the percentage change of British Pound (GBP) against listed major currencies this month. British Pound was the strongest against the Japanese Yen.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the British Pound from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent GBP (base)/USD (quote)."
            },
            {
                "title": "The GBP/USD pair shows upward momentum, supported by dovish Fed expectations and a weaker US Dollar - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/the-gbp-usd-pair-shows-upward-momentum-supported-by-dovish-fed-expectations-and-a-weaker-us-dollar/",
                "body": "The GBP/USD pair sees an upward trend, trading above the mid-1.3300s. Dovish expectations from the Federal Reserve and stabilisation from the risk-on sentiment have impacted currency demand. The market anticipates BoE maintaining its interest rates, providing support to the British Pound.\nA decline in the US Dollar was partially influenced by reduced tariff threats from the US President. There are also anticipations of additional interest rate cuts by the US central bank this year. From a technical angle, Friday’s breakthrough of the 23.6% Fibonacci retracement level suggests the potential for further gains, with the immediate target being the 38.2% Fibo. level.\nFibonacci Levels and Support\nOn the downside, the 1.3330-1.3325 Fibonacci region offers short-term support. Below 1.3300, prices falling past the 1.3260 level may prolong a downward trend to 1.3200 and possibly further to the 1.3180 region. Meanwhile, the UK Pound struggles to move past these technical levels due to negative oscillators in short-term charts.\nEconomic indicators significantly affect the Pound Sterling’s movement. GDP, manufacturing and employment data all contribute to its valuation. A positive Trade Balance boosts currency value by increasing demand from foreign buyers, whereas a negative balance weakens it.\nAs of today, October 13, 2025, we are seeing some buying interest in GBP/USD, but the overall picture is very different from the past. The divergent policy expectations between a cautious Federal Reserve and a more pressured Bank of England are now the main driver. This setup suggests we should be cautious before assuming any long-term bullish strength for the pound.\nThe Bank of England is facing a tougher situation than the Fed, which is impacting the pound. Recent data showed UK inflation has finally cooled to 2.8%, but economic growth remains sluggish, with the Office for National Statistics reporting the economy grew by only 0.4% in the last year. This is increasing expectations that the BoE may need to cut interest rates in early 2026 to stimulate the economy.\nHeading Into Speculative Territory\nOn the other hand, the US dollar remains supported by a more resilient economy. The US, by contrast, just added a solid 195,000 jobs last month, giving the Federal Reserve room to keep interest rates at current levels for longer. This policy difference is creating downward pressure on the GBP/USD pair, keeping it well below the levels seen in previous years.\nWe recall periods back in the late 2010s when the pair traded with a positive bias above the mid-1.3300s, a level that now seems like a distant technical ceiling. That fundamental backdrop, driven by different global risks, has clearly shifted over the last few years. For derivative traders, this means strategies must adapt to the new lower trading range and the underlying economic weakness in the UK.\nGiven this outlook, we believe traders should consider strategies that protect against or profit from a potential drop in GBP/USD. Buying put options with strike prices targeting the 1.2000 psychological level could be a viable strategy in the coming weeks. This approach would benefit if the pound weakens further as the market prices in a BoE rate cut ahead of the Fed."
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0041",
            "open": "0.6501",
            "close": "0.6513",
            "high": "0.6532",
            "low": "0.6491"
        },
        "market_summary": "### AUD/USD Market Briefing\n\n* **Key Drivers:** The Reserve Bank of Australia's (RBA) Meeting Minutes indicated that policy is still **a little restrictive but difficult to determine**, with economic risks persisting due to weak consumption amid softer job and wage growth.\n* **Price Action:** The AUD/USD pair is trading at **0.6518**, showing minimal movement following the RBA Meeting Minutes release, as the market remains cautious after RBA Governor's comments.\n* **Technical Outlook:** Immediate support is near the **0.6500** level, with resistance at **0.6600**, as the Australian Dollar maintains its position against the US Dollar.\n\n---\n**Overall Sentiment:** Neutral ⇔",
        "source_articles": [
            {
                "title": "When are the RBA Meeting Minutes, and how could they impact AUD/USD? - Mitrade",
                "source": "Mitrade",
                "url": "https://www.mitrade.com/insights/news/live-news/article-1-1191281-20251014",
                "body": "The Meeting Minutes from the Reserve Bank of Australia’s (RBA) latest interest rate decision will be published early on Tuesday, at 00:30 GMT. The RBA held its cash rate at 3.6% at its latest rate call, staggering a series of rate cuts that began in February of this year.\nThe finer details of the RBA’s internal discussions surrounding its latest interest rate decision could help traders make a more accurate guess of when the Australian central bank will shift rates again, and investors will be looking for signs of how confident (or apprehensive) the RBA is about the Australian economy.\nThe pace of the RBA’s interest rate decisions directly affects global Australian Dollar (AUD) flows, and the policy convergence or divergence between the RBA and the Federal Reserve (Fed) is a foundational rate-setting tool for the Aussie’s market value. If the RBA’s internal dialogue is more hawkish or dovish compared to what investors have been expecting, it could see early shifts in the AUD as markets prepare for upcoming rate adjustments.\nThe minutes of the Reserve Bank of Australia meetings are published two weeks after the interest rate decision. The minutes give a full account of the policy discussion, including differences of view. They also record the votes of the individual members of the Committee. Generally speaking, if the RBA is hawkish about the inflationary outlook for the economy, then the markets see a higher possibility of a rate increase, and that is positive for the AUD.\nRead more.Next release: Tue Oct 14, 2025 00:30\nFrequency: Weekly\nConsensus: -\nPrevious: -\nSource: Reserve Bank of Australia\nThe Reserve Bank of Australia (RBA) publishes the minutes of its monetary policy meeting two weeks after the interest rate decision is announced. It provides a detailed record of the discussions held between the RBA’s board members on monetary policy and economic conditions that influenced their decision on adjusting interest rates and/or bond buys, significantly impacting the AUD. The minutes also reveal considerations on international economic developments and the exchange rate value.\nThe Reserve Bank of Australia (RBA) sets interest rates and manages monetary policy for Australia. Decisions are made by a board of governors at 11 meetings a year and ad hoc emergency meetings as required. The RBA’s primary mandate is to maintain price stability, which means an inflation rate of 2-3%, but also “..to contribute to the stability of the currency, full employment, and the economic prosperity and welfare of the Australian people.” Its main tool for achieving this is by raising or lowering interest rates. Relatively high interest rates will strengthen the Australian Dollar (AUD) and vice versa. Other RBA tools include quantitative easing and tightening.\nWhile inflation had always traditionally been thought of as a negative factor for currencies since it lowers the value of money in general, the opposite has actually been the case in modern times with the relaxation of cross-border capital controls. Moderately higher inflation now tends to lead central banks to put up their interest rates, which in turn has the effect of attracting more capital inflows from global investors seeking a lucrative place to keep their money. This increases demand for the local currency, which in the case of Australia is the Aussie Dollar.\nMacroeconomic data gauges the health of an economy and can have an impact on the value of its currency. Investors prefer to invest their capital in economies that are safe and growing rather than precarious and shrinking. Greater capital inflows increase the aggregate demand and value of the domestic currency. Classic indicators, such as GDP, Manufacturing and Services PMIs, employment, and consumer sentiment surveys can influence AUD. A strong economy may encourage the Reserve Bank of Australia to put up interest rates, also supporting AUD.\nQuantitative Easing (QE) is a tool used in extreme situations when lowering interest rates"
            },
            {
                "title": "RBA Minutes: Policy still little restrictive but difficult to determine - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/when-are-the-rba-meeting-minutes-and-how-could-they-impact-aud-usd-202510132224",
                "body": "RBA Minutes: Policy still little restrictive but difficult to determine\nThe Reserve Bank of Australia (RBA) published the Minutes of its September monetary policy meeting on Tuesday, which showed that board members agreed that policy still little restrictive but difficult to determine.\nAdditional takeaways\nIncrease in housing prices, loans indicated past rate cuts were having an impact.\nConsiderable uncertainty about global outlook, US tariffs, China economy.\nLabour market still a little tight, forward indicators steady.\nEconomic risks remain, consumption could be stronger with softer jobs and wages.\nBoard observed services inflation proving resistant in other developed nations.\nAUD close to estimates of equilibrium level given terms of trade, yield differentials.\nMonthly CPI readings housing, services suggest Q3 inflation could be above forecast.\nData liaison suggested recovery in household consumption likely to persist.Policy still little restrictive but difficult to determine.\nSaw risk private sector wage growth could ease a little faster than expected.\nImportant to see what q3 data revealed on economy, supply capacity.\nSome time before full impact of previous easing would be felt\nMarket reaction\nAt the time of press, the AUD/USD pair was up 0.06% on the day at 0.6518.\nAustralian Dollar Price Last 7 Days\nThe table below shows the percentage change of Australian Dollar (AUD) against listed major currencies last 7 days. Australian Dollar was the strongest against the New Zealand Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Australian Dollar from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent AUD (base)/USD (quote).\nThis section was published on Monday at 22:24 GMT as a preview of RBA Meeting Minutes.\nRBA Meeting Minutes overview\nThe Meeting Minutes from the Reserve Bank of Australia’s (RBA) latest interest rate decision will be published early on Tuesday, at 00:30 GMT. The RBA held its cash rate at 3.6% at its latest rate call, staggering a series of rate cuts that began in February of this year.\nThe finer details of the RBA’s internal discussions surrounding its latest interest rate decision could help traders make a more accurate guess of when the Australian central bank will shift rates again, and investors will be looking for signs of how confident (or apprehensive) the RBA is about the Australian economy.\nHow could the RBA Meeting Minutes impact AUD/USD?\nThe pace of the RBA’s interest rate decisions directly affects global Australian Dollar (AUD) flows, and the policy convergence or divergence between the RBA and the Federal Reserve (Fed) is a foundational rate-setting tool for the Aussie’s market value. If the RBA’s internal dialogue is more hawkish or dovish compared to what investors have been expecting, it could see early shifts in the AUD as markets prepare for upcoming rate adjustments.\nRBA FAQs\nThe Reserve Bank of Australia (RBA) sets interest rates and manages monetary policy for Australia. Decisions are made by a board of governors at 11 meetings a year and ad hoc emergency meetings as required. The RBA’s primary mandate is to maintain price stability, which means an inflation rate of 2-3%, but also “..to contribute to the stability of the currency, full employment, and the economic prosperity and welfare of the Australian people.” Its main tool for achieving this is by raising or lowering interest rates. Relatively high interest rates will strengthen the Australian Dollar (AUD) and vice versa. Other RBA tools include quantitative easing and tightening.\nWhile inflation had always traditionally been thought of as a negative factor for currencies since it lowers the value of money in general, the opposite has actually been the case in modern times with the relaxatio"
            },
            {
                "title": "Australian Dollar maintains position following RBA Meeting Minutes release - Forex Factory",
                "source": "Forex Factory",
                "url": "https://www.forexfactory.com/news/1366061-australian-dollar-maintains-position-following-rba-meeting-minutes",
                "body": "Your guides on 1win aviator login are super helpful.\naviator 1win login\naviator 1win login\nThe Australian Dollar (AUD) holds ground against the US Dollar (USD) on Tuesday. The AUD/USD pair moves little following the release of the Reserve Bank of Australia’s (RBA) Minutes of its October monetary policy meeting, which showed that board members agreed that policy was still a little restrictive but difficult to determine. The RBA Meeting Minutes also noted that economic risks persist, with consumption remaining weak amid softer job and wage growth. Monthly CPI data for housing and services indicate that Q3 inflation could come in above forecasts. Market sentiment remains cautious after RBA Governor Michele ... (full story)\nThe dollar held steady on Tuesday as U.S. President Donald Trump's watered down rhetoric against tariffs on China and a potential meeting with his Chinese counterpart raised hopes ...\n‘There is no substitute to the dollar… not the renminbi, not the euro’, said a prominent former central banker at an OMFIF gathering in London to mark the launch of Can Europe ...\nAustralian business conditions held steady in September, as stronger sales and profits were offset by weaker employment, according to the latest National Australia Bank (NAB) ...\nChina said on Tuesday (Oct 14) it was ready to \"fight to the end\" in a trade war with the United States after President Donald Trump said he would impose an additional 100 per ...\nThe Australian dollar found a bid during the Sydney session, paring earlier losses to trade marginally higher following the release of the Reserve Bank of Australia’s latest ...\nThe Royal Bank of Canada (RBC) has projected that the Bank of Canada (BoC) will deliver another 25 basis point rate cut in October, following its September move to restart the ..."
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "0.7240",
            "open": "151.8390",
            "close": "152.2770",
            "high": "152.4420",
            "low": "151.7180"
        },
        "market_summary": "### USD/JPY Market Briefing\n\n* **Key Drivers:** The **de-escalation of trade tensions** between the U.S. and China, coupled with **political uncertainty in Japan**, is influencing the **USD/JPY** pair, with the **U.S. Dollar** strengthening against the **Japanese Yen**.\n* **Price Action:** The **USD/JPY** pair has risen to near **152.30**, gathering strength above **152.00** amid easing trade tensions, and is holding above key technical levels, showing **bullish momentum**.\n* **Technical Outlook:** Immediate support is near the **50-day moving average** at around **151.50**, with resistance at **152.50**, and the pair's direction remains fluid due to **political uncertainty** and **hawkish** Fed expectations.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Japanese Yen Outlook: USD/JPY Holds Firm Despite Tariff Shock - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/japanese-yen-outlook-usd-jpy-holds-firm-despite-tariff-shock/",
                "body": "- Yen supported by safe haven flows\n- USD/JPY holding above key technical levels\n- Political risks adding volatility\n- U.S. shutdown delays key data\n- BoJ and Fed speakers may drive moves\nUSD/JPY Outlook Summary\nUSD/JPY directional bias continue to tilt higher despite a messy backdrop of trade tensions, political instability and a U.S. government shutdown. While headline risk remains elevated, the pair has held key technical levels and continues to attract dip buyers. With safe haven flows supporting the yen and political uncertainty clouding the BoJ outlook, direction remains fluid, but the broader setup still favours upside—at least for now.\nTariff Headlines Spark Volatility\nTrade tensions between the U.S. and China have flared again on Friday after Donald Trump announced 100% tariffs on Chinese exports, though the measures aren’t due to take effect until November 1. Beijing has labelled the move hypocritical but stopped short of retaliating, defending its export curbs on rare earths as driven by security concerns rather than politics. The restraint suggests it’s leaving the door open for talks.\nThe timing of Trump’s announcement—after the physical close of U.S. equity markets on Friday and heading into a long weekend for many parts of the country—was familiar. He’s used similar tactics before, dropping major trade headlines late in the day only for them to be softened or reversed shortly after. The forward start date for the tariffs is another tell, giving both sides time to negotiate before the measures kick in.\nIt helps explain why markets have shown some confidence in the so-called “TACO” trade: Trump always chickens out. While headline risk remains high, investors are wary of overreacting given his track record of backpedalling once markets wobble.\nWhile faith in the “TACO” trade may pressure the yen, that could be offset by fresh political uncertainty in Japan, leaving near-term direction finely balanced.\nJapanese Political Uncertainty Dims Upside Risks\nPolitical uncertainty in Japan would normally weigh on the yen, but this time it may have the opposite effect. The collapse of the long-running coalition between the ruling LDP and Komeito has cast doubt on Sanae Takaichi’s chances of becoming Japan’s first female prime minister, raising the risk of a shaky or short-lived government.\nThe yen strengthened after the news, clawing back losses made earlier in the week when Takaichi’s selection as LDP leader pushed it lower on expectations of bigger government spending and continued loose policy. Now, with Japan’s political outlook more uncertain and global risks on the rise, investors may view the yen as a safer bet, even before considering how the Bank of Japan might respond.\nFed, Markets Still Flying Blind due to Shutdown\nThe U.S. government remains shut down, and layoffs have now begun across multiple federal agencies. Donald Trump has blamed Democrats for the shutdown and the resulting job losses. Democrats remain firm, insisting on protections for health-insurance subsidies under the Affordable Care Act. With both sides showing little sign of compromise, a near-term resolution to end the shutdown looks unlikely.\nThat means scheduled economic data releases may be delayed (as indicated with the yellow shading in the calendar below), keeping Fed policymakers and markets largely in the dark on the real-time impact of the shutdown on the economy. That brings into question what more Fed officials can add, although there’ll still be interest in what Powell, Waller and Miran have to say given the former remains Fed chair, with the remaining two leading candidates to replace him when his term expires in May 2026. The appearances are marked red given their ability to generate volatility in USD/JPY.\nSource: TradingView\nOn the Japanese side of the ledger, the data calendar is quiet, putting greater emphasis on an auction of 20-year Japanese government debt and speeches from BoJ officials to deliver bouts of volatility. Will there "
            },
            {
                "title": "Japanese Yen struggles as BoJ rate hike doubts and risk appetite weigh - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/japanese-yen-remains-depressed-amid-political-chaos-boj-uncertainty-and-positive-risk-tone-202510140245",
                "body": "Japanese Yen sticks to modest gains amid fears of possible government intervention\n- The Japanese Yen attracts some intraday buyers in reaction to comments from Japan's Kato.\n- Political uncertainty could delay BoJ rate hikes and might keep a lid on further JPY gains.\n- Easing fears of a US-China trade war could further undermine the JPY’s safe-haven status.\nThe Japanese Yen (JPY) recovers following a modest Asian session slide as comments from Japan's Finance Minister, Katsunobu Kato, fuel speculations that authorities could intervene to stem weakness in the domestic currency. Furthermore, the prospects for an imminent interest rate hike by the Bank of Japan (BoJ) this year turn out to be another factor lending support to the JPY. Any meaningful appreciation, however, still seems elusive amid expectations that domestic political chaos could delay the Bank of Japan's (BoJ) rate hike plans.\nMeanwhile, US President Donald Trump's pivot on China tariffs remains supportive of the prevalent risk-on environment. This could further hold back the JPY bulls from placing aggressive bets, though the lack of follow-through US Dollar (USD) buying might cap the upside for the USD/JPY pair. Nevertheless, the mixed fundamental backdrop warrants some caution before positioning for a firm near-term direction for the USD/JPY pair. Traders now look forward to Federal Reserve (Fed) Chair Jerome Powell's speech for a fresh impetus.\nJapanese Yen gains positive traction as intervention fears offset political uncertainty\n- Japan's Finance Minister Katsunobu Kato said this Tuesday that he has recently seen one-sided and rapid moves in the foreign exchange, adding that it’s important for currencies to move in a stable manner, reflecting fundamentals. This provides a goodish lift to the Japanese Yen, though political uncertainty might cap gains.\n- The long-standing Liberal Democratic Party (LDP)–Komeito coalition came to an abrupt end last week, as the newly elected LDP leader, Sanae Takaichi, awaits a parliamentary vote to confirm her as Japan’s first female Prime Minister. The breakup, in turn, means Takaichi would need support from other parties for her key policies.\n- Nevertheless, the heightened political uncertainty might create a challenge for the Bank of Japan to hike interest rates further and continue to undermine the Japanese Yen. Furthermore, the optimism led by US President Donald Trump's pivot on China tariffs turns out to be another factor driving flows away from the safe-haven JPY.\n- In fact, Trump softened his stance after threatening additional tariffs of 100% on Chinese imports effective November 1 and posted on Truth Social that the US does not wish to hurt China. Trump added that both countries wish to avoid economic pain, easing concerns about a trade war between the world's two largest economies.\n- The US Dollar looks to build on the previous day's positive move and remains within striking distance of its highest level since August touched last week, which further offers support to the USD/JPY pair. However, dovish Federal Reserve expectations might keep a lid on any further USD appreciation and cap the currency pair.\n- According to the CME FedWatch tool, the possibility of a 25-basis-point interest rate cut by the Fed in October and December stands at around 97% and 90%, respectively. In contrast, traders are pricing in a greater chance that the BoJ would hike interest rates amid still sticky inflation and a still resilient economic performance.\n- The US government shutdown is on track to extend into a third week amid deadlock on a funding plan. Republican Speaker Mike Johnson said that the shutdown could become the longest in history, warning that he won’t negotiate with Democrats until they pause their health care demands and reopen government.\n- Important US macro releases have been delayed due to a prolonged US government shutdown, leaving the USD at the mercy of speeches from influential FOMC members. Hence, Tuesday's key foc"
            },
            {
                "title": "Japanese Yen weakens below 152.50 amid de-escalation trade tensions - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/amp/news/usd-jpy-gathers-strength-above-15200-amid-de-escalation-trade-tensions-202510132301",
                "body": "USD/JPY gathers strength above 152.00 amid de-escalation trade tensions\n|- USD/JPY rises to near 152.30 in Tuesday’s early Asian session.\n- Fed's Paulson expected more rate cuts to support the job market.\n- Japan’s political uncertainty undermines the JPY.\nThe USD/JPY pair attracts some buyers to around 152.30 during the early Asian session on Tuesday. The US Dollar (USD) strengthens against the Japanese Yen (JPY) after a change in rhetoric from US President Donald Trump on China. Traders await the Federal Reserve’s (Fed) Chair Jerome Powell speech later on Tuesday.\nTrump on Friday had threatened 100% tariffs on China from November 1. However, he softened his tone on Sunday, saying, \"Don't worry about China, it will all be fine!” US Treasury Secretary Scott Bessent said on Monday that Trump remains on track to meet Chinese leader Xi Jinping in South Korea in late October as the two sides try to de-escalate tensions over tariff threats and export controls. Easing trade tensions between the world’s two largest economies provides some support to the Greenback against the JPY.\nDovish remarks from Philadelphia Fed new President Anna Paulson might cap the upside for the pair. Paulson said on Monday that rising risks to the job market argue for more interest rate cuts by the US central bank, as trade tariffs now appear unlikely to push up inflation as much as expected.\nTraders continue to assess the path ahead for Japan's new Liberal Democratic Party leader, Sanae Takaichi, after Komeito quit the ruling coalition on Friday. The political uncertainty in Japan and the expectation that the Bank of Japan (BoJ) might delay a rate hike could undermine the JPY and act as a tailwind for the pair in the near term. Last week, Etsuro Honda, a close economic adviser to Sanae Takaichi, said that the BoJ should be cautious about raising interest rates again, as the economy is still fragile.\nJapanese Yen FAQs\nThe Japanese Yen (JPY) is one of the world’s most traded currencies. Its value is broadly determined by the performance of the Japanese economy, but more specifically by the Bank of Japan’s policy, the differential between Japanese and US bond yields, or risk sentiment among traders, among other factors.\nOne of the Bank of Japan’s mandates is currency control, so its moves are key for the Yen. The BoJ has directly intervened in currency markets sometimes, generally to lower the value of the Yen, although it refrains from doing it often due to political concerns of its main trading partners. The BoJ ultra-loose monetary policy between 2013 and 2024 caused the Yen to depreciate against its main currency peers due to an increasing policy divergence between the Bank of Japan and other main central banks. More recently, the gradually unwinding of this ultra-loose policy has given some support to the Yen.\nOver the last decade, the BoJ’s stance of sticking to ultra-loose monetary policy has led to a widening policy divergence with other central banks, particularly with the US Federal Reserve. This supported a widening of the differential between the 10-year US and Japanese bonds, which favored the US Dollar against the Japanese Yen. The BoJ decision in 2024 to gradually abandon the ultra-loose policy, coupled with interest-rate cuts in other major central banks, is narrowing this differential.\nThe Japanese Yen is often seen as a safe-haven investment. This means that in times of market stress, investors are more likely to put their money in the Japanese currency due to its supposed reliability and stability. Turbulent times are likely to strengthen the Yen’s value against other currencies seen as more risky to invest in.\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any inv"
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0056",
            "open": "1.3986",
            "close": "1.4034",
            "high": "1.4039",
            "low": "1.3982"
        },
        "market_summary": "### USD/CAD Market Briefing\n\n* **Key Drivers:** The USD/CAD pair has reached a fresh six-month high near **1.4050** ahead of Fed Powell's speech, driven by a stronger US Dollar and diminished expectations for a Bank of Canada rate cut following upbeat Canadian employment data.\n* **Price Action:** Broke above the key psychological level of **1.4000**, showing significant **bullish momentum**. However, the pair may face challenges due to rising odds of further **Fed rate cuts** and a potential **Canadian Dollar** boost from higher **oil prices**.\n* **Technical Outlook:** Immediate support is near the **1.3936** level, which was previous resistance, and the **1.4000** psychological level. Resistance is at **1.4167**, aligning with a prior swing-low and a Fibonacci retracement level.\n\n---\n**Overall Sentiment:** Cautiously **bullish** ↑",
        "source_articles": [
            {
                "title": "USD/CAD reaches fresh six-month highs near 1.4050 ahead of Fed Powell’s speech - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-cad-reaches-fresh-six-month-highs-near-14050-ahead-of-fed-powells-speech-202510140257",
                "body": "USD/CAD reaches fresh six-month highs near 1.4050 ahead of Fed Powell’s speech\n- USD/CAD marked a new six-month high of 1.4043 on Tuesday.\n- The US Dollar may struggle due to rising odds of further Fed rate cuts.\n- The upbeat Canadian employment data have diminished expectations for another BoC rate cut in October.\nUSD/CAD gains ground for the second successive day, trading around a new six-month high of 1.4043 during the Asian hours on Tuesday. Traders will likely observe the US Federal Reserve (Fed) Chair Jerome Powell, who is scheduled to speak on Economic Outlook and Monetary Policy at the National Association for Business Economics (NABE) Annual Meeting in Philadelphia later in the day.\nThe upside of the USD/CAD pair could be restrained as the US Dollar (USD) could face challenges amid rising odds of further rate cuts by the Fed by year-end. The CME FedWatch Tool suggests that markets are now pricing in nearly a 97% chance of a Fed rate cut in October and a 92% possibility of another reduction in December.\nPhiladelphia Fed President Anna Paulson said on Monday that rising risks to the job market argue for more interest rate cuts by the US central bank, as trade tariffs now appear unlikely to push up inflation as much as expected.\nMarket anxiety deepened amid the ongoing US government shutdown, as the White House moved forward with widespread federal layoffs. The shutdown is expected to weigh on the US economy, with missed paychecks and the suspension of billions of dollars’ worth of government services likely to ripple beyond federal employees and impact the broader public.\nThe USD/CAD pair may lose ground as the Canadian Dollar (CAD) could receive support as the upbeat Canadian employment data reduced bets on another Bank of Canada (BoC) interest rate cut this month. Investors see roughly 50% odds the Canadian central bank cuts interest rates at its next policy decision on October 29, down from 72% chance before the data.\nCanadian Dollar FAQs\nThe key factors driving the Canadian Dollar (CAD) are the level of interest rates set by the Bank of Canada (BoC), the price of Oil, Canada’s largest export, the health of its economy, inflation and the Trade Balance, which is the difference between the value of Canada’s exports versus its imports. Other factors include market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – with risk-on being CAD-positive. As its largest trading partner, the health of the US economy is also a key factor influencing the Canadian Dollar.\nThe Bank of Canada (BoC) has a significant influence on the Canadian Dollar by setting the level of interest rates that banks can lend to one another. This influences the level of interest rates for everyone. The main goal of the BoC is to maintain inflation at 1-3% by adjusting interest rates up or down. Relatively higher interest rates tend to be positive for the CAD. The Bank of Canada can also use quantitative easing and tightening to influence credit conditions, with the former CAD-negative and the latter CAD-positive.\nThe price of Oil is a key factor impacting the value of the Canadian Dollar. Petroleum is Canada’s biggest export, so Oil price tends to have an immediate impact on the CAD value. Generally, if Oil price rises CAD also goes up, as aggregate demand for the currency increases. The opposite is the case if the price of Oil falls. Higher Oil prices also tend to result in a greater likelihood of a positive Trade Balance, which is also supportive of the CAD.\nWhile inflation had always traditionally been thought of as a negative factor for a currency since it lowers the value of money, the opposite has actually been the case in modern times with the relaxation of cross-border capital controls. Higher inflation tends to lead central banks to put up interest rates which attracts more capital inflows from global investors seeking a lucrative place to keep their money. This increases demand for the lo"
            },
            {
                "title": "Canadian Dollar Forecast: USD/CAD Six-Month High Over 1.4000 - City Index",
                "source": "City Index",
                "url": "https://www.cityindex.com/en-uk/news-and-analysis/canadian-dollar-forecast-usd-cad-usdcad-six-month-high-over-1-4000-2025-10-13/",
                "body": "Canadian Dollar, USD/CAD Talking Points:\n- USD/CAD has set a fresh six-month high to test above the 1.4000 psychological level, and the pair remains one of the more attractive major FX pairs for USD-strength scenarios.\n- As looked at in last week’s webinar, higher-low support has held and prices have continued with fresh higher-highs. The big question now is re-acceptance at 1.4000, and last week saw the close hold above that price and so far this week, that level has been supported again.\nUSD/CAD has continued to fresh six-month highs and despite the recent lag behind both DXY and EUR/USD’s show of USD-strength, the pair remains attractive for bullish trend continuation in the US Dollar.\nThe spot on the chart that the pair is currently trading through needs to be taken into account as the psychological level at 1.4000 has some history. This was the spot that held the lower high back in May, just before sellers continued the short-side trend that ultimately stalled just above the 1.3500 level. Along the way, there was a hold of support at 1.3750, which later became resistance in the ascending triangle, and more recently, support as the pair has launched up to current fresh highs.\nA level of this nature, a major psychological level that’s already shown tendency to induce inflections and directional changes, can start to bring impact before actually trading. As price gets closer to a test, the perceived risk-reward of following the trend can become askew, thereby dampening buyer behavior. This is likely at least part of what took place when the pair stalled about 20 pips shy of the big figure on October 2nd. But – it was the pullback from that which held strong as support remained around prior resistance of 1.3936, and bulls were able to breakout as USD-strength was running last Thursday. I looked into this during the weekly webinar and so far, the trend has continued to play out.\nUSD/CAD Daily Chart\nChart prepared by James Stanley; data derived from Tradingview\nUSD/CAD Big Picture\nFrom the weekly chart and with view of the decade-long range, we can see how important that 1.4000 level has been. In 2022, after the USD had surged on the back of the Fed’s rate cuts, buyers continually failed to push above the big figure for much the next two years. It wasn’t until last November, on the heels of the Trump election, that USD/CAD was finally able to mount above the big figure, and that surge lasted into the New Year until another major psychological level came into play at 1.4500. That price is what ultimately reversed the trend in Q1 of this year, with a massive sell-off following.\nBut that trend began to stall in June and July, and since then, buyers have been taking over with more and more control as illustrated by the 38.2% retracement of this year’s sell-off.\nThe Fibonacci retracement produced by that move also provides some scope for follow-through resistance, as the 1.4167 level aligns with a prior swing-low.\nUSD/CAD Weekly Price Chart\nChart prepared by James Stanley; data derived from Tradingview\nUSD/CAD Shorter-Term Structure\nAs of this writing USD/CAD is very near the recent highs and this is a price that’s already been tested twice (a 3rd time including the current test).\nThis is a challenging area to establish bullish exposure given that context, and also taken from the fact that price has moved quite far from the recent swing-low. But, from the four-hour chart this can help to identify recent bullish structure, and that can help to devise strategy for bullish continuation scenarios.\nThe 1.4000 level is obviously the big deal here but given the newness of this test, it would be presumptuous to assume acceptance just yet. But – a pullback to and show of support around that price can begin to build the argument on a shorter-term basis. This would be illustrated by an underside wick on the four-hour chart, showing bulls responding to a pullback below the big figure followed by a show of strength, which can be looked at as s s"
            },
            {
                "title": "As positive Canadian job figures diminish expectations for a Bank of Canada rate cut, USD/CAD declines - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/as-positive-canadian-job-figures-diminish-expectations-for-a-bank-of-canada-rate-cut-usd-cad-declines/",
                "body": "The USD/CAD pair weakens towards 1.4000 in the early European session on Monday. This occurs against a backdrop of stronger-than-expected employment data from Canada, which reduces the likelihood of a Bank of Canada (BoC) interest rate cut this month.\nCanadian Employment Data Surprise\nStatistics Canada reported that the Canadian Unemployment Rate remained at 7.1% in September, defying estimations of 7.2%. Moreover, Canada’s economy added 60.4K jobs in September, surpassing expectations of 5K and reversing the previous month’s loss of 65.5K jobs.\nThe BoC had reduced its benchmark rate by 25 basis points last month. However, the probability of a further cut at its next policy decision has now dropped from 72% to 50% post-strong employment figures.\nCrude oil price recovery may bolster the Canadian Dollar, given Canada’s status as the largest oil exporter to the US. Concurrently, easing US-China trade tensions, following comments by President Trump, may provide support for the US Dollar.\nThe Canadian Dollar is influenced by factors such as BoC interest rates, oil prices, economic health, inflation, and trade balance. Relatively higher interest rates and higher oil prices generally positively impact the CAD, while weak economic data adversely affect it.\nImplications for the Bank of Canada Meeting\nThe strong Canadian jobs report has changed the game for the upcoming Bank of Canada meeting on October 29. What we previously saw as a near-certain rate cut is now a coin-flip, introducing significant uncertainty into the USD/CAD pair. This means traders should prepare for a potential spike in volatility rather than committing to a single direction.\nWe are seeing this uncertainty reflected in the options market, where implied volatility for November USD/CAD contracts has jumped from around 7% to over 9.5% in the last few days. A good strategy would be to consider buying volatility through structures like a straddle around the 1.4000 level, which would profit from a large move in either direction following the BoC’s announcement. This positions for the event itself, not a specific outcome.\nAdding to the complexity is the firming price of oil, with WTI crude recently breaking above $88 a barrel for the first time in a month. This trend supports the commodity-linked Loonie and acts as a headwind against any significant USD/CAD upside. However, any continued positive news on the US-China trade front could limit CAD strength, keeping the pair in a choppy range.\nThe case for the BoC to hold rates steady is also bolstered by recent inflation figures, with Statistics Canada reporting last week that core CPI remained stubbornly high at 2.9%, near the top of the bank’s target range. We saw a similar situation in late 2023 when markets mispriced the timing of central bank pivots, causing sharp repricing events. This historical precedent suggests that positioning for a surprise is more prudent than betting on the consensus."
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "0.9580",
            "open": "202.6310",
            "close": "203.0230",
            "high": "203.2350",
            "low": "202.2770"
        },
        "market_summary": "### GBP/JPY Market Briefing\n\n* **Key Drivers:** UK fiscal concerns and Japanese political instability are weighing on markets, underpinning a **tense balance** in GBP/JPY around the **203.00** level.\n* **Price Action:** GBP/JPY has snapped a two-day losing streak, trading at **202.90** with a marginal gain of **0.45%**, as traders evaluate Japan's political uncertainty and UK fiscal risks.\n* **Technical Outlook:** Immediate support is near the **50-day moving average** at **199.85**, with resistance at **205.00**; a decisive move through **205.00** could open the door to a retest of the summer highs.\n\n---\n**Overall Sentiment:** Neutral ⚖️",
        "source_articles": [
            {
                "title": "The Japanese Yen remains steady against the British Pound amidst UK fiscal worries and Japanese political instability - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/the-japanese-yen-remains-steady-against-the-british-pound-amidst-uk-fiscal-worries-and-japanese-political-instability/",
                "body": "The GBP/JPY exchange rate remained stable on Monday, as trading participants evaluated the political uncertainties in Japan alongside fiscal concerns in the UK. GBP/JPY is attempting recovery, trading around 202.90 with a marginal gain of 0.45% after a two-day decline.\nJapan’s political situation is uncertain following the disbandment of the coalition between the Liberal Democratic Party and Komeito. This has affected the outlook on the Bank of Japan’s monetary policies, amid speculation of a pending interest rate freeze despite inflation sitting at 2.7%.\nUK Fiscal Concerns\nIn the UK, attention is on Chancellor Rachel Reeves as she prepares for the November Budget, amidst concerns over tax hikes impacting the economy. The Bank of England maintains a cautious approach, noting weak growth despite strong inflation and wage figures. Megan Greene from BoE suggested the disinflation process might be slowing.\nThe week ahead includes sparse economic updates from Japan. However, the UK will release employment data on Tuesday, with BoE Governor Andrew Bailey expected to provide remarks, followed by GDP figures on Thursday. Employment data is a key indicator for GDP, with a consistent increase seen as positive for the British Pound.\nWe see the political turmoil in Japan as the key factor suppressing the Yen in the short term. The pressure on the Bank of Japan to remain patient is immense, especially after they only cautiously lifted rates out of negative territory back in 2024. With core inflation currently sitting at a manageable 2.5%, the political desire for economic stability will likely outweigh calls for further tightening.\nPotential Volatility\nOn the other side of the trade, we are watching the UK’s credibility test ahead of Chancellor Reeves’s November budget. The Bank of England is caught between sticky inflation, which was last reported at 3.1%, and fears of a slowing economy. This policy tension suggests potential volatility for the Pound, making outright bets risky.\nThese conflicting forces—a dovish BoJ and a cautious BoE—are creating a tense balance in GBP/JPY around the 203.00 level. For derivative traders, this means implied volatility is likely to be the most interesting play in the coming weeks. The pair could be prone to sharp moves on any surprise data but may remain in a broader range otherwise.\nWe believe strategies that benefit from either a rise in volatility or a range-bound environment are worth considering. Options structures like straddles could capture a potential breakout, while strategies like iron condors might perform well if the pair remains stuck between policy indecision. The UK employment figures tomorrow morning are the first major test and will set the immediate tone."
            },
            {
                "title": "GBP/JPY steady amid Japan’s coalition collapse and UK fiscal concerns - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-steadies-as-japans-political-uncertainty-and-uk-fiscal-risks-weigh-on-markets-202510131333",
                "body": "GBP/JPY steadies as Japan’s political uncertainty and UK fiscal risks weigh on markets\n- GBP/JPY holds steady on Monday as traders weigh Japan’s political turmoil and UK fiscal caution.\n- Japan’s coalition collapse clouds policy stability and adds pressure on the BoJ to stay patient.\n- UK markets brace for Chancellor Reeves’s first full Budget and potential targeted tax increases.\nThe British Pound (GBP) is treading water against the Japanese Yen (JPY) on Monday, as investors weigh renewed political uncertainty in Japan against lingering fiscal and monetary headwinds in the United Kingdom (UK). At the time of writing, GBP/JPY is trading little changed near 202.90, snapping a two-day losing streak with a modest gain of 0.45% on the day.\nMarket participants remain focused on how Japan’s political flux may affect the Bank of Japan’s (BoJ) policy path while reassessing the outlook for the Bank of England (BoE) amid persistent UK fiscal concerns.\nIn Japan, the collapse of the long-standing ruling coalition between the Liberal Democratic Party (LDP) and Komeito has injected fresh uncertainty into the political landscape. Opposition parties are forming alliances to challenge LDP leader Sanae Takaichi’s bid for the premiership, raising doubts over the stability of Japan’s next government.\nThe BoJ faces a tougher monetary policy path as political voices call for patience on further tightening. Takaichi, expected to become Japan’s first female prime minister, has called for closer coordination between the government and the central bank. Her comments have reinforced speculation that the BoJ may keep interest rates unchanged for longer, limiting upside momentum in the Yen. While inflation remains around 2.7%, some policymakers still favor additional rate hikes, though others prefer patience to protect fragile growth.\nAcross the channel, the UK faces its own credibility test. Chancellor Rachel Reeves is preparing her first full Budget for November. Markets are concerned that potential tax hikes aimed at meeting fiscal goals could further strain the fragile UK economy. Meanwhile, the BoE remains cautious. On Monday, BoE policymaker Megan Greene said the central bank still sees underlying growth as weak and the labor market as softening, even though inflation and wage growth remain strong. Greene warned that the disinflation process may be slowing and noted there is a case for keeping rates higher for longer, although policy is still expected to move gradually lower over time.\nLooking ahead, Japan’s economic calendar is relatively light this week. In the UK, attention will turn to Tuesday’s employment data and remarks from BoE Governor Andrew Bailey, followed by monthly GDP figures on Thursday. Several additional BoE speakers are also scheduled throughout the week.\nEconomic Indicator\nEmployment Change (3M)\nEmployment Change released by the UK Office for National Statistics represents the change in the number of people who were employed in the UK in the three months to the release period. Generally, a healthy and consistent increase of this figure is seen as bullish for the Pound Sterling (GBP), while a decrease is seen as bearish.\nRead more.Next release: Tue Oct 14, 2025 06:00\nFrequency: Monthly\nConsensus: -\nPrevious: 232K\nSource: Office for National Statistics\nAuthor\nVishal Chaturvedi\nFXStreet\nI’m a macro-focused research analyst with over four years of experience covering forex and commodities market."
            },
            {
                "title": "GBP/JPY snaps losing streak as Cable traders jostle for position - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-snaps-losing-streak-as-cable-traders-jostle-for-position-202510131843",
                "body": "GBP/JPY snaps losing streak as Cable traders jostle for position\n- GBP/JPY pumped the brakes near the 203.00 handle on Monday.\n- Markets are waiting for the return of US money flows after a long weekend.\n- Key UK labor data looms ahead on Tuesday, Yen data docket remains thin this week.\nGBP/JPY roiled on Monday, churning chart paper near the 203.00 handle after arresting a two-day backslide from 15-month highs above 205.00. The Guppy pair is still holding well on the high end of a near-term bullish surge that has the Pound Sterling (GBP) up over 2% against the Japanese Yen (JPY) in October.\nThis week’s economic data docket on the Japanese side remains thin and and limited, but Pound traders will be facing down the latest labor data updates from the UK on Tuesday. GBP markets are hoping that the UK’s 3-month ILO Unemployment Rate will hold at 4.7% in September.\nThe Bank of England (BoE) has been steadily cutting its interest rate since Q3 2024, delivering a steady stream of three interest rate cuts through 2025, and the UK’s central bank is broadly expected to deliver further rate cuts through the end of the year and into 2026 as the BoE grapples with a lopsided economic stop-and-start. This week’s labor data reading will provide GBP traders with a fresh take on the state of the UK economy before fine-tuning rate cut expectations.\nGBP/JPY price forecast\nThe GBP/JPY daily chart has shown a clear shift in momentum over the past two weeks. After sliding below the 50-day Exponential Moving Average (EMA) in late September, the pair found support near 197.00 and staged a strong rebound. The rally accelerated once price reclaimed the 50-day EMA around 199.85, pushing quickly toward 205.00 before easing back.\nThe recent pullback looks more like a pause than a full reversal. Price is holding above the 50-day EMA, suggesting that buyers remain in control for now. The 200-day EMA, down near 196.77, continues to slope upward, providing longer-term trend support.\nShort-term sentiment leans bullish while the pair trades above 200.00, but traders will be watching to see if GBP/JPY can clear resistance near 205.00 again. A decisive move through that level could open the door to a retest of the summer highs, while a close back below 199.50 would signal fading momentum and a possible return to the broader range.\nGBP/JPY daily chart\nPound Sterling FAQs\nThe Pound Sterling (GBP) is the oldest currency in the world (886 AD) and the official currency of the United Kingdom. It is the fourth most traded unit for foreign exchange (FX) in the world, accounting for 12% of all transactions, averaging $630 billion a day, according to 2022 data. Its key trading pairs are GBP/USD, also known as ‘Cable’, which accounts for 11% of FX, GBP/JPY, or the ‘Dragon’ as it is known by traders (3%), and EUR/GBP (2%). The Pound Sterling is issued by the Bank of England (BoE).\nThe single most important factor influencing the value of the Pound Sterling is monetary policy decided by the Bank of England. The BoE bases its decisions on whether it has achieved its primary goal of “price stability” – a steady inflation rate of around 2%. Its primary tool for achieving this is the adjustment of interest rates. When inflation is too high, the BoE will try to rein it in by raising interest rates, making it more expensive for people and businesses to access credit. This is generally positive for GBP, as higher interest rates make the UK a more attractive place for global investors to park their money. When inflation falls too low it is a sign economic growth is slowing. In this scenario, the BoE will consider lowering interest rates to cheapen credit so businesses will borrow more to invest in growth-generating projects.\nData releases gauge the health of the economy and can impact the value of the Pound Sterling. Indicators such as GDP, Manufacturing and Services PMIs, and employment can all influence the direction of the GBP. A strong economy is good for Sterling. Not only does i"
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "2,384.9100",
            "open": "114,925.9900",
            "close": "115,795.4700",
            "high": "116,067.5000",
            "low": "113,682.5900"
        },
        "market_summary": "### BTC/USD Market Briefing\n\n* **Key Drivers:** Growing institutional adoption of Bitcoin, led by **BlackRock's IBIT**, which saw **$2.63 billion** in net inflows, indicating strong investor confidence in **Bitcoin ETFs**.\n* **Price Action:** The market experienced a partial rebound after a weekend crash, with the global crypto market value adding back about **$550 billion**, showing **bullish momentum**.\n* **Technical Outlook:** Immediate support and resistance levels are not explicitly mentioned in the articles, but the growing demand for **Bitcoin ETFs** and the dominance of **IBIT** suggest a positive **technical outlook**.\n\n---\n**Overall Sentiment:** PositiveTRGL",
        "source_articles": [
            {
                "title": "Morning Crypto Report: Bitcoin to Lose 50% Against Gold? SEC to Decide on 6 XRP ETFs in 5 Days, Binance Announces $283 Million Repayment - InsuranceNewsNet",
                "source": "InsuranceNewsNet",
                "url": "https://insurancenewsnet.com/oarticle/morning-crypto-report-bitcoin-to-lose-50-against-gold-sec-to-decide-on-6-xrp-etfs-in-5-days-binance-announces-283-million-repayment",
                "body": "Morning Crypto Report: Bitcoin to Lose 50% Against Gold? SEC to Decide on 6 XRP ETFs in 5 Days, Binance Announces $283 Million Repayment\nAdvertisement The crypto market is expected to enter the evening with recovery in progress but far from secure. The weekend crash, fueled by U.S.-China trade escalation and cascading liquidations, erased hundreds of billions in capitalization before a partial rebound set in. According to data, global crypto market value has added back about $550 billion from…"
            },
            {
                "title": "BlackRock’s IBIT Tops Bitcoin ETF Inflows With $2.63B in Record Week - CoinCentral",
                "source": "CoinCentral",
                "url": "https://coincentral.com/blackrocks-ibit-tops-bitcoin-etf-inflows-with-2-63b-in-record-week/",
                "body": "TLDR\n- BlackRock’s Bitcoin ETF, IBIT, recorded $2.63 billion in net inflows between October 6 and October 10.\n- IBIT accounted for the largest share of the $2.71 billion in total Bitcoin ETF inflows for the week.\n- The ETF’s historical net inflows now total $65.26 billion, underscoring its dominance in the Bitcoin ETF market.\n- IBIT’s net assets have reached $93.98 billion, controlling about 4.13% of Bitcoin’s total market capitalization.\n- Despite a minor price drop, IBIT maintained strong trading volume, with $7.02 billion traded across 105 million shares.\nBlackRock’s Bitcoin ETF, IBIT, has emerged as the dominant player in the crypto investment space. The ETF saw a significant $2.63 billion in net inflows between October 6 and October 10. This marks the highest weekly inflow for any Bitcoin spot ETF. IBIT’s strong performance continues to attract institutional investors seeking exposure to Bitcoin.\nMassive Inflows Signal Investor Confidence\nBlackRock’s IBIT outperformed all other Bitcoin spot ETFs, representing a majority of the $2.71 billion in inflows. The ETF now holds $65.26 billion in historical net inflows. It is the leading choice for institutions looking to gain exposure to Bitcoin in a regulated environment. Despite a minor 0.09% discount to its net asset value and a 3.7% price drop, IBIT saw strong demand.\n吴说获悉，根据 SoSoValue 数据，上周交易日（美东时间 10 月 6 日至 10 月 10 日）比特币现货 ETF 单周净流入 27.1 亿美元。上周单周净流入最多的比特币现货 ETF 为贝莱德（Blackrock）比特币 ETF IBIT，周度净流入 26.3 亿美元，目前 IBIT 历史总净流入达 652.6 亿美元。https://t.co/cRH33Tu3K2\n— 吴说区块链 (@wublockchain12) October 13, 2025\n“Even amid short-term market corrections, investors continue to trust IBIT’s stability and liquidity,” said a market analyst.\nThis sustained demand highlights growing confidence in BlackRock’s Bitcoin ETF. With $93.98 billion in net assets, IBIT controls about 4.13% of Bitcoin’s market cap. The ETF’s ability to withstand volatility positions it as a long-term option for institutional investors.\nOther Bitcoin ETFs See Outflows\nWhile IBIT surged, other Bitcoin ETFs faced outflows. Fidelity’s FBTC experienced a $10.18 million outflow, while Grayscale’s GBTC saw a larger $19.21 million withdrawal. This marks a continuation of Grayscale‘s struggle following its conversion from a trust to an ETF. Smaller players, such as Ark 21Shares and the Grayscale BTC fund, reported modest outflows of $5-6 million each.\nThe overall net inflow across all Bitcoin ETFs reached $62.77 billion as of October 10. Despite a slight outflow of $4.5 million on the day, the Bitcoin ETF market remains strong. Total assets in Bitcoin ETFs reached nearly $159 billion, which represents 7% of Bitcoin’s total market cap.\nIBIT Leads the Institutional Shift to Bitcoin ETFs\nBlackRock’s IBIT is leading the charge as traditional finance firms increasingly turn to Bitcoin ETFs. With a low 0.25% management fee, IBIT offers deep liquidity and exposure to Bitcoin. It has become the ETF of choice for traditional financial institutions entering the cryptocurrency market.\nFidelity’s FBTC, while holding $24.19 billion in assets, remains far behind IBIT in scale. However, the race for Bitcoin ETF dominance reflects the broader trend of growing institutional adoption of cryptocurrency. As capital continues to flow into Bitcoin ETFs, the institutional narrative surrounding Bitcoin strengthens. The competition between firms like BlackRock, Fidelity, and Grayscale will likely intensify in the coming months."
            },
            {
                "title": "BlackRock’s IBIT Is Nearing $100B in AUM. Everyone Else Might Be Chasing ‘Crumbs’ - The Daily Upside",
                "source": "The Daily Upside",
                "url": "https://www.thedailyupside.com/etf/thematics-sectors/blackrocks-ibit-is-nearing-100b-in-aum-everyone-else-might-be-chasing-crumbs/",
                "body": "BlackRock’s IBIT Is Nearing $100B in AUM. Everyone Else Might Be Chasing ‘Crumbs’\nAs the iShares Bitcoin Trust nears the milestone, dozens of spot-price crypto ETFs are being prepped to come to market.\nSign up for exclusive news and analysis of the rapidly evolving ETF landscape.\nThe world’s fastest-growing ETF, the iShares Bitcoin Trust (IBIT), is nearing $100 billion in assets, less than two years after its launch.\nThat puts it among the 20 biggest ETFs, only 18 of which are in the $100 billion-plus club. It clearly shows demand for digital assets, or at least for one product. BlackRock dominates the crypto ETF category, with the next-biggest competitor, Fidelity’s Wise Origin (FBTC), being roughly a quarter of the size. Of course, BlackRock is also the world’s biggest asset manager, at about $12.5 trillion, according to the Sovereign Wealth Fund Institute. The firm, which also manages the fourth-biggest crypto ETF, the $18 billion iShares Ethereum Trust, hasn’t shown any plans to expand into other digital assets. BlackRock declined to comment, but it has not been among the issuers filing for spot-price ETFs in XRP, Solana or other categories.\n“The ETF game belonged to BlackRock long before crypto ETFs,” said Tyrone Ross, CEO of 401 Financial and Turnqey Labs. “Everyone else gets the crumbs, and because the market opportunity is so big, other providers can accumulate meaningful AUM with those crumbs.”\nProfitable? Um, Just IBIT\nThe iShares ETF, which charges 0.25%, brings in revenue of about $240 million for BlackRock, Bloomberg analysts noted, making it the most profitable fund for the company. There’s a big incentive for companies to add spot-price crypto ETFs, though the Securities and Exchange Commission until recently was slow to approve many. That changed last month, when the regulator gave exemptions to the three big exchanges to use generic listing standards. The effect will be numerous new digital asset ETFs coming to market without a la carte approval by the SEC. Whether there’s investor appetite for numerous versions of Dogecoin is another matter.\n“Other crypto tokens don’t have the same global adoption or characteristics that make Bitcoin such a strong store of value,” said Mike Casey, president of AE Advisors, who has been recommending Bitcoin allocations since 2019. “The spot ETFs are a frictionless way to add Bitcoin exposure for clients.” While IBIT has the most liquidity and largest market cap, he said the Grayscale Bitcoin Mini Trust (BTC), Bitwise Bitcoin ETF (BITB) and ARK 21Shares Bitcoin ETF (ARKB) are also worth a look.\nSome of the recent developments in crypto ETFs:\n- BlackRock filed for an iShares Bitcoin Premium Income ETF.\n- Rex-Osprey has two ETFs with staking capabilities (SSK and ESK).\n- S&P Global is adding a Digital Markets 50 Index, tracking both equities and digital assets. Dinari, which partnered with S&P, is making a token specific to that index.\nLet them eat crumb cake: There are billions of dollars in investments at stake, so expect a deluge of ETFs soon, even if only a small slice gain enough assets to survive. “The door is wide open now for other types of crypto ETFs,” Ross said. “It will be interesting to see how Solana is received and whatever comes after, like a Chainlink, Ripple or Litecoin.”"
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "247.9000",
            "open": "4,138.1900",
            "close": "4,288.8500",
            "high": "4,291.5500",
            "low": "4,043.6500"
        },
        "market_summary": "### ETH/USD Market Briefing\n\n* **Key Drivers:** Increased adoption of Ethereum-based decentralized applications (dApps) and decentralized finance (DeFi) initiatives, along with the introduction of **leverage tokens** on the Ethereum mainnet, are expected to drive **bullish momentum**.\n* **Price Action:** Expected to trade in a range of **$3,200** to **$3,600** by 2025, with potential for **$7,000** to **$8,000** in a **bullish case** scenario, driven by **staking and passive income**, **layer-2 expansion**, **DeFi and NFT growth**, and **institutional adoption**.\n* **Technical Outlook:** Immediate support is near the **50-day moving average**, with resistance at **$3,600**, and potential for further growth driven by **scalability**, **staking**, and increased **applications** of Ethereum in **DeFi** and **NFTs**.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "ETH Price Prediction 2025-2026: Scaling the Future with Hashj Rewards - openPR.com",
                "source": "openPR.com",
                "url": "https://www.openpr.com/news/4221964/eth-price-prediction-2025-2026-scaling-the-future-with-hashj",
                "body": "ETH Price Prediction 2025-2026: Scaling the Future with Hashj Rewards\nEther (ETH) remains a leader in the cryptocurrency industry as the building block of decentralized applications, DeFi initiatives and NFT platforms. Not only has its move to a Proof-of-Stake (PoS) consensus made its network more sustainable, but has also opened up new opportunities to investors seeking passive income.It is now easy to join the booming Ethereum based on platforms such as Hashj, which also comes with clear blockchain related rewards and a registration bonus of 118 USD which can immediately be used. https://hashtagini.com/\n1. The Current Market Position of Ethereum\nBy 2025, Ethereum will be trading at a range of $3,200 to $3,600 which is an indication of a consistent demand by both the retail and institutional investors. Optimism and Arbitrum are layer-2 solutions that are aiding to scale the network making the transactions cheaper and faster. This has increased the use of Ethereum-based dApps and smart contracts in the blockchain ecosystem.\nThe transition of Ethereum to PoS also enables the holders to stake the ETH and obtain rewards, which makes it a more attractive long-term investment.\n2. Major Motives that ETH Price Increases\na. Staking and Passive Income\nThe PoS system of Ethereum allows investors to deposit their ETH and receive regular rewards, which leads to high demand and low supply.\nb. Layer-2 Expansion\nThe layer-2 solutions enhance the scale, reduce payments, and enhance transaction speed, making developers and users keep building on Ethereum.\nc. DeFi and NFT Growth\nNFT platforms and decentralized finance are thriving on Ethereum, which is making the network more active, as well as rendering ETH more useful.\nd. Institutional Adoption\nBanks, investment funds and major companies are still incorporating ETH in their portfolios and this is increasing their credibility and liquidity in the market.\n3. ETH Price Forecast 2025-2026\nScenario Market Outlook Estimated Price Range\nBullish Case Rapid adoption, strong staking participation $7,000 - $8,000+\nModerate Case Steady ecosystem growth $5,000 - $6,500\nBearish Case Market corrections or regulatory hurdles $3,500 - $4,500\nWith even the conservative estimations, Ethereum has the fundamentals to grow long term, and it is a good competitor in 2025-2026.\n4. The way Hashj Improves Ethereum Profits.\nHashj supports a person to get Ethereum rewards without complicated trading and technical skills. With blockchain transparency and smart contracts, Hashj will have guaranteed income security and automation.\nHashj Benefits for ETH Users:\nAutomated Daily Rewards: Passively receive ETH through no action trading.\nDecentralized, Open, and transparent: All transactions are authenticated on-chain.\nEasy to use: Friendly to both novices and experienced investors.\nInstant Bonus: Sign up, and receive $118 instantly to increase your ETH portfolio. https://hashtagini.com/\nWith Hashj, you will be able to generate revenue with Ethereum, today, no matter what the market does.\n5. Expert Insights on Ethereum\nEthereium is widely considered by analysts to be a pioneer in blockchain and smart contracts development:\nIts PoS conversion will be pushing long-term value.\nThe cost of transactions may also be greatly minimized by the implementation of Layer-2, which will attract more users and developers.\nFurther adoption of DeFi and NFTs will make ETH one of the leading assets in the cryptocurrency market.\n6. Challenges to Consider\nAlthough Ethereum has a good growth potential, investors must know:\nOther Layer-1 blockchain competitors, such as Solana and Cardano.\nUncertainty in the market based on the international economics.\nRegulatory trends that could impact DeFi or staking in general.\nDespite such challenges, Ethereum still has a strong ecosystem that is flexible.\n7. Conclusion\nThe scalability, staking, and increased applications of Ethereum in DeFi and NFTs will further increase its growth in 2025-2026. Through Hashj, inv"
            },
            {
                "title": "Ethereum Mainnet to See New Leverage Tokens from Seamless Protocol Launch - CoinCentral",
                "source": "CoinCentral",
                "url": "https://coincentral.com/ethereum-mainnet-to-see-new-leverage-tokens-from-seamless-protocol-launch/",
                "body": "TLDR\n- Seamless Protocol introduces automated leverage tokens for DeFi on Ethereum mainnet.\n- Two new partners to launch DeFi strategies using Seamless Protocol’s leverage tokens.\n- Cantina performs security audit on Seamless Protocol’s mainnet deployment for safety.\n- Leverage tokens streamline DeFi interactions with one-click access to strategies.\nSeamless Protocol is launching its Leverage Tokens on the Ethereum mainnet this week. These tokens simplify access to leveraged DeFi strategies by automating complex processes into one-click actions. By leveraging standard ERC-20 tokens, Seamless Protocol allows users to tap into advanced DeFi positions without needing to manage intricate steps themselves. This new development could reshape how users interact with decentralized finance on Ethereum.\nIntroduction of Leverage Tokens on Ethereum Mainnet\nSeamless Protocol’s Leverage Tokens are designed to make leveraging DeFi strategies more accessible. These tokens wrap complex looping strategies into simple ERC-20 tokens, which can be easily used by anyone.\nThe deployment of these tokens allows users to gain access to automated leveraged positions with just one click. With this launch, Seamless Protocol is enhancing the composability of Ethereum-based decentralized applications (dApps).\nThe primary goal of these tokens is to make leveraged strategies easier for DeFi users. Rather than manually setting up leveraged positions, users can simply acquire these tokens, which automatically implement the desired strategies. This removes the complexity typically involved in interacting with leveraged DeFi protocols.\nStrategic Partnership and New Developments\nTwo new partners are set to launch their own strategies using the Leverage Tokens, extending their functionality to more users and platforms. This is expected to increase the liquidity on the Ethereum network, providing a more seamless experience for users looking to maximize their DeFi returns. By integrating these tokens into their offerings, the partners will help unlock further liquidity and capital efficiency within Ethereum-based DeFi applications.\nThe introduction of these Leverage Tokens also brings increased flexibility for developers building on Ethereum. Through these tokens, developers can integrate tokenized leverage features into their dApps, improving the overall composability and interoperability of the Ethereum ecosystem. This could potentially lead to a broader range of DeFi applications making use of automated leverage strategies, simplifying their implementation.\nSecurity Measures and Audit\nCantina, a well-known security auditing firm, conducted a thorough security audit on the mainnet deployment of the Leverage Tokens. The audit ensured that the underlying smart contracts and infrastructure were secure and compliant with industry standards. This was an essential step in assuring the safety of users who will interact with these tokens.\nThe security audit also reviewed the protocols used in the token’s deployment, examining potential risks within the smart contract system. The results confirmed that the Leverage Tokens have been deployed securely, adding a layer of confidence for users when interacting with these new financial tools. The audit’s positive outcome has paved the way for the broader release of these tokens.\nImpact on DeFi Ecosystem and User Experience\nThe launch of Leverage Tokens represents a significant step forward for the Ethereum DeFi ecosystem. By simplifying the process of gaining leveraged exposure through ERC-20 tokens, Seamless Protocol is making it easier for a wider audience to participate in DeFi markets. The automation of complex strategies helps reduce the technical barrier to entry for users who may not have the expertise to navigate advanced DeFi mechanisms.\nAdditionally, the integration of tokenized leverage features into the Ethereum network enhances the overall user experience. With one-click access to leveraged positions, users can now t"
            },
            {
                "title": "Bhutan migrates its national ID system to Ethereum - Cointelegraph",
                "source": "Cointelegraph",
                "url": "https://cointelegraph.com/news/bhutan-migrates-ethereum-national-id",
                "body": "The South Asian nation of Bhutan is migrating its self-sovereign ID system to Ethereum from Polygon, allowing its nearly 800,000 residents to verify their identities and access government services.\nThe integration with Ethereum has been completed, while the migration of all resident credentials is expected to finish by the first quarter of 2026, according to Ethereum Foundation President Aya Miyaguchi, who joined Ethereum co-founder Vitalik Buterin at the launch ceremony with Bhutan’s prime minister, Tshering Tobgay, and crown prince, Jigme Namgyel Wangchuk.\n“It’s deeply inspiring to see a nation commit to empowering its citizens with self-sovereign identity,” Miyaguchi posted to X on Monday, adding that the Ethereum integration was a world-first.\n“This milestone marks not only a national achievement but a global step toward a more open and secure digital future for the long term.”\nIntegrating a blockchain-based solution into a government’s national ID system has long been touted as a promising crypto use case, due to its immutability, transparency and privacy features, particularly when zero-knowledge proofs are implemented.\nEthereum is Bhutan’s third blockchain national ID solution\nBhutan previously ran its national ID system on Polygon from August 2024 and Hyperledger Indy before that. Brazil and Vietnam are among the few other countries that have partially integrated blockchain-based self-sovereign identity solutions to date.\nRelated: Crypto funds attract $3.2B inflows despite Friday’s flash crash\nMiyaguchi noted that Bhutan’s National Digital Identity and GovTech teams played a crucial role in the Ethereum integration, as well as other contributors in the Bhutan crypto community.\nBhutan has been stacking Bitcoin\nBhutan — a country that measures national progress by Gross National Happiness — has quietly become a leader in crypto adoption in recent years. It is currently the fifth-largest Bitcoin-holding nation-state, having amassed its holdings through mining using renewable energy at its Himalayan hydropower dams.\nIt currently holds 11,286 Bitcoin worth $1.31 billion, trailing only the US, China, the UK, and Ukraine, BitBo’s Bitcoin Treasuries data shows.\nBhutan may also be exploring other crypto initiatives, having met with former Binance CEO Changpeng Zhao in late September — though the details of their discussions were not disclosed.\nPay in #BNB using @Binance Pay in Bhutan🇧🇹, nice and easy. 😏 pic.twitter.com/B5p3YolJjJ\n— CZ 🔶 BNB (@cz_binance) September 29, 2025\nMagazine: EU’s privacy-killing Chat Control bill delayed — but fight isn’t over"
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "18.2713",
            "open": "196.6800",
            "close": "208.4500",
            "high": "208.6500",
            "low": "190.3787"
        },
        "market_summary": "### SOL/USD Market Briefing\n\n* **Key Drivers:** Renewed confidence in Solana's DeFi ecosystem, driven by **$250 million** USDC mint by Circle, and increased institutional and developer momentum, with Solana's active developers increasing by **35%** in the last year.\n* **Price Action:** Shows **bullish momentum** as Solana-based liquidity layer Kamino integrates with Project 0, enhancing cross-margin lending and boosting liquidity, and Sorare migrates from Ethereum L2 StarkEx to Solana, expanding the ecosystem.\n* **Technical Outlook:** Immediate support is near the **$20** level, with resistance at **$25**, as the **$250 million** USDC mint and increasing DeFi activity on Solana are expected to drive **upward pressure** on the price.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Circle Mints $250 Million in USDC on Solana – a Major Boost for DeFi Liquidity - CryptoNinjas",
                "source": "CryptoNinjas",
                "url": "https://www.cryptoninjas.net/news/circle-mints-250-million-in-usdc-on-solana-a-major-boost-for-defi-liquidity/",
                "body": "Key Takeaways:\n- Circle minted $250 million worth of USDC on the Solana blockchain, signaling renewed confidence in Solana’s DeFi ecosystem.\n- The mint aims to strengthen liquidity across decentralized exchanges (DEXs), lending protocols, and payment rails.\n- The move could position Solana as a key hub for stablecoin activity, competing directly with Ethereum and Base.\nCircle, the issuer of USD Coin (USDC), has minted $250 million USDC on Solana, according to blockchain monitoring service Whale Alert. The transaction, one of the largest single USDC mints in recent months, reflects a surge in stablecoin demand within Solana’s DeFi sector and highlights the blockchain’s growing relevance in digital finance.\nCircle Expands Its Stablecoin Footprint on Solana\nCircle’s treasury minted 249,875,875 USDC, valued at roughly $250 million, on the Solana network earlier this week. The mint follows a period of heightened activity on Solana-based decentralized finance (DeFi) platforms, where stablecoins are increasingly used for lending, liquidity pools, and cross-chain settlements.\nSolana’s low transaction costs and high throughput make it an ideal environment for large-scale stablecoin operations. By injecting fresh USDC liquidity, Circle appears to be supporting ecosystem demand driven by new DeFi applications, payment integrations, and cross-border transaction volumes.\nRead More: Circle Unveils Arc Layer-1 Blockchain Following $5.9T USDC Quarter 2 Earnings Report\nWhy Solana Is Becoming a Stablecoin Powerhouse\nStablecoins like USDC serve as the backbone of decentralized finance, providing a reliable on-chain dollar equivalent for trading, collateral, and yield generation.\nThe new mint of $250 million of USDC places the total that Solana has in the market at over $1.4 billion, according to Solscan data, placing the network as the third-largest USDC network after Ethereum and Base.\nSolana’s Competitive Edge in the Stablecoin Race\nSpeed and cost are the major strengths of Solana. Mean transaction costs are less than $0.002, with network latency averaging 400 milliseconds, which is much faster than the base layer of Ethereum. It is this efficiency that enables stablecoin flows such as algorithmic trading, DeFi arbitrage to run in real-time, without the penalty of high gas costs.\nJupiter Exchange, Marinade Finance, and Drift Protocol are some of the projects that are very dependent on stablecoin liquidity. The introduction of the new mint will probably increase the level of trading, decrease slippage of DEXs, and result in the stability of prices of larger traders.\nRead More: Circle Launches USDC Natively on XRP Ledger, Unlocking New DeFi and Payment Possibilities\nInstitutional and Developer Momentum Behind USDC on Solana\nCircle’s renewed activity follows a broader push to expand USDC’s native integrations across multiple blockchains, including Ethereum, Avalanche, Arbitrum, and Solana. However, Solana has recently emerged as a preferred network thanks to its speed, cost efficiency, and expanding DeFi ecosystem.\nThe new mint could also tie into Circle’s upcoming Cross-Chain Transfer Protocol (CCTP) rollout on Solana, which allows seamless USDC transfers between networks without wrapping or bridging risks. When implemented entirely, this would make Solana a liquidity routing node with USDC, which would boost its use as a multichain DeFi participant.\nDeveloper activity is increasing, meanwhile, developer activity is increasing. Solana has increased in number of active developers by 35 percent in the last year, more so than Avalanche or Polygon. Most of them incorporate native USDC payments, which means that Circle has been fully integrated into the Solana development stack.\nAccording to market analysts, the issuance of stablecoins on a large scale is often an indicator of inflows of liquidity by market makers and institutional desks in anticipation of more trading."
            },
            {
                "title": "Project 0 Integrates Solana DeFi giant Kamino in boost to liquidity - theblock.co",
                "source": "theblock.co",
                "url": "https://www.theblock.co/post/374362/solana-defi-giant-kamino-boosts-liquidity-via-project-0-integration",
                "body": "Project 0 Integrates Solana DeFi giant Kamino in boost to liquidity\nQuick Take\n- Crypto prime broker Project 0 is integrating Solana-based liquidity layer Kamino to unlock cross-margin lending using a single pool of credit.\n- The move comes days after the largest liquidation event in crypto history.\nCrypto prime broker Project 0 is integrating Solana-based liquidity layer Kamino. The tie-up will enable users to manage risk, collateral, and capital efficiency across a range of DeFi applications.\nMost notably, users will now be able to borrow against their Kamino and Project 0 deposits using a single pool of credit that collates loan-to-value (LTV), borrow weights, and interest rate figures across platforms in one click. This also introduces a unified margin account, opening access to leverage opportunities without needing to manage multiple sets of collateral.\n\"By enabling cross-margin across multiple venues, users can now manage their entire portfolio under a single margin account, addressing a long-standing inefficiency in DeFi and providing clearer oversight of portfolio-wide risk,\" Project 0 founder MacBrennan Peet said in a statement.\nIn other words, Project 0 is meant to give decentralized finance users greater flexibility by consolidating their deposits, also boosting liquidity.\n\"Under the existing DeFi market structure, users are required to overcollateralize separately on each platform, which fragments capital and increases the chance of liquidation even when offsetting positions exist elsewhere,\" the project wrote.\nFlash crash\nThe move comes just days after the largest liquidation event in crypto history, when, on Friday, nearly $10 billion in open interest was eliminated by a flash crash in prices and multiple exogenous and endogenous risks to crypto derivatives. To some extent, the event has sparked a reevaluation of crypto market structure.\n\"Project 0, in partnership with Kamino, has spent extensive time modeling situations like the market flashcrash and the impact that has on solvency, market liquidity, and liquidations,\" Peet told The Block via email, noting that the models provided the insight that Project 0's risk parameters could have absorbed the drawdown and protected lenders. \"With Project 0 integrating Kamino, there are no new risks added to Kamino's systems. This is because Project 0 cannot change Kamino's imposed risk parameters. All risk parameters live on Kamino are set by the Kamino team only.\"\nNotably, both Kamino and Project 0 appear to have escaped the flash crash without issue. On Friday, Kamino wrote that its users incurred $0 worth of bad debt and that the liquidation engine \"performed exactly as expected.\" Likewise, Peet noted Project 0 processed over 2,000 liquidations while maintaining solvency. This is in light of some riskier collateral assets, like the memecoin BONK, seeing double-digit drawdowns.\nBy integrating Kamino, Project 0 takes on the Kamino risk profile, which is intended and how the platform functions. However, Kamino is not taking on Project 0's risk profile, a spokesperson said.\n\"[W]e have partial liquidations to ensure we only liquidate the minimum that brings users back to full health,\" Peet said.\nThe integration will be rolled out on Kamino beginning with Project 0's top 5,000 users and then introduced via a staggered public integration over the next few days.\nEditor's note (Oct. 13 — 16:55 UTC): Clarifies that Project 0 is integrating Kamino and taking on its risk profile.\nDisclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.\n© 2025 The Block. All Rights Reserved."
            },
            {
                "title": "Sorare Migrates to Solana, Abandoning Ethereum L2 StarkEx - The Defiant",
                "source": "The Defiant",
                "url": "https://thedefiant.io/news/nfts-and-web3/sorare-migrates-to-solana-from-starkex",
                "body": "Sorare Migrates to Solana, Abandoning Ethereum L2 StarkEx\nSorare, a blockchain-based fantasy sports game where fans can collect NFT player cards, is once again changing its home, this time migrating from StarkEx to Layer 1 chain Solana.\nIn an announcement on Oct. 8, Sorare described the migration from StarkEx, an Ethereum Layer 2 scaling solution, as “more than a technical upgrade,” calling it a “step forward in our vision to become the most open and flexible platform for digital sports collectibles.”\nIn its FAQ section for the migration, Sorare explained that it’s moving to Solana to connect Sorare cards “to a broader ecosystem,” including the ability to manage the NFTs on popular Solana wallets like Phantom. The team also hinted at a possible Sorare ecosystem token in the future, as part of its long-term vision:\nWhile the announcement didn’t provide further detail as to why Sorare chose to move to Solana, commentators on X have suggested that Sorare was paid an eight-figure sum to make the switch. The Defiant reached out to Sorare and Solana for comments, but haven’t heard back by press time.\nFounded in 2019 by Nicolas Julia and Adrien Montfort, Sorare started on Ethereum and by mid-2021 moved onto L2 StarkEx, the application-specific scaling engine from Starknet developer, StarkWare, to cut gas costs. That same year the company raised a $680 million Series B that valued it at roughly $4.3 billion.\nMigration Details\nAs part of the migration, starting this month, Sorare said that users’ ETH balances currently on StarkEx will migrate to Base, Coinbase’s Ethereum Layer 2, to improve “transaction efficiency while keeping the experience familiar.”\nBy the end of October, Sorare cards will be bridged as Solana NFTs while preserving all cards’ attributes like scarcity, serial number, season, XP, and metadata, per the blog post. The team also said that Sorare will cover all gas fees for the migration, specifying that users “won’t sign transactions or spend crypto during migration.”\nSorare also added that once the migration is complete, cards withdrawn to Ethereum wallets “still work in gameplay but cannot trade on Sorare until re-deposited or bridged to Solana,” while NFTs left on StarkEx will be bridged to Solana.\nAre NFTs Back?\nSorare's migration comes as the total number of NFT sales has reached its highest level since 2022, per data from blockchain analytics platform DappRadar.\nIn a Thursday research post, the DappRadar wrote that in Q3, the market recorded over 18.1 million NFTs sold, generating $1.6 billion in trading volume, adding that “one of the leading dapps” in this sports field is Sorare, which is responsible for “multimillions in trading volume, selling hundreds of thousands of digital cards to players and collectors around the globe.”\nEarlier today, Larva Labs, the creators of CryptoPunks, Autoglyphs, and Meebits, wrapped up Art Blocks’ curated series with a new collection, Quine, with the sale closing at 7.56 ETH, or $31,000 per Quine NFT.\nRelated Posts\nAdvertisement\nGet an edge in Crypto with our free daily newsletter\nKnow what matters in Crypto and Web3 with The Defiant Daily newsletter, Mon to Fri\n90k+ Defiers informed every day. Unsubscribe anytime."
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "426.500",
            "open": "45,819.160",
            "close": "46,073.940",
            "high": "46,167.660",
            "low": "45,741.160"
        },
        "market_summary": "### US30 Market Briefing\n\n* **Key Drivers:** Escalating trade tensions between the US and China, coupled with a government shutdown, are fueling **bearish** sentiment and **volatility** in the market.\n* **Price Action:** The **Dow Jones Industrial Average** dropped **878.82 points** to **45,479.60**, while the **S&P 500** slid **2.71%** to **6,552.51**, and the **Nasdaq Composite** sank **3.56%** to **22,204.43**.\n* **Technical Outlook:** Immediate support is near the **50-day moving average**, with resistance at the **recent highs** of **46,000**.\n\n---\n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "Dow Jones, Nasdaq, S&P 500 weekly preview: Pullback fears surge into Q3 earnings - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/news/stock-market-news/dow-jones-nasdaq-sp-500-weekly-preview-pullback-fears-surge-into-q3-earnings-4283700",
                "body": "China confirms working-level talks with US, vows ‘fight to the end’ in trade war\nInvesting.com -- U.S. stocks closed sharply lower on Friday after a late-session selloff triggered by President Donald Trump’s threat to impose steeper tariffs on China.\nTrump accused Beijing of “becoming very hostile” over its restrictions on rare earth metals, a critical input for technology and defense manufacturing.\nThe Dow Jones Industrial Average dropped 878.82 points, or 1.9%, to 45,479.60. The S&P 500 slid 2.71% to 6,552.51, its steepest one-day fall since April 10, while the Nasdaq Composite sank 3.56% to 22,204.43.\nEarlier in the session, equities were trading firmly higher, with the Nasdaq hitting a record intraday high before Trump’s comments reversed the momentum.\nVolatility surged alongside the retreat, with the CBOE VIX jumping above 22, snapping a months-long stretch of calm as investors moved quickly to hedge against deeper losses through the options market.\nThe late decline erased the S&P 500’s weekly advance, leaving the index down 2.4% for the week. The Dow lost 2.7% over the same period, while the Nasdaq ended the week 2.5% lower.\nLooking ahead to this week, attention will largely center on the start of third-quarter earnings, but the political backdrop in Washington is also in focus as investors watch for any sign of progress toward ending the government shutdown that began on October 1.\nMarkets have so far taken the shutdown in stride, though market strategists warn that the economic impact will grow the longer it persists. Travel disruptions are already emerging, and the suspension of government operations is beginning to affect key data releases.\nThe monthly jobs report scheduled for October 3 has been postponed, and investors are now watching to see whether next week’s releases, including inflation and retail sales figures, will also be affected.\nRBC Capital Markets strategists note that betting markets now see a shutdown lasting more than 30 days as the most likely outcome, a shift that could sharpen labor market worries.\nWhile the strategists say “the China tariff news on Friday had much more to do with the drop in the S&P 500,” they argue that the move in expectations toward a longer shutdown is not \"doing the U.S. equity market any favors.”\nThe Bureau of Labor Statistics said the consumer price index (CPI), initially due this Wednesday, will now be released on October 24.\nIf the shutdown continues into next week, economists warn that the October employment report could also be distorted, complicating interpretation of the data at a time when markets are highly sensitive to signals on inflation, growth and Fed policy.\nU.S. banks to kick off third-quarter earnings season\nInvestors will mainly focus on quarterly results from major U.S. banks this week for a read on the economy’s underlying strength.\nWith equity valuations sitting near five-year highs and concerns simmering over stretched enthusiasm around technology and artificial intelligence, a solid third-quarter earnings season will be key to sustaining market momentum.\nJPMorgan, Goldman Sachs, Wells Fargo and Citigroup are set to report on Tuesday, marking the formal start of earnings season. Bank of America and Morgan Stanley will follow on Wednesday.\nBarclays analyst Jason Goldberg expects third-quarter results to show “higher net interest income (NII), increased fees, positive operating leverage and continued share buyback,” with median bank EPS seen rising 12% year-on-year and slightly above the prior quarter.\nHe forecasts revenue growth of about 5% for a fourth straight quarter and sees tangible book value increasing again, helped by lower long-term rates, with the median bank delivering roughly a 1.1% return on assets (ROA) and 12% return on equity (ROE).\nBeyond the banks, TSMC and American Express are also set to report earnings this week, which will offer additional signals on demand trends across global tech supply chains and consumer spending.\nWhat analyst"
            },
            {
                "title": "Will Sempra stock outperform Dow Jones index - Earnings Overview Report & Growth Focused Entry Point Reports - newser.com",
                "source": "newser.com",
                "url": "https://chat.whatsapp.com/IpG3ceTq4Qe1fyovigBgQG",
                "body": "Stay connected with voice and video.\nSay it with stickers, voice, GIFs and more.\nMessaging features you need to connect in groups.\nStay updated on topics you care about.\nGet help with anything, all with the safety and privacy on WhatsApp.\nShare your everyday with photos, videos and voice notes.\nLayers of protection to help you stay safe.\nFollow this link to join"
            },
            {
                "title": "Dow Jumps 500 Points As Trump Softens Tariff Tone Vs. China; Q3 Earnings Season To Pick Up Pace - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/the-big-picture/dow-jones-sp500-nasdaq-trump-china-tariff/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #67dccc57-a8c1-11f0-bca9-510a34b12df9"
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "50.750",
            "open": "9,444.300",
            "close": "9,456.300",
            "high": "9,466.250",
            "low": "9,415.500"
        },
        "market_summary": "### UK100 Market Briefing\n\n* **Key Drivers:** The **FTSE 100** is expected to benefit from **global earnings recovery** in 2026, **artificial intelligence (AI)-fuelled productivity gains**, and potential **interest rate cuts** from the **Bank of England**.\n* **Price Action:** The index has shown significant **bullish momentum** since October 2020, with a total gain of **91.3%** in the last five years, but the expected growth seems to already be **baked into share prices**.\n* **Technical Outlook:** The **price target** for the **FTSE 100** has been raised to **9,700 points** by **Citigroup**, indicating a potential **5.1% gain**, with **3.2%** coming from **dividends**, while individual stocks like **Rolls-Royce** have a more substantial potential gain of **17%** with a **share price target** of **1,350p**.\n\n---\n**Overall Sentiment:** **Cautiously bullish** 📈",
        "source_articles": [
            {
                "title": "£5,000 invested in the FTSE 100 5 years ago is now worth… - Fool UK",
                "source": "Fool UK",
                "url": "https://www.fool.co.uk/2025/10/13/5000-invested-in-the-ftse-100-5-years-ago-is-now-worth/",
                "body": "Since the pandemic, the FTSE 100 has vastly outperformed. Historically, the UK’s flagship index has generated an average total annualised return of 8%. But since October 2020, it’s been moving at a far more impressive pace.\nIn fact, including dividends, passive index investors have earned a solid 91.3% total gain in the last five years. That’s the equivalent of 13.9% a year, enough to transform a £5,000 initial investment into £9,567. Yet that pales in comparison to what some FTSE 100 stocks have achieved. Rolls-Royce (LSE:RR.), for example, is up 1,424%, rewarding some stock pickers with £76,200!\nOf course, past performance doesn’t guarantee future results. So the question now is, how much money could investors make from the FTSE 100 and Rolls-Royce if they invest £5,000 today?\nInspecting forecasts\nLet’s start with the index. The outlook from institutional investors regarding the UK’s largest businesses seems to be fairly positive. Analysts at Citigroup have flagged further room for upward momentum as global earnings are expected to recover in 2026. Don’t forget, most of the profits from FTSE 100 companies come from international markets.\nCombining this with expected artificial intelligence (AI)-fuelled productivity gains and further interest rate cuts from the Bank of England, the investment bank’s recently raised its price target from 9,300 to 9,700 points.\nSadly, that’s not actually much higher than where the index sits today. Assuming the projection’s accurate, that translates into a 5.1% gain, 3.2% of which comes from dividends. In other words, most of the expected growth seems to already be baked into share prices on average. And a £5,000 investment may only grow to £5,257 by this time next year.\nWhat about Rolls-Royce shares? Here, the story’s a bit more interesting. Even after its massive surge, management’s continued guidance of higher earnings and free-cash flow generation has resulted in a strong bullish sentiment. So much so, that the analysts at UBS have place a share price target of 1,350p by this time next year.\nWhen combined with the stock’s 0.65% dividend yield, that translates into a far more substantial 17% potential gain – turning £5,000 into £5,851.\nAre these expectations realistic?\nSeeing a slowdown in growth after such a strong period is fairly standard in the stock market, especially when valuations are reaching new all-time highs.\nHowever, for Rolls-Royce, it’s important to note that UBS’s projection is among the most optimistic. There’s a strong bull case to be made regarding operational execution, improved cash conversion, alongside structural and cyclical tailwinds within the energy, defence, and aerospace markets.\nHowever, there’s a risk that this may change in the near future. The bulk of revenue still comes from servicing civil aircraft, linking the business to the long-haul travel market.\nBut with fears of a weaker economic outlook in the UK and US, travel demand could begin to suffer, slowing Rolls-Royce’s momentum. And for a stock already trading at a premium, that could open the floodgates to share price volatility.\nThat’s why not all institutional analysts are as optimistic as UBS. And it’s why I think there are other FTSE 100 opportunities that are looking far more attractive to consider right now."
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "196.500",
            "open": "24,370.070",
            "close": "24,438.070",
            "high": "24,462.820",
            "low": "24,266.320"
        },
        "market_summary": "### GER40 Market Briefing\n\n* **Key Drivers:** The German DAX index closed higher, led by a gain of **0.55%**, as investors reacted to upbeat trade signals and hopes for third-quarter earnings, despite signs of strain in export growth.\n* **Price Action:** The DAX index showed a **0.60%** gain, with **Siemens** climbing **1.57%** after partnering with Airbus on cutting industrial emissions, indicating a cautious optimism in the market.\n* **Technical Outlook:** The index's muted gain signals that investors are still playing it safe, with persistent worries about slowing exports and simmering geopolitical tensions meaning that market swings could return if uncertainty flares up again, with **wholesale prices** rising **1.2%** year over year.\n\n---\n**Overall Sentiment:** Cautious 📈",
        "source_articles": [
            {
                "title": "Major European indices close higher led the German DAX - investingLive",
                "source": "investingLive",
                "url": "https://investinglive.com/stock-market-update/major-european-indices-close-higher-led-the-german-dax-20251013/",
                "body": "The major European stock indices are closing the day marginally higher led by the German DAX with a gain of 0.55%. A snapshot of the closing levels shows:\n- German DAX +0.55%\n- France's CAC, +0.07%\n- UK's FTSE 100, +0.18%\n- Spain's Ibex, +0.40%\n- Italy's FTSE, +0.14%\nAs London/European traders look to end the trading day, the major US indices are also higher helped by the return of hostages and cease-fire in Israel.\n- Dow industrial average is up 620 points or 1.36% at 46100\n- S&P index is up 99.97 points or 1.53% at 6652.73\n- NASDAQ index is up 439 points or 1.90% to 22643.16\nThe US debt market is closed today in observance of Columbus Day.\nIn other markets:\n- Crude oil is higher by $0.81 and $59.70\n- Gold traded to a new high at $4103.02. It is currently trading up $78 or 1.95% at $4096.30\n- Silver also reached a new all-time high and is trading up $1.43 or 2.81% and $51.55.\n- Bitcon does not have the alternative investment bid. It is currently trading down $600 at $114,480"
            },
            {
                "title": "German DAX Index Closes Higher; Siemens Gains - MarketScreener",
                "source": "MarketScreener",
                "url": "https://www.marketscreener.com/news/german-dax-index-closes-higher-siemens-gains-ce7d5ad8d180f121",
                "body": "Access Denied\nYou don't have permission to access \"http://www.marketscreener.com/news/german-dax-index-closes-higher-siemens-gains-ce7d5ad8d180f121\" on this server.\nReference #18.18172117.1760420972.ac911ec8\nhttps://errors.edgesuite.net/18.18172117.1760420972.ac911ec8"
            },
            {
                "title": "German Stocks Edge Up As Investors Eye Global Politics - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/german-stocks-edge-up-as-investors-eye-global-politics",
                "body": "DAX closed higher as upbeat sentiment followed tariff signals from the US and hopes for third-quarter earnings, even as export growth showed signs of strain.\nabout 14 hours ago • 2 mins\nJoin the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nGerman stocks nudged higher on Monday, with the DAX index closing up 0.60%, as investors reacted to upbeat trade signals and kept an eye on the upcoming third-quarter earnings season.\nWhat does this mean?\nGermany’s market mood steadied after US officials hinted at a softer approach on tariffs against China, cooling fears of fresh export controls and renewed trade tensions. Just days earlier, the threat of steep tariffs and tighter restrictions had unsettled investors, but the more measured tone helped stabilize sentiment. Deutsche Bank Research points out that volatility is still closely tied to recession concerns, especially as political talks between the US and China evolve. Meanwhile, Europe’s political landscape remained in focus – with budget debates in France and Middle East peace talks in Egypt adding to the cautious mood. On the data front, Germany’s export growth continued to lose steam as the HCOB PMI Export Conditions Index ticked down in September, while wholesale prices rose 1.2% year over year, mainly thanks to higher costs for essentials and industrial materials.\nWhy should I care?\nFor markets: Cautious optimism takes the wheel.\nA pause in heated trade rhetoric offered a small boost to stocks, but the DAX’s muted gain signals that investors are still playing it safe. Siemens climbed 1.57% after partnering with Airbus on cutting industrial emissions, with Airbus shares barely higher, up 0.17%. Persistent worries about slowing exports and simmering geopolitical tensions mean that market swings could return if uncertainty flares up again.\nThe bigger picture: Politics and trade shape the industrial outlook.\nGermany’s export-driven economy is feeling the squeeze from changing global demand and ongoing political uncertainties. Robust shipments to Asia and North America are steadying exports for now, but weak momentum in the eurozone – Germany’s biggest trading region – and budget battles in France are risks to watch. With wholesale prices rising and global leaders negotiating trade and peace, German industry is navigating an unpredictable environment.\nWe’re not talking about dating here. (But boy, wouldn’t that be nice.) Your broker – your trading partner – should have those qualities, see.\nYou want:\nThe site’s easy on the eyes, too: you’re looking good, Tradu.\n65% of retail CFD accounts lose money. Your capital is at risk.\nMentioned in story\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nInsight\nStéphane Renevier, CFA • about 14 hours ago\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article is based on reporting by MT Newswires. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies."
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "346.500",
            "open": "24,556.450",
            "close": "24,730.240",
            "high": "24,788.450",
            "low": "24,441.950"
        },
        "market_summary": "### NDX100 Market Briefing\n\n* **Key Drivers:** The recent earnings season, particularly **Fastenal's (NASDAQ:FAST) Q3 earnings**, showed revenue growth of **11.7%** year-over-year, meeting Wall Street's expectations. However, the **tech sector** suffered losses due to tariff concerns and a decline in crude oil prices, impacting **NDX100** components like **Apple**, **Broadcom**, **Intel**, and **Nvidia**.\n* **Price Action:** The **NDX100** index has been under pressure, with **US Tech Stocks** looking to pare losses after a sharp decline. The **Morningstar US Technology Index** fell **2.5%** over the week, with hardware manufacturers being particularly hard-hit.\n* **Technical Outlook:** Immediate support for the **NDX100** is near the **15,000** level, with resistance at **16,000**. The index's **bullish momentum** has been impacted by the recent decline in tech stocks, but the overall **technical outlook** remains **neutral**.\n\n---\n**Overall Sentiment:** **Bearish** 📉",
        "source_articles": [
            {
                "title": "Fastenal’s (NASDAQ:FAST) Q3 Earnings Results: Revenue In Line With Expectations - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/fastenal-nasdaq-fast-q3-earnings-121224060.html",
                "body": "Industrial supplier Fastenal (NASDAQ:FAST) met Wall Street’s revenue expectations in Q3 CY2025, with sales up 11.7% year on year to $2.13 billion. Its GAAP profit of $0.29 per share was in line with analysts’ consensus estimates.\nIs now the time to buy Fastenal? Find out in our full research report.\nFastenal (FAST) Q3 CY2025 Highlights:\n-\nRevenue: $2.13 billion vs analyst estimates of $2.13 billion (11.7% year-on-year growth, in line)\n-\nEPS (GAAP): $0.29 vs analyst estimates of $0.30 (in line)\n-\nAdjusted EBITDA: $485.9 million vs analyst estimates of $495.9 million (22.8% margin, 2% miss)\n-\nOperating Margin: 20.7%, in line with the same quarter last year\n-\nFree Cash Flow Margin: 15.3%, up from 12.4% in the same quarter last year\n-\nSales Volumes rose 8.7% year on year (11.8% in the same quarter last year)\n-\nMarket Capitalization: $52.54 billion\nCompany Overview\nFounded in 1967, Fastenal (NASDAQ:FAST) provides industrial and construction supplies, including fasteners, tools, safety products, and many other product categories to businesses globally.\nRevenue Growth\nA company’s long-term sales performance is one signal of its overall quality. Any business can put up a good quarter or two, but many enduring ones grow for years. Luckily, Fastenal’s sales grew at a decent 7.5% compounded annual growth rate over the last five years. Its growth was slightly above the average industrials company and shows its offerings resonate with customers.\nLong-term growth is the most important, but within industrials, a half-decade historical view may miss new industry trends or demand cycles. Fastenal’s recent performance shows its demand has slowed as its annualized revenue growth of 4.8% over the last two years was below its five-year trend.\nWe can dig further into the company’s revenue dynamics by analyzing its number of units sold, which reached 133,910 in the latest quarter. Over the last two years, Fastenal’s units sold averaged 11.1% year-on-year growth. Because this number is better than its revenue growth, we can see the company’s average selling price decreased.\nThis quarter, Fastenal’s year-on-year revenue growth was 11.7%, and its $2.13 billion of revenue was in line with Wall Street’s estimates.\nLooking ahead, sell-side analysts expect revenue to grow 9.8% over the next 12 months, an improvement versus the last two years. This projection is admirable and suggests its newer products and services will fuel better top-line performance.\nSoftware is eating the world and there is virtually no industry left that has been untouched by it. That drives increasing demand for tools helping software developers do their jobs, whether it be monitoring critical cloud infrastructure, integrating audio and video functionality, or ensuring smooth content streaming. Click here to access a free report on our 3 favorite stocks to play this generational megatrend."
            },
            {
                "title": "Markets Brief: Are Q3 Earnings Expectations Too High? - Morningstar",
                "source": "Morningstar",
                "url": "https://www.morningstar.com/markets/markets-brief-all-eyes-tech-stocks-after-last-weeks-china-tariffs-announcement",
                "body": "Markets Brief: Are Q3 Earnings Expectations Too High?\nPlus: Crypto and the search for a safe haven.\nUS Tech Stocks Look to Pare Losses\nThe recent rally in stocks reversed sharply on Friday as tariff concerns dominated headlines, reminding investors that cutting-edge technologies still depend on one of the oldest industries: mining. Following the implementation of new export rules by China, which produces about 70% of ‘rare earths’ (source: mining-technology.com), the Trump administration threatened to impose 100% tariffs on Chinese goods from Nov. 1.\nHowever, after President Donald Trump struck a more conciliatory tone on China on social media over the weekend, US stocks were set to pare losses at the market open on Monday.\nPredictably though, last week the Morningstar US Technology Index bore the brunt of Trump’s latest tariffs announcement, falling 2.5% over the week with hardware manufacturers Apple AAPL (down 3.4%), Broadcom AVGO (down 6%), Intel INTC (down 3.9%) and Nvidia NVDA (down 5%) particularly hard-hit. The decline also extended to consumer cyclical stocks (down 3.6%) as Tesla TSLA fell 5.1%. Although consumer defensives (up 0.5%) and utilities (up 1.3%) provided some diversification benefit for investors, all other sectors fell.\nPeriods like this can tempt investors to narrow their focus and let biases shape short-term forecasts that drive portfolio changes. This is dangerous as the near-term path of prices is always unpredictable and consequently, investors run the risk of being ‘whipsawed’ as changes are made to portfolios. Before acting, it is important to remember that these episodes (and even much deeper crises) should not result in permanent damage to a well-structured portfolio and are, instead, a normal part of the journey that is experienced by all successful investors.\nEnergy Stocks Hit By Crude Oil Price Slide\nDespite the technology-focused headlines, the steepest declines were to be found in the energy sector (down 4.1%) as the price of crude oil fell 5.4%. While the proximate cause of this decline was the ceasefire agreement in Gaza and the expectation of declining tension in the Middle East, it is worth noting that energy prices have been weak over the past year on fears that production will outstrip demand. The negative sentiment caused by this imbalance has driven energy companies from trading at a small premium to Morningstar’s estimate of fair value to a significant discount over the last 18 months. Morningstar’s Joshua Aguilar examines the well of opportunities created by this decline here.\nSpotlight on Crypto in Hunt for Safe Havens\nThe sharp fall in bitcoin and ethereum last week highlighted the weakness of cryptocurrencies as an effective diversifier for stocks. Rather than providing a safe haven, they instead delivered accelerated exposure to investor uncertainty.\nIn contrast, government bonds played their traditional diversifier role, rising 0.5%. However, credit investors fared less well as spreads, the additional yield credit investors receive for accepting default risk, rose from near historic lows, leading to a 0.8% fall in US high yield bonds over the week. This rise in credit risk coincided with the high-profile bankruptcy of auto-parts supplier First Brands. The debt of this company was held by several alternative credit funds, highlighting the importance of understanding the composition of novel strategies. Max Curtin unpacks that exposure in this article.\nEarnings Season Set to Pack a Punch\nAs we enter the first big week of earnings season, analysts are expecting strong results. In contrast to most quarters, forecasts of company profits have been rising in the preceding weeks. Companies tend to guide down analysts forecasts in a transparent attempt to raise the stock price when they subsequently deliver a positive ‘surprise’ in the results. The absence of this negative guidance creates the possibility of a genuine surprise. This view will be tested first by the financial services s"
            },
            {
                "title": "Will VusionGroup S.A. (S4M) stock beat Nasdaq index returns - July 2025 Fed Impact & Accurate Buy Signal Notifications - newser.com",
                "source": "newser.com",
                "url": "https://chat.whatsapp.com/IpG3ceTq4Qe1fyovigBgQG",
                "body": "Stay connected with voice and video.\nSay it with stickers, voice, GIFs and more.\nMessaging features you need to connect in groups.\nStay updated on topics you care about.\nGet help with anything, all with the safety and privacy on WhatsApp.\nShare your everyday with photos, videos and voice notes.\nLayers of protection to help you stay safe.\nFollow this link to join"
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "68.170",
            "open": "6,621.970",
            "close": "6,648.490",
            "high": "6,670.000",
            "low": "6,601.830"
        },
        "market_summary": "### SPX500 Market Briefing\n\n* **Key Drivers:** No relevant information found in the provided articles regarding **SPX500** key drivers.\n* **Price Action:** No relevant information found in the provided articles regarding **SPX500** price action.\n* **Technical Outlook:** No relevant information found in the provided articles regarding **SPX500** technical outlook.\n\n---\n**Overall Sentiment:** No relevant information found in the provided articles to determine the overall sentiment of **SPX500**",
        "source_articles": [
            {
                "title": "Fight breaks out after Lions S Brian Branch smacks JuJu Smith-Schuster in the helmet after loss to Chiefs - Yahoo Sports",
                "source": "Yahoo Sports",
                "url": "https://sports.yahoo.com/nfl/breaking-news/article/fight-breaks-out-after-lions-s-brian-branch-smacks-juju-smith-schuster-in-the-helmet-after-loss-to-chiefs-on-sunday-night-032519537.html",
                "body": "Fight breaks out after Lions S Brian Branch smacks JuJu Smith-Schuster in the helmet after loss to Chiefs on Sunday night\nThings got extremely heated in the final seconds of the Kansas City Chiefs’ win over the Detroit Lions on Sunday night.\nAs the two teams took the field at Arrowhead Stadium to shake hands with the final seconds ticking off the clock, Lions safety Brian Branch reached out and hit Kansas City Chiefs wide receiver JuJu Smith-Schuster in his facemask after blowing past Chiefs quarterback Patrick Mahomes, who looked like he was trying to shake his hand though Branch ignored him.\n[Yahoo Sports TV is here! Watch live shows and highlights 24/7]\nThat sent Smith-Schuster down to the ground. He jumped back up and went after Branch with a few others as the scuffle escalated. The fracas took officials and coaches a few minutes to sort out.\nThings eventually calmed down and both teams left the field without further issue. Smith-Schuster walked off the field holding a towel to his face, and Chiefs head coach Andy Reid said that there is \"pretty good damage\" to his nose.\nThe scuffle is sure to lead to fines from the league, at a minimum, in the coming days.\n\"I did a little childish thing, but I'm tired of people doing stuff in between the play and refs don't catch it,\" Branch said after the game, via The Athletic’s Colton Pouncy. \"They be trying to bully me out there.\n“I should’ve never did it. It was childish.\"\nBranch said that Smith-Schuster specifically hit him in the back at one point in the game while trying to make a block, and that it wasn’t called for a penalty.\n“I got blocked in the back illegally, and it was in front of the ref,” Branch said. “The ref didn't do anything. Just stuff like that. I could've got hurt off of that, but I still should not have done that.”\nThat hit in question came near the end of the fourth quarter, where Branch seemed to be blindsided by Smith-Schuster and knocked to the ground.\nLions head coach Dan Campbell called out Branch after the game, too.\n\"I love Brian Branch,\" Campbell said, \"but what he did is inexcusable. It's not going to be accepted here. It's not what we do, it's not what we're about. I apologized to [head] coach [Andy] Reid and the Chiefs and Schuster. That's not OK. That's not what we do here and it's not going be OK. He knows it and our team knows it. \"\nThe outburst came after the Chiefs surged ahead in the second half to beat the Lions, 30-17, on Sunday night. They took a three-point lead into the locker room at halftime, and then Hollywood Brown scored his first of two second-half touchdowns on KC's first drive of the third quarter to take all momentum away from the Lions.\nMahomes went 22-of-30 passing for 257 yards with three touchdowns and ran for another score in the win for the Chiefs, who now sit at 3-3. Isaiah Pacheco had 51 yards on 12 carries, and Travis Kelce had 78 yards on six catches. Smith-Schuster had 57 yards on three catches.\nJared Goff completed 23 of 29 for 203 yards with two touchdowns for the Lions, who had won four straight games entering Sunday. Jahmyr Gibbs had 65 yards on 17 carries, and Jameson Williams had 66 yards and a score on six catches.\nBranch, now in his third season in the league, had seven total tackles."
            },
            {
                "title": "NFL Reveals Punishment for Lions S Brian Branch - Newsweek",
                "source": "Newsweek",
                "url": "https://www.newsweek.com/sports/nfl/brian-branch-suspended-nfl-lions-10874175",
                "body": "Sunday night's matchup between the Kansas City Chiefs and Detroit Lions got chippy towards the end of the game. Lions safety Brian Branch took issue with Chiefs wide receiver JuJu Smith-Schuster appearing to block him in the back late in the fourth quarter.\nMore News: Lions’ Brian Branch Reveals Why He Punched Chiefs WR Juju Smith-Schuster\nBranch refused to shake the hand of Chiefs quarterback Patrick Mahomes after the contest. The safety then slapped Smith-Schuster, causing the wide receiver to fall to the ground. A brawl between the Chiefs and Lions broke out soon after.\nMore News: Huge Brawl Breaks Out at End of Chiefs-Lions Game\nPer Ian Rapoport of the NFL Network, the league suspended Branch one game without pay. He will miss Detroit's contest against the Tampa Bay Buccaneers on \"Monday Night Football\" in Week 7.\n\"Lions S Brian Branch, who popped Chiefs WR JuJu Smith-Schuster in the face after the loss to KC, was suspended one game by the NFL,\" Rapoport posted on X. \"Detroit plays the Bucs on MNF.\"\nIn his ruling, Jon Runyan, NFL vice president of football operations, called Branch's actions \"aggressive\" and \"unwarranted.\"\n“Your aggressive, non-football act was entirely unwarranted, posed a serious risk of injury, and clearly violated the standards of conduct and sportsmanship expected of NFL players,\" Runyan wrote, via a post from Rapoport. \"Your conduct reflected poorly on the NFL and has no place in our game.”\nWhen speaking to reporters after the game, Branch apologized and called his actions \"childish.\"\nLions head coach Dan Campbell called out Branch for his behavior.\n“It’s not going to be accepted here,” Campbell said. “It’s not what we do, it’s not what we’re about … That’s not OK. That’s not what we do here, and it’s not going to be OK.\"\nBranch's absence could be significant against the Buccaneers. Tampa Bay quarterback Baker Mayfield has entered the chatter for the league MVP by having a solid season through his first six games. The Buccaneers are 5-1.\n(Update): Per Rapoport, Branch is appealing the NFL's ruling.\nThe Lions dropped to 4-2 with the 34-17 loss to Kansas City on \"Sunday Night Football.\"\nFor more on the Lions and the NFL, head to Newsweek Sports."
            },
            {
                "title": "Lions S Brian Branch Issued One-Game Suspension - ProFootballRumors.com",
                "source": "ProFootballRumors.com",
                "url": "https://www.profootballrumors.com/2025/10/lions-s-brian-branch-issued-one-game-suspension",
                "body": "11:06pm: Branch is indeed appealing his one-game suspension, per NFL Network’s Ian Rapoport and ESPN’s Jeremy Fowler. However, the NFL’s language in their letter informing Branch of his suspension makes it seem unlikely that he will succeed.\n“Your aggressive, non-football act was entirely unwarranted, posed a serious risk of injury, and clearly violated the standards of conduct and sportsmanship expected of NFL players,” the statement read (via Dave Birkett of the Detroit Free Press).\n4:30pm: Brian Branch will be unavailable to the Lions in Week 7. The third-year safety was issued a one-game suspension on Monday, per a league announcement.\nAfter last night’s Lions-Chiefs game, Branch slapped Kansas City wideout JuJu Smith-Schuster (video link). A brief skirmish ensued, leading to the expectation supplemental discipline would be handed down. The NFL reviewed the incident and issued the ban.\nBranch has already been fined 13 times in his career despite only playing 41 combined regular and postseason games to date. Given his history in that regard, issuing a suspension does not entirely come as a surprise from the league’s perspective. The 2023 Pro Bowler can appeal the ban; if he does so, one of the jointly-appointed hearing officers will oversee the matter.\nWhen speaking to reporters Sunday night, Branch admitted he should not have initiated the altercation with Smith-Schuster but added he felt the Chiefs were attempting to “bully” him during the game (video link via ESPN’s Eric Woodyard). Head coach Dan Campbell termed Branch’s actions “inexcusable,” meaning team discipline of some kind may have been forthcoming anyway.\nRegardless of what happens on that front, the Lions are now set to be without a critical member of their secondary pending a successful appeal. Branch has operated as a full-time defensive starter for most of his career, and the former second-rounder recorded 109 tackles in 2024 while adding double-digit pass deflections for the second year in a row. Branch had enjoyed a productive start to his season, but he will now miss the final game before Detroit’s bye week.\nThe Lions’ secondary is already shorthanded with D.J. Reed on injured reserve and fellow cornerback Terrion Arnold out of the lineup as well. Branch has experience as a slot corner but his ideal position is safety, where he has formed an effective tandem with Kerby Joseph (who has himself battled injuries as well despite playing every game this season).\nDetroit’s loss last night dropped the team to 4-2 on the year. The team’s secondary will face a strong test against the Buccaneers in Week 7, but that unit will be without a key figure."
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "810.000",
            "open": "46,204.200",
            "close": "46,933.490",
            "high": "47,014.200",
            "low": "46,204.200"
        },
        "market_summary": "### JPN225 Market Briefing\n\n* **Key Drivers:** Uncertainty surrounding Japan's next premier and **U.S.-China trade tensions** are weighing on the market, with the **Komeito Party's withdrawal** from the ruling coalition introducing uncertainty about the establishment of the Hoshina administration.\n* **Price Action:** The **Nikkei 225** fell approximately **550 yen**, trading at around **47,540 yen**, and hit an intraday low of **47,328.55 yen**, showing significant **bearish** momentum.\n* **Technical Outlook:** Immediate support is near the recent low of **47,328.55 yen**, with resistance at **47,540 yen**, and the **yen-denominated settlement value** of the Chicago Nikkei 225 futures fell by **605 yen** compared to the Osaka Exchange’s closing price on October 10, settling at **47,015 yen**.\n\n---\n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "The Nikkei Average fell approximately 550 yen, remaining weak after an initial sell-off = Morning session on the 14th. - 富途牛牛",
                "source": "富途牛牛",
                "url": "https://news.futunn.com/en/post/63221926/the-nikkei-average-fell-approximately-550-yen-remaining-weak-after",
                "body": "At around 10:08 a.m. on the 14th, the Nikkei Stock Average was trading approximately 550 yen lower than the previous Friday at around 47,540 yen. At 9:15 a.m., it hit an intraday low of 47,328.55 yen, down 760.25 yen from the previous Friday’s close. On October 10, the previous Friday, the Komeito Party announced its withdrawal from the ruling coalition with the Liberal Democratic Party. This has introduced uncertainty regarding the establishment of the Hoshina administration that the market had previously anticipated. Additionally, U.S. President Donald Trump's announcement of an additional 100% tariff on Chinese goods appears to have triggered caution, leading to weak market performance. The yen-denominated settlement value of the Chicago Nikkei 225 futures fell by 605 yen compared to the Osaka Exchange’s closing price on October 10, settling at 47,015 yen.\nBy industry, 29 out of 33 sectors were declining while four sectors were rising. Rubber product stocks such as Bridgestone (5108.T) and pharmaceutical shares like Chugai Pharmaceutical (4519.T), Daiichi Sankyo (4568.T) were down. Communication-related shares such as NTT (9432.T) and SoftBank Group (9984.T), as well as precision equipment stocks including Olympus (7733.T) and HOYA (7741.T) also performed poorly. Electrical machinery shares like Hitachi (6501.T) and Sony Group (6758.T), along with service sector stocks such as Secom (9735.T) and Recruit Holdings (6098.T) were weak. Futures-related securities stocks from Daiwa Securities Group (8601.T) and Nomura (8604.T), and banking shares from Sumitomo Mitsui (8316.T) and Mizuho (8411.T) also showed weakness. Conversely, steel stocks such as Nippon Steel (5401.T) and JFE Holdings (5411.T), as well as shipping stocks including NYK Line (9101.T) and Mitsui O.S.K. Lines (9104.T) were higher.\nElsewhere, shares of Chiyoda Corporation (8185.T), JINS Holdings (3046.T), Sansan (4443.T), MRO (3064.T), and Marmae (6264.T) declined. Meanwhile, Giken Seisakusho (6289.T), Link-U (4446.T), Ryohin Keikaku (7453.T), Takeuchi Manufacturing (6432.T), and Yoko Engineering (6330.T) rose.\nIn the Tokyo foreign exchange market, at 10:08 a.m., the dollar-yen rate was trading in the mid-152 yen range (compared to 152.84-86 yen on October 10, the previous Friday), and the euro-yen rate was trading in the lower 176 yen range (compared to 176.95-99 yen).\nProvided by: Wealth Advisor Co."
            },
            {
                "title": "Japan's Nikkei slips as market frets over premiership, US-China tensions - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/reuters.com,2025:newsml_L2N3VV028:0-japan-s-nikkei-slips-as-market-frets-over-premiership-us-china-tensions/",
                "body": "Japan's Nikkei slips as market frets over premiership, US-China tensions\nBy Kevin Buckland\nJapan's Nikkei share average sank on Tuesday after reopening from a long weekend, pressured by uncertainty surrounding the country's next premier and persistent U.S.-China trade tensions.\nThe Nikkei NI225 ended the morning session down 1.2% at 47,520.57, with just 31 of its 225 components rising, 192 declining and two trading flat.\nThe broader Topix TOPIX slid 1.4% to 3,153.50.\nJapanese investors returning from a national holiday on Monday faced a complex global backdrop, including a stronger yen and Wall Street sell-off on Friday. While both saw partial reversals, market sentiment remained fragile as shifting signals from U.S. President Donald Trump continued to unsettle traders.\nOn balance, weaker U.S. stocks and a stronger yen since the start of Japan's extended weekend weighed on the market, said Maki Sawada, an equity strategist at Nomura Securities.\nIn addition, the initial euphoria from fiscal dove Sanae Takaichi's election as leader of the Liberal Democratic Party at the start of the month has faded after coalition partner Komeito pulled support. This opened a small possibility of an opposition party leader being elected prime minister by parliament later this month. Local media say October 20 or 21 are likely dates for the vote.\n\"The decline of the 'Takaichi trade' is one reason\" for weakness in Japanese stocks on Tuesday, Sawada said. \"Political uncertainty is weighing.\"\nExporters, whose overseas revenue is crimped by a stronger currency, dropped on Tuesday, with Toyota 7203 down 1.1%. Tyremakers also experienced outsized declines, making the rubber (.IRUBR.T) sector the worst performer among the Tokyo Stock Exchange's 33 industry groups.\nSoftBank Group 9984 slumped 3.8%, extending its pullback from a record high on Thursday as the heavyweight startup investor continued to retreat.\nStill, many chip-sector shares advanced, tracking upbeat performances among Wall Street peers overnight. Lasertec 6920 rose 3% and Sumco 3436 gained 2.5%.\n\"Expectations for growth in artificial intelligence remain in place,\" said Nomura's Sawada.\nElsewhere, Muji owner Ryohin Keikaku 7453 surged 12.3% following its earnings announcement after the closing bell on Friday, making it the Nikkei's top performing stock."
            },
            {
                "title": "Japan Stocks Look Lower, Sentiment Lifts Elsewhere: Markets Wrap - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/articles/2025-10-13/stock-market-today-dow-s-p-live-updates",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            }
        ]
    }
]