[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "39.610",
            "open": "3,734.880",
            "close": "3,749.180",
            "high": "3,761.700",
            "low": "3,722.090"
        },
        "market_summary": "Gold prices are holding near record highs above $3,700 per ounce, driven by strong central bank buying and a global shift away from the US dollar due to concerns over mounting US debt. The market is currently in a holding pattern, awaiting key US inflation data (PCE) for hints on the Federal Reserve's interest rate policy, which will provide the next major directional impetus. Despite a slight technical pullback, the fundamental drivers of economic uncertainty and dollar weakness continue to provide strong support.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Global gold rush sign of waning trust in US dollar - China Daily",
                "source": "China Daily",
                "url": "https://www.chinadaily.com.cn/a/202509/26/WS68d5f6fda3108622abca3177.html",
                "body": "Global gold rush sign of waning trust in US dollar\nA shift is quietly unfolding in the global financial system recently: for the first time since 1996, central banks worldwide now hold more gold than US Treasury securities. This is far more than a routine portfolio rebalancing—it is a potent signal of declining confidence in the US dollar and the sustainability of US debt.\nIn August, the US national debt surged past $37 trillion, a figure that translates to about $109,000 per US citizen. Even more alarming is its growth rate—$5.7 billion per day. The debt ceiling was raised by an additional $5 trillion this July as the US enacted the One Big Beautiful Bill Act, further enabling borrowing amid a cycle of relentless spending.\nThe consequences are already visible. Corporate investment is softening, hiring in the private sector has slowed dramatically, and households face stagnant wages alongside rising prices. Such trends often precede an economic downturn.\nAs US debt continues to mount, so do concerns over fiscal stability, currency credibility, and potential spillover effects worldwide. In response, central banks are turning to gold—a timeless store of value—to hedge against uncertainty and reduce dependence on the dollar.\nThis move reflects a sober reality: the world is preparing for a future less anchored by the US economy. The golden awakening of central banks may well mark the beginning of a new global financial order."
            },
            {
                "title": "Gold price today, Thursday, September 25: Gold opens at $3,768 with new jobs, inflation data on tap - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/personal-finance/investing/article/gold-price-today-thursday-september-25-gold-opens-at-3768-with-new-jobs-inflation-data-on-tap-115904972.html",
                "body": "Some offers on this page are from advertisers who pay us, which may affect which products we write about, but not our recommendations. See our Advertiser Disclosure.\nGold (GC=F) futures opened at $3,768.30 per ounce on Thursday, up 1% from Wednesday’s close of $3,732.10. The precious metal has remained above $3,700 since the close on September 22.\nAfter three Fed governors offered conflicting views on future interest rates earlier this week, investors will focus on new economic data for hints at the Fed’s next policy moves. The Department of Labor will report the September 20 weekly initial jobless claims data today. The expectation is an increase in claims to 235,000 from 231,000. Friday’s release of the August PCE index from the Bureau of Economic Analysis may also be telling. Analysts predict the monthly PCE will rise to 0.3% from 0.2% in July. The PCE is the Fed’s preferred inflation metric.\nGold stands to strengthen in multiple scenarios, since the precious metal tends to increase in value when interest rates decline and when the economic outlook becomes cloudy.\nCurrent price of gold\nThe opening price of gold futures on Thursday is up 1% from Wednesday’s close of $3,732.10 per ounce. Thursday’s opening price is up 3.1% from the opening price of $3,654.60 one week ago on September 18. In the past month, the gold futures price increased 12% compared to the opening price of $3,366 on August 25, 2025. Over the past year, gold is up 41.9% from the opening price of $2,656.30 on September 25, 2024.\n24/7 gold price tracking: Don't forget you can monitor the current price of gold on Yahoo Finance 24 hours a day, seven days a week.\nWant to learn more about the current top-performing companies in the gold industry? Explore a list of the top-performing companies in the gold industry using the Yahoo Finance Screener. You can create your own screeners with over 150 different screening criteria.\nHow to invest in gold\nInvesting in gold is a four-step process:\n-\nSet your goal.\n-\nSet an allocation.\n-\nChoose a form.\n-\nConsider your investment timeline.\nAfter deciding why you want to invest in gold and selecting the size and form of your gold investment, consider your investment timeline as a final suitability check.\nGold can be volatile. It has demonstrated extended periods of decline in the past. Extended periods of decline are not acceptable if your timeline is short. The risk is too great that gold's price will be down when you need to liquidate.\nAn extended holding period provides greater potential for reaching your investment goals. As an example, hedging against stock market declines or inflation is a long-term effort. These outcomes will continue to be risks as long as you own stocks or cash deposits. Holding gold as insurance against an economic calamity requires you to keep the asset until you need it.\nLearn more: How to invest in gold in 4 steps\nGold as a safety net\nA small gold position can act as a stabilizer for your stock portfolio and your purchasing power. If you choose physical gold stored at home, it can also stand in as currency in the worst of economic crises. Just know that gold has underperformed stocks in the past, so choose your target allocation accordingly.\nLearn more: What to know before buying gold, silver, or platinum from Costco\nPrice-of-gold chart\nWhether you’re tracking the price of gold since last month or last year, the price-of-gold chart below shows the precious metal’s steady upward climb in value.\nHistoric price of gold\nHistorically, gold has shown extended up cycles and down cycles. The precious metal was in a growth phase from 2009 to 2011. It then trended down, failing to set a new high for nine years.\nIn those lackluster years for gold, your position will negatively impact your overall investment returns. If that feels problematic, a lower allocation percentage is more appropriate. On the other hand, you may be willing to accept gold's underperforming years so you can benefit more in the good years."
            },
            {
                "title": "Gold Forecast: XAU/USD awaits the US PCE inflation for fresh impetus - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/analysis/gold-price-forecast-xau-usd-awaits-the-us-pce-inflation-for-fresh-impetus-202509260255",
                "body": "- Gold returns to the red below $3,750 early Friday, eyeing US PCE inflation.\n- US Dollar sits at three-week highs as US economic resilience counters Trump’s fresh tariffs.\n- Technically, Gold remains a ‘buy-the-dips’ trade but the upcoming US data holds the key.\nGold is back on its corrective journey below $3,750 in Friday’s Asian trades, after having staged a tepid bounce on Thursday. All eyes now remain on the US core Personal Consumption Expenditures (PCE) Price Index due later in the day for a fresh directional impetus.\nWill US PCE inflation revive the Gold record rally?\nReduced bets for aggressive interest rate cuts by the US Federal Reserve (Fed) this year offset renewed jitters fuelled by US President Donald Trump’s latest round of tariffs, helping the US Dollar (USD) holds its recent uptrend at the expense of Gold.\nEncouraging US data released on Thursday highlighted the economic resilience, pouring cold water on aggressive Fed easing expectations.\nUS Gross Domestic Product rose by an upwardly revised rate of 3.8% from April through June, higher than 3.3% initially reported.\nMeanwhile, the Labour Department reported 218,000 seasonally adjusted filings for the week ending September 20, down 14,000 from the prior week’s upwardly revised figure and below the consensus estimate of 235,000.\nAdditionally, Durable Goods Orders rebounded firmly by 2.9% in August versus the previously revised -2.7% and -0.5% expected.\nTrump on Thursday announced tariffs of up to 100% on imports of branded and patented pharmaceutical drugs, starting October 1. Trump also slapped 50% tariffs on imports of kitchen cabinets and bathroom vanities, 30% on upholstered furniture, and 25% on heavy trucks.\nMarkets weigh the latest Trump’s tariffs, while gearing up for the critical US PCE inflation data due later this Friday. The data will confirm whether the Fed will remain on track for two rate cuts this year.\nThe Fed’s preferred inflation measure, the core PCE Price Index, is expected to rise by 2.9% in August, at the same pace seen in July. The headline annual PCE inflation is set to tick higher to 2.7% in the same period, against July’s 2.6%.\nAn upside surprise to the core PCE print could bolster the USD rally and weigh further on the non-interest-bearing Gold price. A sudden increase in price pressure could further temper expectations of more Fed cuts.\nOn the other hand, a softer-than-expected US core PCE reading would be welcomed by the Fed\nIn the lead-up to the US PCE showdown, the FXStreet Fed Sentiment Index extends its foothold in the hawkish zone, trading near 114 as of writing, up from around 105 levels seen a day ago.\nGold price technical analysis: Daily chart\nTechnically, the bearish pressures seem to have eased a bit as the 14-day Relative Strength Index (RSI) moves out of the extreme overbought region.\nThe leading indicator currently trades at 71.50, down from 78 levels seen at the start of the week.\nIf the pullback regains momentum, the initial support is seen at the $3,700 threshold, below which Monday’s low of $3,684 will offer some comfort.\nFurther down, the $3,650 psychological barrier could come to the rescue of buyers.\nOn the other hand, buyers need acceptance above the $3,750 psychological level to revive the record rally.\nThe next topside hurdle is located at the lifetime high of $3,791, followed by the $3,800 barrier.\nA sustained and decisive break above the latter could fuel a fresh advance toward the $3,850 psychological level.\nInflation FAQs\nInflation measures the rise in the price of a representative basket of goods and services. Headline inflation is usually expressed as a percentage change on a month-on-month (MoM) and year-on-year (YoY) basis. Core inflation excludes more volatile elements such as food and fuel which can fluctuate because of geopolitical and seasonal factors. Core inflation is the figure economists focus on and is the level targeted by central banks, which are mandated to keep inflation at a manageable l"
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.155",
            "open": "68.753",
            "close": "69.241",
            "high": "69.318",
            "low": "68.163"
        },
        "market_summary": "Brent Crude prices faced downward pressure in August, averaging $67.26 per barrel, amid a broader decline in the OPEC Reference Basket. This is occurring despite steady global oil demand growth projections for 2025 and 2026. The market is further tightened by a significant draw on US distillate inventories due to strong export demand and refinery closures, increasing the risk of price volatility.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Top 5 OPEC African countries that produced the most oil in August 2025 - Business Insider Africa",
                "source": "Business Insider Africa",
                "url": "https://africa.businessinsider.com/local/markets/top-5-opec-african-countries-that-produced-the-most-oil-in-august-2025/wygt6dd",
                "body": "- Oil production remains a key economic driver for many African nations, significantly contributing to GDP and revenue.\n- The OPEC Reference Basket (ORB) value declined by $1.24 in August, averaging $69.73 per barrel.\n- The global economy sustained steady growth in 2025, supported by strong momentum in the year's first half.\n- Oil demand growth projections for 2025 and 2026 remain consistent, estimating increases of 1.3 mb/d and 1.4 mb/d year-over-year, respectively.\nOil production continues to be a reliable asset, contributing significantly to the GDP of many African countries and serving as a significant source of revenue. August has been no exception to the typical monthly fluctuations in this resource's output.\nRecommended articles\nThe value of the OPEC Reference Basket (ORB) fell by $1.24 month over month (m-o-m) in August, averaging $69.73/b.\nThe constant and robust momentum shown in the first half of 2025 has helped the global economy maintain its steady growth trajectory, according to the latest OPEC report.\nThe report also highlights that ICE Brent's front-month contract is down $2.29 month over month to average $67.26 per barrel, while the NYMEX WTI front-month contract fell $3.22 month over month to average $64.02 per barrel.\nAccording to the estimates in July, the global oil demand growth prediction for 2025 is still at around 1.3 million barrels per day (mb/d), year over year.\nIn 2025, the Organisation for Economic Co-operation and Development (OECD) expects oil demand to increase by around 0.1 mb/d, whereas the non-OECD expects it to increase by roughly 1.2 mb/d.\nGlobal oil demand is expected to increase by around 1.4 mb/d year over year in 2026, which is likewise unchanged from the estimate made last month.\nThe non-OECD is anticipated to increase by around 1.2 mb/d, year over year, whereas the OECD is predicted to rise by roughly 0.2 mb/d, year over year.\nAccording to this August’s estimate, World Oil Supply Non-DoC liquids output, that is, liquids production from nations that are not parties to the Declaration of Cooperation, is expected to increase by around 0.8 mb/d, year over year, in 2025.\nWith that said, here are the African countries with the highest oil production last month in thousand barrels per day (tb/d), according to OPEC’s latest report."
            },
            {
                "title": "US distillate inventories to end 2025, 2026 at multi-year lows - Oil & Gas Journal",
                "source": "Oil & Gas Journal",
                "url": "https://www.ogj.com/general-interest/economics-markets/news/55319209/us-distillate-inventories-to-end-2025-2026-at-multi-year-lows",
                "body": "US distillate inventories to end 2025, 2026 at multi-year lows\nKey Highlights\n- US distillate inventories are expected to be lower in 2025 and 2026 due to a combination of reduced domestic production and increased exports.\n- Refinery closures, including one in Houston and two in California, will decrease US petroleum distillate output, impacting inventory levels.\n- A significant inventory draw in first-half 2025 was driven by lower renewable diesel and biodiesel supply, leading to increased reliance on petroleum-based distillates.\n- Strong international demand, especially from European hubs, has supported US distillate exports, further reducing domestic inventories.\n- increased renewable diesel production in 2026 will partially offset the decline in distillate fuel oil production.\nTotal US distillate inventories in 2025 and 2026 are predicted to be lower than in previous years due to a significant inventory draw in 2025, strong export demand, and reduced domestic production due to refinery closures. The forcast was presented by the US Energy Information Administration (EIA) in its September Short-Term Energy Outlook (STEO).\nDistillates include motor diesel fuel and home heating oil. Drawdowns in distillate inventories increase the risk of price increases and price volatility from supply disruptions, particularly during periods of high demand, such as the fall harvest and winter heating season.\nEIA uses total distillates to examine the combination of distillates and biomass-based distillates, which are alternatives to distillates, including renewable diesel and biodiesel.\nA key factor in the low inventory forecast is the sharp inventory draw in first-half 2025. During this period, total US distillate inventories fell by 17%, or about 22 million bbl, exceeding the average decline of 10%, or 14 million bbl, over the same period in the previous 4 years.\nA primary factor contributing to the significant inventory draw in first-half 2025 is the reduced supply of renewable diesel and biodiesel, driven by lower production and lower net imports of these fuels. This reduced supply of renewable diesel and biodiesel leads to increased demand for petroleum-based distillates to fill the gap. While renewable diesel and biodiesel consumption in first-half 2025 decreases by 124,000 b/d, or 35%, compared with first-half 2024, petroleum distillate fuel oil consumption increases by around 170,000 b/d, or 5%.\n“We expect the first-half 2025 drop in biofuels consumption to be a short-term departure from the longer-term trend of biofuels increasing as a share of distillate consumption. We forecast renewable diesel and biodiesel consumption to partially recover in the second half of 2025 to meet existing and future production mandates under the Renewable Fuel Standard (RFS). We expect an increase in renewable diesel and biodiesel production will partially offset the increase in total distillate fuel oil consumption that we forecast in 2026, resulting in essentially flat distillate fuel oil inventories between December 2025 and December 2026,” EIA said.\nAnother factor contributing to the significant inventory draw in first-half 2025 is above-average distillate exports, supported by strong international demand. Since 2023, major European hubs such as the Netherlands and the UK have been importing more distillate from the US to replace Russian product.\nAccording to EIA data, during first-half 2025, US distillate exports averaged 1.2 million b/d, 7% above the previous 5-year average. Strong international distillate demand is expected to continue to exert downward pressure on US inventories through 2026.\nUS refinery closures also contribute to the low distillate inventory figures in 2026.\nLyondellBasell's Houston refinery closed in early 2025, and two other California refineries (with a combined refining capacity of 284,000 b/d) are scheduled to close over the next 2 years.\nThis loss of refining capacity is likely to lead to a decline in US production of pe"
            },
            {
                "title": "Halliburton acquires WellSense's advanced intervention solution - Oil Review Middle East",
                "source": "Oil Review Middle East",
                "url": "https://oilreviewmiddleeast.com/technical-focus/halliburton-acquires-wellsenses-advanced-intervention-solution",
                "body": "In a first divestment development for FrontRow Energy Technology Group, its subsidiary, WellSense, a rapid fibre-optic well diagnostics provider, has sold FiberLine Intervention licence to oilfield services company, Halliburton\nThe agreement terms secure a global licence for Halliburton to deploy WellSense FiberLine Intervention (Fli) technology for use in well stimulation monitoring.\nA FrontRow Energy Technology Group company, WellSense, will continue to deploy the technology globally for all other oil and gas applications, including well plug and abandonment (P&A), well integrity and leak detection, as well as carbon capture, utilisation and storage (CCUS).\nAnnabel Green, CEO of WellSense, said, “The successful completion of this deal is a defining moment for WellSense and for our parent company, FrontRow Energy Technology Group. Not only is it a strong industry endorsement of our technology and the value it delivers, but also our business model of bringing new and innovative solutions to market.\n“Our unique bare fibre dynamic despooling technology delivers superior data quality for a detailed subsurface understanding. Unlike other well monitoring techniques it provides a lightweight offline intervention solution with disposable probes for significant efficiency savings and reduced risk.\n“Meeting the complex challenges of upstream oil and gas requires the adoption of technologies that fundamentally improve how the industry operates. This agreement is the result of a decade of focused innovation, collaboration and delivery and I would like to extend my sincere thanks to all our employees, past and present, whose dedication has built the strong foundation that made this success possible.”\nSteve Kent, CEO of FrontRow, said,“This deal is a major milestone for FrontRow and is a clear example of how UK-born innovation can solve industry challenges and attract global attention.\n“This is FrontRow’s first commercial licence sale and a landmark in our journey. It demonstrates that innovation, when nurtured with the right expertise and support, can deliver technical success as well as real commercial value.”"
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.270",
            "open": "65.053",
            "close": "65.523",
            "high": "65.643",
            "low": "64.373"
        },
        "market_summary": "The U.S. shale industry is facing significant headwinds from political uncertainty and rising long-term costs. Executives report delayed investments due to policy volatility, while analysts project a major surge in breakeven prices due to depleting core inventory. This is set against a backdrop of stable but modest global demand growth and a recent monthly decline in crude oil prices.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "Shale oil execs say Trump policies are hurting investment, 'business is broken' - CNBC",
                "source": "CNBC",
                "url": "https://www.cnbc.com/2025/09/25/shale-oil-execs-say-trump-policies-are-hurting-investment-business-is-broken.html",
                "body": "Shale oil executives say President Donald Trump is hurting investment in the oil patch, and are giving a grim outlook for the future of the industry that turned the U.S. into the largest crude producer in the world.\nThe executives' anonymous comments were published in a quarterly survey of oil and gas companies by the Federal Reserve Bank of Dallas this week. The 139 companies that responded operate predominantly in Texas as well as northern Louisiana and southern New Mexico.\nTrump has championed fossil fuels while attacking the renewable energy industry since taking office in January. His One Big Beautiful Bill Act, passed by Congress in July, delivered virtually everything the oil lobby wanted.\nBut Trump's push for lower crude prices, higher tariffs, and the resulting uncertainty caused by his \"stroke of pen\" policies are hurting investment, executives at independent oil and gas producers told the Dallas Fed.\nNearly 80% of executives who participated in the survey said they have delayed investment decisions in response to heightened uncertainty about the future price of oil and the cost of producing crude.\n\"We have begun the twilight of shale,\" one executive said, pointing to layoffs by the thousands and industry consolidation under big companies like Exxon Mobil. \"The writing is on the wall,\" the unnamed manager said.\n'Drilling is going to disappear'\nAnother executive warned that \"drilling is going to disappear\" as Trump pushes for $40 per barrel crude oil at the same time his steel tariffs are raising costs. U.S. crude oil prices are currently trading around $65 per barrel, just above the level producers need to drill profitably.\nThe shale industry has been \"gutted\" over the course of the Biden and Trump administrations, another executive said. Political hostility from Biden chased away capital from the industry, the person said. Economic ignorance from Trump is \"finishing the job,\" they said.\n\"The U.S. shale business is broken,\" the executive said.\nThe Trump administration has effectively aligned itself with the decision by OPEC+ to increase oil supply, \"kneecapping U.S. producers in the process,\" the person said.\n\"Guided by a U.S. Department of Energy that tells them what they want to hear instead of hard facts, they operate with little understanding of shale economics,\" the same executive said.\nRegulatory costs\nA White House spokesperson said Trump is \"rolling back burdensome regulations that were killing the industry,\" crediting the president's policies with record production in June. Energy Secretary Chris Wright has repeatedly argued that the administration is making drilling cheaper by cuting red tape.\nBut 57% of executives surveyed by the Dallas Fed said regulatory changes since January have reduced their breakeven costs by less than $1 per barrel.\nAnother executive warned that Trump's attacks on the renewable energy industry will come back to haunt the oil and gas sector in a few years. Investors are avoiding energy due to volatility and the \"stroke of pen\" risk that the White House wields over energy projects, the person said.\n\"Life is long, and the sword being wielded against the renewables industry right now will likely boomerang back in 3.5 years against traditional energy,\" they said, warning the industry will face harsher methane penalties, permitting restrictions and environmental reviews when Democrats return to power."
            },
            {
                "title": "U.S. Shale Costs to Soar to $95 per Barrel Within a Decade - Crude Oil Prices Today | OilPrice.com",
                "source": "Crude Oil Prices Today | OilPrice.com",
                "url": "https://oilprice.com/Energy/Crude-Oil/US-Shale-Costs-to-Soar-to-95-per-Barrel-Within-a-Decade.html",
                "body": "The era of falling breakeven costs in the U.S. shale patch may soon come to an end, and a new era of higher costs and depleted core inventory could reduce America’s sway in meeting the global demand growth.\nThat’s the latest take from analytics firm Enverus Intelligence Research, which said in a new report this week that the marginal cost of U.S. oil supply is projected to rise from $70 per barrel WTI price at present, to as much as $95 per barrel by the mid-2030s. The expected $15 per barrel surge in costs would be driven by a shift from economically proven inventory to more speculative locations as the core inventory is depleting, according to Enverus Intelligence Research (EIR).\nSoaring Cost, Waning Global Influence\nThe looming depletion of North America’s core oil and gas inventory will have implications for global energy markets, especially the U.S. ability to meet global demand, Enverus’ report says.\n“North America’s dominance in supplying global oil demand growth is waning,” Alex Ljubojevic, director at EIR, said in a statement.\n“Over the next decade, its contribution to consumption growth is expected to fall below 50% — a stark contrast to the previous 10 years when it supplied more than 100%,” Ljubojevic added.\nRelated: Iraq Expects Kurdistan Oil Exports to Restart This Week\nStill, the Permian basin in West Texas and New Mexico and the Canadian oil sands are and will continue to be North America’s lowest-cost sources of scalable oil supply, Enverus reckons.\nThe oil sands would benefit from strong Western Canadian Select (WCS) prices and sunk infrastructure costs, and additional takeaway infrastructure capacity could unlock significant upsides to the estimates of Canadian oil production growth. Currently, Enverus expects Canada’s oil output to rise by 450,000 barrels per day (bpd) by 2030, up from an expected record-high for 2025.\nThe U.S. shale patch, however, will have to contend with flatter growth curves going forward amid oil prices close to current breakevens and depleting core inventory, which will make companies change investment strategies.\n“As core shale oil inventory in the U.S. depletes, the industry is entering a new era of higher costs and more complex development. This shift will reshape the cost curve and redefine investment strategies across the continent,” Enverus’ Ljubojevic said.\nU.S. Shale Slows Drilling\nAmid lower oil prices this year, the U.S. shale patch is in a wait-and-see mode, expecting to ride the price decline with minimal tweaks to strategies. U.S. oil producers are trimming capital expenditure budgets, relying on efficiency gains from current drilling activity to keep output levels.\nAmerican oil production is rising, due to the lag between oil price slides and drilling, but large shale producers are already calling the peak of oil output, despite the Trump Administration’s best efforts to support the fossil fuels industry.\nFor example, efficiency gains, as well as synergies from the Endeavor merger and lower service costs, allowed Diamondback Energy to reduce its 2025 capital budget by another $100 million, or about 3%, from the prior midpoint, to $3.4 - $3.6 billion.\n“With volatility and uncertainty persisting, we see no compelling reason to increase activity this year,” CEO Kaes Van't Hof told shareholders in a letter in early August.\nSince the Q1 letter to shareholders, Diamondback “Continue to believe that, at current oil prices, U.S. shale oil production has likely peaked and activity levels in the Lower 48 will remain depressed,” Van't Hof said.\nHigher costs and continued uncertainty, including with U.S. trade policies, led to another decline in oil and gas activity in the Permian, executives from producers and services firms said in the latest Dallas Fed Energy Survey published this week.\nIn the survey, most executives, 57%, estimate that regulatory changes since the Trump Administration took over in January 2025 have reduced their firms’ breakeven costs for new wells by less than"
            },
            {
                "title": "Top 5 OPEC African countries that produced the most oil in August 2025 - Business Insider Africa",
                "source": "Business Insider Africa",
                "url": "https://africa.businessinsider.com/local/markets/top-5-opec-african-countries-that-produced-the-most-oil-in-august-2025/wygt6dd",
                "body": "- Oil production remains a key economic driver for many African nations, significantly contributing to GDP and revenue.\n- The OPEC Reference Basket (ORB) value declined by $1.24 in August, averaging $69.73 per barrel.\n- The global economy sustained steady growth in 2025, supported by strong momentum in the year's first half.\n- Oil demand growth projections for 2025 and 2026 remain consistent, estimating increases of 1.3 mb/d and 1.4 mb/d year-over-year, respectively.\nOil production continues to be a reliable asset, contributing significantly to the GDP of many African countries and serving as a significant source of revenue. August has been no exception to the typical monthly fluctuations in this resource's output.\nRecommended articles\nThe value of the OPEC Reference Basket (ORB) fell by $1.24 month over month (m-o-m) in August, averaging $69.73/b.\nThe constant and robust momentum shown in the first half of 2025 has helped the global economy maintain its steady growth trajectory, according to the latest OPEC report.\nThe report also highlights that ICE Brent's front-month contract is down $2.29 month over month to average $67.26 per barrel, while the NYMEX WTI front-month contract fell $3.22 month over month to average $64.02 per barrel.\nAccording to the estimates in July, the global oil demand growth prediction for 2025 is still at around 1.3 million barrels per day (mb/d), year over year.\nIn 2025, the Organisation for Economic Co-operation and Development (OECD) expects oil demand to increase by around 0.1 mb/d, whereas the non-OECD expects it to increase by roughly 1.2 mb/d.\nGlobal oil demand is expected to increase by around 1.4 mb/d year over year in 2026, which is likewise unchanged from the estimate made last month.\nThe non-OECD is anticipated to increase by around 1.2 mb/d, year over year, whereas the OECD is predicted to rise by roughly 0.2 mb/d, year over year.\nAccording to this August’s estimate, World Oil Supply Non-DoC liquids output, that is, liquids production from nations that are not parties to the Declaration of Cooperation, is expected to increase by around 0.8 mb/d, year over year, in 2025.\nWith that said, here are the African countries with the highest oil production last month in thousand barrels per day (tb/d), according to OPEC’s latest report."
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0109",
            "open": "1.1737",
            "close": "1.1664",
            "high": "1.1754",
            "low": "1.1645"
        },
        "market_summary": "The EUR/USD is trading near two-week lows, pressured by a stronger US Dollar following robust US economic data that has reduced expectations for aggressive Fed rate cuts. All eyes are on the upcoming US PCE inflation data, which could further dampen the case for Fed easing if it prints hot. While some analysts see medium-term upside for the pair due to policy divergence, the immediate technical and fundamental outlook is bearish.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "Euro strengthens above 1.1650 ahead of US PCE inflation data - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/eur-usd-strengthens-above-11650-ahead-of-us-pce-inflation-data-202509260437",
                "body": "- EUR/USD gains traction near 1.1680 in Friday’s Asian session.\n- Traders will take more cues from the key US PCE inflation data later on Friday.\n- Reuters poll indicates the majority of economists surveyed expect ECB to hold interest rates steady until at least December 2025.\nThe EUR/USD pair recovers some lost ground around 1.1680 during the Asian trading hours on Friday, bolstered by a weaker US Dollar (USD). Markets might turn cautious later in the day ahead of the key US August Personal Consumption Expenditures (PCE) Price Index report.\nTraders continue to assess mixed signals from Federal Reserve (Fed) policymakers. Kansas City Fed President Jeffrey Schmid stated that the US central bank may not need to lower interest rates again soon, citing the need to keep bringing down inflation. Meanwhile, Chicago Fed President Austan Goolsbee noted that he was not eager to do a lot more policy easing while inflation is above target and moving the wrong way.\nThe attention will shift to the US consumer spending data for signals of how urgently the economy needs an additional rate cut from the Fed. Markets are now pricing in nearly an 87.7% odds of a 25 basis points (bps) rate cut in the October meeting, down from a 90%-92% possibility on Wednesday. Any signs of hotter inflation could dampen the case for Fed rate cuts and underpin the Greenback, which creates a headwind for the major pair.\nAcross the pond, a significant majority of economists surveyed expected the European Central Bank (ECB) to keep rates unchanged for the remainder of the year, according to a Reuters poll. Rising expectations that the ECB is done cutting rates could support the shared currency against the USD. However, some financial institutions anticipate further cuts later this year or in early 2026 if conditions warrant.\nEuro FAQs\nThe Euro is the currency for the 19 European Union countries that belong to the Eurozone. It is the second most heavily traded currency in the world behind the US Dollar. In 2022, it accounted for 31% of all foreign exchange transactions, with an average daily turnover of over $2.2 trillion a day. EUR/USD is the most heavily traded currency pair in the world, accounting for an estimated 30% off all transactions, followed by EUR/JPY (4%), EUR/GBP (3%) and EUR/AUD (2%).\nThe European Central Bank (ECB) in Frankfurt, Germany, is the reserve bank for the Eurozone. The ECB sets interest rates and manages monetary policy. The ECB’s primary mandate is to maintain price stability, which means either controlling inflation or stimulating growth. Its primary tool is the raising or lowering of interest rates. Relatively high interest rates – or the expectation of higher rates – will usually benefit the Euro and vice versa. The ECB Governing Council makes monetary policy decisions at meetings held eight times a year. Decisions are made by heads of the Eurozone national banks and six permanent members, including the President of the ECB, Christine Lagarde.\nEurozone inflation data, measured by the Harmonized Index of Consumer Prices (HICP), is an important econometric for the Euro. If inflation rises more than expected, especially if above the ECB’s 2% target, it obliges the ECB to raise interest rates to bring it back under control. Relatively high interest rates compared to its counterparts will usually benefit the Euro, as it makes the region more attractive as a place for global investors to park their money.\nData releases gauge the health of the economy and can impact on the Euro. Indicators such as GDP, Manufacturing and Services PMIs, employment, and consumer sentiment surveys can all influence the direction of the single currency. A strong economy is good for the Euro. Not only does it attract more foreign investment but it may encourage the ECB to put up interest rates, which will directly strengthen the Euro. Otherwise, if economic data is weak, the Euro is likely to fall. Economic data for the four largest economies in the euro area (Germany"
            },
            {
                "title": "Euro to Dollar Forecast: EUR/USD Slips Below 1.17 as US Data Clouds Fed Cuts - currencynews.co.uk",
                "source": "currencynews.co.uk",
                "url": "https://www.currencynews.co.uk/forecast/20250925-44127_euro-to-dollar-forecast-eur-usd-slips-below-1-17-us-data-clouds-fed-cuts.html",
                "body": "The Euro to Dollar exchange rate fell to two-week lows against the Dollar on Thursday, with EUR/USD sliding under 1.1700 as strong US data cast doubt on the scale of Fed rate cuts this year.\nMarkets grew less confident in October and December easing, though MUFG still sees policy divergence lifting the pair back towards 1.20 by year-end.\nEUR/USD Forecasts: 1.17 Breached\nThe Euro only briefly traded above 1.1750 against the US Dollar on Thursday and dipped to 2-week lows below 1.1700 after the New York open.\nSolid US data triggered doubts whether the Fed would engage in further aggressive rate cuts this year which supported the dollar.\nAccording to UoB; “Conditions are deeply oversold, but the sharp decline has scope to break below 1.1715. Given the oversold conditions, EUR might not be able to maintain a foothold below this level, and the next major support at 1.1670 is also unlikely to come into view.”\nScotiabank will be concerned over the outlook if EUR/USD sustains a move below 1.1720.\nSave on Your EUR/USD Transfer\nGet better rates and lower fees on your next international money transfer.\nCompare TorFX with top UK banks in seconds and see how much you could save.\nMUFG still expects medium-term Euro gains; “With the ECB set to leave rates on hold through the rest of this year while the Fed plans to deliver two more 25bps rate cuts, we continue to believe that the near-term policy divergence will lift EUR/USD up towards the 1.2000-level by year end.”\nGeo-political developments will continue to be watched closely.\nING commented; “We don't really buy into the story that geopolitics has driven the dollar stronger this week. Instead, this week's dollar strength is probably a function of not enough bearish news to justify what, after all, is quite an expensive proposition in being short dollars.”\nUS initial jobless claims declined to 218,000 in the latest week from a revised 232,000 previously and below consensus forecasts of 233,000 while continuing claims held at 1.93mn.\nThe data does not suggest widespread layoffs, although there are still concerns over a decline in both supply and demand for labour.\nMarkets were less confident that the Fed would cut interest rates in October and December.\nDanske Bank is not backing two cuts; “The Fed remains divided over how to manage downside risks to the labour market and upside risks to inflation. We are still better aligned with the hawkish camp as we forecast only one more rate cut this year. Policymakers have to consider both easing financial conditions as well as tightening liquidity conditions.”\nEuro-Zone political developments will still be watched closely.\nAccording to Scotiabank; “Political risk in France is once again rising amid reports that Marine Le Pen and her National Rally party are pushing for fresh elections.”\nUBS was more positive and noted that newly-appointed French Prime Minister Lecornu has started budget negotiations with all parties to form a new government and added; “Any positive progress on this front would likely provide further support for the euro.”\nLike this piece? Please share with your friends and colleagues:\nInternational Money Transfer? Ask our resident FX expert a money transfer question or try John's new, free, no-obligation personal service! ,where he helps every step of the way,\nensuring you get the best exchange rates on your currency requirements."
            },
            {
                "title": "EUR/USD - Faces Risk From Diverging Fed, ECB Policy Paths - eFXdata",
                "source": "eFXdata",
                "url": "https://www.efxdata.com/insights/272cb2dc5af37d47f640edf077c82136.html",
                "body": "EUR/USD could continue its downward trajectory as diverging monetary policy outlooks between the Federal Reserve and the European Central Bank weigh on the pair. The euro fell to a 10-session low on Thursday, driven by a series of strong U.S. economic data that bolster the dollar's yield advantage. Weekly and continuing jobless claims dropped below estimates, alleviating some concerns about a weakening U.S. labor market. Additionally, Q2 personal consumption expenditures (PCE) exceeded expectations, while August durable goods orders rose by 2.9%, significantly outpacing the anticipated decline of 0.5%.\nThese reports suggest that the U.S. economy may be more resilient than previously thought, potentially leading the Fed to adopt a less aggressive rate-cutting stance. As a result, the terminal rate spread between the Fed and ECB has widened, adding downward pressure to EUR/USD.\nThe technical outlook also reveals increasing downside risks, with the pair trading below both the 10- and 21-day moving averages and a declining daily relative strength index (RSI).\nAs investors reassess their long positions in EUR/USD,\nattention turns to the upcoming U.S. PCE data due Friday. A\nprint above expectations could amplify the dollar's strength and\ndecrease the likelihood of Fed rate cuts, thereby extending the\neuro's decline against the dollar.\nsofreuri\neurusd\n(Christopher Romano is a Reuters market analyst. The views\nexpressed are his own)"
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0143",
            "open": "1.3445",
            "close": "1.3340",
            "high": "1.3466",
            "low": "1.3323"
        },
        "market_summary": "The GBP/USD is under significant selling pressure, plunging toward key technical support near the 1.3267/80 level after a post-Fed reversal. The pair is being driven lower by a combination of a stronger US Dollar, bolstered by robust US GDP and labor data, and uncertainty around the Bank of England's policy path due to mixed signals from its officials. Major US inflation data (Core PCE) is the immediate focal point, with a hotter reading likely to fuel further dollar strength and test pivotal support for the cable.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "British Pound Forecast: GBP/USD Plunges Toward Pivotal Support - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/british-pound-forecast-gbp-usd-plunges-toward-pivotal-support-9-25-2025/?amp=true",
                "body": "British Pound Forecast: GBP/USD Plunges Toward Pivotal Support\nBritish Pound Technical Forecast: GBP/USD Weekly Trade Levels\n- British Pound post-Fed sell-off approaching attempting to break to fresh monthly lows\n- GBP/USD key support now in view- Major U.S. inflation data on tap tomorrow, NFPs next week\n- Resistance 1.3434/69 (key), 1.3648/50, 1.3749- Support 1.3267/80 (key), 1.3140/44, 1.3056/80\nSterling is poised to mark a second consecutive-weekly decline with GBP/USD attempting to break to fresh monthly lows today. The post-Fed reversal is now approaching technical support at a multi-year slope and the battle lines drawn on the Sterling weekly technical chart heading into key inflation data tomorrow.\nReview my latest Weekly Strategy Webinar for an in-depth breakdown of this Sterling setup and more. Join live on Monday’s at 8:30am EST.\nBritish Pound Price Chart – GBP/USD Weekly\nChart Prepared by Michael Boutros, Sr. Technical Strategist; GBP/USD on TradingView\nTechnical Outlook: In my last British Pound Weekly Forecast we noted that a rebound off slope support kept the focus on a potential breakout and that, “From a trading standpoint, losses should be limited to the median-line IF price is heading higher on this stretch with a breach / close above 1.3650 needed to fuel the next leg of the advance.” GBP/USD surged nearly 3% off the September low with the rally briefly registering an intraday high at 1.3726 on the heels of the Fed rate decision. Price failed to mark a close above resistance with an outside daily / weekly reversal off the highs now extending more than 2.8%.\nInitial weekly support rests with the 78.6% retracement of the August rally / the August low-week close at 1.3267/80- note that the median-line converges on this threshold over the next few weeks and a break / close below this threshold is needed to suggest a more significant high was registered last week and that a lager trend reversal is underway. Subsequent support objectives rests with the 38.2% retracement of the yearly range / May low / 2023 high at 1.3140/44 and 1.3056/80- a region defined by the 52-week moving average and the 100% extension of the June decline. Look for a larger reaction there IF reached.\nInitial weekly resistance now eyed at the 2024 high / September high-week close (HWC) at 1.3434/69. The threat remains tilted to the downside while below this threshold with key resistance steady at the 2025 HWC / 78.6% retracement of the June decline at 1.3648/50- a breach / close above this threshold would threaten resumption of the broader uptrend with subsequent resistance objectives eyed at the 2022 high at 1.3749 and the 1.40-handle.\nBottom line: The Fed reversal in GBP/USD is now approaching support at the median-line with major event risk on tap tomorrow. While the near-term risk is weighted to the downside, the decline may be vulnerable into technical support just lower. From a trading standpoint, look to reduce short-exposure heading into slope support- rallies should be limited to 1.3469 IF price is heading lower on this stretch with a close 1.3267 needed to fuel the next major leg of the decline.\nKeep in mind we get the release of Core Personal Consumption Expenditures tomorrow morning with Non-Farm Payrolls on tap next week. Stay nimble into the releases and watch the weekly closes for guidance here. Review my latest British Pound Short-term Outlook for a closer look at the near-term GBP/USD technical trade levels.\nGBP/USD Economic Data Releases\nEconomic Calendar - latest economic developments and upcoming event risk.\nActive Weekly Technical Charts\n- Japanese Yen (USD/JPY)\n- Swiss Franc (USD/CHF)\n- Crude Oil (WTI)\n- Australian Dollar (AUD/USD)\n- Gold (XAU/USD)\n- US Dollar Index (DXY)\n- Euro (EUR/USD)\n- Canadian Dollar (USD/CAD)\n- S&P 500, Nasdaq, Dow\n--- Written by Michael Boutros, Sr Technical Strategist\nFollow Michael on X @MBForex\nThe information on this web site is not targeted at the general public of any particular country. It "
            },
            {
                "title": "GBP/USD Outlook: BoE Caution Meets Stronger US Data - Forex Crunch",
                "source": "Forex Crunch",
                "url": "https://www.forexcrunch.com/blog/2025/09/26/gbp-usd-outlook-boe-caution-meets-stronger-us-data/",
                "body": "- GBP/USD outlook deteriorates, trading near 1.3350 after a four-week low on Thursday.\n- UK inflation risks keep BoE hesitant on rapid easing.\n- Strong US GDP and labor data bolster the dollar ahead of the PCE inflation report.\nThe GBP/USD price is holding just above the 4-week lows marked on Thursday after stronger US data and mixed signals from the Bank of England. Governor Bailey acknowledged that inflation is likely to drop in 2025 with future rate cuts directly tied to the inflation data. His cautious tone contrasts with that of other policymakers, such as Megan Greene, who argued against further easing amid upside risks to inflation.\n–Are you interested in learning more about MT5 brokers? Check our detailed guide-\nThe diverging views have left investors uncertain about the BOE’s next move, especially when the UK economy is affected by political noise. Large-scale borrowing proposals to fund housing and calls for the re-nationalization of services have created chaos in gilt markets, when demand is already fragile. A softening labor market and hesitant consumers, holding unusually high savings levels, further weigh on the UK’s domestic growth.\nAcross the Atlantic, the US dollar has gained strength after solid US data, with the second-quarter GDP revised up to 3.8% and jobless claims falling to the lowest level since July. These signals indicate US economic resilience, which dampens the odds of aggressive rate cuts by the Fed. While markets still expect further rate cuts this year, Fed Chair Powell has underscored that the decision will depend on the inflation and employment data. This backdrop favors the dollar against the pound.\nKey Events Ahead: US Core PCE\nThe Friday’s US Core PCE Index data is key to watch, with forecasts pointing at a 0.2% monthly and 2.9% yearly rise. A hotter reading would further strengthen the dollar. Additionally, Fed speeches from Barkin and Bowman are due, along with UoM consumer sentiment data.\nGBP/USD Technical Outlook: Bulls Shaken Under 20-SMA\nThe GBP/USD price looks feeble, dropping well below the 20-period MA and breaking the key swing low of 1.3340. The price has slightly moved up from the fresh 4-week lows, with weaker price action indicating further losses towards the 1.3300 handle. On breaking the level, the price could test the 1.3260 area ahead of 1.3200 and 1.3150.\n–Are you interested in learning more about forex signals telegram groups? Check our detailed guide-\nOn the other hand, sustaining above the immediate resistance of 1.3380 could gather buying traction and lead to a meaningful recovery above 1.3400, potentially testing the 1.3450 area. However, the probability of the upside scenario is low, with more consolidation at current levels in the wake of market catalysts that could ignite volatility.\nLooking to trade forex now? Invest at eToro!\n68% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money."
            },
            {
                "title": "Pound Sterling Price News and Forecast: GBP/USD holds ground as the Pound steadies on BoE policy stance - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/pound-sterling-price-news-and-forecast-gbp-usd-holds-ground-as-the-pound-steadies-on-boe-policy-stance-202509260456",
                "body": "GBP/USD stays near 1.3350 as traders adopt caution due to UK inflation risks\nGBP/USD holds ground after two days of losses, trading around 1.3350 during the Asian hours on Friday. The downside of the pair could be restrained as the Pound Sterling (GBP) may gain ground on the United Kingdom’s (UK) inflation risks and the uncertain Bank of England’s (BoE) policy stance.\nBoE policymaker Megan Greene urged caution on rate cuts, suggesting a pause in November as risks to inflation have shifted to the upside. However, Governor Andrew Bailey signaled that more easing is still needed. \"But exactly when that will be and how much it will be will depend on the path of inflation going down,\" Bailey added, while noting that there is some softening in the labor market, alongside cautiousness among consumers. Read more...\nGBP/USD sinks below 1.3400 on strong US data, focus shifts to PCE\nThe GBP/USD ended Thursday’s session with losses of over 0.78%, seeming poised to test lower prices as a scarce economic docket in the UK would leave traders adrift to dynamics linked to the US Dollar. The pair trades below the 20, 50, 100 and 200-day SMAs, after puking below 1.3400 as Friday’s Asian session begins.\nSerling fell to a four-week low of 1.3324 on Thursday after the release of macroeconomic news in the US, spurred a trim of Fed dovish bets, which boosted the Greenback. From a technical perspective, if GBP/USD slides beneath the 1.33 handle, the next area of interest would be the 200-day SMA At 1.3124. Read more...\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice.\nRecommended content\nEditors’ Picks\nAUD/USD sticks to three-week lows near 0.6525, US PCE eyed\nAUD/USD languishes in a three-week low near 0.6525 early Friday, undermined by the recent US Dollar uptrend. Meanwhile, Trump's new round of tariffs on a broad range of imported goods tempers investors' appetite for riskier assets and weighs on the Aussie.\nUSD/JPY reverses softer Tokyo CPI-led uptick to 150.00\nUSD/JPY fades the softer Tokyo CPI-led uptick to near 150.00 in Asian trading on Friday. Disappointing inflation report gives the BoJ more room to delay raising interest rates, which weigh"
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0078",
            "open": "0.6573",
            "close": "0.6538",
            "high": "0.6603",
            "low": "0.6525"
        },
        "market_summary": "The AUD/USD is facing downward pressure, trading near 0.6590, as a cautious Fed tempers rate cut expectations and strong US data supports the dollar. While Australian inflation has risen to the top of the RBA's target range, reducing immediate easing bets, a cooling domestic labor market and a stronger USD are headwinds. Traders are focused on upcoming US data, including the Core PCE, and next week's RBA meeting, where rates are expected to be held.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "AUD/USD slips to 0.6590 as Powell highlights dual mandate challenges - Mitrade",
                "source": "Mitrade",
                "url": "https://www.mitrade.com/insights/news/live-news/article-1-1146916-20250924",
                "body": "The Australian Dollar drops versus the US Dollar on Wednesday amid the lack of catalyst, following remarks by the Fed Chair Jerome Powell, who said that the Fed would continue to balance the dual mandate of the central bank. The AUD/USD trades at 0.6590, down 0.11%.\nOn Tuesday, Powell said that the policy path is difficult for the Fed, which must look at both goals of the dual mandate “equally,” pushing back against almost certain rate cuts coming in the subsequent meetings. Nevertheless, market participants seem confident that the US central bank will reduce rates twice towards the end of the year.\nPowell added that risks in the labor market had risen and that inflation remains somewhat elevated. He acknowledged that policy remains modestly restrictive, but “well positioned to respond to potential economic developments.”\nData-wise, New Home Sales in August improved sharply, from 0.664 million to 0.8 million, a 20.5% increase exceeding forecasts of 0.65 million. Although the data was positive, the latest S&P Global Purchasing Managers Index (PMI) prints in the services and manufacturing sector, indicating the economy is cooling.\nAhead, traders will eye the release of Jobless Claims, Gross Domestic Product (GDP) figures and the Fed’s inflation gauge, the Core PCE Price Index for August.\nIn Australia inflation metrics witnessed the CPI climbing from 2.8% to 3.0% — the top end of the RBA's target range. Consequently, the chances for additional easing by the Reserve Bank of Australia (RBA) remain slim, just at 8%. The RBA will meet next week on September 30, with markets participants expecting the bank to hold rates.\nThe technical picture suggests that the AUD/USD could test lower prices, despite hoovering around the 20-day SMA at 0.6593. Buyers need a daily close above 0.6600 so they could challenge daily highs of 0.6628 ahead of 0.6650. Conversely, a drop below the 20-day SMA clears the path to challenge weekly lows of 0.6574, before extending its losses to the 50-day SMA at 0.6538. the next support lies at the 100-day SMA a 0.6514.\nThe table below shows the percentage change of Australian Dollar (AUD) against listed major currencies this month. Australian Dollar was the strongest against the New Zealand Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Australian Dollar from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent AUD (base)/USD (quote)."
            },
            {
                "title": "Japanese Yen and Aussie Dollar Forecasts: Tokyo Core-Core Inflation Slides; US Data Next - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/japanese-yen-and-aussie-dollar-forecasts-tokyo-core-core-inflation-slides-us-data-next-1550877",
                "body": "Traders face a pivotal session after Tokyo inflation cooled to 2.5% in September, dampening speculation the Bank of Japan could act as soon as October. The plunge in the “core-core” rate from 3% to 2.5%—falling toward BoJ’s 2% target—shifted focus squarely onto the BoJ’s policy outlook, sending USD/JPY higher and raising the stakes ahead of US inflation data later today.\nWhile the national inflation figures are key for the BoJ, economists consider Tokyo inflation a leading indicator of Japan’s inflation outlook. Economist expected the core-core inflation rate to jump to 3.3%.\nThe USD/JPY pair rose from 149.879 to 149.956 after the inflation report amid expectations of a near-term BoJ hold on monetary policy.\nLater in the morning session, Bank of Japan policymaker Asahi Noguchi is on the calendar to speak. Asahi Noguchi was one of seven board members who voted to keep interest rates at 0.5% on Friday, September 19. A more hawkish stance on monetary policy could support bets on an October policy adjustment, given that two board members dissented from the policy decision.\nLater Friday, the highly anticipated Personal Income and Outlays report could influence expectations of an October Fed rate cut. Economists forecast the Core PCE Price Index to rise 2.9% year-on-year in August, matching the previous month’s increase.\nA higher-than-expected reading could dampen rate cut expectations, sending USD/JPY toward the the August 1 high of 150.917.\nConversely, a softer inflation print could fuel speculation about Fed rate cuts in October and December, pushing the pair toward the 149.358 support level. If breached, the 200-day EMA would be the next key technical support level.\nBeyond the data, traders should consider commentary from FOMC members.\nUSD/JPY Scenarios: Hawkish BoJ vs. Dovish Fed Risks\nRead the full USD/JPY forecast, including chart setups and trade ideas.\nAs traders weigh a potential BoJ and Fed divergence, attention is also turning to Australia, where inflation and labor data cloud the RBA’s next move.\nTurning focus to the AUD/USD pair, recent labor market and inflation data have clouded the RBA’s policy outlook.\nJob vacancies fell 2.7% in the three months to August 2025 as private sector job vacancies declined 3.4%. Furthermore, the number of unemployed persons per job vacancy rose from 1.9 to 2.0, the highest level since February 2021.\nThe numbers were in line with the recent labor market report. Employment fell 5.4k month-on-month in August, and the participation rate dropped from 67% to 66.8%.\nWhile labor market data is signaling a cooling, inflation could potentially be moving in the opposite direction. The Monthly CPI Indicator showed the annual inflation rate rose from 2.8% in July to 3% in August, the top end of the RBA’s 2-3% target range.\nWhile rising inflation has reduced immediate market confidence in a November RBA rate cut, economists such as Dr. Shane Oliver still expect cuts due to broader economic headwinds. Dr. Shane Oliver recently commented on the potential influence of the Fed, stating:\n“And if the Fed continues to cut because of a weakening US jobs market, it may also add to pressure for more rate cuts here, as weaker US growth will impact global and Australian growth. Our base case remains for 0.25% RBA rate cuts in November, February, and May.”\nAUD/USD: Key Scenarios to Watch\nSee our full AUD/USD analysis for detailed trends and trade setups.\nMoney markets continue to price in a November RBA rate cut, with further policy adjustments possible in February and May. However, August’s US inflation data could significantly influence the Fed rate path and US-Aussie interest rate differentials.\nSofter-than-expected US inflation would raise bets on multiple Fed rate cuts in the fourth quarter. A more dovish Fed rate path may narrow the rate differential, favoring the Aussie dollar. Under this scenario, the AUD/USD pair could move toward $0.66, bringing the $0.665 level into sight.\nConversely, hotter inflation c"
            },
            {
                "title": "AUD/USD Forex Signal 25/09: Under Pressure (Chart) - DailyForex",
                "source": "DailyForex",
                "url": "https://www.dailyforex.com/forex-technical-analysis/2025/09/audusd-forex-signal-25-september-2025/234556",
                "body": "Bearish view\n- Sell the AUD/USD pair and set a take-profit at 0.6450.\n- Add a stop-loss at 0.6700.\n- Timeline: 1-2 days.\nBullish view\n- Buy the AUD/USD pair and set a take-profit at 0.6700.\n- Add a stop-loss at 0.6450\nThe AUD/USD exchange rate wavered as investors reacted to a strong inflation report from Australia. Market participants are also focusing on the upcoming Reserve Bank of Australia (RBA) interest rate decision. It was trading at 0.6583, down from the monthly high of 0.6706.\nRBA to Maintain Caution As Australia Inflation Rises\nThe AUD/USD exchange rate wavered after the Australian Bureau of Statistics (ABS) published the latest inflation report. The data showed that the headline Consumer Price Index rose from 2.8% in July to 3% in August, higher than the median estimate of 2.8%.\nThis report means that Australia’s inflation is still a major issue. As a result, analysts expect that the Reserve Bank of Australia (RBA) will be cautious when delivering its interest rate decision in its meeting next week.\nPrecisely, most analysts expect that the bank, which is headed by Michele Bullock, will maintain its cautious tone and decide to leave interest rates unchanged in this meeting.\nTop Forex Brokers\nThe AUD/USD pair also reacted to strong US housing data and a statement from several Federal Reserve officials who insisted that the bank should be cautious when cutting interest rates because of the stubbornly high inflation.\nRaphael Bostic, Beth Hammack, and Austan Goolsbee have all hinted that they will not support an interest rate cut in the next meeting. In another statement on Tuesday, Jerome Powell noted that another rate cut was not 100% assured because of inflation.\nGoolsbee and other Fed officials like Mary Daly, John Williams, and Michele Bowman will also talk. Like Christopher Waller and Stephen Miran, Michele Bowman will likely insist that the bank should cut interest rates because of the worsening interest rates.\nAUD/USD Technical Analysis\nThe daily chart shows that the AUD/USD pair has pulled back in the past few days moving from a high of 0.6706 on September 17 to the current 0.6580.\nIt dropped below the important support level at 0.6620, the highest level on July 24, while the Relative Strength Index (RSI) and the Awesome Oscillator have all pointed downwards.\nTherefore, the pair will likely continue falling as sellers target the next key support level at 0.6422, its lowest level in July and August. A move above the resistance at 0.6700 will invalidate the bearish outlook.\nReady to trade our free Forex signals? Here are the best forex platforms in Australia to choose from."
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "1.3680",
            "open": "148.8110",
            "close": "149.7730",
            "high": "149.9210",
            "low": "148.5530"
        },
        "market_summary": "The USD/JPY is trading near 150.00, a key psychological level, driven by a resurgent US Dollar. Strong US economic data, including upwardly revised GDP and falling jobless claims, has reduced expectations for imminent Fed rate cuts and widened the interest rate differential with Japan. Meanwhile, a cooling in Tokyo's core-core inflation has dampened speculation of a near-term hawkish shift from the Bank of Japan, further pressuring the Yen.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Dollar climbs to three-week high on strong data - United States - English - Convera",
                "source": "Convera",
                "url": "https://convera.com/blog/currency-news/dollar-climbs-to-three-week-high-on-strong-data/",
                "body": "Written by Steven Dooley, Head of Market Insights, and Shier Lee Lim, Lead FX and Macro Strategist\nDollar rally resumes on solid data and technical breakout\nThe USD index broke above its 100-day moving average for the first time since March.\nInitial jobless claims fell to 218k from 231k prior, while Q2 GDP was revised higher to 3.8%, undermining the soft labor narrative. USD/JPY traded just shy of 150 as rate volatility provided additional support for the dollar against low-yielders.\nGBP underperformed significantly with 10-year gilts selling off 9bp after leadership speculation raised concerns over potential borrowing increases.\nA senior Fed official argued for replacing the federal funds rate as the policy benchmark, suggesting the tri-party general collateral rate as an alternative. While this wouldn’t materially change monetary policy conduct, it could shift focus toward repo/SOFR markets.\nUS equities closed down 1% with the S&P 500 breaking support at 6670. Investor AI fatigue continues alongside mounting geopolitical tensions.\nFed signals discomfort with sticky inflation; USD/SGD eyes 1.3000\nChicago Fed President Austan Goolsbee warned that keeping interest rates steady while inflation creeps higher is effectively the same as cutting them. He made it clear the Fed isn’t comfortable with inflation hovering in the mid-2% range and doesn’t believe its ripple effects are being felt yet.\nIn Asia, the Singapore dollar is under pressure. USD/SGD has broken above its 100-day moving average and is now flirting with the key 1.3000 level. But with the pair sitting at the top of its one-month range, dollar buyers may wait for a dip before jumping in.\nBOJ keeps close watch on tariffs as USD/JPY flirts with 150\nJapan’s central bank remains cautious. In its July meeting minutes, BoJ officials flagged ongoing uncertainty in the US, EU, and China. While Japan’s economy is recovering—thanks to stronger corporate profits, rising employment, and steady income—many members stressed the need to closely monitor how US tariffs could affect growth and prices.\nOne member suggested it may take another 2–3 months to fully gauge the fallout. If Japan and the US prove resilient, the BoJ could shift away from its wait-and-see stance by late 2025.\nInflation is inching closer to the 2% target, but it’s not there yet. Services PPI for August rose 2.7%, slightly below the 2.9% forecast.\nIn FX, USD/JPY is testing the psychological 150.00 level. Support sits at 148.04 (21-day moving average) and 147.56 (50-day).\nAussie slumps on dollar strength\nTable: seven-day rolling currency trends and trading ranges\nKey global risk events\nCalendar: 22 – 27 September\nHave a question? [email protected]\n*The FX rates published are provided by Convera’s Market Insights team for research purposes only. The rates have a unique source and may not align to any live exchange rates quoted on other sites. They are not an indication of actual buy/sell rates, or a financial offer."
            },
            {
                "title": "Japanese Yen and Aussie Dollar Forecasts: Tokyo Core-Core Inflation Slides; US Data Next - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/japanese-yen-and-aussie-dollar-forecasts-tokyo-core-core-inflation-slides-us-data-next-1550877",
                "body": "Traders face a pivotal session after Tokyo inflation cooled to 2.5% in September, dampening speculation the Bank of Japan could act as soon as October. The plunge in the “core-core” rate from 3% to 2.5%—falling toward BoJ’s 2% target—shifted focus squarely onto the BoJ’s policy outlook, sending USD/JPY higher and raising the stakes ahead of US inflation data later today.\nWhile the national inflation figures are key for the BoJ, economists consider Tokyo inflation a leading indicator of Japan’s inflation outlook. Economist expected the core-core inflation rate to jump to 3.3%.\nThe USD/JPY pair rose from 149.879 to 149.956 after the inflation report amid expectations of a near-term BoJ hold on monetary policy.\nLater in the morning session, Bank of Japan policymaker Asahi Noguchi is on the calendar to speak. Asahi Noguchi was one of seven board members who voted to keep interest rates at 0.5% on Friday, September 19. A more hawkish stance on monetary policy could support bets on an October policy adjustment, given that two board members dissented from the policy decision.\nLater Friday, the highly anticipated Personal Income and Outlays report could influence expectations of an October Fed rate cut. Economists forecast the Core PCE Price Index to rise 2.9% year-on-year in August, matching the previous month’s increase.\nA higher-than-expected reading could dampen rate cut expectations, sending USD/JPY toward the the August 1 high of 150.917.\nConversely, a softer inflation print could fuel speculation about Fed rate cuts in October and December, pushing the pair toward the 149.358 support level. If breached, the 200-day EMA would be the next key technical support level.\nBeyond the data, traders should consider commentary from FOMC members.\nUSD/JPY Scenarios: Hawkish BoJ vs. Dovish Fed Risks\nRead the full USD/JPY forecast, including chart setups and trade ideas.\nAs traders weigh a potential BoJ and Fed divergence, attention is also turning to Australia, where inflation and labor data cloud the RBA’s next move.\nTurning focus to the AUD/USD pair, recent labor market and inflation data have clouded the RBA’s policy outlook.\nJob vacancies fell 2.7% in the three months to August 2025 as private sector job vacancies declined 3.4%. Furthermore, the number of unemployed persons per job vacancy rose from 1.9 to 2.0, the highest level since February 2021.\nThe numbers were in line with the recent labor market report. Employment fell 5.4k month-on-month in August, and the participation rate dropped from 67% to 66.8%.\nWhile labor market data is signaling a cooling, inflation could potentially be moving in the opposite direction. The Monthly CPI Indicator showed the annual inflation rate rose from 2.8% in July to 3% in August, the top end of the RBA’s 2-3% target range.\nWhile rising inflation has reduced immediate market confidence in a November RBA rate cut, economists such as Dr. Shane Oliver still expect cuts due to broader economic headwinds. Dr. Shane Oliver recently commented on the potential influence of the Fed, stating:\n“And if the Fed continues to cut because of a weakening US jobs market, it may also add to pressure for more rate cuts here, as weaker US growth will impact global and Australian growth. Our base case remains for 0.25% RBA rate cuts in November, February, and May.”\nAUD/USD: Key Scenarios to Watch\nSee our full AUD/USD analysis for detailed trends and trade setups.\nMoney markets continue to price in a November RBA rate cut, with further policy adjustments possible in February and May. However, August’s US inflation data could significantly influence the Fed rate path and US-Aussie interest rate differentials.\nSofter-than-expected US inflation would raise bets on multiple Fed rate cuts in the fourth quarter. A more dovish Fed rate path may narrow the rate differential, favoring the Aussie dollar. Under this scenario, the AUD/USD pair could move toward $0.66, bringing the $0.665 level into sight.\nConversely, hotter inflation c"
            },
            {
                "title": "USD/JPY Price Forecast - Dollar to Yen Soars to 149.75 as Dollar Strengthens on U.S. Growth, Yen Braces for Tokyo CPI - tradingnews.com",
                "source": "tradingnews.com",
                "url": "https://www.tradingnews.com/news/usd-jpy-price-forecast-dollar-to-yen-soars-to-149-as-dollar-strengthens",
                "body": "USD/JPY Price Forecast - Dollar to Yen Soars to 149.75 as Dollar Strengthens on U.S. Growth, Yen Braces for Tokyo CPI\nA stronger U.S. economy and falling jobless claims fuel Dollar momentum, pushing USD/JPY into critical resistance at 149.23. Upcoming PCE and Tokyo CPI releases will dictate if the pair breaks 150 or retreats toward 147 | That's TradingNEWS\nUSD/JPY Extends Rally Toward 149.75 on Surging U.S. Data and Weak Yen Backdrop\nThe USD/JPY pair has climbed to 149.75, its highest in seven weeks, up 0.55% on the session as traders respond to a string of stronger-than-expected U.S. economic releases. The move extends a two-day rally powered by upward GDP revisions, resilient labor market data, and surging durable goods orders, giving the U.S. Dollar another leg higher against the Japanese Yen. Q2 GDP was revised to 3.8% from 3.3%, well above expectations, underscoring consumer spending strength and a sharp drop in imports. Weekly jobless claims fell to 218,000, compared to forecasts of 235,000, while August durable goods orders jumped 2.9% after a July decline of 2.7%. These readings cut expectations for an October Fed rate cut to 85% from 94% just days earlier, reinforcing the Dollar’s yield advantage over the Yen.\nTechnical Outlook: USD/JPY Eyes Breakout Above 149 Resistance\nThe pair’s rally has brought it directly into the 148.84–149.23 resistance corridor, a zone marked by the 61.8% retracement of the August decline and the yearly moving average. A sustained break above this level would confirm a larger structural shift and open the door toward 150.88–151.63, where April extensions and 2023 highs converge. Short-term support lies at 147.05, with deeper defenses at 146.10–146.70, a region aligned with the 38.2% retracement of the April rally and the multi-year slope line from 2021. A close below this pivot would invalidate the broader advance, exposing 143.67–144.10. For now, bulls remain in control, and the weekly close relative to 149 will be decisive in determining whether momentum carries toward the 151 handle.\nJapanese Policy and Inflation Risk for the Yen\nOn the Japanese side, Bank of Japan minutes revealed policymakers reaffirming the 0.5% overnight call rate target while continuing gradual JGB tapering. Officials noted core CPI running 3.0–3.5%, with sticky services inflation driven by rising labor costs. A few members suggested readiness to discuss eventual rate hikes if inflation persists, though the overall stance remains ultra-accommodative. Tokyo CPI due Friday will be closely monitored for confirmation of entrenched price pressures. A hotter reading could revive chatter of earlier BoJ tightening, though for now the divergence with Fed policy remains stark, keeping pressure on the Yen.\nRead More\n-\nBITQ ETF Holds $23.91 After 91% Yearly Gain, Tracking Bitcoin’s $124K High and Coinbase Strength\n25.09.2025 · TradingNEWS ArchiveStocks\n-\nBitcoin ETFs Secure $241M Inflows While BTC-USD Tests $109K; IBIT, FBTC, ARKB Lead Turnaround\n25.09.2025 · TradingNEWS ArchiveCrypto\n-\nNatural Gas Price - NG=F Climbs to $2.94 on Short-Covering as +75 Bcf Storage Build Caps Rally\n25.09.2025 · TradingNEWS ArchiveCommodities\n-\nGBP/USD Price Forecast - Sterling to Pound Drops to 1.3343 as Strong US Data Boosts Dollar and BoE Warnings Cap Sterling\n25.09.2025 · TradingNEWS ArchiveForex\nMacro Drivers: Fed Caution, Rate Differentials, and PCE on Deck\nThe divergence between a Fed still cautious on rate cuts and a BoJ reluctant to normalize is keeping the spread in favor of the Dollar. Core PCE, the Fed’s preferred inflation gauge, is due tomorrow and could set the tone for October policy expectations. Any upside surprise above the 2.6% annualized pace could further erode bets on near-term easing, reinforcing the Dollar’s bid and lifting USD/JPY through 149.23 toward 150+. Conversely, softer PCE could offer temporary relief to the Yen, especially if coupled with strong Tokyo CPI.\nMomentum, Positioning, and Market Psychology\nPositioning da"
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0064",
            "open": "1.3890",
            "close": "1.3937",
            "high": "1.3949",
            "low": "1.3885"
        },
        "market_summary": "The USD/CAD is trading near multi-month highs due to a combination of factors pressuring the Canadian dollar and supporting the US dollar. The Loonie is weakened by soft domestic economic data, expectations for further Bank of Canada rate cuts, and concerns over US trade policies. In contrast, the US dollar is bolstered by resilient economic data, a more cautious Federal Reserve approach to easing, and broad strength against G-10 currencies.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "USD / CAD - Canadian dollar under pressure - Baystreet.ca",
                "source": "Baystreet.ca",
                "url": "https://www.baystreet.ca/articles/forex_trader.aspx",
                "body": "- Overnight action was subdued ahead of today’s pending US data dump\n- Swiss National Bank leaves rates unchanged at 0.0%, as expected.\n- US dollar consolidating recent gains in quiet trading.\nUSDCAD open 1.3893, overnight range 1.3885-1.3902, close, 1.3897, WTI 64.55, Gold 3757.59\nThe Canadian dollar is consolidating its losses since Monday. A string of soft domestic data highlights Canada’s economic fragility which is set to deepen under Trump’s tariff barrage. That will become evident on Friday with the release of July GDP.\nThe currency is also undermined by expectations of further BoC easing, even as U.S. rates are projected to fall on October 29. Adding to the momentum, broad U.S. dollar strength against the G-10 currencies is also pressuring the Loonie.\nWTI is consolidating this week’s gains in a 64.27-64.93 range after gaining over 5% this week. The EIA reported U.S. crude inventories fell by 0.607 million barrels and Ukrainian drone strikes on Russian oil infrastructure raised concerns of diminished supply in the near term.\nTrump is close to sealing his forced takeover of TikTok, one of China’s most successful tech firms. He originally pushed for a U.S. ban on the app, citing national security concerns, only to later recognize its role in helping his election campaign. The outcome now hands control of 80% of the company to a consortium of American investors and partners.\nAsian equities ended mixed. Japan’s Topix added 0.47% and Australia’s ASX 200 gained 0.10%, while Hong Kong’s Hang Seng edged down 0.12%.\nAs of 7:30 am EDT, the DAX has fallen 1.04%, the CAC-40 is off 0.73%, and the FTSE 100 is down 0.40%. U.S. S&P 500 futures are down 0.30%. The dollar index is at 97.85, and the U.S. 10-year Treasury yield is steady near 4.163%.\nEURUSD is consolidating near the top of its 1.1731–1.1754 range, holding earlier losses. Political uncertainty in France remains a drag as Marine Le Pen pushes for fresh elections. The Swiss National Bank SNB) left rates unchanged at 0.0% Chairman Schlegel said \"the bar to go into negative rates is higher than for a normal cut; but if necessary, will be ready to use all tools\"\nGBPUSD traded narrowly between 1.3434 and 1.3467. The pound continues to struggle with weak growth data, stubborn inflation, and concerns over government finances. Debate among Bank of England officials highlight the divide, with Governor Bailey in favor of more cuts while Megan Greene suggested skipping one in November.\nUSDJPY stayed confined between 148.56 and 148.88. July’s BoJ minutes provided some support, with two members pushing for future rate hikes, although weak local data and tariff uncertainty capped gains.\nAUDUSD moved within 0.6581–0.6604, supported by higher-than-expected inflation figures that reduced expectations of an RBA rate cut on September 30.\nToday’s data includes: US GDP, Jobless Claims and, and Durable Goods Orders."
            },
            {
                "title": "USD/CAD maintains position near 1.3950 ahead of US PCE inflation data - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-cad-maintains-position-near-13950-ahead-of-us-pce-inflation-data-202509260344",
                "body": "- USD/CAD hovers near the four-month high of 1.3949, reached on Thursday.\n- The US Dollar receives support as strong economic data may slow the Fed’s interest rate cuts.\n- Canada has finalized its first Indo-Pacific trade deal under Prime Minister Mark Carney, aiming to reduce reliance on the US.\nUSD/CAD remains stronger for the fifth consecutive day, trading around 1.3940 during the Asian hours on Friday. The pair holds ground near the four-month high of 1.3949, which was recorded on Thursday, after the stronger-than-expected economic data from the United States (US). Focus shifts toward Personal Consumption Expenditures (PCE) Price Index data, the Federal Reserve’s preferred inflation gauge, due later on Friday.\nRobust economic data may prompt the US Federal Reserve (Fed) to adopt a more cautious approach to cutting interest rates. The US Gross Domestic Product (GDP) Annualized grew 3.8% in the second quarter (Q2), coming in above the previous estimate and the estimation of 3.3%. Meanwhile, the GDP Price Index rose 2.1% in the same period, as compared to the expected and previous 2.0% growth. US Initial Jobless Claims declined to 218K last week, the lowest since July. The market expectations were an increase to 235K from 232K previously.\nFed Bank of Kansas City President Jeffrey Schmid said on Thursday that the Fed is currently close to meeting its mandates, but added that policy must be forward-looking. Schmid added that the rate cut was appropriate to offset risks to the labor market, though inflation is still too high and the current job market is largely in balance, per Reuters. However, Chicago Fed President Austan Goolsbee noted that he was not eager to do a lot more policy easing while inflation is above target and moving the wrong way.\nCanadian Trade Minister Maninder Sidhu said on Thursday that Canada has signed its first Indo-Pacific trade deal under Prime Minister Mark Carney, as part of efforts to reduce reliance on the United States (US). “I see a lot of opportunities in agriculture, in energy and telecom, in defense and aerospace,” Sidhu added.\nCanadian Dollar FAQs\nThe key factors driving the Canadian Dollar (CAD) are the level of interest rates set by the Bank of Canada (BoC), the price of Oil, Canada’s largest export, the health of its economy, inflation and the Trade Balance, which is the difference between the value of Canada’s exports versus its imports. Other factors include market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – with risk-on being CAD-positive. As its largest trading partner, the health of the US economy is also a key factor influencing the Canadian Dollar.\nThe Bank of Canada (BoC) has a significant influence on the Canadian Dollar by setting the level of interest rates that banks can lend to one another. This influences the level of interest rates for everyone. The main goal of the BoC is to maintain inflation at 1-3% by adjusting interest rates up or down. Relatively higher interest rates tend to be positive for the CAD. The Bank of Canada can also use quantitative easing and tightening to influence credit conditions, with the former CAD-negative and the latter CAD-positive.\nThe price of Oil is a key factor impacting the value of the Canadian Dollar. Petroleum is Canada’s biggest export, so Oil price tends to have an immediate impact on the CAD value. Generally, if Oil price rises CAD also goes up, as aggregate demand for the currency increases. The opposite is the case if the price of Oil falls. Higher Oil prices also tend to result in a greater likelihood of a positive Trade Balance, which is also supportive of the CAD.\nWhile inflation had always traditionally been thought of as a negative factor for a currency since it lowers the value of money, the opposite has actually been the case in modern times with the relaxation of cross-border capital controls. Higher inflation tends to lead central banks to put up interest rates wh"
            },
            {
                "title": "USD/CAD Analysis: Canadian Dollar Under Pressure, US Dollar Rebound Signal Strengthens - 富途牛牛",
                "source": "富途牛牛",
                "url": "https://news.futunn.com/en/post/62603094/usd-cad-analysis-canadian-dollar-under-pressure-us-dollar-rebound?level=1&data_ticket=1758865458696434",
                "body": "During the European trading session on Thursday (September 25), the USD/CAD currency pair demonstrated a clear pattern of US dollar strength. The USD/CAD exchange rate was quoted at 1.3892/94 during the session, down slightly by 0.02% from the previous trading day but up 0.77% over the past week. This trend reflects multiple pressures facing the Canadian economy, including a weakening labor market and rising trade risks, while the US economy, although slowing, has shown greater resilience.\nDivergence in Central Bank Policies\nThe monetary policy paths of the Bank of Canada (BoC) and the Federal Reserve (Fed) have become central factors influencing the USD/CAD exchange rate. At its meeting on September 17, the Bank of Canada announced a 25-basis-point reduction in the overnight interest rate target to 2.5%, marking the first rate cut since March, while also lowering the deposit rate to 2.45%. The Bank of Canada emphasized further softness in the Canadian labor market, with job losses concentrated in trade-sensitive sectors, and business investment suspended due to uncertainties surrounding US trade policies.\nGovernor Tiff Macklem stated at a press conference that if economic risks escalate, the Bank of Canada is prepared to cut rates further to support economic growth and maintain inflation near the 2% target. Market expectations suggest that the Bank of Canada will implement two additional 25-basis-point rate cuts in October and December, potentially bringing the policy rate down to 2.0%.\nThis has further weakened the attractiveness of the Canadian dollar, driving the USD/CAD higher. By contrast, the Federal Reserve lowered the federal funds rate target range by only 25 basis points to 4%-4.25% at its September 17 FOMC meeting, while also reducing the interest rate on reserve balances to 4.15%.\nPowell warned at the subsequent press conference that further rate cuts should be approached cautiously to avoid prematurely loosening monetary policy.\nThe FOMC economic projections indicate an expected GDP growth rate of 2.1% for the US in 2025, with unemployment stabilizing at 4.2% and core PCE inflation at 2.3%.\nThe Federal Reserve emphasized that it will closely monitor labor market and inflation data and does not intend to accelerate easing in the short term. This contrasts sharply with the dovish stance of the Bank of Canada, reinforcing the relative strength of the US dollar.\nThe cautious tone from the Federal Reserve has triggered a rebound in the US Dollar Index, with USD/CAD touching around 1.3875. Analysts noted that this policy divergence could support USD/CAD moving towards the 1.40 level in the short term.\nLatest Economic Data: Weak Employment in Canada, Moderate Growth in the U.S.\nCanadian economic data indicates significant downward pressure. Over the past two months, there has been a net reduction in jobs, primarily concentrated in manufacturing and export sectors, impacted by U.S. trade tariffs. The Bank of Canada's latest monetary policy report forecasts that inflation will stabilize at the 2% target in the second half of 2025, but economic growth is expected to slow to 1.5%, with population growth deceleration and weak household spending being the main drags. Additionally, business investment contracted in the second quarter, as companies expressed heightened concerns about future demand prospects.\nIn the U.S., although the latest labor data shows a slowdown in job growth (with the private sector adding 52,000 jobs in July, half the level of the first quarter), overall economic activity experienced moderate growth in the first half of the year. The Federal Reserve predicts that the unemployment rate will rise slightly to 4.2%, but the labor market remains resilient.\nExternal Factors: Oil Prices and Trade Uncertainty\nAs a resource-dependent currency, the Canadian dollar is highly reliant on oil prices, but recent fluctuations have been limited (WTI crude around $65 per barrel), providing little support.\nMore concerning"
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "0.7500",
            "open": "200.0800",
            "close": "199.8170",
            "high": "200.3370",
            "low": "199.5870"
        },
        "market_summary": "The GBP/JPY pair is trading below the key 200.00 psychological level, facing downward pressure from multiple fronts. The Yen is finding support from firming market bets on an imminent Bank of Japan rate hike and a softer global risk tone. Concurrently, the Pound is being weighed down by growing concerns over the UK's fiscal outlook, evidenced by weaker demand at a government debt auction, and dovish commentary from the Bank of England.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "GBP/JPY steady below 200.00 amid JPY strength, UK fiscal worries - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-consolidates-below-20000-jpy-strength-and-uk-fiscal-concerns-cap-the-upside-202509260534",
                "body": "- GBP/JPY struggles to gain any meaningful traction as modest JPY strength offsets GBP rebound.\n- The initial reaction to a weaker Tokyo CPI print turns out to be short-lived amid a softer risk tone.\n- Concerns about the UK’s fiscal situation and the BoE’s dovish tilt contribute to capping spot prices.\nThe GBP/JPY cross lacks any firm intraday directional bias on Friday and seesaws between tepid gains/minor losses, below the 200.00 psychological mark through the Asian session amid mixed cues. A modest US Dollar (USD) pullback from a three-week high benefits the British Pound (GBP) and supports spot prices, though the emergence of some buying around the Japanese Yen (JPY) caps the upside.\nMeanwhile, data released earlier today showed that consumer prices in Japan's capital city, Tokyo, rose less than expected in September. This comes on top of domestic political uncertainty and concerns about economic headwinds stemming from US tariffs, which could allow the Bank of Japan (BoJ) to delay raising interest rates. Nevertheless, investors are still pricing in the possibility of an imminent BoJ rate hike in October, which, along with a slight deterioration in the global risk sentiment, benefits the JPY's relative safe-haven assets.\nFurthermore, the GBP bulls might refrain from placing aggressive bets amid concerns over the UK’s fiscal outlook ahead of the Autumn budget in November. Moreover, the Bank of England (BoE) Governor Andrew Bailey's dovish remarks on Wednesday, saying that there will be further reductions in the bank rate, might keep a lid on the GBP. This, in turn, makes it prudent to wait for strong follow-through buying before positioning for an extension of the GBP/JPY pair's bounce from the vicinity of the 199.00 mark, or a two-week low touched on Monday.\nPound Sterling FAQs\nThe Pound Sterling (GBP) is the oldest currency in the world (886 AD) and the official currency of the United Kingdom. It is the fourth most traded unit for foreign exchange (FX) in the world, accounting for 12% of all transactions, averaging $630 billion a day, according to 2022 data. Its key trading pairs are GBP/USD, also known as ‘Cable’, which accounts for 11% of FX, GBP/JPY, or the ‘Dragon’ as it is known by traders (3%), and EUR/GBP (2%). The Pound Sterling is issued by the Bank of England (BoE).\nThe single most important factor influencing the value of the Pound Sterling is monetary policy decided by the Bank of England. The BoE bases its decisions on whether it has achieved its primary goal of “price stability” – a steady inflation rate of around 2%. Its primary tool for achieving this is the adjustment of interest rates. When inflation is too high, the BoE will try to rein it in by raising interest rates, making it more expensive for people and businesses to access credit. This is generally positive for GBP, as higher interest rates make the UK a more attractive place for global investors to park their money. When inflation falls too low it is a sign economic growth is slowing. In this scenario, the BoE will consider lowering interest rates to cheapen credit so businesses will borrow more to invest in growth-generating projects.\nData releases gauge the health of the economy and can impact the value of the Pound Sterling. Indicators such as GDP, Manufacturing and Services PMIs, and employment can all influence the direction of the GBP. A strong economy is good for Sterling. Not only does it attract more foreign investment but it may encourage the BoE to put up interest rates, which will directly strengthen GBP. Otherwise, if economic data is weak, the Pound Sterling is likely to fall.\nAnother significant data release for the Pound Sterling is the Trade Balance. This indicator measures the difference between what a country earns from its exports and what it spends on imports over a given period. If a country produces highly sought-after exports, its currency will benefit purely from the extra demand created from foreign buyers seeking to pur"
            },
            {
                "title": "GBP/JPY slips as UK fiscal concerns weigh, BoJ hike bets firm - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/amp/news/gbp-jpy-slips-as-uk-fiscal-concerns-weigh-boj-hike-bets-firm-202509251526",
                "body": "GBP/JPY slips as UK fiscal concerns weigh, BoJ hike bets firm\n|- GBP/JPY retreats 0.27% to 199.72 after rejection near 200.34 weekly high.\n- UK debt auction shows weaker demand, stoking fiscal worries ahead of Reeves’ November 2026 autumn budget.\n- BoJ minutes flagged scope for hikes if outlook holds; markets price 72% chance of 25-bps move this year.\nThe Pound Sterling losses ground versus the Japanese Yen on Thursday as the cross-pair reversed its course from around weekly highs of 200.34, weighed by investors growing concerns about Britain finances. The GBP/JPY trades at 199.72, down 0.27%.\nSterling pressured by soft Gilt demand; Yen supported by BoJ minutes, Tokyo CPI in focus\nReuters revealed that the latest 2034 Gilt auction revealed that investor demand for UK’s debt, has softened. Chancellor Rachel Reeves would reveal the autumn budget in November 2026, which is expected to show a balance between raising taxes and supporting economic growth.\nBank of England MPC members Megan Greene was hawkish on Wednesday, said that she is less concerned about a decline in the labor market. She added that risks from trade persisted but had faded, while inflation risks are tilted to the upside.\nIn Japan, the minutes of the Bank of Japan’s from two meetings ago, discussed the case for future rate hikes, if the economic and price outlooks adhered to projections. In the meantime, market participants had priced in a 72% chance of a 25-bps rate hike by year end. Traders’ eyes will shift to the release of Tokyo CPI data.\nGBP/JPY Price Forecast: Technical outlook\nDespite being poised to test higher prices, the GBP/JPY is forming a ‘dark cloud cover’ a bearish candle chart pattern that indicates that sellers outweighed buyers. Nevertheless it needs confirmation below the September 24 low of 199.46, which could clear the path to test the 199.00 figure. In that outcome, the next support would be the 50-day SMA at198.96, ahead of testing the August 29 low of 197.94.\nOn the flipside, if bulls regain 200.00 the next areas of interest would be 200.50 and the 201.00 figure.\nPound Sterling Price This week\nThe table below shows the percentage change of British Pound (GBP) against listed major currencies this week. British Pound was the strongest against the New Zealand Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the British Pound from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent GBP (base)/USD (quote).\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers."
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "5,064.0000",
            "open": "113,547.5000",
            "close": "109,199.5000",
            "high": "113,700.5000",
            "low": "108,636.5000"
        },
        "market_summary": "The market is experiencing a surge of institutional product development and regulatory approval, led by major players like BlackRock filing for a Bitcoin covered-call ETF to generate yield and Hashdex receiving approval for a diversified crypto index ETF. This expansion, supported by new SEC generic listing standards that streamline approvals, signals a maturation of crypto investment vehicles and growing acceptance within traditional finance. The influx of new products is broadening institutional exposure beyond just Bitcoin and Ethereum to include other major cryptocurrencies.\n\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "BlackRock’s $12.5T Bitcoin ETF Filing Shakes Markets — Is Approval Imminent? - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/blackrock-12-5t-bitcoin-etf-221611237.html",
                "body": "BlackRock, the world’s largest asset manager, has filed an application for a new Bitcoin Premium Income ETF, a move that could significantly expand institutional exposure to digital assets.\nThe $12.5 trillion firm is seeking approval for what would be its latest entry into cryptocurrency products, adding to its growing dominance in the exchange-traded fund market.\nNew BlackRock ETF Seeks Yield on Bitcoin Through Covered-Call Strategy\nThe proposed Bitcoin Premium Income ETF is designed as a covered-call strategy, offering yield on Bitcoin holdings.\nBloomberg analyst Eric Balchunas noted that BlackRock has registered the name iShares Bitcoin Premium ETF and described it as a “33 Act spot product,” positioned as a sequel to the firm’s $87 billion iShares Bitcoin Trust (IBIT).\nIf approved, the new product could attract traditional finance investors seeking income from Bitcoin while further cementing BlackRock’s position as the leading provider of crypto ETFs.\nThe filing comes at a time when BlackRock’s digital asset business is rapidly scaling.\nAccording to data shared by the Onchain Foundation, the company’s Bitcoin and Ether ETFs are generating more than $260 million in annual revenue, with $218 million from Bitcoin products and $42 million from Ethereum.\nAnalysts say the success of these funds signals that crypto ETFs are no longer an experiment but a meaningful profit center for the asset manager.\nOn-chain data from Arkham Intelligence shows that BlackRock is now the largest institutional custodian of both Bitcoin and Ethereum. The firm holds more than 756,000 BTC valued at $85.29 billion, alongside 3.8 million ETH worth nearly $16 billion.\nIncluding smaller crypto holdings, BlackRock’s total digital asset custody now exceeds $101 billion. The firm is also known for making large purchases during market downturns, a pattern that has helped strengthen its position as a key player in crypto markets.\nBlackRock’s expansion into digital assets continues to draw inflows. Its Ethereum-linked fund recorded $512 million in net capital inflows last week, according to Farside Investors. In its second-quarter earnings report, BlackRock disclosed $14.1 billion in digital asset inflows, making the category one of its fastest-growing product lines despite representing only 1% of total assets under management.\nCrypto ETFs generated $40 million in base fees and securities lending revenue in the same quarter.\nThe firm is also exploring tokenization, a process of creating blockchain-based versions of traditional assets. Earlier this year, BlackRock launched its tokenized money market fund BUIDL, which has grown to more than $2 billion in assets."
            },
            {
                "title": "BlackRock chases Bitcoin yield in latest ETF as a ‘sequel’ to IBIT - Cointelegraph",
                "source": "Cointelegraph",
                "url": "https://cointelegraph.com/news/blackrock-files-for-bitcoin-premium-income-etf",
                "body": "Asset management giant BlackRock filed to register a Delaware trust company for its proposed Bitcoin Premium Income ETF on Thursday, signaling a push to broaden its Bitcoin offerings.\nBloomberg ETF analyst Eric Balchunas said BlackRock’s proposed product would sell covered call options on Bitcoin futures, collecting premiums to generate yield.\nThe regular distributions would, however, trade away potential upside from investing in BlackRock’s spot Bitcoin ETF, which mirrors Bitcoin’s (BTC) price movements.\n“This is a covered call Bitcoin strategy in order to give BTC some yield. This will be a ’33 Act spot product, sequel to the $87b $IBIT.”\nRegistering a trust filing in Delaware typically indicates that an ETF issuer will imminently file an S-1 registration statement or 19b-4 filing with the Securities and Exchange Commission to officially kick off the process.\nUS regulators — particularly the SEC — have signaled openness to a wider range of crypto investment products as part of President Donald Trump’s promise to make America the “crypto capital of the world.”\nThe new BlackRock product would complement its iShares Bitcoin ETF (IBIT), which has clocked over $60.7 billion in inflows since launching in January 2024 — by far the largest of its kind — with the Fidelity Wise Origin Bitcoin Fund (FBTC) coming in next at $12.3 billion.\nBitcoin yield products are slowly coming to market\nOne of the earliest reasons why many TradFi investment companies overlooked Bitcoin is that it isn’t a native yield-generating asset.\nHowever, solutions have popped up, such as one of Strategy’s convertible preferred stock offerings, STRK, which leverages its 639,835 Bitcoin to offer investors stable income.\nRelated: Bitcoin upgrade is splitting developers and purists\nIf approved, BlackRock’s proposed product would add to the few prominent yield-generating Bitcoin products in the US.\nBlackRock won’t take part in altcoin ETF craze, analyst says\nBalchunas said that, in light of all the other coins “about to be ETF-ized,” the filing shows BlackRock is opting to build around Bitcoin and Ether (ETH) and “lay off the rest, at least for now.”\n“This makes the horse race for these other coins much more wide open,” he said.\nPotential approvals may start coming in quicker too, with the SEC last week approving a generic listing standard that wouldn’t require each application to be assessed individually.\nAmong the cryptocurrencies most likely to next be wrapped in ETF form are Litecoin (LTC), Solana (SOL), XRP (XRP) and Dogecoin (DOGE).\nMagazine: ‘Help! My robot vac is stealing my Bitcoin’: When smart devices attack"
            },
            {
                "title": "Hashdex’s Crypto Index ETF Comprising BTC, ETH, XRP, SOL Gets SEC Greenlight - Coinspeaker",
                "source": "Coinspeaker",
                "url": "https://www.coinspeaker.com/hashdex-sec-approves-btc-eth-xrp-sol-etf/",
                "body": "Bhushan is a FinTech enthusiast and holds a good flair in understanding financial markets. His interest in economics and finance draw his attention towards the new emerging Blockchain Technology and Cryptocurrency markets. He is continuously in a learning process and keeps himself motivated by sharing his acquired knowledge. In free time he reads thriller fictions novels and sometimes explore his culinary skills.\nKey Notes\n- The Hashdex Crypto Index ETF will comprise top crypto assets like Bitcoin, Ethereum, XRP, Solana, and Stellar in its portfolio.\n- XRP and Solana will represent 6.9% and 4.3% of the ETF, respectively, while Bitcoin and Ethereum remain dominant at 72.5% and 14.8%.\n- The SEC’s updated generic listing rules enable crypto ETFs to bypass lengthy reviews, reducing approval times from up to 270 days to 75 days.\nIn a breakthrough development, the US Securities and Exchange Commission (SEC) approved the expansion of the Hashdex Nasdaq Crypto Index ETF under the new generic listing standards. This ETF comprises the top digital assets such as Bitcoin BTC $109 640 24h volatility: 3.0% Market cap: $2.19 T Vol. 24h: $73.50 B , Ethereum ETH $3 957 24h volatility: 3.8% Market cap: $477.58 B Vol. 24h: $63.53 B , XRP XRP $2.76 24h volatility: 5.1% Market cap: $164.88 B Vol. 24h: $8.96 B , Solana SOL $196.4 24h volatility: 6.6% Market cap: $106.70 B Vol. 24h: $12.11 B , and Stellar XLM $0.35 24h volatility: 4.3% Market cap: $11.28 B Vol. 24h: $278.40 M .\nHashdex Crypto Index ETF Will Trade on Nasdaq\nThe crypto ETF will trade on Nasdaq under the ticker NCIQ. This is the second crypto ETF fund launched in a week’s time after Grayscale’s GDLC.\nThe Hashdex Crypto Index ETF is structured in Delaware and classified as an “emerging growth company.” The amended trust agreement was filed as an exhibit, confirming the product’s compliance with Nasdaq’s updated listing requirements.\nAccording to the official data, XRP will represent roughly 6.9% of the index, while Solana (SOL) will account for 4.3%. Bitcoin and Ethereum continue to dominate the portfolio with weightings of 72.5% and 14.8%, respectively, while Cardano (ADA) makes up 1.2%.\nThe addition of XRP and Solana is expected to draw greater institutional interest in both tokens. Besides, it will also open the gates for the approval of spot ETFs for both these digital assets.\nOctober to See a Flood of Crypto ETF Approvals?\nEarlier in September 2025, the US SEC announced its decision to apply the generic listing standards for crypto ETFs. Since then, asset managers have been making quick moves to take advantage of the change. Steven McClurg, founder of Canary Capital Group, said:\n“We’ve got about a dozen filings with the SEC now, and more coming. We’re all getting ready for a wave of launches.”\nThe new rules allow qualified crypto ETFs to bypass the lengthy case-by-case review process that previously delayed approvals for months. Under the old framework, approvals could take up to 270 days, whereas the revised system can clear products in as little as 75 days.\nDisclaimer: Coinspeaker is committed to providing unbiased and transparent reporting. This article aims to deliver accurate and timely information but should not be taken as financial or investment advice. Since market conditions can change rapidly, we encourage you to verify information on your own and consult with a professional before making any decisions based on this content."
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "352.1000",
            "open": "4,164.4400",
            "close": "3,886.3100",
            "high": "4,172.9700",
            "low": "3,820.8700"
        },
        "market_summary": "Institutional adoption of Ethereum is accelerating, highlighted by SharpLink's move to tokenize its SEC-registered stock directly on-chain and ETHZilla's $47 million investment in the Puffer protocol. These developments demonstrate a growing trend of traditional finance (TradFi) entities utilizing Ethereum for treasury management, yield generation, and exploring the compliant trading of tokenized assets on DeFi infrastructure. This signifies a major step in the convergence of traditional equity markets and decentralized finance, bringing substantial capital and legitimacy to the Ethereum ecosystem.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "SharpLink & Superstate Bring SEC-Registered Equity to Ethereum — Tokenized SBET Launch - SharpLink Gaming",
                "source": "SharpLink Gaming",
                "url": "https://investors.sharplink.com/sec-registered-equity-on-ethereum-sharplink-superstate-tokenize-sbet/",
                "body": "First Public Company to Natively Issue Equity on the Ethereum Blockchain; Collaboration to Explore Regulated Trading of Tokenized Shares on Automated Market Makers\nMinneapolis, MN, Sept. 25, 2025 (GLOBE NEWSWIRE) — SharpLink Gaming, Inc. (Nasdaq: SBET) (“SharpLink” or the “Company”), one of the world’s largest corporate holders of Ether (“ETH”) and prominent industry advocate of Ethereum adoption, today announced its intention to tokenize its SEC-registered common stock directly on the Ethereum blockchain, appointing financial technology firm Superstate as its Digital Transfer Agent.\nBy enabling its equity to be tokenized natively onchain, SharpLink aims to demonstrate how public companies can use blockchain infrastructure to create shareholder value, improve market efficiency and drive forward the next generation of capital markets. SharpLink intends to partner with Superstate to tokenize its equity on Ethereum through its Opening Bell platform, expanding Superstate’s multichain capital markets infrastructure.\nSharpLink and Superstate also intend to closely collaborate on advancing how tokenized public equities can ultimately trade on Automated Market Makers (“AMMs”) and other decentralized finance (“DeFi”) protocols in a fully compliant manner. This initiative aligns with the SEC’s broader Project Crypto innovation agenda aimed at modernizing U.S. securities regulation to better enable digital assets, blockchain and onchain markets.\nThis work has the potential to position SharpLink’s tokenized equity, along with future Opening Bell tokenizations, for secondary market trading on AMMs. Doing so would demonstrate how compliant tokenized securities can deliver broader utility, enhance liquidity and modernize capital flows for a new era of investor and issuer engagement.\nCommenting on the new partnership with Superstate, SharpLink Co-CEO Joseph Chalom, stated, “Tokenizing SharpLink’s equity directly on Ethereum is far more than a technological achievement – it is a statement about where we believe the future of the global capital markets is headed. At SharpLink, our core mission is two-fold: to build the world’s most trusted digital asset treasury and to pursue initiatives that accelerate the global adoption of the Ethereum network. By working with Superstate, not only are we enabling our shareholders to hold SBET shares natively on Ethereum, but we are also embarking on entirely new frontiers for how compliant, tokenized public equities could one day trade seamlessly through AMMs – an evolution we believe could redefine market structure itself.”\nJoseph Lubin, SharpLink’s Chairman of the Board, Founder and CEO of Consensys and Co-Founder of Ethereum, added, “We’re proud to have been the first public company to become a Digital Asset Treasury company on Ethereum, onboarding traditional finance to Ethereum. And now we are excited to raise the floodgates further by onboarding TradFi to composable DeFi on Ethereum. As one of the largest corporate holders of ETH, this major step forward reinforces SharpLink’s conviction that Ethereum is the foundation upon which the next generation of financial infrastructure will be built.”\nLaunched in 2025, Opening Bell is a regulated onchain issuance and tokenization platform that allows companies to tokenize SEC-registered equity via blockchain infrastructure. Shares tokenized with Opening Bell remain fully compliant and legally equivalent to traditional book-entry equity, but can also be held in self-custodied wallets, integrated with digital financial products and made available to global investor segments.\n“SharpLink will be the first public company to tokenize their shares on Ethereum using Superstate’s Opening Bell, a milestone worthy of such an important Ethereum-aligned company,” said Superstate CEO Robert Leshner. “We’re very pleased to be partnering with SharpLink as they build the ecosystem for tokenized equity on Ethereum and beyond.”\nFollowing the appointment of Lubin as Chairman and t"
            },
            {
                "title": "How is ETHZilla's $47 million investment in Puffer significant for DeFi? - OneSafe",
                "source": "OneSafe",
                "url": "https://www.onesafe.io/blog/institutional-investment-defi-impact-smes",
                "body": "ETHZilla has decided to deploy about $47 million worth of Ethereum into the Puffer protocol. This is quite significant for DeFi, isn't it?\nIt's a big deal, yes. It's not just a financial move; it's indicative of increasing interest in DeFi tools by institutional players, particularly regarding treasury management. They're putting around 10,600 ETH into Puffer to achieve better yields, which shows that institutions are now considering DeFi for capital efficiency.\nWhat effects will this investment have on the crypto market?\nHow will ETHZilla's partnership with Puffer alter the crypto landscape?\nThis partnership is expected to create more liquidity in the market and change the dynamics of restaking. When big players like ETHZilla invest in innovative protocols, they bolster market liquidity and trust. This could pave the way for broader adoption of decentralized finance.\nWhat are the implications for treasury management by ETHZilla?\nWhat does this mean for ETHZilla's treasury strategy, and does it set an example for other institutions?\nFor ETHZilla, this not only enhances their treasury strategy but also sets a standard for other institutions to consider similar moves in the DeFi space. It’s an interesting time for treasury management in crypto.\nWhat risks does this present to SMEs?\nWhat are the potential downsides for small to medium enterprises (SMEs)?\nThere are significant risks for SMEs, particularly regarding market concentration, counterparty risks, regulatory hurdles, operational vulnerabilities, financial stability risks, and privacy issues.\nHow can SMEs manage volatility from institutional investments?\nHow should SMEs handle the volatility created by institutional investments in DeFi?\nThey have a few strategies at their disposal. One is instant conversion to fiat currency when they receive crypto, which protects against price drops. Other strategies include accepting stablecoins, diversifying their crypto portfolios, and employing dollar-cost averaging. Regulatory compliance and decentralized custody solutions are also advisable.\nWhat should regulatory frameworks consider for corporate treasury management?\nWhat kind of regulatory adaptations will be necessary for corporate treasury management in DeFi?\nRegulatory frameworks need to be flexible and adaptable, based on ongoing feedback from the industry. A risk-based approach is essential, focusing on potential impacts on consumer protection and financial stability. Self-regulation and international coordination will be important for consistent standards, along with adjustments to transparency and reporting requirements.\nIn summary, institutional investments like ETHZilla's are altering the DeFi landscape. Both opportunities and challenges are on the horizon for SMEs, and strategic approaches coupled with adaptable regulatory frameworks will be critical for navigating this evolving landscape."
            },
            {
                "title": "SharpLink and Superstate Launch SEC-Registered Tokenized Equity on Ethereum with SBET Shares - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/sharplink-superstate-launch-sec-registered-150007381.html",
                "body": "SharpLink Gaming, Inc. (Nasdaq: SBET) plans to tokenize its SEC-registered common stock directly on the Ethereum blockchain, the firm announced on Thursday.\nThe move will be executed in partnership with Superstate, a financial technology firm specializing in digital transfer agency services. SharpLink said it will use Superstate’s Opening Bell platform.\nSharpLink said it seeks to showcase how public companies can use blockchain to create shareholder value, improve efficiency, and modernize capital markets.\nShares tokenized on the Opening Bell remain legally equivalent to traditional book-entry equity, while gaining functionality such as self-custody in digital wallets and integration with decentralized financial products.\nDriving the Future of Tokenized Securities\nThe partnership is designed not only to issue tokenized SBET shares but also to advance research into how regulated equities could eventually trade on Automated Market Makers (AMMs) and other decentralized finance (DeFi) protocols, said SharpLink Gaming in a press release.\nSharpLink explains that this vision aligns with the U.S. Securities and Exchange Commission’s Project Crypto agenda, which is exploring frameworks for digital assets and blockchain-driven market infrastructure.\nIf realized, trading of compliant, tokenized securities on AMMs could unlock broader liquidity and utility for investors while streamlining capital flows between issuers and markets. SharpLink and Superstate hope this collaboration will demonstrate how tokenization can bring transparency and efficiency to U.S. equity markets.\nAlignment with Ethereum’s Ecosystem\n“Tokenizing SharpLink’s equity directly on Ethereum is far more than a technological achievement—it is a statement about where we believe the future of the global capital markets is headed,” said Joseph Chalom, co-CEO of SharpLink.\n“We’re proud to have been the first public company to become a Digital Asset Treasury company on Ethereum. Now we are raising the floodgates further by onboarding traditional finance to composable DeFi,” added Joseph Lubin, chairman of SharpLink, CEO of Consensys, and co-founder of Ethereum.\nSharpLink’s ETH Treasury Strategy\nThe tokenization plan builds on SharpLink’s aggressive Ethereum treasury strategy, launched in June 2025. The company has since accumulated more than 838,000 ETH and generated 3,815 ETH in staking rewards by late September, cementing its position as one of the world’s largest corporate ETH holders.\nRobert Leshner, CEO of Superstate, called the initiative “a milestone worthy of such an important Ethereum-aligned company.” He added: “We’re very pleased to be partnering with SharpLink as they build the ecosystem for tokenized equity on Ethereum and beyond.”\nRead original story SharpLink and Superstate Launch SEC-Registered Tokenized Equity on Ethereum with SBET Shares by Tanzeel Akhtar at Cryptonews.com"
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "18.7100",
            "open": "211.9800",
            "close": "196.0800",
            "high": "212.5000",
            "low": "193.7900"
        },
        "market_summary": "The Solana ecosystem is experiencing significant institutional and developmental growth. A major exchange, MSBFUND, is deepening its strategic support with comprehensive services for Solana projects, backed by substantial funding. Concurrently, a corporation is executing a massive stock buyback funded by its large SOL treasury, signaling strong confidence, and new products are launching to broaden retail access to institutional-grade, tokenized real-world assets on the chain.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "MSBFUND Continues to Strengthen Solana Ecosystem Development, Becoming a Key Gateway for Global Compliance Access - FinancialContent",
                "source": "FinancialContent",
                "url": "https://markets.financialcontent.com/wral/article/binary-2025-9-26-msbfund-continues-to-strengthen-solana-ecosystem-development-becoming-a-key-gateway-for-global-compliance-access",
                "body": "At the 2025 Solana Global Developer Conference, the Solana ecosystem is viewed as a key infrastructure driving the explosion of next-generation Web3 application scenarios. As a leading compliant digital asset trading platform, MSBFUND.com officially announced its commitment to deepen its strategic layout within the Solana ecosystem. By providing comprehensive listing support, DApp integration, liquidity services, and infrastructure empowerment, MSBFUND aims to be the compliant access gateway for Solana developers entering the global market.\nComprehensive Support for the Solana Ecosystem, Connecting the Full Chain from Development to Trading\nCurrently, the MSBFUND platform has completed in-depth integration with the Solana ecosystem, covering multiple key support dimensions:\nSupport for All Solana Tokens: Enabling trading for the entire range of Solana tokens, including SOL, BONK, JUP, RAY, mSOL, and ensuring the latest popular projects are listed as soon as possible.\nGreen Listing Channel: Waiving basic listing fees for high-potential projects, optimizing the review process to ensure “quick, good, and sustainable” listings.\nIntegration of Native Solana DApp Modules: Opening the MSBFUND matching engine to developers, lowering the integration threshold for systems.\nStable Liquidity Support: Connecting with USDC/SOL trading pairs to facilitate smooth exchange paths between on-chain projects and real payment scenarios.\nData shows that so far, 86 Solana ecosystem projects have successfully launched trading through the MSBFUND platform, covering various sectors such as DeFi, GameFi, NFT, payments, and infrastructure. In Q3 2025, the number of users trading on the Solana chain increased by over 320% compared to the previous quarter, establishing the platform as one of the preferred trading channels for Solana projects going global.\nThe product manager of the MSBFUND platform noted, “The Solana developer community is releasing its innovative capabilities at an unprecedented speed. We hope to provide a fast track to the global market for the Solana ecosystem through multi-faceted support, including funding, liquidity, user access, and compliance bridges.”\n$150 Million Series B Financing Completed, Major Investments from Sequoia, Pantera, and Jump\nNotably, MSBFUND recently announced the completion of $150 million in Series B financing, led by Sequoia Capital, with participation from established fintech institutions including Pantera Capital, Jump Crypto, and SBI Holdings. The platform’s post-funding valuation has exceeded $1.2 billion, placing it among the global leaders.\nAccording to official disclosures, the funding will primarily focus on three core areas:\nGlobal Market Expansion: Establishing more localized compliance operation centers in key regions such as Asia, Europe, the Middle East, and the Americas, enhancing regional regulatory connectivity and customer service coverage.\nStrengthening Strategic Core Areas: Including BTC reserve strategies, SOL ecosystem layout, and RWA (Real World Assets on-chain) expansion to promote multi-chain parallelism and the integration of diverse scenarios.\nTechnology System Upgrades: Focusing on investments in the Proof of Reserve (PoR) system and AI Smart Risk Control Engine 2.0 upgrades to enhance the platform’s global leadership in asset transparency and risk compliance.\nThe platform is set to launch a fully managed asset management service for institutional users, complete with an independent clearing and settlement system and API integration interface, accelerating the construction of a “global crypto investment bank.”\nCompliance First, Creating a Trusted Gateway for the Solana Ecosystem\nAs one of the few digital asset platforms globally that have obtained U.S. MSB licensing and SEC registration, MSBFUND adheres to a compliance-first operational strategy. In regions such as Europe, Southeast Asia, and the Middle East, it is also advancing multiple compliance applications and operational plans "
            },
            {
                "title": "DeFi Development $100M Stock Buyback Signals Confidence in Solana - CoinCentral",
                "source": "CoinCentral",
                "url": "https://coincentral.com/defi-development-100m-stock-buyback-signals-confidence-in-solana/",
                "body": "TLDR\n- DeFi Development Corp. has expanded its stock buyback program to $100 million, one of the largest in the digital asset sector.\n- The company’s decision comes after its Board of Directors approved a significant increase from the initial $1 million allocation.\n- DeFi Development has accumulated over 2 million Solana (SOL) tokens as part of its strategy to build a strong blockchain treasury.\n- The expanded buyback program allows management to repurchase shares based on market conditions and regulatory requirements.\n- DeFi Development continues to grow internationally, with plans to establish a Solana Digital Asset Treasury in Korea.\nDeFi Development Corp. has significantly expanded its share repurchase program, now authorized for $100 million. This move marks one of the largest stock buybacks in the digital asset space. The company’s decision comes after its board approved a substantial increase from the initial $1 million allocation, signaling confidence in its strategy. The program will be executed under the guidelines of Rule 10b-18 of the Securities Exchange Act of 1934.\nDeFi Development Expands Its Treasury Strategy\nDeFi Development’s decision to boost its stock buyback to $100 million highlights its growing financial strength. The company’s stock repurchase initiative is part of a broader plan to build shareholder value while advancing its Solana-focused treasury strategy. “This expansion reflects the confidence we have in our long-term vision and our strong balance sheet,” a company spokesperson stated.\nhttps://x.com/defidevcorp/status/1970837949010083958\nIn the past few months, DeFi Development has made significant investments in Solana (SOL), accumulating over 2 million SOL tokens. As of September 17, the company had disclosed a total of 2,095,748 SOL, valued at approximately $499 million at the time. These tokens are staked across several validators, including its own, allowing the company to generate yield.\nDespite regulatory challenges earlier in the year, DeFi Development is committed to growing its treasury. In June, it withdrew a $1 billion filing with the U.S. Securities and Exchange Commission (SEC) but continued with capital-raising efforts. In July, the company raised $100 million through a private offering, partially funding further Solana acquisitions and stock repurchases.\nStrategic Stock Buyback Signals Confidence in Market Conditions\nThe timing of DeFi Development’s expanded buyback program comes as the company adjusts to the evolving market conditions. According to the company’s filing, the repurchases will be executed based on market factors and regulatory considerations. This flexibility allows management to make decisions in real-time, responding to both market volatility and growth opportunities.\nDeFi Development emphasized that the stock buyback does not obligate it to repurchase a fixed number of shares. The program can be suspended or altered at any time, reflecting a cautious approach despite its aggressive strategy. The company’s commitment to repurchasing shares signals a clear intent to enhance shareholder value while navigating the complexities of the digital asset market.\nThis decision further solidifies DeFi Development’s position as a leading institutional holder of Solana. The company’s focus on Solana’s long-term potential underscores its broader strategy to dominate the space as a significant blockchain player. It continues to accumulate Solana, further increasing its exposure to the cryptocurrency as part of its treasury-building strategy.\nInternational Expansion and Institutional Growth Follow Buyback Announcement\nDeFi Development’s growth trajectory also includes international expansion. Recently, the company signed a letter of intent to establish DeFi Development Corp. Korea, a Solana Digital Asset Treasury (DAT), in collaboration with Fragmetric. This international move aligns with DeFi Development’s strategy to scale its operations and diversify its presence in key markets g"
            },
            {
                "title": "Chintai and Splyce target retail access to tokenized securities on Solana - Cointelegraph",
                "source": "Cointelegraph",
                "url": "https://cointelegraph.com/news/solana-s-tokens-rwa-access-splyce-chintai",
                "body": "Real-world asset (RWA) protocols Splyce and Chintai have launched a new product on Solana designed to give retail users access to institutional-grade tokenized securities — a move that could broaden the appeal of RWA tokenization on one of the world’s largest blockchains.\nThe product is powered by strategy tokens, or S-Tokens, which provide retail users with exposure to yields generated by Chintai. While users never directly hold Chintai’s tokenized securities, S-Tokens act as a “mirror” through a loan structure backed by the underlying assets.\nS-Tokens are designed to broaden access to RWA yields beyond institutional investors. Today, most institutional RWA products operate as “walled gardens” with strict capital requirements and compliance hurdles, limiting retail participation, the companies told Cointelegraph.\nThe S-Token model aims to bridge this gap, offering retail users access to institutional-grade yields while allowing issuers to remain compliant.\nWith Splyce, users can engage with these assets directly through their existing Web3 wallets, maintaining the permissionless experience that typically defines DeFi.\n“There are no jurisdictional restrictions on where S‑Tokens can be offered — they’re as permissionless as USDC or USDT,” Ross Blyth, Splyce’s chief marketing officer, told Cointelegraph. “That said, deposits are still subject to standard KYC/AML monitoring to ensure compliance with Anti-Money Laundering requirements.”\nThe first iteration of S-Tokens will involve the Kin Fund, a tokenized real estate fund launched by Kin Capital on the Chintai network.\n“Distribution and liquidity have always been the biggest hurdles for RWAs,” Chintai managing director Josh Gordon told Cointelegraph. “Soon, institutional-grade assets will be tradable across Solana decentralized exchanges with the same ease as tokens today.”\nRelated: VC Roundup: VCs fuel energy tokenization, AI datachains, programmable credit\nA potential boost to Solana’s RWA momentum\nSolana, known for its high throughput, low fees and strong developer ecosystem, has been gaining notable traction in the real-world asset space.\nAccording to industry data, tokenized assets on Solana are now valued at more than $656 million. Only four other networks — Ethereum, ZKsync Era, Polygon and Aptos — currently support higher levels of tokenized assets.\nSince the start of the year, the value of tokenized assets on Solana has grown by more than 260%. The network’s largest non-stablecoin tokenized products include the Ondo US Dollar Yield and the Ondo Short-Term US Government Bond Fund, which provide tokenized access to yield-bearing products such as short-term US Treasurys.\nIn addition, BlackRock launched its USD Institutional Digital Liquidity Fund (BUIDL) on Solana earlier this year. While BUIDL has quickly become the dominant tokenized US Treasury product across blockchains, its presence on Solana further underscores the network’s growing role in institutional RWA adoption.\nAlthough the largest RWA products on Solana are still geared mainly toward qualified institutional buyers or accredited investors, limiting retail access, alternatives are emerging. Ondo Finance has also announced plans to extend retail access on Solana through its partnership with Alchemy Pay.\nMeanwhile, Ondo’s YieldCoin (USDY) is available to retail users on Stellar, according to MEXC.\nThese developments come as Solana emerges as a platform for tokenized equities, with Forward Industries — a Nasdaq-listed company and Solana treasury holder — planning to tokenize its stock on the blockchain through a partnership with Superstate, a regulated issuance platform.\nRelated: $400T TradFi market is a huge runway for tokenized RWAs: Animoca"
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "440.150",
            "open": "46,180.800",
            "close": "45,976.680",
            "high": "46,238.550",
            "low": "45,798.400"
        },
        "market_summary": "The Dow Jones Industrial Average (US30) showed strength in August 2025, gaining 3.2% on the back of significant rallies in key components like UnitedHealth and Apple. However, the index has recently experienced a multi-day decline, with futures trading flat as investors await key economic data and commentary from multiple Federal Reserve officials to gauge the future path of interest rates.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Stock Market Today: Indexes Fall For Third Day; IBM Leaps On Quantum Bets (Live Coverage) - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-sp500-nasdaq-gdp-jobless-claims-nvda-stock/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #4dcced92-9a9c-11f0-98d4-e975b893042b"
            },
            {
                "title": "These Were the 5 Top-Performing Stocks in the Dow Jones Industrial Average in August 2025 - aol.com",
                "source": "aol.com",
                "url": "https://www.aol.com/articles/were-5-top-performing-stocks-174700502.html",
                "body": "These Were the 5 Top-Performing Stocks in the Dow Jones Industrial Average in August 2025\nKey Points\nUnitedHealth Group led all Dow stocks with a 24.2% gain after Warren Buffett's Berkshire Hathaway disclosed a new $3.3 billion position.\nApple surged 11.8% following a $100 billion domestic manufacturing commitment designed to address potential tariff concerns.\nHome Depot gained 10.7% despite modest earnings, with management citing delayed consumer spending on major home improvement projects.\nThe Dow Jones Industrial Average (DJINDICES: ^DJI) rose 3.2% in August 2025, comfortably ahead of the broader S&P 500 (SNPINDEX: ^GSPC) index, which gained 1.9% in the same period. But the Dow's impressive performance was built on a mixed bag of specific stock performances.\nImage source: Getty Images.\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now. Learn More »\nMicrosoft (NASDAQ: MSFT) and Caterpillar (NYSE: CAT) lagged behind, with August drops of 4% or more. Meanwhile, health insurance giant UnitedHealth Group (NYSE: UNH) outweighed those underperformers with an index-leading 24.2% price gain.\nLet's check out the rest of the top-performing Dow Jones stocks last month.\n1. UnitedHealth Group (up 24.2%)\nUnitedHealth took a tumble with a weak earnings report at the end of July, but bounced back in August. The stock soared on Aug. 15, as Warren Buffett's Berkshire Hathaway reported a brand-new position of 5 million shares in the stock. The $3.3 billion merger with home health specialist Amedisys was completed on the same day, adding fuel to the fires. All told, UnitedHealth's stock moved 0.7% lower across the two-month span of July and August.\n2. Apple (up 11.8%)\niPhone maker Apple (NASDAQ: AAPL) surged 12% in the first week of August. The company addressed tariff concerns by expanding its domestic manufacturing commitments. The four-year commitment of an additional $100 billion includes partnerships with Texas Instruments and Corning.\nAdvertisement\n3. American Express (up 10.7%)\nCredit services giant American Express (NYSE: AXP) sprinted higher by landing several valuable sporting sponsorships in the Miami area. The deals include the Formula 1 Miami Grand Prix and the Miami Dolphins football team.\n4. Home Depot (up 10.7%)\nHome improvement retailer Home Depot (NYSE: HD) reported modest Q2 results last month. The stock still rose; management said that consumers are just delaying their big-ticket home improvement projects. The financial results should improve over time.\n5. Sherwin-Williams (up 10.6%)\nPaint retailer Sherwin-Williams (NYSE: SHW) followed the same themes as Home Depot. Instead of an earnings report, the global company refinanced its credit facilities with better terms in Canada and Europe.\nShould you invest $1,000 in UnitedHealth Group right now?\nBefore you buy stock in UnitedHealth Group, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and UnitedHealth Group wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $672,879!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,086,947!*\nNow, it’s worth noting Stock Advisor’s total average return is 1,066% — a market-crushing outperformance compared to 186% for the S&P 500. Don’t miss out on the latest top 10 list, available when you join Stock Advisor.\n*Stock Advisor returns as of September 8, 2025\nAmerican Express is an advertising partner of Motley Fool Money. Anders Bylund has positions in UnitedHealth Group. The Motley Fool has positions in and recommends Apple, Berkshire Hathaway, Home Depot, Microsoft, and Texas Instruments. The Motley Fool recommends Corning, Sherwi"
            },
            {
                "title": "Stock Market Today: S&P 500, Nasdaq And Dow Jones Futures Flat, As Investors Brace For Multiple Fed Official Remarks — Costco Earnings In Focus - Apple (NASDAQ:AAPL), Accenture (NYSE:ACN) - Benzinga",
                "source": "Benzinga",
                "url": "https://www.benzinga.com/markets/market-summary/25/09/47860816/stock-market-today-sp-500-nasdaq-and-dow-jones-futures-flat-as-investors-brace-for-multiple-fed-official-remarks-costco-earnings-in-focus",
                "body": "U.S. stock futures are trading mixed on Thursday following a decline on Wednesday, with no significant movements across major benchmark indices.\nThe futures markets remain calm ahead of the weekly jobless claims data that are set to be released on Thursday, offering an essential economic data point to influence monetary decisions by the Federal Reserve.\nThis comes as several regional Federal Reserve officials are scheduled to speak on Thursday, offering their outlook on the economy and monetary policies.\nSee Also: The Fed May Cut Less Than You Think, And That Could Hit Stocks Hard: Oxford Economics\nMeanwhile, the 10-year Treasury bond yielded 4.139% and the two-year bond was at 3.604%. The CME Group’s FedWatch tool‘s projections show markets pricing a 91.9% likelihood of the Federal Reserve cutting the current interest rates in its October meeting.\nThe SPDR S&P 500 ETF Trust (NYSE: SPY) and the Invesco QQQ Trust ETF (NASDAQ: QQQ), which track the S&P 500 index and the Nasdaq 100, respectively, are flat in pre-market trade, according to Benzinga Pro data.\nCues From Last Session\nMost S&P 500 sectors were in the red on Wednesday, with materials, real estate, and communications leading the way, while energy, utilities and consumer discretionary inched up.\nThe Nasdaq Composite fell 77 points during the session, followed by the S&P 500, down 19 points, and the Dow Jones Industrial Average by 171.50.\nAmong specific movers, Intel Corp. (NASDAQ: INTC) rallied 6.41% on Wednesday, following reports that the company was seeking an investment from Apple Inc. (NASDAQ: AAPL) as part of its turnaround attempts.\nThe New Home Sales data on Wednesday came in significantly ahead of estimates at 800,000, ahead of the median forecast at 649,000, and the prior quarter figures at 664,000.\nInsights From Analysts\nAnalyst Mike Zaccardi highlighted results from the American Association of Individual Investors, which he notes maintains a bullish percentage similar to the previous week. Of the individual investors polled, 41.7% poll bullish, with 19.1% neutral and 39.2% bearish.\nSimilarly, 27% of the AAII say there is a “higher than normal” chance of a recession before the end of this fiscal year, while most continue to believe that the probabilities are “unlikely.”\nUpcoming Economic Data\nHere’s what investors will be keeping an eye on Thursday;\n- At 8:20 a.m. ET, Chicago Fed President Austan Goolsbee speaks.\n- At 8:30 a.m. ET, a wave of reports hit: initial jobless claims for the week of Sept. 20, the final Q2 GDP estimate, August's advanced trade balance in goods, retail inventories, wholesale inventories, and durable-goods orders (including the ex-transportation measure).\n- At 9:00 a.m. ET, New York Fed President John Williams delivers opening remarks, while Kansas City Fed President Jeff Schmid also speaks.\n- At 10:00 a.m. ET, Fed Vice Chair for Supervision Michelle Bowman speaks, alongside the August existing home sales data.\n- At 1:00 p.m. ET, Fed Governor Michael Barr delivers remarks.\n- At 1:40 p.m. ET, Dallas Fed President Lorie Logan speaks.\n- At 3:30 p.m. ET, San Francisco Fed President Mary Daly rounds out the Fed speakers with a scheduled appearance.\nStocks In Focus\n- Costco Wholesale Corp. (NASDAQ: COST) is up 0.43% pre-market ahead of its fourth quarter earnings report, scheduled to be released after markets close on Thursday.\n- Accenture PLC (NYSE: ACN) is set to release its third-quarter results before markets open, and the stock remains flat in pre-market trade.\n- Jabil Inc. (NYSE: JBL), the American manufacturing company, is up 2.31% pre-market, ahead of its fourth quarter results scheduled for Thursday morning.\n- TD Synnex Corp. (NYSE: SNX) is soaring in pre-market trade, up 2.43%, ahead of its fourth quarter results at 9 AM on Thursday.\n- Carmax Inc. (NYSE: KMX) is set to release its second-quarter figures before markets open on Thursday, with the stock up 2% pre-market.\nCommodities, Gold, And Global Equity Markets\nCrude oil futures we"
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "46.800",
            "open": "9,240.440",
            "close": "9,241.690",
            "high": "9,250.690",
            "low": "9,203.890"
        },
        "market_summary": "The UK100 (FTSE 100) declined due to persistent domestic inflation and external pressures from US investigations into medical imports, which rattled investor confidence. While mining stocks surged on a rally in copper prices, broader market sentiment was weighed down by concerns over delayed interest rate cuts from the Bank of England and weakness in sectors like healthcare and construction.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "London Stocks Slip As Inflation And Medical Probes Rattle Investors - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/london-stocks-slip-as-inflation-and-medical-probes-rattle-investors",
                "body": "about 10 hours ago • 2 mins\nJoin the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nLondon’s top stock indexes slid as persistent UK inflation and US investigations into imported medical goods spooked investors, but metal miners surged after copper notched its biggest rally in over a year.\nWhat does this mean?\nBoth the FTSE 100 and FTSE 250 closed in the red, dragged lower by worries over UK inflation, which remains the highest among G7 countries at 3.8%. A Bank of England official signaled that interest rate cuts could come slower than markets expect, adding more pressure on sectors sensitive to borrowing costs. Medical equipment stocks dipped after the US launched new national security reviews of imported health products, sending Convatec down over 6%. Construction stocks followed their European peers lower, and Mitchells & Butlers fell as sales growth slowed. On the flip side, Petershill Partners soared more than 33% after announcing plans to delist from London due to lackluster valuations. The day’s winners were industrial miners like Rio Tinto and Anglo American, which rallied as copper prices hit a 15-month high – a bullish sign for global demand. Investors are now looking ahead to updates from at least seven US Federal Reserve officials, hoping for direction on future interest rate moves.\nWhy should I care?\nFor markets: Inflation’s shadow keeps risk appetite in check.\nSticky inflation and uncertainty around interest rates are making investors more cautious, especially in the UK and across Europe. Sectors like healthcare and construction are under strain, while Petershill's decision to leave the London Stock Exchange highlights ongoing challenges for local capital markets. But it’s not all bleak – commodity-driven sectors are outperforming as global demand props up prices, with mining stocks enjoying strong gains thanks to copper’s surge.\nThe bigger picture: Central banks hold the keys to recovery.\nThe UK’s persistent inflation is setting it apart from other major economies and forcing the Bank of England to move slowly on rate cuts. Meanwhile, upcoming signals from US Federal Reserve officials could influence expectations for monetary policy worldwide. Whether rates come down or stay higher for longer could have lasting effects on investment decisions, sector performance, and the overall path to economic recovery.\nProspero.ai’s high-tech signals and plays are helping investors make smarter decisions.\nNow, you can benefit as they do: Prospero’s crowdfunder is open.\nHere’s what you need to know:\nNo wonder the platform was named the Best AI Fintech by the Global Financial Market Review, while winning the award for the Most Influential CEO 2025 Financial Technology from CEO Monthly.\nIf you want to invest in an investor favorite, check out Prospero.ai's crowdfunder here.\nInvesting in private securities is risky, speculative, and illiquid. You should not invest unless you can afford to lose the entire amount invested. Past performance is not indicative of future results. Please review the full offering materials and disclosures before making an investment decision.\nMentioned in story\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nInsight\nReda Farran, CFA • about 16 hours ago\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an"
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "354.250",
            "open": "23,725.300",
            "close": "23,575.800",
            "high": "23,734.300",
            "low": "23,380.050"
        },
        "market_summary": "**No relevant news articles with clean content were found.**",
        "source_articles": []
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "369.000",
            "open": "24,524.610",
            "close": "24,411.530",
            "high": "24,568.860",
            "low": "24,199.860"
        },
        "market_summary": "The NDX100 is facing pressure as strong economic data, including robust GDP growth and low jobless claims, fuels concerns that the Federal Reserve may delay interest rate cuts. This has led to rising Treasury yields, which particularly hurt high-valuation tech stocks, causing the Nasdaq to extend its decline. However, the broader market shows resilience with mixed sector performance, and individual stories like Intel's surge on partnership news highlight there are still positive catalysts within the index.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "We Think Research Solutions' (NASDAQ:RSSS) Robust Earnings Are Conservative - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/think-research-solutions-nasdaq-rsss-184722291.html",
                "body": "Research Solutions, Inc.'s (NASDAQ:RSSS) strong earnings report was rewarded with a positive stock price move. We did some digging and found some further encouraging factors that investors will like.\nExamining Cashflow Against Research Solutions' Earnings\nMany investors haven't heard of the accrual ratio from cashflow, but it is actually a useful measure of how well a company's profit is backed up by free cash flow (FCF) during a given period. In plain english, this ratio subtracts FCF from net profit, and divides that number by the company's average operating assets over that period. You could think of the accrual ratio from cashflow as the 'non-FCF profit ratio'.\nAs a result, a negative accrual ratio is a positive for the company, and a positive accrual ratio is a negative. While it's not a problem to have a positive accrual ratio, indicating a certain level of non-cash profits, a high accrual ratio is arguably a bad thing, because it indicates paper profits are not matched by cash flow. Notably, there is some academic evidence that suggests that a high accrual ratio is a bad sign for near-term profits, generally speaking.\nFor the year to June 2025, Research Solutions had an accrual ratio of -1.57. That implies it has very good cash conversion, and that its earnings in the last year actually significantly understate its free cash flow. In fact, it had free cash flow of US$7.0m in the last year, which was a lot more than its statutory profit of US$1.27m. Research Solutions shareholders are no doubt pleased that free cash flow improved over the last twelve months.\nThat might leave you wondering what analysts are forecasting in terms of future profitability. Luckily, you can click here to see an interactive graph depicting future profitability, based on their estimates.\nOur Take On Research Solutions' Profit Performance\nAs we discussed above, Research Solutions' accrual ratio indicates strong conversion of profit to free cash flow, which is a positive for the company. Because of this, we think Research Solutions' underlying earnings potential is as good as, or possibly even better, than the statutory profit makes it seem! And it's also positive that the company showed enough improvement to book a profit this year, after losing money last year. At the end of the day, it's essential to consider more than just the factors above, if you want to understand the company properly. Ultimately, this article has formed an opinion based on historical data. However, it can also be great to think about what analysts are forecasting for the future. Luckily, you can check out what analysts are forecasting by clicking here."
            },
            {
                "title": "MillerKnoll: The Post-Earnings Drop Is A Buying Opportunity (NASDAQ:MLKN) - Seeking Alpha",
                "source": "Seeking Alpha",
                "url": "https://seekingalpha.com/article/4825884-millerknoll-the-post-earnings-drop-is-a-buying-opportunity",
                "body": "I wrote an article about MillerKnoll, Inc. (NASDAQ:MLKN) in June 2025. At that time the stock was trading for about $17.22 and I gave it a Buy rating. The stock has rallied since then, and it recently\nMillerKnoll: The Post-Earnings Drop Is A Buying Opportunity\nSummary\n- MillerKnoll, Inc. shares plunged post-earnings, returning to attractive levels near $17, presenting a potential buying opportunity with a compelling 4% dividend yield.\n- Q1 2026 results were solid, with revenue up 10.9% and EPS of $0.45, but guidance and new store plans weighed on sentiment.\n- MLKN's upside catalysts include possible tariff relief, successful new store openings, and further Fed rate cuts, though economic risks remain.\n- Valuation appears deeply undervalued; I plan to accumulate MLKN shares gradually, balancing recession risks with strong brands and income potential.\nAnalyst’s Disclosure:I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.\nSeeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body."
            },
            {
                "title": "Dow Dips as Fed Fears Slam Tech Stocks – Hot Economic Data Rattles Wall Street (Sept 25, 2025) - ts2.tech",
                "source": "ts2.tech",
                "url": "https://ts2.tech/en/dow-dips-as-fed-fears-slam-tech-stocks-hot-economic-data-rattles-wall-street-sept-25-2025/",
                "body": "U.S. Stock Market News Roundup for September 25, 2025\n- Stocks Mixed After Early Selloff: Major U.S. indexes struggled for direction on Thursday. The Dow Jones Industrial Average and S&P 500 closed roughly flat after paring early losses, while the tech-heavy Nasdaq Composite extended its decline for a third straight session amid renewed weakness in heavyweight tech shares [1] [2]. Volatility remained contained – the “fear index” (VIX) ticked down to around 16, signaling no panic despite the pullback [3].\n- Red-Hot Economic Data Surprises: Fresh data showed the U.S. economy firing on all cylinders. Second-quarter GDP growth was revised up to 3.8% annualized – the fastest pace in nearly two years – beating forecasts of 3.3% [4] [5]. Meanwhile, weekly jobless claims fell to 218,000, a new low since mid-July, indicating a still-tight labor market [6]. A 20.5% surge in new home sales to 800,000 units (annualized) – the highest since early 2022 – further underscored economic strength [7]. The robust reports fueled speculation that the Federal Reserve may delay or reduce the scope of future interest-rate cuts, lifting Treasury yields and the U.S. dollar [8] [9].\n- Fed Sends Mixed Signals: Federal Reserve officials offered contrasting commentary that kept investors on edge. Fed Chair Jerome Powell warned this week that asset prices “are fairly highly valued,” a cautionary note that tempered hopes for aggressive rate relief [10]. He described a “challenging” policy road ahead, balancing still-elevated inflation against a cooling jobs market. In contrast, Fed Governor Stephen Miran argued Thursday that the Fed risks harming the economy by not cutting rates more rapidly [11]. Traders have accordingly dialed back expectations – futures markets, which once priced in steady rate cuts, now show uncertainty about another Fed rate reduction this year [12].\n- Tech Stocks Tumble on Valuation Jitters: High-flying tech and AI stocks led the market’s weakness. The elite “Magnificent Seven” mega-cap tech companies fell nearly 2% as a group amid profit-taking and rising bond yields [13]. Market darlings like Nvidia, Amazon, and Microsoft – which fueled 2025’s rally – extended their slide as investors questioned stretched valuations [14]. These interest-rate sensitive growth shares have been hardest hit by the uptick in yields, which makes future earnings less attractive.\n- Intel Soars on Apple Investment Buzz: Not every tech stock struggled. Intel shares surged ~6% after reports that the embattled chipmaker approached Apple about a potential strategic investment [15]. The talks are preliminary, but they come on the heels of Nvidia’s $5 billion stake in Intel (for a 4% holding) announced days ago [16], plus a recent $2 billion infusion from SoftBank [17]. Intel’s stock has now climbed over 40% since mid-August on hopes that big partnerships – and a $10 billion U.S. government stake to expand chip factories – will turbocharge its turnaround [18] [19].\n- Energy & Commodities in Focus: The energy sector outperformed as oil prices hovered near one-year highs. U.S. crude futures, which spiked over 2% on Wednesday after a surprise inventory drawdown, held close to ~$95 a barrel [20]. Oil majors and refiners rallied on the supply-tightening trend, helping the S&P 500’s energy sector jump about 1% [21]. In contrast, gold prices pulled back from recent record levels as rising real yields dulled the appeal of the safe-haven metal [22]. The U.S. Dollar Index hit its highest level in months around the mid-98 range [23], bolstered by the strong U.S. data and interest-rate outlook.\n- Macro Risks Mount – Shutdown and Geopolitics: Washington brinksmanship is creeping into market calculations. With Congress locked in a budget stalemate, a federal government shutdown looms on October 1 if a funding deal isn’t reached, injecting uncertainty into the economic outlook [24]. The White House has even directed agencies to draft contingency plans for potential furloughs and s"
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "80.960",
            "open": "6,644.460",
            "close": "6,609.240",
            "high": "6,652.710",
            "low": "6,571.750"
        },
        "market_summary": "The provided articles do not contain any information relevant to the SPX500 (S&P 500 index). The dossier consists of news about political decisions regarding vaccine policy, a report on an NFL player's performance, and an entertainment piece about a K-pop star's fashion show appearance. There is no data on market performance, corporate earnings, economic indicators, or Federal Reserve policy that would allow for a market summary.\nSENTIMENT: Neutral\n\n**Overall Market Sentiment:** Neutral",
        "source_articles": [
            {
                "title": "RFK Jr.’s big vaccine decision - Politico",
                "source": "Politico",
                "url": "https://www.politico.com/news/2025/09/25/how-rfk-jr-could-change-vaccine-recommendations-without-the-experts-00581054",
                "body": "RFK Jr.’s big vaccine decision\nHealth Secretary Robert F. Kennedy Jr. or the acting CDC director could create new recommendations without a vote from the panel, giving the health secretary broad authority over the childhood vaccine schedule. But there's little precedent for such a move.\nPresident Donald Trump speaks in the Roosevelt Room of the White House, Sept. 22, 2025, in Washington, as HHS Secretary Robert F. Kennedy Jr. listens. | Mark Schiefelbein/AP\nDecision time is looming for Health Secretary Robert F. Kennedy Jr.\nThe Centers for Disease Control and Prevention usually approves changes to the vaccine schedule teed up by its external advisory panel. But there may now be some daylight between Kennedy and the CDC’s Advisory Committee on Immunization Practices, which last week made decisions that — at least on the surface — appeared surprising for a group whose members Kennedy handpicked.\nKennedy, himself or through his acting CDC director, Jim O’Neill, has the power to accept or reject ACIP’s recommendations — which, if approved, wouldn’t alter the vaccine schedule as much as many public health advocates expected. The panel tabled a proposal to delay vaccinating certain newborns for hepatitis B; did not recommend that states and localities require prescriptions for the Covid-19 vaccine; and endorsed allowing anyone 6 months and older to get a Covid shot.\nKennedy could create new recommendations without a vote from the panel, giving the health secretary broad authority over the childhood vaccine schedule, though there’s little precedent for such a move.\nPresident Donald Trump appears to have further complicated Kennedy’s decisionmaking by pushing dramatic changes to the vaccine schedule at a White House event Monday to address a supposed connection between Tylenol use by pregnant women and autism.\nTrump linked childhood vaccines and the timeline in which they’re administered to autism diagnoses — a theory discredited by numerous scientific studies — and suggested that the schedule needed to be overhauled. He also said he thought hepatitis B vaccination should be pushed back from an infant’s first day of life to age 12.\nIt’s unclear when the CDC’s decision will be announced, though it could come any day now, or which way Kennedy is leaning. HHS spokesperson Andrew Nixon noted that the recommendations become “part of the CDC immunization schedule if it is adopted by the CDC director,” but declined to comment on Kennedy’s timing.\nStill, many public health advocates are worried.\n“I think [Kennedy] has ultimate power in terms of these sorts of things,” said Dr. Paul Offit, director of the Vaccine Education Center at Children’s Hospital of Philadelphia and a former ACIP member. “That’s what makes it all so frightening, because he’s a man on a mission, and his mission is to make vaccines less available, less affordable.”\nThere’s precedent for HHS ignoring its vaccine advisers. Then-CDC Director Rochelle Walensky overruled the committee in 2021 to more broadly recommend third doses of Covid vaccines than the panel recommended.\nBut Dr. Richard Besser, CEO of the Robert Wood Johnson Foundation and a former acting CDC director under President Barack Obama, said Walensky’s decision was understandable. The Covid pandemic was still raging, and ACIP’s advice to limit booster doses to older people and those with preexisting medical conditions came after a divided vote.\n“Dr. Walensky’s decision expanded eligibility for potentially life-saving vaccines,” he said in an email. “Secretary Kennedy, on the other hand, seems determined to restrict access as much as he can.”\nKennedy has deviated from the normal process before. In May, he changed the Covid vaccine guidance without an ACIP vote, removing the recommendation that pregnant women get vaccinated and advising that healthy children “may” get the shot after conferring with their doctors.\nKennedy fired all 17 members of the advisory panel in June, citing conflicts of interest, and has repla"
            },
            {
                "title": "Marvin Harrison Jr.'s struggles continue with a huge drop, but he rebounds with a TD - Yahoo Sports",
                "source": "Yahoo Sports",
                "url": "https://sports.yahoo.com/nfl/article/marvin-harrison-jrs-struggles-continue-with-a-huge-drop-but-he-rebounds-with-a-td-012702077.html",
                "body": "Marvin Harrison Jr.'s struggles continue with a huge drop, but he rebounds with a TD\nLast week Marvin Harrison Jr. had a bad drop. He was wide open downfield, Kyler Murray delivered a good pass and Harrison simply had it go through his arms.\nAt least that one hit the ground and was incomplete.\nHarrison's struggles early in his second season were on full display for a big audience that turned in for Thursday night's game, and a big mistake became a turnover. The Arizona Cardinals receiver had a perfect pass hit him right in the hands over the middle of the field, but it bounced off his hands and when he tried to gather it, the ball caromed in the air and right to Seattle Seahawks linebacker Ernest Jones IV for an interception.\nThe Seahawks went on to win 23-20 on a field goal as time expired.\nHarrison was supposed to be a transcendent player coming out of Ohio State. He was viewed as one of the top receiver prospects in a long time, and was taken fourth in the NFL Draft after three quarterbacks went off the board. It has not worked out anywhere close to how he or the Cardinals had hoped.\nHarrison did bounce back for a really nice touchdown in the fourth quarter. He caught it over Pro Bowl cornerback Devon Witherspoon in the end zone for the Cardinals' first touchdown of the night.\nHarrison needed a play like that.\n[Yahoo Sports TV is here! Watch live shows and highlights 24/7]\nHarrison had an uneven rookie season, but was still good enough that bigger things were expected his second season. He had a solid opener but then had just 71 yards in Arizona's next two games, everyone saw his embarrassing drop against the 49ers, and then he had the drop on Thursday night that led to an interception. Before that, Harrison and Murray had a big miscommunication that led to Murray throwing to nobody on the right side as Harrison continued to run upfield.\nHarrison's struggles are becoming such an issue that on the Amazon Prime Video pregame show, former NFL tight end Tony Gonzalez said he talked to Harrison about his own issues with drops his second season.\nHarrison's touchdown didn't completely erase the massive drop that led to the interception. But it was a needed reprieve from his struggles."
            },
            {
                "title": "SEVENTEEN's S.Coups Makes Runway Debut Closing Boss's MFW Show — See Photos - Teen Vogue",
                "source": "Teen Vogue",
                "url": "https://www.teenvogue.com/story/seventeen-scoups-runway-debut-boss-mfw-ss26-show-see-photos",
                "body": "S.Coups, the leader of K-pop group SEVENTEEN, is taking his next steps in his fashion career — quite literally — and making his runway debut by closing out Boss's womenswear spring-summer 2026 show as part of Milan Fashion Week.\nOn September 25, 2025, S.Coups surprised fans by doing the honor of closing designer Marco Falcioni's latest show, rocking the final look from the collection, comprised of a long brown leather trench coat with a matching sheer blouse, black crepe pants with a statement belt, and black shoes.\nS.Coups walked alongside models like Ashley Graham, Paloma Elsesser, and more, in front of a star-studded crowd that included David Beckham, Chloë Bailey, Noah Beck, Rudy Pankow, and more.\nThe show marked another milestone for S.Coups and Boss. The star was named a global ambassador for the brand in April 2025. Shortly after, he made his Met Gala debut wearing a custom look by Boss inspired by traditional Korean clothing. What's next for S.Coups and Boss? We'll have to wait and see, given the pace we're going, and we'd say something big.\nS.Coups's runway debut arrives just days before the star is set to debut under a new SEVENTEEN subunit with fellow member Mingyu. The duo, now known as CxM (SEVENTEEN), will release their first mini-album, titled Hype Vibes, on September 29, 2025.\nIf you missed SEVENTEEN's leader S.Coups walking the Boss spring-summer 2026 runway, you can rewatch the show's livestream below:"
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "565.000",
            "open": "45,659.630",
            "close": "45,608.920",
            "high": "45,814.630",
            "low": "45,249.630"
        },
        "market_summary": "The Nikkei 225 showed resilience, trading near flat after an initial sell-off, as a weakening yen provided a boost to export-heavy sectors. Investor expectations have shifted, with many now betting the Bank of Japan will maintain a longer pause on rate hikes, contributing to the yen's decline. This currency move and excitement around AI and a strong brewery IPO provided support, offsetting early pressure from declines in U.S. equities.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Yen dips to 2-month low against dollar as investors bet on longer BOJ pause - Nikkei Asia",
                "source": "Nikkei Asia",
                "url": "https://asia.nikkei.com/business/markets/currencies/yen-dips-to-2-month-low-against-dollar-as-investors-bet-on-longer-boj-pause",
                "body": "CurrenciesYen dips to 2-month low against dollar as investors bet on longer BOJ pause\nExpectations of Fed interest rate cut also fall after GDP and jobs numbers\nTokyo's unexpectedly stable inflation has led some investors to believe that the Bank of Japan is in no hurry to raise interest rates. (Photo by Akira Kodaka)\nJADA NAGUMO\nSeptember 26, 2025 13:32 JST\nTOKYO -- The Japanese yen depreciated to the weakest level in almost two months against the dollar as investors back-peddled on their expectations that the Bank of Japan would raise interest rates soon. Stronger than expected U.S. economic indicators also tempered anticipation of an interest rate cut by the Federal Reserve."
            },
            {
                "title": "The Nikkei Average was down by approximately 20 yen, with notable decliners including Disco, Laser Tech, and Sumitomo Pharma. - 富途牛牛",
                "source": "富途牛牛",
                "url": "https://news.futunn.com/en/post/62634784/the-nikkei-average-was-down-by-approximately-20-yen-with",
                "body": "At around 11 a.m. on the 26th, the Nikkei Stock Average was trading near 45,730 yen, down approximately 20 yen from the previous day's close. Selling pressure took the lead early in the morning due to declines in U.S. equities. At 9:24 a.m., the index hit an intraday low of 45,423.08 yen, down 331.85 yen. However, the market saw some resilience later on, supported by buying for dividend rights in September and a weaker yen, with the index briefly turning positive. The dollar-yen exchange rate hovered around 149.80 yen, showing limited movement.\nAmong the companies listed in the Nikkei Average, notable decliners included Disco <6146.T>, Laser Tech <6920.T>, Sumitomo Pharma <4506.T>, SUMCO <3436.T>, and M3 <2413.T>. On the other hand, top gainers were Nippon Steel <5631.T>, Fujifilm <4901.T>, Ajinomoto <2802.T>, Mitsubishi Estate <8802.T>, and Tokyu Land <8804.T>.\nProvided by: Wealth Advisor Co."
            },
            {
                "title": "Japanese Stocks Edge Up As Weaker Yen Lifts Exporters - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/japanese-stocks-edge-up-as-weaker-yen-lifts-exporters",
                "body": "Join the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nJapanese stocks ticked higher on Wednesday, with the Nikkei 225 up 0.27% to 45,754.93, as export-heavy sectors rallied on a weaker yen and excitement grew around AI and a splashy brewery IPO.\nWhat does this mean?\nA sliding yen gave a boost to Japan’s globally focused giants, pushing autos, electronics, and machinery stocks higher. Hopes for a near-term Bank of Japan rate hike added momentum for banks, after the central bank hinted at tighter policy and trimmed bond-buying by 400 billion yen. Sentiment got another lift from AI fever and expectations for softer inflation, with SoftBank shares up 3.1%. New listings made headlines too—Orion Breweries’ IPO jumped 4.7% on its first day. Not everyone shared in the rally, though—Advantest fell 2.4% amid weak US tech signals and pricey Japanese valuations, and Takeda slipped 0.3% after moving internal funds. Meanwhile, D. Western Therapeutics soared 46.3% after its new pain patch secured US FDA approval, paving the way for American sales by 2026.\nWhy should I care?\nFor markets: Currency swings shape investor sentiment.\nA weaker yen usually spells good news for Japanese exporters by making their products more competitive abroad, and that trend was seen in the Nikkei’s recent climb. But with the Bank of Japan signaling possible rate hikes and cutting bond purchases to 3.7 trillion yen, investors are watching financials and industrials for the next big moves as inflation edges down toward 2%.\nThe bigger picture: Structural shifts redefine Japan’s growth story.\nJapan’s gradual move toward tighter monetary policy and its resilience amid global economic changes are drawing renewed international attention. Fresh IPO activity—like Orion Breweries’ debut—points to confidence in consumer recovery, while major FDA wins for Japanese pharma firms highlight the country’s continued push for innovation and a global presence.\nProspero.ai’s high-tech signals and plays are helping investors make smarter decisions.\nNow, you can benefit as they do: Prospero’s crowdfunder is open.\nHere’s what you need to know:\nNo wonder the platform was named the Best AI Fintech by the Global Financial Market Review, while winning the award for the Most Influential CEO 2025 Financial Technology from CEO Monthly.\nIf you want to invest in an investor favorite, check out Prospero.ai's crowdfunder here.\nInvesting in private securities is risky, speculative, and illiquid. You should not invest unless you can afford to lose the entire amount invested. Past performance is not indicative of future results. Please review the full offering materials and disclosures before making an investment decision.\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nInsight\nReda Farran, CFA • about 16 hours ago\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article is based on reporting by MT Newswires. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies.\nGet the two biggest stories in finance, and the reasons why you should care, delivered to your inbox every day."
            }
        ]
    }
]