[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "132.580",
            "open": "4,762.070",
            "close": "4,831.640",
            "high": "4,888.640",
            "low": "4,756.060"
        },
        "market_summary": "### Gold (XAU/USD) Market Briefing\n\n* **Key Drivers:** The **US dollar's weakness** and **geopolitical tensions**, particularly the US-Europe trade tensions and the dispute over Greenland, are driving **bullish momentum** for gold.\n* **Price Action:** Gold has reached a new record high, breaking above **$4,800**, with the spot price hitting **$4,888.80** per ounce, driven by **safe-haven demand**.\n* **Technical Outlook:** The immediate resistance is near **$4,900**, with support at **$4,800**, as gold continues its **upward trend** fueled by **inflation** and **uncertainty**.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Gold Extends Rally as US Dollar Weakness Restores Classic Correlation - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/analysis/gold-extends-rally-as-us-dollar-weakness-restores-classic-correlation-200673643",
                "body": "Trump says reached framework deal on Greenland, won’t be imposing tariffs\nThe US Dollar is losing momentum fast after failing to reclaim a key resistance zone, and bears are now pushing for another leg lower.\nAt the same time, gold is taking full advantage of that weakness and just powered through major upside levels. Today is all about watching whether the dollar keeps bleeding - because as long as it does, metals stay in the driver’s seat\nUSD Index (DX.F): Bears Are Back in Control\nLet’s open today’s Note by revisiting the quote from Jan. 14:\n“(…) Friday’s failed move above the upper border of the mentioned rising channel translated into unsuccessful breakout above the 61.8% Fibonacci retracement. Additionally, bulls didn’t manage to close the early-December gap, which together with the current position of the indictors (Stochastic has already printed a sell signal, while CCI is deep in overbought territory and close to rolling over) raises the probability that the dollar’s next meaningful move will be to the south toward the downside targets we’ve already discussed on Friday (…)”\nFrom today’s perspective, we clearly see that the daily chart shows that despite multiple attempts to break above the resistance zone we discussed a week ago, bulls failed to close the gap, which triggered a strong bearish reaction.\nYesterday’s session opened with another large red downside gap, and when you combine that with fresh sell signals, it basically gave bears a green light to execute the bearish scenario we outlined on Jan. 12:\n“(…) If sellers regain control and close the day under the upper line of the channel, their first downside target will likely be the previously broken area around 98.53. A clean break below that level could expose 98.26, and potentially even a move toward the lower border of the mentioned channel. (…)”\nAnd as we see, the market delivered: sellers pushed DX.F straight down into 98.09, printing a daily low slightly below both of our downside targets during yesterday’s session.\nEven though we saw some rebound later, Wednesday opened with yet another red downside gap, which, combined with sell pressure still active, suggests another push lower could be right around the corner.\nFirst downside target? At least a retest of yesterday’s low.\nIf bulls don’t step in there, the next bearish destination becomes the next major support zone based on the October 6, 2025 upside gap (97.41–97.64) + the 61.8% Fibonacci retracement. At this point, it is worth noting that this important support zone already stopped sellers twice in December, therefore, it’s one of those “watch it like a hawk” areas in the near term.\nUSD Index (H4): Breakdown Confirmed\nLet’s recall one more quote from Jan.14:\n“(…) two unsuccessful attempts to go above the channel adds technical weight and strongly suggests the dollar may retest the 98.50 support zone in the near term. (…)”\nOn the H4 chart, we can clearly see that even though bulls managed to climb above 99, the upper border of the black rising channel + the red resistance zone was simply too much.\nAfter several days of consolidation, buyers finally ran out of fuel, and bears stormed the market.\nFrom this timeframe, we see that the latest decline took the dollar below the lower boundary of the black rising channel, which means that until we see an invalidation of this breakdown, any bounce should be treated as a corrective move inside a broader bearish swing.\nYes, H4 indicators did flash early buy signals, but as long as those daily red gaps stay open and DX.F remains below the channel, bears still have the upper hand.\nSo… what does this mean for gold?\nLast week’s quote turned out to be a good compass for recent price action:\n“(…) As the chart above shows, the U.S. dollar has been rising since the start of the year, while gold and silver have not weakened. In fact, the correlation between USD and metals has increased, not decreased.\nHow to read this?\n(…) That doesn’t mean the relationship is broken forev"
            },
            {
                "title": "Current price of gold as of January 21, 2026 - Fortune",
                "source": "Fortune",
                "url": "https://fortune.com/article/current-price-of-gold-01-21-2026/",
                "body": "At 9:05 a.m. Eastern Time today, gold was valued at $4,857 per ounce. That’s a $120 uptick from the same time yesterday and a $1,981 gain over the past year.\nIf you want an investment that isn’t directly impacted by inflation variance, gold may fit the bill. Gold has a long-term record of appreciating in value. One of the more common ways of buying and holding gold is a gold IRA. It’s also a practical choice for those who want to avoid the cost and burden of storing physical gold.\nHistorical gold price chart\nGold doesn’t outperform traditional stocks in every financial situation. In strong economic climates, stocks can deliver higher returns over both short and long periods. From 1971 to 2024, stocks averaged 10.7% in annual returns, while gold averaged 7.9%.\nBut in uncertain economic times, gold is seen as a safe, risk-averse asset. That’s why many people view it more as a store of value than a typical investment like stocks or bonds.\nWhat does “spot gold” mean?\nThe spot gold price is the rate for immediate transactions when buying gold over-the-counter. This figure helps investors track real-time demand and trends. Simply put, a higher spot price reflects greater demand. Unlike futures, the spot price is for instant settlement.\nWhen the future price is above the spot price, it’s called contango, which is common for commodities with high storage costs. If the futures price is below the spot price, it’s known as backwardation.\nMany factors can affect the spot price, causing frequent changes. Active gold investors need to be prepared for this volatility.\nWhat is price spread in gold trading?\nA price spread is the difference between the buying and selling price of an asset.\nIn gold trading, the ask price is what you pay to buy, and the bid price is what you receive when selling. The bid is always lower than the ask.\nA smaller spread means the market is more liquid. When spreads are tight, it suggests strong demand for gold.\nCheck Out Our Daily Rates Reports\n- Discover the highest high-yield savings rates, up to 5% for January 21, 2026.\n- Discover the highest CD rates, up to 4.18% for January 21, 2026.\n- Discover the best personal loan rates for January 21, 2026.\n- Discover the current mortgage rates for January 21, 2026.\n- Discover current refi mortgage rates report for January 21, 2026.\n- Discover current ARM mortgage rates report for January 21, 2026.\n- Discover the current price of silver for January 21, 2026.\n- Discover the current price of platinum for January 21, 2026.\nHow to invest in gold\nIf you picture gold investing as diving into a pile of coins, you’re only half right. While you can buy physical bars, coins, or jewelry, gold is often traded as exchange-traded funds (ETFs).\nPopular gold investment options include:\n- Gold bars: Also called bullion, sold by weight, with purity and manufacturer details stamped on the bar. Gold rounds are essentially the same, with the only notable difference being the shape of the bullion.\n- Gold coins: Collectible coins like the American Gold Eagle, often priced higher than bars of the same weight due to rarity.\n- Gold jewelry: Priced above gold content for design and craftsmanship.\n- Gold futures contracts: Agreements to buy gold at a set price in the future, allowing speculation without handling the physical metal.\n- Gold funds: Mutual funds or ETFs invested in gold assets, with values tied to the underlying portfolio.\nIs it a good time to invest in gold?\nWhether now is the best time to invest in gold is open to interpretation. Still, adding gold can help diversify your portfolio and reduce market volatility.\nGold remains a steady asset in today’s unpredictable market. Prices have soared to all-time highs, up over 25% since the beginning of 2025, fueled by inflation and uncertainty. Many experts suggest this is a good time to diversify with gold.\nCurrent precious metals prices as of 9:05 a.m. ET today\nSilver, platinum, and palladium are also favored by investors. Gold is generally les"
            },
            {
                "title": "Gold Price Hits New Record, Soaring Over US$4,800 - Investing News Network",
                "source": "Investing News Network",
                "url": "https://investingnews.com/gold-all-time-high/",
                "body": "The Conversation (2)\nGold Price Hits New Record, Soaring Over US$4,800\nJan. 21, 2026 01:55PM PST\nThe gold price is flirting with US$4,900, while silver is easing back to the US$93 level; platinum is pushing up past US$2,500.\nmariusz szczygieł / Adobe Stock\nThe gold price reached new highs yet again, driven higher by safe-haven demand as US President Donald Trump escalates trade tensions with Europe, and the US dollar weakens.\nThe spot price of gold hit US$4,888.80 per ounce in early trading on Wednesday (January 21) ahead of the World Economic Forum in Davos where Trump is expected to face pushback against his bid for Greenland.\nGold price chart, January 14 to 21, 2026.\nChart via the Investing News Network\nThe yellow metal's latest rise adds to an ongoing historic run.\nAfter starting 2025 around US$2,640, gold had risen to the US$3,200 level by April. It stayed within a fairly flat range until the end of August, when it launched higher once again, breaking US$4,300 in mid-October.\nThe price of gold took a breather following that move, even falling briefly below US$4,000; however, its retracement was neither as steep nor as long as many market watchers expected it to be.\nGold began gaining steam again in mid-November, and took off again in earnest at the end of 2025.\nIn 2026, precious metals have continued to benefit from geopolitical tensions and economic uncertainty. Expectations of interest rate cuts after US Federal Reserve Chair Jerome Powell's term ends later this year have provided support too. Trump’s feud with the Fed over rates took an eyebrow-raising turn on January 9, when the US Department of Justice served the Fed with grand jury subpoenas targeting Powell with a criminal indictment.\nThis latest upswing for the gold comes as investors moved out of global stocks following Trump’s threats over the weekend that the European nations opposing his bid to acquire Greenland will face 10 percent tariffs starting February 1. That figure could rise to 25 percent if a deal to secure Greenland for the US is not reached by June.\nThe nations targeted by the new tariffs include France, Germany, the UK, Denmark, Norway, Sweden, the Netherlands and Finland. The news has prompted fears of a full-blown US-Europe trade war, a weaker US dollar, higher inflation and a worsening outlook for the global economy. There are even concerns the conflict over Greenland could seriously weaken or dismantle the NATO alliance. Gold is traditionally used as a hedge against such risks.\nGreenland's key geographic position in the Arctic has long been coveted by the United States as a necessary strategic asset in its geopolitical struggle with Russia and China. “China and Russia want Greenland, and there is not a thing that Denmark can do about it,” Trump wrote on his social media platform Truth Social. “Only the United States of America, under PRESIDENT DONALD J. TRUMP, can play in this game, and very successfully, at that!”\n\"Gold’s sharp response to tariff-related headlines highlights how market sentiment has shifted away from a narrow focus on growth or inflation, toward policy uncertainty as a primary driver. Tariffs do not only disrupt trade flows; they also pose spillover risks to supply chains, corporate margins, and medium-term growth expectations,\" Linh Tran, senior market analyst at XS.com, said in a market note shared with the Investing News Network (INN).\n\"As soon as the probability of escalation increases, defensive capital tends to move preemptively, rather than waiting for tangible impacts to materialize in economic data. In this context, gold functions as a portfolio risk-balancing asset.\"\nEuropean leaders have responded with vows that they will not be blackmailed into allowing Trump to take Greenland, and are now preparing counter measures to the president's tariffs.\n\"The most realistic option would be for Europe to strike back using the so-called Anti-Coercion Instrument, a legal framework that allows the EU to respond collectively when"
            }
        ]
    },
    {
        "asset_name": "Silver",
        "symbol": "EIGHTCAP:XAGUSD",
        "status": "Success",
        "data": {
            "day_range": "5.254",
            "open": "94.633",
            "close": "92.986",
            "high": "95.543",
            "low": "90.289"
        },
        "market_summary": "### Silver (XAG/USD) Market Briefing\n* **Key Drivers:** Persistent economic uncertainty, geopolitical tensions, and increasing industrial demand, particularly from **AI data centers**, **semiconductor manufacturing**, and **renewable energy**, are driving the **bullish momentum**.\n* **Price Action:** Reached a high of **$94.12** per ounce as of January 21, 2026, with a gain of over **$63** over the past 12 months, and is nearing the **$100** per ounce mark predicted by some industry insiders, including First Majestic Silver CEO Keith Neumeyer.\n* **Technical Outlook:** Immediate support is near the **$90** level, with resistance at **$100**, as the metal's price continues to be influenced by its **industrial demand** and **safe-haven** appeal, with a potential **price target** of **$130** per ounce in the long term.\n\n--- \n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Could the Silver Price Really Hit $100 per Ounce? - Investing News Network",
                "source": "Investing News Network",
                "url": "https://investingnews.com/daily/resource-investing/precious-metals-investing/silver-investing/silver-in-the-future/",
                "body": "Is the First Majestic Silver (TSX:FR,NYSE:AG) CEO’s silver price prediction of over US$100 per ounce about to come true?\nThe silver price had surged over 215 percent year-on-year as of January 20, 2026, on the back of economic uncertainty and ongoing geopolitical tensions, as well as support from long-term demand fundamentals.\nThe silver price broke through its previous all-time high in October 2025, blasting through the US$50 per ounce mark. Since then, it has rallied to new highs again and again. Only a few weeks into 2026, the price of the metal is now within serious striking distance of the US$100 level. The latest catalyst is US President Donald Trump’s threatened trade war with some of America's European NATO allies if they continue to balk at his bid for Greenland.\nWell-known figure Keith Neumeyer, CEO of First Majestic, has frequently said he believes the white metal could hit the US$100 mark or even reach as high as US$130 per ounce.\nNeumeyer has voiced this opinion often over the past decade. He put up a US$130 price target in a November 2017 interview with Palisade Radio, when silver was just US$17 per ounce. He has reiterated his triple-digit silver price forecast in multiple interviews with Kitco over the years, including one in March 2023.\nIn 2024, Neumeyer made his US$100 silver call in a conversation with ITM Trading’s Daniela Cambone at the Prospectors & Developers Association of Canada (PDAC) convention, and in April of that year he acknowledged his reputation as the \"triple-digit silver guy\" on the Todd Ault Podcast.\nSpeaking with Chris Marcus of Arcadia Economics on January 16, 2026, a day after the price of silver had broken through US$93 per ounce for the first time, Neumeyer stated that “triple digits is definitely on its way.”\nAt times Neumeyer has been even bolder, suggesting in 2016 that silver could reach US$1,000 if gold were to hit US$10,000.\nIn order to better understand where Neumeyer’s opinion comes from and why a triple-digit silver price is finally materializing, it’s important to take a look at the factors that affect the metal’s movements, as well as where prices have been in the past and where other industry insiders think silver could be headed.\nFirst, let’s dive a little deeper into Neumeyer’s US$100 silver prediction.\nWhy has Neumeyer called for a US$100 silver price?\nNeumeyer believes silver could hit US$100 due to a variety of factors, including its consistent deficit, its industrial demand and how undervalued it is compared to gold.\nWhen he first made the prediction more than a decade ago, there was significant distance for silver to go before it could reach the success Neumeyer had boldly predicted.\nNeumeyer expected a triple-digit silver price in part because he believed the market cycle could be compared to the year 2000, when investors were sailing high on the dot-com bubble and the mining sector was down. He thinks it’s only a matter of time before the market corrects, like it did in 2001 and 2002, and commodities see a big rebound in pricing. It was during 2000 that Neumeyer himself invested heavily in mining stocks and came out on top.\n“I’ve been calling for triple-digit silver for a few years now, and I’m more enthused now,” Neumeyer said at an event in January 2020, noting that there are multiple factors behind his reasoning. “But I’m cautiously enthused because, you know, I thought it would have happened sooner than it currently is happening.”\nIn an August 2022 interview with Wall Street Silver, he reiterated his support for triple-digit silver and said he’s not alone in this optimistic view — in fact, he’s been surpassed in that optimism. “I actually saw someone the other day call for US$500 silver,” he said. “I’m not quite sure I’m at the level. Give me US$50 first and we’ll see what happens after that.”\nAnother factor driving Neumeyer’s position is his belief that the silver market is in a deficit at a time when demand is rising from new industrial sectors. In a December "
            },
            {
                "title": "Current price of silver as of Wednesday, January 21, 2026 - Fortune",
                "source": "Fortune",
                "url": "https://fortune.com/article/current-price-of-silver-1-21-2026/",
                "body": "As of 8:30 a.m. Eastern Time, silver traded at $94.12 per ounce. That’s down $1.20 from yesterday at this hour—but represents a gain of more than $63 over the past 12 months.\nCheck Out Our Daily Rates Reports\n- Discover the highest high-yield savings rates, up to 5% for January 21, 2026.\n- Discover the highest CD rates, up to 4.18% for January 21, 2026.\n- Discover the best personal loan rates for January 21, 2026.\n- Discover the current mortgage rates for January 21, 2026.\n- Discover current refi mortgage rates report for January 21, 2026.\n- Discover current ARM mortgage rates report for January 21, 2026.\n- Discover the current price of gold for January 21, 2026.\n- Discover the current price of silver for January 21, 2026.\n- Discover the current price of platinum for January 21, 2026.\nHistorical silver performance\nSilver is not typically a high-growth play. Historically, it trails other investment options, like stocks. From 1921 onward, silver has underperformed the S&P 500 by about 96%. That means an equal sum invested in silver and stocks back then would now be worth 96% less in silver holdings than stocks.\nInstead, silver is prized for its stability and its power to hedge against inflation. Often dubbed a “store of value,” it tends to sustain purchasing power when inflation climbs.\nCompared with gold, silver prices generally swing more sharply due to industrial demand—solar equipment, healthcare devices, and more—whereas gold is almost purely a safe-haven asset.\nWhat does “spot silver” mean?\n“Spot silver” refers to the live market rate at which silver can be bought or sold instantly. That said, real-world buyers usually pay a premium over spot for markups, shipping, insurance, and other fees.\nThe spot price serves as a gauge of immediate market demand: a higher spot price means stronger buying interest.\nWhat is “price spread” in silver trading?\nThe term “price spread” describes the difference between the buying (ask) and selling (bid) prices for silver. Here’s how those terms are defined.\n- Ask price: the cost to purchase silver.\n- Bid price: the amount you receive when you sell silver.\nA narrower spread indicates high demand.\nHow to invest in silver\nSilver exposure can be achieved through physical ownership or via silver-backed exchange-traded funds (ETFs). ETFs let you own a stake in a fund that holds silver, sparing you storage and insurance responsibilities.\nKey silver investment options include:\n- Bullion bars and rounds. These are sold by weight and purity\n- Government-minted silver coins. Iconic examples include American Silver Eagles and Canada’s Silver Maple Leafs, which often trade at premiums for their rarity and backing.\n- Silver jewelry. Custom pieces that fetch prices above equal-purity bullion.\n- Silver mining equities. Stocks in companies extracting silver, offering a sort of indirect investment in silver.\nOn exchanges, bullion and coins must meet a minimum 99.9% purity. Lower-purity silver generally falls into collectible or industrial categories. Our guide to the best silver IRA companies provide more information on how to shrewdly invest in silver (and other precious metals).\nIs it a good time to invest in silver?\nSilver has surged more than 150% over the past year, hitting its highest levels in over a decade.\nDeciding whether to invest now depends on your unique attitude toward the market. If inflation is top of mind, adding precious metals can be prudent. Or, if you foresee rising industrial applications—such as electronics—demand could potentially push prices even higher.\nCurrent precious metals prices as of 8:30 a.m. ET today\nGold remains the benchmark metal, while platinum and palladium exhibit volatility patterns similar to silver due to smaller market caps. Gold’s larger market makes it comparatively stable.\nThe takeaway\nWith economic volatility persistent in the current market, precious metals deserve at least a quick look. Silver’s recent performance has outshined gold’s, and many experts forecas"
            },
            {
                "title": "EXCLUSIVE: Silver's Boom Has Left Wall Street Baffled — The Real Story Is A Structural Shockwave - Benzinga",
                "source": "Benzinga",
                "url": "https://www.benzinga.com/markets/commodities/26/01/50047326/silver-price-boom-structural-shockwave",
                "body": "For decades, silver needed inflation or crisis to rally. That dependency may finally be ending. Silver's latest surge isn't being powered by CPI surprises or geopolitical fear. Instead, it's being pulled higher by structural demand from AI data centers, semiconductor manufacturing, and renewable energy — a shift that could permanently change how the metal trades.\n- Track silver-tracking SLV ETF here.\nFrom Macro Trade To Industrial Input\nIn an exclusive interview with Benzinga, Ed Egilinsky of Direxion highlighted how silver's usage in semiconductors and data centers is becoming \"transformative in nature.\"\nThese aren't speculative trends. They're capital-intensive, policy-supported investments with long time horizons.\nWhy Inflation Is No Longer Required\nUnlike past cycles, silver, and the iShares Silver ETF (NYSE:SLV) as a proxy, have rallied even as market volatility stayed subdued. “This is evident over the last two years where the VIX has been mostly muted, yet gold and silver have rallied sharply,” said Egilinsky. That suggests demand is coming from physical consumption rather than financial hedging.\nSolar energy alone remains a major silver sink, and AI infrastructure adds another layer of steady, non-discretionary demand. “The weakening of the U.S. Dollar in 2025 also provided some added fuel to the silver rally,” noted Egilinsky.\nSupply Constraints Add Fuel\nDownstream bottlenecks and export restrictions have limited silver's ability to respond quickly to demand spikes. When consumption rises, prices don't gradually adjust — they gap higher.\nThat dynamic makes the shiny metal more sensitive to structural demand shifts than markets may be pricing in.\nA Re-Rating, Not A Trade\nSilver is increasingly behaving less like gold's volatile cousin and more like a strategic industrial metal tied to the global electrification and compute buildout.\nInvestor takeaway: If AI and solar continue scaling, silver's cycle may be breaking — and long-term allocations may start replacing short-term trades.\nImage: Shutterstock\n© 2026 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.780",
            "open": "64.157",
            "close": "65.325",
            "high": "65.482",
            "low": "63.702"
        },
        "market_summary": "### Spot Brent Crude Oil Market Briefing\n* **Key Drivers:** Ample global oil supply is cushioning concerns about geopolitical risks, with the IEA noting that **bloated balances** provide comfort to market participants, keeping prices in check. The **US Strategic Petroleum Reserve (SPR)** saw an increase, and **US production** fell slightly.\n* **Price Action:** **Spot Brent Crude Oil** is trading at **$65.23**, up **0.48%** on the day, but roughly **$0.10** down from the previous week. **WTI** is trading at **$60.63**, up **0.45%** on the day.\n* **Technical Outlook:** The IEA forecasts a **significant surplus** in the first quarter, with global oil supply growing by **2.5mn b/d** in 2026, potentially leading to a surplus of **3.7mn b/d**. Immediate support and resistance levels are not explicitly mentioned in the articles, but the overall sentiment suggests a **bearish** outlook due to the anticipated surplus.\n\n--- \n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "US Sees Big Gains in Crude Oil, Product Inventories - Crude Oil Prices Today | OilPrice.com",
                "source": "Crude Oil Prices Today | OilPrice.com",
                "url": "https://oilprice.com/Latest-Energy-News/World-News/US-Sees-Big-Gains-in-Crude-Oil-Product-Inventories.html",
                "body": "China’s muted response to Iran’s…\n\"It's most important 8 minute read of my week…\"\nThe American Petroleum Institute (API) estimated that crude oil inventories in the United States saw a build of 3.04 million barrels in the week ending January 16. Crude oil inventories increased by 5.27 million barrels in the week prior.\nInventories in the US Strategic Petroleum Reserve (SPR) keep climbing week after week. The Department of Energy (DoE) reported that crude oil inventories in the SPR rose by 800,000 barrels to 414.5 million barrels in the week ending January 16. This is 311 million barrels shy of maximum capacity.\nUS production fell during the week of January 9 to 13.753 million bpd, down from 13.811 million bpd in the week prior, according to the latest EIA data. This is 272,000 bpd more than this same time last year.\nAt 4:27 pm ET, Brent crude was trading up on the day at $65.23 (+0.48%). Brent is now roughly $0.10 down from this time last week amid geopolitical turmoil and worry of soft demand. WTI was also trading up on the day, by $0.27 (+0.45%) at $60.63.\nGasoline inventories saw another large increase this week as well, gaining 6.2 million barrels in the week ending January 16. In the week prior, gasoline inventories grew by 8.23 million barrels. As of last week, gasoline inventories were 4% above the five-year average for this time of year, according to the latest EIA data.\nDistillate inventories fell slightly in the reporting period, falling by 33,000 barrels, after gaining 4.34 million barrels in the week prior. Distillate inventories were still 4% below the five-year average as of the week ending January 9, the latest EIA data shows.\nCushing inventory—the inventory kept at the delivery hub for the WTI Crude futures contract—rose by 1.2 million barrels, after increasing by 945,000 barrels in the prior week.\nBy Julianne Geiger for Oilprice.com\nMore Top Reads From Oilprice.com\nADVERTISEMENT\nJulianne Geiger is a veteran editor, writer and researcher for Oilprice.com, and a member of the Creative Professionals Networking Group."
            },
            {
                "title": "Oil supply buffers cushion geopolitical risk: IEA - Argus Media",
                "source": "Argus Media",
                "url": "https://www.argusmedia.com/en/news-and-insights/latest-market-news/2778293-oil-supply-buffers-cushion-geopolitical-risk-iea",
                "body": "Ample global oil supply is allaying concerns about geopolitical risks to oil production and exports in Venezuela, Iran and Russia, the IEA said today.\n\"While it is too early to assess the full implications for oil markets of these latest geopolitical developments, for now, bloated balances provide some comfort to market participants and have kept prices in check,\" the IEA said.\nIn its first Oil Market Report (OMR) of the year, the IEA said it still sees subdued oil demand growth and a large supply surplus for 2026. The Paris-based watchdog increased its oil demand growth forecast for 2026 by 70,000 b/d to 930,000, driven by higher expectations from Asia-Pacific and Africa. This would see overall demand at 104.98mn b/d.\nAs widely expected, the agency sees relatively weak first quarter year-on-year growth of 840,000 b/d — supported by higher-than-expected heating demand — picking up to around 1mn b/d in the second half. But it said a \"significant surplus\" is likely to re-emerge in the current quarter as refiners begin maintenance, and said 2026 demand will be \"tempered by sub-par global GDP growth, energy efficiency improvements and robust EV sales in some markets.\"\nThe agency sees global oil supply growing by 2.5mn b/d in 2026. Barring a change in Opec+ production policy and possibly lower output from US shale producers, the supply surplus would be 3.7mn b/d.\nThis would follow a 2.1mn b/d supply surplus in 2025, when the agency said oil demand grew by 850,000 b/d to 104.05mn b/d and supply increased by 3.05mn b/d to 106.19mn b/d.\n\"Last year's surge in trade policy uncertainty and economic risk aversion weighed heavily on commercial activity in emerging economies, causing oil demand to stagnate,\" the IEA said.\nThe IEA first outlined its 2025 oil demand forecasts in April 2024, when it projected consumption growth of 1.15mn b/d. This time last year it saw annual demand growth of 1.05mn b/d in 2025.\nThe IEA's demand estimates for 2025 remain well below those of Opec, which sees oil consumption up by 1.3mn b/d to 105.14mn b/d. Opec sees oil demand rising by 1.38mn b/d in 2026 and by 1.34mn b/d in 2027.\nThe IEA said global observed stocks rose by 75mn bl, or 2.5mn b/d, in November. It said preliminary data show further builds in December, after China issued new import quotas that had offset steep inventory declines in several Middle East countries at the end of 2025."
            },
            {
                "title": "Energy Briefs: Oil Supply, Power Rates, Global Markets - okenergytoday.com",
                "source": "okenergytoday.com",
                "url": "https://www.okenergytoday.com/2026/01/energy-brief-oil-power-policy-global-markets/",
                "body": "United States\n** The Texas oil industry is bracing for potential margin pressure as President Trump pledges to push crude prices toward $50 per barrel and increase U.S. access to Venezuelan oil, a move analysts say could make breakeven economics even more challenging for producers.\n** In her first official action as governor, New Jersey Democrat Mikie Sherrill signed executive orders requiring regulators to expand electricity bill credits and freeze power rates, signaling an aggressive consumer protection stance on energy costs.\n** A federal judge has allowed Dominion Energy to continue construction of its 70% complete offshore wind farm near Virginia, despite a Trump administration halt citing unspecified national security concerns.\n** Lesser-known oil companies are leading political donations to candidates for the Texas Railroad Commission, the powerful regulatory body overseeing oil and gas production, pipelines, utilities, and mining operations.\nWorld\n** The International Energy Agency (IEA) says the global oil market will enter a deep surplus in the first quarter of 2026, projecting supply will exceed demand by 4.25 million barrels per day, as excess output outweighs geopolitical disruption risks.\n** India’s Reliance Industries Ltd., operator of the world’s largest refining complex, is set to receive sanctions-compliant Russian oil in February and March, following a one-month pause, according to sources familiar with the matter.\n** UAE President Sheikh Mohamed bin Zayed Al Nahyan concluded talks with Indian Prime Minister Narendra Modi, with the two nations signing a long-term LNG supply agreement and committing to double bilateral trade to more than $200 billion by 2032."
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.645",
            "open": "59.702",
            "close": "60.797",
            "high": "60.982",
            "low": "59.337"
        },
        "market_summary": "### Spot WTI Crude Oil Market Briefing\n\n* **Key Drivers:** Ample global oil supply is cushioning concerns about geopolitical risks, with the IEA noting that **bloated balances** provide comfort to market participants, keeping prices in check. US crude oil inventories saw a build of **3.04 million barrels** in the week ending January 16.\n* **Price Action:** WTI crude oil is trading up on the day at **$60.63**, with Brent crude at **$65.23**, amid **geopolitical turmoil** and concerns about **soft demand**. The price of WTI crude oil has shown **bullish momentum** in the short term.\n* **Technical Outlook:** Immediate support for WTI crude oil is near the **50-day moving average**, with resistance at **$65**. The **supply surplus** expected in 2026 may exert downward pressure on prices, with the IEA forecasting a surplus of **3.7 million barrels per day**.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "US Sees Big Gains in Crude Oil, Product Inventories - Crude Oil Prices Today | OilPrice.com",
                "source": "Crude Oil Prices Today | OilPrice.com",
                "url": "https://oilprice.com/Latest-Energy-News/World-News/US-Sees-Big-Gains-in-Crude-Oil-Product-Inventories.html",
                "body": "China’s muted response to Iran’s…\n\"It's most important 8 minute read of my week…\"\nThe American Petroleum Institute (API) estimated that crude oil inventories in the United States saw a build of 3.04 million barrels in the week ending January 16. Crude oil inventories increased by 5.27 million barrels in the week prior.\nInventories in the US Strategic Petroleum Reserve (SPR) keep climbing week after week. The Department of Energy (DoE) reported that crude oil inventories in the SPR rose by 800,000 barrels to 414.5 million barrels in the week ending January 16. This is 311 million barrels shy of maximum capacity.\nUS production fell during the week of January 9 to 13.753 million bpd, down from 13.811 million bpd in the week prior, according to the latest EIA data. This is 272,000 bpd more than this same time last year.\nAt 4:27 pm ET, Brent crude was trading up on the day at $65.23 (+0.48%). Brent is now roughly $0.10 down from this time last week amid geopolitical turmoil and worry of soft demand. WTI was also trading up on the day, by $0.27 (+0.45%) at $60.63.\nGasoline inventories saw another large increase this week as well, gaining 6.2 million barrels in the week ending January 16. In the week prior, gasoline inventories grew by 8.23 million barrels. As of last week, gasoline inventories were 4% above the five-year average for this time of year, according to the latest EIA data.\nDistillate inventories fell slightly in the reporting period, falling by 33,000 barrels, after gaining 4.34 million barrels in the week prior. Distillate inventories were still 4% below the five-year average as of the week ending January 9, the latest EIA data shows.\nCushing inventory—the inventory kept at the delivery hub for the WTI Crude futures contract—rose by 1.2 million barrels, after increasing by 945,000 barrels in the prior week.\nBy Julianne Geiger for Oilprice.com\nMore Top Reads From Oilprice.com\nADVERTISEMENT\nJulianne Geiger is a veteran editor, writer and researcher for Oilprice.com, and a member of the Creative Professionals Networking Group."
            },
            {
                "title": "Oil supply buffers cushion geopolitical risk: IEA - Argus Media",
                "source": "Argus Media",
                "url": "https://www.argusmedia.com/en/news-and-insights/latest-market-news/2778293-oil-supply-buffers-cushion-geopolitical-risk-iea",
                "body": "Ample global oil supply is allaying concerns about geopolitical risks to oil production and exports in Venezuela, Iran and Russia, the IEA said today.\n\"While it is too early to assess the full implications for oil markets of these latest geopolitical developments, for now, bloated balances provide some comfort to market participants and have kept prices in check,\" the IEA said.\nIn its first Oil Market Report (OMR) of the year, the IEA said it still sees subdued oil demand growth and a large supply surplus for 2026. The Paris-based watchdog increased its oil demand growth forecast for 2026 by 70,000 b/d to 930,000, driven by higher expectations from Asia-Pacific and Africa. This would see overall demand at 104.98mn b/d.\nAs widely expected, the agency sees relatively weak first quarter year-on-year growth of 840,000 b/d — supported by higher-than-expected heating demand — picking up to around 1mn b/d in the second half. But it said a \"significant surplus\" is likely to re-emerge in the current quarter as refiners begin maintenance, and said 2026 demand will be \"tempered by sub-par global GDP growth, energy efficiency improvements and robust EV sales in some markets.\"\nThe agency sees global oil supply growing by 2.5mn b/d in 2026. Barring a change in Opec+ production policy and possibly lower output from US shale producers, the supply surplus would be 3.7mn b/d.\nThis would follow a 2.1mn b/d supply surplus in 2025, when the agency said oil demand grew by 850,000 b/d to 104.05mn b/d and supply increased by 3.05mn b/d to 106.19mn b/d.\n\"Last year's surge in trade policy uncertainty and economic risk aversion weighed heavily on commercial activity in emerging economies, causing oil demand to stagnate,\" the IEA said.\nThe IEA first outlined its 2025 oil demand forecasts in April 2024, when it projected consumption growth of 1.15mn b/d. This time last year it saw annual demand growth of 1.05mn b/d in 2025.\nThe IEA's demand estimates for 2025 remain well below those of Opec, which sees oil consumption up by 1.3mn b/d to 105.14mn b/d. Opec sees oil demand rising by 1.38mn b/d in 2026 and by 1.34mn b/d in 2027.\nThe IEA said global observed stocks rose by 75mn bl, or 2.5mn b/d, in November. It said preliminary data show further builds in December, after China issued new import quotas that had offset steep inventory declines in several Middle East countries at the end of 2025."
            },
            {
                "title": "Energy Briefs: Oil Supply, Power Rates, Global Markets - okenergytoday.com",
                "source": "okenergytoday.com",
                "url": "https://www.okenergytoday.com/2026/01/energy-brief-oil-power-policy-global-markets/",
                "body": "United States\n** The Texas oil industry is bracing for potential margin pressure as President Trump pledges to push crude prices toward $50 per barrel and increase U.S. access to Venezuelan oil, a move analysts say could make breakeven economics even more challenging for producers.\n** In her first official action as governor, New Jersey Democrat Mikie Sherrill signed executive orders requiring regulators to expand electricity bill credits and freeze power rates, signaling an aggressive consumer protection stance on energy costs.\n** A federal judge has allowed Dominion Energy to continue construction of its 70% complete offshore wind farm near Virginia, despite a Trump administration halt citing unspecified national security concerns.\n** Lesser-known oil companies are leading political donations to candidates for the Texas Railroad Commission, the powerful regulatory body overseeing oil and gas production, pipelines, utilities, and mining operations.\nWorld\n** The International Energy Agency (IEA) says the global oil market will enter a deep surplus in the first quarter of 2026, projecting supply will exceed demand by 4.25 million barrels per day, as excess output outweighs geopolitical disruption risks.\n** India’s Reliance Industries Ltd., operator of the world’s largest refining complex, is set to receive sanctions-compliant Russian oil in February and March, following a one-month pause, according to sources familiar with the matter.\n** UAE President Sheikh Mohamed bin Zayed Al Nahyan concluded talks with Indian Prime Minister Narendra Modi, with the two nations signing a long-term LNG supply agreement and committing to double bilateral trade to more than $200 billion by 2032."
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0067",
            "open": "1.1718",
            "close": "1.1686",
            "high": "1.1743",
            "low": "1.1676"
        },
        "market_summary": "### EUR/USD Market Briefing\n\n* **Key Drivers:** The cancellation of planned tariffs by US President Trump has improved risk sentiment, boosting the US Dollar and pressuring the Euro. The **hawkish** stance of the Federal Reserve, combined with a **dovish** European Central Bank, continues to drive the **bearish** momentum in EUR/USD.\n* **Price Action:** The EUR/USD pair has broken below the key psychological level of **1.1700**, showing significant **bearish** momentum, with a potential test of lower prices ahead.\n* **Technical Outlook:** Immediate support is near the **1.1662** level, with resistance at **1.1700**. The 200-day moving average, currently near **1.1590**, is a plausible target in the coming weeks.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "The US Dollar strengthens while EUR/USD declines as tariff threats from Trump are lifted - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/the-us-dollar-strengthens-while-eur-usd-declines-as-tariff-threats-from-trump-are-lifted/",
                "body": "The EUR/USD pair lost over 0.30% as US President Trump announced the cancellation of planned tariffs related to Greenland negotiations. This decision, shared on Truth Social from Davos, Switzerland, improved risk sentiment, boosting US equities with gains between 1.16% and 1.21% and strengthening the US Dollar Index by 0.20% to 98.75.\nEconomic updates ahead include US GDP figures, jobless claims, and the Core PCE Index, while in the Eurozone, the ECB’s policy accounts and EU consumer confidence data are due. The Euro was weakest against the US Dollar this week, dropping 0.86%, and strongest against the Japanese Yen, gaining 1.18%.\nEur Usd Technical Outlook\nThe EUR/USD pair’s technical outlook suggests a potential test of lower prices, having dropped below 1.1700, with a key support level at 1.1662. This currency pair is influenced by economic data including GDP, unemployment rates, manufacturing indices, and inflation. A strong economic performance can support the Euro by attracting foreign capital and prompting ECB interest rate hikes. Conversely, a negative trade balance or weak economic data can push the currency lower.\nLooking back at the events of 2025, we saw how quickly the market shifted when the former President dropped tariff threats related to Greenland. The US Dollar strengthened immediately, and the EUR/USD pair fell below the 1.1700 level. This dynamic, where geopolitical headlines can override short-term economic data, remains a key factor for us to monitor.\nThe data that followed those events last year has largely supported a stronger dollar. The final reading for US Q3 2025 GDP came in at a solid 2.2%, and more recently, the Core PCE inflation for December 2025 finished the year at 2.8%, well above the Fed’s target. This reinforces the view that the Federal Reserve has little reason to consider cutting rates in the near term.\nOpportunities for Traders\nMeanwhile, the European Central Bank appears to be in a more difficult position. The latest German IFO Business Climate Index fell to 85.2, a worrying sign for the Eurozone’s economic engine. This growing policy divergence between a firm Fed and a cautious ECB continues to put downward pressure on the EUR/USD exchange rate.\nFor derivatives traders, this environment presents clear opportunities. We observed last year how one-month implied volatility on EUR/USD jumped to over 8% during the tariff scare before collapsing once the threat was removed. This pattern suggests that selling volatility by using strategies like short strangles could be profitable after any future politically-driven market spikes.\nGiven the fundamental weakness in the Eurozone, we should also consider directional plays. The break below the key 1.1700 mark last year was technically significant, and the 200-day moving average, now near 1.1590, is a plausible target in the coming weeks. Purchasing EUR/USD put options or establishing bear put spreads offers a defined-risk way to position for further downside."
            },
            {
                "title": "EUR/USD slips as Trump drops tariff threats, lifts the US Dollar - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/eur-usd-slips-as-trump-drops-tariff-threats-lifts-the-us-dollar-202601212309",
                "body": "EUR/USD slips as Trump drops tariff threats, lifts the US Dollar\n- EUR/USD falls over 0.30% after Trump cancels planned tariffs tied to Greenland negotiations.\n- Improved risk sentiment lifts US equities and supports the Dollar, pressuring the shared currency.\n- Focus turns to US GDP, Jobless Claims, Core PCE and ECB policy accounts.\nEUR/USD retreats late Wednesday during the North American session, registers losses of over 0.30% as US President Donald Trump refrained from its threats of imposing tariffs over eight European countries over discussions of Greenland.\nEuro retreats as easing US–EU trade tensions boost the Greenback\nIn Davos Switzerland, US President Donald Trump posted on Truth Social that “Based upon a very productive meeting that I have had with the Secretary General of NATO, Mark Rutte, we have formed the framework of a future deal with respect to Greenland and, in fact, the entire Arctic Region.” He added that “Based upon this understanding, I will not be imposing the tariffs that were scheduled to go into effect on February 1.”\nOn the post, risk appetite improved as shown by US equity markets, which recovered as three of the four US equity indices ended Wednesday’s session with gains between 1.16% and 1.21%.\nThe US Dollar recovered some ground as shown by the US Dollar Index (DXY). The DXY, which tracks the buck’s value versus six currencies, is up 0.20% at 98.75.\nOther data revealed that the US Supreme Court expressed skepticism about Trump’s authority to fire Fed Governor Lisa Cook, revealed CNBC.\nAcross the pond, the Eurozone docket featured speeches by members of the European Central Bank, led by President Christine Lagarde and Kocher.\nAhead on Thursday, the economic docket will feature US Q3 2025 Gross Domestic Product final reading, jobless claims and the Fed’s preferred inflation gauge, the Core Personal Consumption Expenditures (PCE) Price Index. In the European Union, the schedule will feature the ECB’s Monetary Policy Meeting Accounts and EU’s Consumer Confidence data.\nDaily digest market movers: Euro on the defensive as Trump TACO trade re-emerges\n- US President Donald Trump reunion with the North Atlantic Treaty Organization (NATO) Secretary General Mark Rutte created a framework of a future deal over Greenland. Trump called the framework “fantastic,” but offered no details.\n- A Reuters poll revealed that over 100 economists expect the Fed to hold rates unchanged in January. Also, the majority expect the US central bank to stand pat until the current Fed Chair Jerome Powell finishes his term In May.\n- US Pending Home Sales plunged 9.3% in December, marking the weakest reading since July. The report highlighted that inventory of existing homes remains constrained, as many homeowners are locked into mortgage rates below 5%, reducing incentives to list properties and weighing on transaction activity.\n- Newswires reported that the European Union is delaying the ratification of the US-EU trade agreement.\n- ECB Kocher said that using trade policy threats to exert political pressure, increasing the risks for global economy. In other words, ECB’s Lagarde said that monetary policy “is in a good place” and that the bloc’s economy would be stronger if not for tariffs.\nEuro Price This week\nThe table below shows the percentage change of Euro (EUR) against listed major currencies this week. Euro was the strongest against the Japanese Yen.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Euro from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent EUR (base)/USD (quote).\nTechnical outlook: Euro drops below 1.1700 as risk appetite improves\nEUR/USD retreated after hitting a daily high of 1.1743, dropping below the 1.1700 figure, which opens the path for lower prices. The Relative S"
            },
            {
                "title": "After reaching approximately 1.1768, EUR/USD fell towards 1.1700, according to BBH analysts - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/after-reaching-approximately-1-1768-eur-usd-fell-towards-1-1700-according-to-bbh-analysts/",
                "body": "The EUR/USD currency pair moved closer to 1.1700 on Monday, following a recent peak near 1.1768. This shift came after ECB President Christine Lagarde spoke on maintaining stable monetary policy amidst US tariff threats.\nLagarde remarked that the monetary policy settings remain favourable. She also suggested that the short-term impact of new US tariffs would be minimal.\nECB Policy and Market Predictions\nThe European Central Bank has ceased easing, predicting that the EUR/USD pair will continue to fluctuate between 1.1500 and 1.1800 over the coming months.\nThese insights were provided by the FXStreet Insights Team, who compile market observations from various experts.\nWe recall seeing this analysis back in 2025 when the euro was holding up against the dollar near 1.1700. The belief was that the European Central Bank was done cutting rates, which would keep the pair trading in a stable 1.1500 to 1.1800 range. That outlook hinged on the ECB maintaining a steady policy.\nMarket Implications for Traders\nAs of today, January 21, 2026, that range has clearly broken, with EUR/USD now trading much lower around 1.0950. The economic divergence we have seen is the primary cause, as Eurozone Q4 2025 GDP growth came in at a sluggish 0.1% while the U.S. posted a more resilient 2.0% expansion. This has reinforced the wide interest rate differential favoring the dollar.\nFor derivative traders, the old strategy of selling volatility within that 1.15-1.18 range is no longer valid. Given that Eurozone headline inflation has fallen to 2.1%, just above the ECB’s target, the pressure is on the ECB to consider further easing, not hold steady. This suggests traders should look at buying put options to protect against or profit from a slide towards the 1.0800 level seen in late 2025.\nWith the market pricing in a higher probability of an ECB rate cut by mid-year compared to the Federal Reserve, any strength in the euro should be viewed with skepticism. Volatility has been low, with one-month implied volatility sitting near 5.5%, making options relatively cheap. This presents an opportunity to structure bearish positions, such as put spreads, that can benefit from a continued, gradual decline in the currency pair."
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0058",
            "open": "1.3438",
            "close": "1.3429",
            "high": "1.3459",
            "low": "1.3401"
        },
        "market_summary": "### GBP/USD Market Briefing\n\n* **Key Drivers:** The **GBP/USD** pair is experiencing a range-bound movement, influenced by **easing trade war fears** and **mixed expectations** about future interest rate cuts by the **Bank of England (BoE)**. The **US Personal Consumption Expenditure (PCE) Price Index** and **US Q3 GDP growth report** are awaited for fresh cues.\n* **Price Action:** The pair is trading sideways around **1.3400**, holding above the **200-day Simple Moving Average (SMA)**, which keeps the bias tilted to the upside. Immediate resistance is at **1.3485**, while support is seen at **1.34** and **1.3350**.\n* **Technical Outlook:** The **Relative Strength Index (RSI)** holds above **50**, indicating a slight improvement in momentum. A break above **1.3485** could bring **1.3550** into focus, while a move below **1.3350** creates a lower low.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "GBP/USD, JPY/USD Forecast: Two trades to watch - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/gbp-usd-jpy-usd-forecast-two-trades-to-watch/?amp=true",
                "body": "GBP/USD, JPY/USD Forecast: Two trades to watch\nGBP/USD slips after CPI data & ahead of Trump’s speech\nGBP/USD has given back earlier gains amid a modest USD recovery ahead of Trump’s speech at Davos and as investors digest UK inflation data.\nUK CPI rose to 3.4% year on year, ahead of expectations of 3.3%, and up from November's reading of 3.2% on a monthly basis. Headline CPI is 0.4% after contracting 0.2% in November. Core CPI, which removes more volatile items such as food and fuel, remained at 3.2% year on year, in line with forecasts.\nThe increase in inflation was mainly driven by one-offs - a rise in tobacco duty and airfares. Service sector inflation, which is closely tracked by the BoE, rose to 4.5% from 4.4%, a smaller-than-expected increase.\nThe BoE expects inflation to reach its 2% target in the spring of this year and has forecast that the chancellor's budget will help remove 0.5% from price growth over the coming years. Market bets on interest rate cuts from the BoE are little changed following the data, pricing in a 25-basis-point rate cut, with a 70% chance by the end of the year.\nThe US dollar is rising modestly, recovering from a two-week low against its major peers as investors await President Trump's speech at Davos. The speech comes following his tariff threats, which triggered a sell-off in US assets abroad at the start of the week. Fears of prolonged uncertainty, a loss of confidence in US leadership, and potential retaliation drove the 'sell America' trade.\nInvestors will wait to see Trump's tone when he speaks at the World Economic Forum. Should Trump continue to double down on his plans to acquire Greenland, the dollar could head lower. Any sense that Trump may soften his tone in order to get a deal done could help drive a dollar recovery.\nGBP/USD forecast – technical analysis\nGBP/USD is trading sideways around 1.3440. The price holds above the 200 SMA, keeping the bias tilted to the upside. The RSI also holds above 50 amid a slight improvement in momentum.\nBuyers would need to rise above the 1.3485 resistance, a level which has capped gains on several occasions over the past few weeks. A rise above here brings 1.3550 into focus, the 2026 high.\nSupport is seen at 1.34, the 200 SMA and a horizontal support. A break below here brings 1.3350, the January low into play. A move below here creates a lower low.\nUSD/JPY hold steady ahead of Trump & Friday’s BoJ meeting\nUSD/JPY is struggling for direction amid recent weakness in both the USD and the JPY, as investors await Trump’s speech in Davos and the BoJ rate decision on Friday.\nThe USD fell sharply yesterday as the White House’s threats over Greenland triggered a broad selloff in US assets. Trump has made it clear that securing Greenland for national security reasons is a core objective. The market is waiting to see whether Trump softens his tone in Davos, which could help drive a USD recovery.\nWhile the dollar is holding steady against the yen, the Japanese currency has suffered its own setback after Prime Minister Takaishi called a snap election on Monday for February 8th, and pledged a wave of measures to loosen fiscal policy.\nJapanese government bonds were hit hard, with the 40-year yield spiking 27.5 basis points to a record 4.215% on Tuesday, and has since eased slightly to 4.1% today.\nThe yen is trading at a record low against the Swiss franc and is close to a record low versus the euro.\nWhen bond yields rise, and the currency falls, it is a warning that the market doesn’t like what it's seeing, putting Takaichi on track for her own “Liz Truss” moment.\nAttention is now turning to the Bank of Japan rate decision on Friday, but after hiking interest rates in December, no change is expected this month. Instead, attention will be on communication with policymakers, likely to maintain a slightly hawkish stance.\nUSD/JPY forecast - technical analysis\nUSD/JPY has trended higher since September, forming a series of higher highs and higher lows. The price ran "
            },
            {
                "title": "GBP/USD struggles above 1.3400 as traders eye US PCE and GDP data - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-usd-remains-confined-in-a-range-above-13400-as-traders-eye-us-pce-and-gdp-data-202601220057",
                "body": "GBP/USD remains confined in a range above 1.3400 as traders eye US PCE and GDP data\n- GBP/USD struggles to gain any meaningful traction for the second straight day on Thursday.\n- Easing trade war fears assist the USD to attract some follow-through buyers and cap the pair.\n- Traders now look forward to the US PCE Price Index and the US Q3 GDP for a fresh impetus.\nThe GBP/USD pair extends its sideways consolidative price move for the second straight day on Thursday and oscillates in a range above the 1.3400 mark during the Asian session. Moreover, a mixed fundamental backdrop warrants some caution before placing directional bets as traders keenly await the crucial US macro data.\nThe US Personal Consumption Expenditure (PCE) Price Index is due for release later today. It will be accompanied by the final US Q3 GDP growth report, which should offer fresh cues about the US Federal Reserve's (Fed) future policy path. This, in turn, will play a key role in influencing the near-term US Dollar (USD) price dynamics and provide some meaningful impetus to the GBP/USD pair.\nIn the meantime, the USD is seen gaining some follow-through positive traction and building on the previous day's move up in the wake of easing tensions over Greenland. In fact, US President Donald withdrew a threat to impose tariffs on a number of European nations and said in Davos on Wednesday that he had reached an agreement on a framework for a future deal on Greenland with NATO.\nThe comments eased trade war fears, which had revived the so-called 'Sell America' trade. Adding to this, reduced bets for a more aggressive easing by the Fed offer some support to the USD and act as a headwind for the GBP/USD pair. The British Pound (GBP), on the other hand, struggles to lure buyers amid mixed expectations about future interest rate cuts by the Bank of England (BoE).\nThe UK Office of National Statistics reported on Wednesday that the headline Consumer Price Index (CPI) rose for the first time in five months, to the 3.4% YoY rate in December. The data make it unlikely that the BoE will lower borrowing costs at its policy meeting early next month. Traders, however, are still pricing in one or possibly two quarter-point interest rate cuts by the BoE in 2026.\nThis, in turn, holds back traders from placing aggressive bets around the GBP/USD pair and contributes to the subdued range-bound price action. From a technical perspective, spot prices, so far, have managed to hold above the very important 200-day Simple Moving Average (SMA). The said SMA is currently pegged near the 1.3365-1.3360 region and should now act as a key pivotal point for traders.\nUS Dollar Price Today\nThe table below shows the percentage change of US Dollar (USD) against listed major currencies today. US Dollar was the strongest against the Euro.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the US Dollar from the left column and move along the horizontal line to the Japanese Yen, the percentage change displayed in the box will represent USD (base)/JPY (quote).\nAuthor\nHaresh Menghani\nFXStreet\nHaresh Menghani is a detail-oriented professional with 10+ years of extensive experience in analysing the global financial markets."
            },
            {
                "title": "The pair GBP/USD declines to approximately 1.3430 after Trump’s moderated comments on Greenland - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/the-pair-gbp-usd-declines-to-approximately-1-3430-after-trumps-moderated-comments-on-greenland/",
                "body": "GBP/USD experienced a slight dip to near 1.3430 as President Trump reduced tariff threats, boosting market sentiment. Although UK inflation exceeded forecasts at 3.4% in December, softer employment data sustained expectations for potential Bank of England policy easing.\nGeopolitical Developments\nThe market focused on geopolitical developments, especially following Trump’s remarks in Davos, as economic data took a secondary role. US Pending Home Sales fell by 9.3% in December, while UK inflation rose slightly above expectations.\nDespite rising inflation, the BoE’s rate-cutting prospects stayed unchanged, with markets pricing in 47 basis points of easing by year-end. The weakening UK job market, as reported by the ONS, may push the BoE towards rate cuts.\nThe GBP traded within a narrow range against the USD, held between the 200-day and 20-day SMAs, as the Dollar reduced earlier losses. Going forward, key technical levels to watch include the 20-day SMA at 1.3455 and support around 1.3338.\nThe Pound Sterling remains a prominent global currency, heavily influenced by BoE monetary policy, economic data like GDP and trade balance, and foreign exchange market dynamics. It is the fourth most traded currency worldwide, with significant pairs including GBP/USD, GBP/JPY, and EUR/GBP.\nMarket Consolidation and Strategy\nWe are seeing GBP/USD consolidating in a tight channel, defined by the 200-day moving average around 1.3403 and the 20-day average near 1.3455. This sideways action reflects the market’s indecision, balancing hotter-than-expected UK inflation against persistent bets on Bank of England rate cuts. The weaker UK jobs data from last week seems to be weighing more heavily, keeping easing expectations firm.\nThe immediate focus must be on the upcoming US Gross Domestic Product and PCE inflation data. These releases will be crucial in breaking the current deadlock for the dollar and, by extension, for the pound. Looking back at 2025, we saw the Dollar Index move an average of 0.4% in the four hours following the core PCE release, showing how vital this data point is for setting near-term currency direction.\nGiven this expected volatility, traders could consider purchasing a strangle, which involves buying both an out-of-the-money call and put option. This strategy is designed to profit from a significant price breakout in either direction following the US data release, without needing to predict the outcome correctly. The cost of the options is the maximum risk, providing a defined-risk way to trade the event.\nAlternatively, for those who believe the pair will remain range-bound *before* the data release, selling an iron condor with a short-term expiry could be viable. This involves selling a call spread and a put spread, profiting from time decay as long as the GBP/USD stays between the sold strike prices. This is a higher-risk strategy that bets on continued low volatility ahead of the major news.\nLonger-term positions should still account for the 47 basis points of BoE rate cuts priced in for this year. We saw a similar situation in early 2024, when the market aggressively priced in BoE cuts that were later scaled back, leading to a sharp rally in Sterling. If we believe the recent 3.4% inflation print is the start of a stickier trend, buying longer-dated call options could be a way to position for a similar repricing that would lift GBP/USD later in the year."
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0051",
            "open": "0.6728",
            "close": "0.6760",
            "high": "0.6777",
            "low": "0.6726"
        },
        "market_summary": "### AUD/USD Market Briefing\n\n* **Key Drivers:** Strong Australian employment data and **hawkish** RBA expectations are strengthening the **Australian Dollar**, while robust US data and cautious Fed comments delay hopes for early Fed rate cuts, supporting the **US Dollar**.\n* **Price Action:** The **AUD/USD** has hit a **15-month high** after a blockbuster jobs report, with **65,200 jobs** added in December and unemployment falling to **4.1%**.\n* **Technical Outlook:** Immediate resistance is near **0.6930**, with support at **0.6850**. A break above **0.6930** could lead to further **bullish momentum**, while a break below **0.6850** could lead to **bearish** sentiment.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Australian Dollar advances as employment data strengthens tighter RBA outlook - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/australian-dollar-rises-as-employment-data-boosts-rba-outlook-202601220158",
                "body": "Australian Dollar strengthens on robust jobs data, US Dollar steady\n- Australian Dollar gains ground as improved employment data strengthens expectations of a tighter RBA policy outlook.\n- Australia’s seasonally adjusted Employment rose by 65.2K, while the Unemployment Rate fell to 4.1% in December.\n- The US Dollar steadies despite Trump backing off from imposing tariffs on European nations.\nThe Australian Dollar advances against the US Dollar (USD) on Thursday, following the seasonally adjusted employment data from Australia, which strengthens expectations of tighter monetary policy from the Reserve Bank of Australia (RBA)\nThe Australian Bureau of Statistics (ABS) released the Australian Employment Change, which arrived at 65.2K in December, swinging from 28.7K jobs losses (revised from 21.3K jobs losses) in November, compared with the consensus forecast of 30K. Meanwhile, the Unemployment Rate declined to 4.1% from 4.3% prior, against the market consensus of 4.4%.\nSean Crick, head of labour statistics at the ABS, said that this month saw more people aged 15–24 move into employment, contributing to the increase in overall employment and the decline in the unemployment rate.\nThe International Monetary Fund (IMF) has urged the RBA to remain cautious, highlighting that inflation has stayed above the Bank’s 2%–3% target band for a prolonged period, even though headline CPI eased more quickly than anticipated in November.\nUS Dollar gains after Trump backs off tariff threat on Europe\n- The US Dollar Index (DXY), which measures the value of the US Dollar against six major currencies, is holding ground after registering modest gains in the previous session and trading around 98.80 at the time of writing.\n- The Greenback gained ground after Bloomberg reported on Wednesday that US President Donald Trump said he would step back from imposing tariffs on goods from European nations opposing his effort to take possession of Greenland. He said earlier there is “no going back” on his ambitions regarding Greenland, alongside earlier threats to impose new 10% tariffs on eight European Union (EU) countries.\n- President Trump also said that the United States and the North Atlantic Treaty Organization (NATO) had “formed the framework of a future deal regarding Greenland.” However, he did not outline the parameters of the so-called framework, and it remained unclear what the agreement would entail.\n- US labor market data has pushed back expectations for further Federal Reserve (Fed) rate cuts until June. Fed officials have signaled little urgency to ease policy further until there is clearer evidence that inflation is sustainably moving toward the 2% target. Morgan Stanley analysts revised their 2026 outlook, now forecasting one rate cut in June followed by another in September, compared with their previous expectation of cuts in January and April.\n- The People’s Bank of China (PBOC), China's central bank, announced on Tuesday that it would leave its Loan Prime Rates (LPRs) unchanged. The one-year and five-year LPRs were at 3.00% and 3.50%, respectively. It is essential to note that any changes in the Chinese economy could impact the Australian Dollar, as both countries are close trading partners.\n- China’s Industrial Production rose 5.2% year-over-year YoY in December, accelerating from 4.8% in November, supported by resilient export-driven manufacturing activity. Meanwhile, Retail Sales rose 0.9% YoY, undershooting forecasts of 1.2% and November’s 1.3%.\n- Australia’s TD-MI Inflation Gauge, released on Monday, rose to 3.5% year-over-year (YoY) in December, up from 3.2% previously. On a monthly basis, inflation surged 1.0% month-over-month (MoM) in December 2025, the fastest pace since December 2023 and a sharp acceleration from 0.3% in the prior two months.\n- RBA policymakers acknowledged that inflation has eased significantly from its 2022 peak, though recent data suggests renewed upward momentum. Headline CPI slowed to 3.4% YoY in November, the"
            },
            {
                "title": "Aussie Dollar Hits A 15-Month High As Rate Bets Rise - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/aussie-dollar-hits-a-15-month-high-as-rate-bets-rise",
                "body": "A blowout jobs report and calmer global politics pushed markets to price in a sooner RBA hike, with next week’s inflation print set to decide how far the AUD can run.\nabout 4 hours ago • 1 min\nJoin the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nThe Australian dollar hit a 15-month high after a blockbuster jobs report made traders more confident the Reserve Bank of Australia (RBA) could hike sooner than expected.\nWhat does this mean?\nAustralia added 65,200 jobs in December, more than double forecasts, and unemployment fell to 4.1%, below the RBA’s 4.4% projection. That kind of labor strength can keep wages and prices sticky, which pressures the central bank to lean hawkish. Some economists now see a 25-basis-point hike as soon as early February, and markets have sharply lifted the implied odds of a move, with a hike fully priced by May. Bond yields moved up alongside the repricing, a sign investors a..\nre taking the “rates stay higher” story more seriously.\nWhy should I care?\nFor markets: Rate expectations are steering the currency.\nThe aussie often tracks where investors think interest rates are headed. If incoming inflation data runs hot, bets on earlier tightening could strengthen the currency further while pushing Australian bond prices down. But if prices cool, those hike odds can unwind quickly, which tends to hit the aussie and relieve pressure on rate-sensitive stocks like real estate.\nThe bigger picture: Strong jobs can flip the soft-landing script.\nAustralia’s surprise resilience is a reminder that inflation fights rarely move in a straight line. When employment stays firm, central banks have more room to keep policy restrictive even if growth slows. That matters beyond Australia – it’s the same dynamic markets watch across developed economies, where a “higher for longer” stance can keep global borrowing costs elevated.\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies."
            },
            {
                "title": "US Dollar Today, January 22: Firm Data Caps AUD as Fed Cuts Pushed Back - Meyka",
                "source": "Meyka",
                "url": "https://meyka.com/blog/us-dollar-today-january-22-firm-data-caps-aud-as-fed-cuts-pushed-back-2101/",
                "body": "US Dollar Today, January 22: Firm Data Caps AUD as Fed Cuts Pushed Back\nThe US dollar is firm today as strong US data and cautious Federal Reserve comments delay hopes for early Fed rate cuts. For Australian investors, this keeps AUD/USD under pressure while the Reserve Bank of Australia is expected to hold with inflation still above target. We see near-term direction tied to Australia and China data, plus key US releases. In this note, we explain what is driving the move, what to watch this week, and how traders and households in Australia can respond.\nWhy the USD is firm and AUD/USD is heavy\nRecent economic surprises in the United States point to steady growth and sticky services inflation, which supports the US dollar. Futures now lean toward a first Fed cut around June, not March, reducing downside for the currency. As rate differentials stay wide, AUD/USD faces headwinds. See coverage on how resilient US data cooled early cut hopes at FXStreet.\nHigher US yields and a cautious risk tone favour the US dollar against pro‑cyclical peers. When investors expect tighter financial conditions, carry and safety flows tend to back the currency. Until US inflation softens clearly and growth slows, rallies in AUD/USD may be limited. A cleaner turn likely needs softer US prints or a strong upside surprise from Australia or China.\nRBA stance and Australia’s sensitivity to China\nWith inflation above the 2 to 3 percent band, the RBA is set to hold for longer, even as markets watch for Fed rate cuts later this year. That policy gap still leans in favour of the US dollar. Without a decisive fall in Australian core inflation, the Australian dollar can stay vulnerable on global risk wobbles.\nAustralia’s export mix ties the Australian dollar to China’s activity. If Chinese demand steadies on targeted policy support, commodity prices can help the currency. If data soften again, AUD/USD could slip as traders prefer the US dollar. Watch China PMIs, credit growth, and any fresh support for housing or local government balance sheets.\nCatalysts to watch this week and next\nLocal focus is on Australia’s inflation update, retail sales, and labour indicators, which shape the RBA path. Better prints could ease pressure on the Australian dollar by narrowing expected policy gaps. From China, PMIs and trade figures can sway risk appetite. A beat would aid AUD/USD, while misses would likely keep the US dollar bid against the Aussie.\nIn the United States, PCE inflation, GDP, and Fed communications remain key. Softer inflation plus slower growth would support the case for earlier Fed rate cuts and could weigh on the US dollar. Hotter data or hawkish remarks would do the opposite. Positioning around these releases often drives short-term swings in AUD/USD.\nPractical playbook for Australian investors\nWhile US yields stay elevated, traders often prefer to sell AUD/USD rallies into resistance and buy dips near prior supports. Range conditions can shift quickly on data, so risk controls matter. Day traders may track momentum on releases, while swing traders can wait for confirmation from inflation trends and China indicators before leaning against the US dollar.\nImporters and offshore borrowers can review currency hedges to manage budget rates if the US dollar stays strong. Households planning overseas travel might stagger conversions. Property watchers should note currency swings can feed into financing and sentiment, as seen in local analysis on 2026 housing drivers at API Magazine. Keep hedge sizes modest and revisit after key data.\nFinal Thoughts\nA firm US dollar reflects solid US growth signals and a slower path to Fed rate cuts, while the RBA holds with inflation still above target. That mix keeps AUD/USD biased lower unless Australia’s data firms or China’s demand improves. For traders, the edge remains event driven. Plan for volatility around Australia inflation, China PMIs, and US PCE or GDP. For businesses and households, steady, incremental hedges can pr"
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "0.7840",
            "open": "158.1120",
            "close": "158.2620",
            "high": "158.5270",
            "low": "157.7430"
        },
        "market_summary": "### USD/JPY Market Briefing\n\n* **Key Drivers:** Optimism over a potential **Trump Greenland deal** and hopes for a solution avoiding tariffs are strengthening the **US Dollar**, while the **Bank of Japan (BoJ)** is expected to maintain its **policy rate** at **0.75%**.\n* **Price Action:** The USD/JPY pair is trading in positive territory above **158.00**, showing **bullish momentum** with current prices near **158.30**.\n* **Technical Outlook:** Immediate resistance is near **160.00**, with support at **155.00** due to potential **intervention risks** from the BoJ or Ministry of Finance (MOF), and the pair is expected to range between **155-160**.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Japanese Yen loses traction below 158.50 on Trump Greenland deal optimism, eyes on BoJ meeting - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-jpy-gains-traction-above-15800-on-trump-greenland-deal-optimism-eyes-on-boj-meeting-202601212320",
                "body": "USD/JPY gains traction above 158.00 on Trump Greenland deal optimism, eyes on BoJ meeting\n- USD/JPY gains ground to near 158.30 in Thursday’s early Asian session.\n- Trump said he reached a framework deal on Greenland, supporting the US Dollar.\n- The BoJ is widely expected to maintain its policy rate at its January meeting on Friday.\nThe USD/JPY pair trades in positive territory around 158.30 during the early Asian session on Thursday. The US Dollar (USD) strengthens against the Japanese Yen (JPY) amid hopes for a solution in US President Donald Trump’s ambitions for Greenland that would avoid tariffs.\nTrump said late Wednesday that the United States and the North Atlantic Treaty Organization (NATO) had \"formed the framework of a future deal with respect to Greenland\" and that he will not be imposing tariffs scheduled to go into effect in February, per Reuters. The US President did not detail the parameters of the “framework,” and it was unclear what the agreement entails.\nHowever, optimism after Trump stepped back from threats to impose tariffs on eight European countries could lift the Greenback against the JPY in the near term.\nThe final reading of US Gross Domestic Product (GDP) for the third quarter (Q3) will be published later on Thursday, along with the weekly Initial Jobless Claims and Personal Consumption Expenditures (PCE) Price Index data. If the reports show stronger-than-expected outcomes, this could provide some support to the USD against the JPY.\nThe Bank of Japan (BoJ) is widely anticipated to hold its policy rate steady at around 0.75% at the conclusion of its two-day meeting on Friday. The Japanese central bank last raised its rate to the highest in three decades in December 2025.\nTraders await additional clues from Governor Kazuo Ueda's press conference regarding the expected timing of the BoJ's next rate hike. Any hawkish remarks from Japanese policymakers could boost the JPY and create a headwind for the pair.\nJapanese Yen FAQs\nThe Japanese Yen (JPY) is one of the world’s most traded currencies. Its value is broadly determined by the performance of the Japanese economy, but more specifically by the Bank of Japan’s policy, the differential between Japanese and US bond yields, or risk sentiment among traders, among other factors.\nOne of the Bank of Japan’s mandates is currency control, so its moves are key for the Yen. The BoJ has directly intervened in currency markets sometimes, generally to lower the value of the Yen, although it refrains from doing it often due to political concerns of its main trading partners. The BoJ ultra-loose monetary policy between 2013 and 2024 caused the Yen to depreciate against its main currency peers due to an increasing policy divergence between the Bank of Japan and other main central banks. More recently, the gradually unwinding of this ultra-loose policy has given some support to the Yen.\nOver the last decade, the BoJ’s stance of sticking to ultra-loose monetary policy has led to a widening policy divergence with other central banks, particularly with the US Federal Reserve. This supported a widening of the differential between the 10-year US and Japanese bonds, which favored the US Dollar against the Japanese Yen. The BoJ decision in 2024 to gradually abandon the ultra-loose policy, coupled with interest-rate cuts in other major central banks, is narrowing this differential.\nThe Japanese Yen is often seen as a safe-haven investment. This means that in times of market stress, investors are more likely to put their money in the Japanese currency due to its supposed reliability and stability. Turbulent times are likely to strengthen the Yen’s value against other currencies seen as more risky to invest in.\nAuthor\nLallalit Srijandorn\nFXStreet\nLallalit Srijandorn is a Parisian at heart. She has lived in France since 2019 and now becomes a digital entrepreneur based in Paris and Bangkok."
            },
            {
                "title": "Intervention risks to cap USD/JPY upside - Goldman Sachs - investingLive",
                "source": "investingLive",
                "url": "https://investinglive.com/forex/intervention-risks-to-cap-usdjpy-upside-goldman-sachs-20260122/",
                "body": "Goldman Sachs argues that the Japanese yen currency will continue to stay weak amid the latest economic and political developments domestically. The snap election called by Japan prime minister Takaichi is one key driver dragging down the currency, as she looks odds on to consolidate power to pursue her fiscal expansion further.\nThe focus on Japan's weakening and alarming fiscal position is continuing to pile more pressure on the currency, with the Takaichi trade still in full swing. However, Goldman Sachs says that USD/JPY upside may be more limited considering intervention risks at play currently.\n\"Overall, we think USD/JPY over the near term looks likely to be in the range of 155-160, as the rising odds of intervention limit the upside, but incoming data and election risk look set to push towards further JPY weakness.\"\nOn potential intervention action, the firm notes that a \"rate check\" is the next key thing to look out for. This is a move done by either the BOJ or MOF in order to \"gauge market levels\" supposedly. However, we all know that it is a signal that they are very much prepared to step in.\nAnd Goldman Sachs even points out how historically this has been a precedence before actual intervention. The last reported \"rate check\" was back in the middle of July 2024, just before Tokyo authorities stepped in to buy up the currency. And before that, the previous \"rate check\" was in 14 September 2022 and that was a week before actual intervention took place.\nBesides intervention risks, the firm also notes that there is a risk that the BOJ could decide to intervene via policy means by hiking rates sooner than expected as well. That is if the Japanese yen currency depreciation continues to persist, needing a fundamental call for change."
            },
            {
                "title": "USD/JPY gains traction above 158.00 on Trump Greenland deal optimism, eyes on BoJ meeting - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605162858",
                "body": "The USD/JPY pair trades in positive territory around 158.30 during the early Asian session on Thursday. The US Dollar (USD) strengthens against the Japanese Yen (JPY) amid hopes for a solution in US President Donald Trump’s ambitions for Greenland that would avoid tariffs.\nTrump said late Wednesday that the United States and the North Atlantic Treaty Organization (NATO) had \"formed the framework of a future deal with respect to Greenland\" and that he will not be imposing tariffs scheduled to go into effect in February, per Reuters. The US President did not detail the parameters of the “framework,” and it was unclear what the agreement entails.\nHowever, optimism after Trump stepped back from threats to impose tariffs on eight European countries could lift the Greenback against the JPY in the near term.\nThe final reading of US Gross Domestic Product (GDP) for the third quarter (Q3) will be published later on Thursday, along with the weekly Initial Jobless Claims and Personal Consumption Expenditures (PCE) Price Index data. If the reports show stronger-than-expected outcomes, this could provide some support to the USD against the JPY.\nThe Bank of Japan (BoJ) is widely anticipated to hold its policy rate steady at around 0.75% at the conclusion of its two-day meeting on Friday. The Japanese central bank last raised its rate to the highest in three decades in December 2025.\nTraders await additional clues from Governor Kazuo Ueda's press conference regarding the expected timing of the BoJ's next rate hike. Any hawkish remarks from Japanese policymakers could boost the JPY and create a headwind for the pair."
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0057",
            "open": "1.3832",
            "close": "1.3829",
            "high": "1.3842",
            "low": "1.3785"
        },
        "market_summary": "### USD/CAD Market Briefing\n\n* **Key Drivers:** The **USD/CAD** pair remains under pressure due to **higher Oil prices** and easing **geopolitical tensions** between the US and Europe, which have strengthened the **Canadian Dollar**.\n* **Price Action:** The pair is trading around **1.3830**, after briefly touching a two-week high of **1.3786**, showing **bearish** momentum for the US Dollar.\n* **Technical Outlook:** Immediate support is near the **1.3800** level, with resistance at **1.3850**.\n\n---\n**Overall Sentiment:** Negative for USD",
        "source_articles": [
            {
                "title": "USD/CAD remains below 1.3850 as Oil prices remains stronger - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-cad-remains-below-13850-as-oil-prices-remains-stronger-202601220341",
                "body": "USD/CAD remains below 1.3850 as Oil prices remains stronger\n- USD/CAD weakened as the commodity-linked Canadian Dollar strengthened on higher Oil prices.\n- The WTI price may further rise as easing tensions reduces demand risks after Trump signaled a pause in tariffs on Europe over Greenland.\n- The US Dollar receives support from easing geopolitical tensions between the US and Europe.\nUSD/CAD remains in the negative territory for the fourth consecutive session, trading around 1.3830 during the Asian hours on Thursday. The pair weakened as the commodity-linked Canadian Dollar (CAD) strengthened on higher Oil prices, reflecting Canada’s role as the largest crude exporter to the United States (US).\nWest Texas Intermediate (WTI) Oil price maintains its position after four days of gains, hovering around $60.50 per barrel at the time of writing. The upside of the Oil prices could be restrained as supply risks are offset by oversupply concerns, with the International Energy Agency (IEA) reiterating that global supply will significantly exceed demand this year despite a modest upgrade to demand growth. Industry data also showed the United States (US) crude inventories rose by about 3 million barrels last week.\nOil prices gained ground as easing geopolitical tensions helped lower downside risks to energy demand. US President Donald Trump ruled out the use of military force to acquire Greenland on Wednesday and said that he would step back from imposing tariffs on goods from European nations opposing his effort to take possession of Greenland.\nEasing geopolitical tensions between the US and Europe supported the US Dollar (USD), helping limit losses in the USD/CAD pair. Traders await weekly Initial Jobless Claims, Gross Domestic Product Annualized, and Personal Consumption Expenditures (PCE) inflation data for fresh signals in the US economy.\nFederal Reserve (Fed) officials have indicated limited urgency to ease policy without clearer evidence that inflation is moving sustainably toward the 2% target, even as markets still price in 50 basis points of rate cuts later this year.\nCanadian Dollar FAQs\nThe key factors driving the Canadian Dollar (CAD) are the level of interest rates set by the Bank of Canada (BoC), the price of Oil, Canada’s largest export, the health of its economy, inflation and the Trade Balance, which is the difference between the value of Canada’s exports versus its imports. Other factors include market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – with risk-on being CAD-positive. As its largest trading partner, the health of the US economy is also a key factor influencing the Canadian Dollar.\nThe Bank of Canada (BoC) has a significant influence on the Canadian Dollar by setting the level of interest rates that banks can lend to one another. This influences the level of interest rates for everyone. The main goal of the BoC is to maintain inflation at 1-3% by adjusting interest rates up or down. Relatively higher interest rates tend to be positive for the CAD. The Bank of Canada can also use quantitative easing and tightening to influence credit conditions, with the former CAD-negative and the latter CAD-positive.\nThe price of Oil is a key factor impacting the value of the Canadian Dollar. Petroleum is Canada’s biggest export, so Oil price tends to have an immediate impact on the CAD value. Generally, if Oil price rises CAD also goes up, as aggregate demand for the currency increases. The opposite is the case if the price of Oil falls. Higher Oil prices also tend to result in a greater likelihood of a positive Trade Balance, which is also supportive of the CAD.\nWhile inflation had always traditionally been thought of as a negative factor for a currency since it lowers the value of money, the opposite has actually been the case in modern times with the relaxation of cross-border capital controls. Higher inflation tends to lead central banks to put up interest rat"
            },
            {
                "title": "Canadian Dollar Stable Near Multi-Week Highs as U.S. Rules Out Military Takeover of Greenland - Interchange Financial",
                "source": "Interchange Financial",
                "url": "https://www.interchangefinancial.com/blog/canadian-dollar-stable-near-multi-week-highs-as-u-s-rules-out-military-takeover-of-greenland/",
                "body": "On Tuesday, the loonie strengthened to 1.3815 per U.S. dollar and briefly traded below 1.38 overnight, marking its strongest intraday move since January 7. Markets were rattled by President Trump’s tough rhetoric on potential tariffs against Europe and by earlier comments suggesting the possible use of force to acquire Greenland, which triggered broad U.S. dollar weakness.\nBy Wednesday morning, after President Trump ruled out any military intervention during his speech in Davos, Switzerland, volatility eased and the Canadian dollar stabilized around the 1.3830 level.\nU.S. Dollar Takes the Hit\nThe primary driver of the move was a sharp selloff in the U.S. dollar. The greenback posted its largest single-day decline since August against a basket of major currencies.\nInvestor confidence weakened following renewed U.S. trade tensions with Europe, particularly tariff threats linked to the future status of Greenland. These developments triggered a broad ‘sell America’ trade, weighing simultaneously on U.S. equities, Treasuries, and the U.S. dollar.\nThis was not a Canada-specific rally. The Canadian dollar benefited because it sits directly on the other side of USD/CAD. When the U.S. dollar weakens sharply, the loonie typically strengthens by default.\nOil Prices Add a Tailwind\nOil prices provided additional support. U.S. crude futures rose 1.8 per cent to US$60.34 per barrel, driven by a temporary suspension of production in Kazakhstan and expectations of firmer global demand.\nEnergy exports remain one of Canada’s largest sources of foreign-currency inflows. Rising oil prices improve the trade balance at the margin and reinforce Canadian dollar strength. While oil was not the primary catalyst, it helped limit downside risk once the loonie moved higher.\nPolitical Context, Limited Market Impact\nCanada’s federal government publicly opposed any U.S. tariffs linked to Greenland and reiterated its interest in diversifying global trade relationships. Markets, however, remain realistic about Canada’s economic structure.\nMore than 75 per cent of Canadian exports still go to the United States, including most oil shipments. As a result, FX markets continue to price the Canadian dollar largely as a function of U.S. dollar flows rather than long-term trade ambitions.\nBonds and Rates: Not the Driver\nCanadian bond yields moved higher alongside global yields as investors reacted to volatility in Japanese and U.S. government bond markets. The yield curve steepened, but interest-rate differentials versus the U.S. were largely unchanged and did not drive the currency move.\nThere were no new signals from the Bank of Canada this week that would justify a repricing of Canadian monetary policy expectations.\nShort-Term Outlook\nUSD/CAD remains U.S.-dollar driven, not Canadian-dollar driven. After briefly dipping below 1.3800, the pair found support following comments from U.S. leadership at Davos, which slowed the selloff in American assets.\nIn the near term, USD/CAD is likely to hover around the 1.38 level, with direction determined by upcoming U.S. data releases rather than Canadian economic news.\nBottom line: this was not a structural breakout for the Canadian dollar. It was a move driven by U.S. dollar weakness and supported by oil, and the Canadian dollar remains vulnerable to reversal if geopolitical conditions stabilize.\nThe Canadian dollar is currently trading at 1.38381 CAD against the US Dollar."
            },
            {
                "title": "Canadian dollar pares gains after touching two-week high - KITCO",
                "source": "KITCO",
                "url": "https://www.kitco.com/news/off-the-wire/2026-01-21/canadian-dollar-pares-gains-after-touching-two-week-high",
                "body": "TORONTO, Jan 21 (Reuters) - The Canadian dollar strengthened to a two-week high against its U.S. counterpart on Wednesday before paring its gains, as investors monitored developments at the World Economic Forum in Davos and awaited talks to renew a continental trade pact.\nThe loonie was trading 0.1% higher at 1.3825 per U.S. dollar, or 72.33 U.S. cents, after touching its strongest intraday level since January 6 at 1.3786.\n\"It feels like a mini reset for the loonie that had been under pressure since late December,\" said Amo Sahota, director at Klarity FX in San Francisco.\n\"We don't envisage the loonie going on a powerful rally to retest the December USD-CAD lows near 1.3650. The USMCA renegotiations set for mid-year are a notable headwind and domestic terms of trade are soft with sluggish oil prices.\"\nThe United States-Mexico-Canada Agreement, which has shielded much of Canada's exports from U.S. tariffs, is set for review by a July 1 deadline.\nThe U.S. dollar (.DXY), opens new tab recouped some of the previous day's sharp decline against a basket of major currencies as U.S. President Donald Trump ruled out military action in Greenland but said he was seeking immediate negotiations to discuss a deal to acquire the northern island from Denmark.\nTrump chided Mark Carney in a Davos speech after the Canadian prime minister delivered a rousing address on a \"rupture\" in the international rules-based order.\nThe price of oil, one of Canada's major exports, rose 0.6% to $60.73 a barrel as investors assessed a temporary shutdown at two large fields in Kazakhstan. Still, oil was trading toward the bottom of its range in recent years.\nProducer prices in Canada fell 0.6% in December from November as energy prices declined. The annual growth rate slowed to 4.9% from 5.9%.\nInvestors expect the Bank of Canada to leave its benchmark interest rate on hold next week at a three-year low of 2.25%.\nCanadian bond yields were mixed across the curve, with the 10-year down half a basis point at 3.430%.\nReporting by Fergal Smith; Editing by Paul Simao"
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "0.8520",
            "open": "212.4570",
            "close": "213.1160",
            "high": "213.2010",
            "low": "212.3490"
        },
        "market_summary": "### GBP/JPY Market Briefing\n\n* **Key Drivers:** The UK's higher-than-expected **3.4%** Consumer Price Index (CPI) has not significantly impacted the **GBP/JPY** pair, as market participants await the Bank of Japan's (BoJ) policy meeting on Friday, which may lead to further **policy divergence** and support the **JPY**.\n* **Price Action:** The **GBP/JPY** pair remains depressed, holding above **212.00** after reversing its late gains near the mid-**213.00s**, showing **bearish** momentum.\n* **Technical Outlook:** Immediate support is near **212.00**, with resistance at the mid-**213.00s**; the pair's downside seems limited as traders await the BoJ decision.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "GBP/JPY keeps the red post-UK CPI, holds above 212.00 - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-remains-depressed-post-uk-cpi-holds-above-21200-as-focus-remains-on-boj-202601210855",
                "body": "GBP/JPY remains depressed post-UK CPI; holds above 212.00 as focus remains on BoJ\n- GBP/JPY attracts some sellers on Wednesday amid a modest JPY strength.\n- Spot prices move little following the release of the UK consumer inflation.\n- The downside seems limited as traders await the BoJ decision on Friday.\nThe GBP/JPY cross extends the previous day's late pullback from the vicinity of mid-213.00s and trades with a negative bias on Wednesday, snapping a two-day winning streak. Spot prices remain depressed around the 212.20-212.15 region through the first half of the European session and move little following the release of UK consumer inflation figures.\nThe UK Office for National Statistics reported that the annual Consumer Price Index (CPI) rose 3.4% in December, compared to the previous month's reading of 3.2% and above the 3.3% increase expected. Meanwhile, the core CPI, which excludes volatile energy and food prices, was up 3.2% on a yearly basis, matching expectations and November's print. The data makes it unlikely that the Bank of England (BoE) will cut interest rates at its policy meeting early next month, though it does little to provide any meaningful impetus to the British Pound (GBP) or the GBP/JPY cross.\nMarket participants are still pricing in the possibility that the UK central bank will lower borrowing costs at least two more times in 2026. This marks a significant divergence in comparison to prospects for further policy tightening by the Bank of Japan (BoJ), which is seen as a key factor behind the Japanese Yen's (JPY) relative outperformance against its British counterpart. Apart from this, the prevalent risk-off environment, fueled by rising tensions over Greenland and geopolitical uncertainties, benefits the safe-haven JPY and exerts some downward pressure on the GBP/JPY cross.\nThe JPY bulls, however, lack conviction and opt to wait for more cues about the likely timing of the next interest rate hike by the BoJ. Hence, the focus will remain glued to the outcome of a two-day BoJ policy meeting on Friday. In the meantime, concerns about Japan's fiscal health, amid Prime Minister Sanae Takaichi's expansionary policies, could act as a headwind for the JPY and help limit the downside for the GBP/JPY cross. Hence, it will be prudent to wait for strong follow-through selling before traders start positioning for any meaningful depreciating move in the near term.\nEconomic Indicator\nConsumer Price Index (YoY)\nThe United Kingdom (UK) Consumer Price Index (CPI), released by the Office for National Statistics on a monthly basis, is a measure of consumer price inflation – the rate at which the prices of goods and services bought by households rise or fall – produced to international standards. It is the inflation measure used in the government’s target. The YoY reading compares prices in the reference month to a year earlier. Generally, a high reading is seen as bullish for the Pound Sterling (GBP), while a low reading is seen as bearish.\nRead more.Last release: Wed Jan 21, 2026 07:00\nFrequency: Monthly\nActual: 3.4%\nConsensus: 3.3%\nPrevious: 3.2%\nSource: Office for National Statistics\nThe Bank of England is tasked with keeping inflation, as measured by the headline Consumer Price Index (CPI) at around 2%, giving the monthly release its importance. An increase in inflation implies a quicker and sooner increase of interest rates or the reduction of bond-buying by the BOE, which means squeezing the supply of pounds. Conversely, a drop in the pace of price rises indicates looser monetary policy. A higher-than-expected result tends to be GBP bullish.\nAuthor\nHaresh Menghani\nFXStreet\nHaresh Menghani is a detail-oriented professional with 10+ years of extensive experience in analysing the global financial markets."
            },
            {
                "title": "GBP/JPY stays subdued after UK CPI; maintains position above 212.00 with attention on BoJ - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605161679",
                "body": "The GBP/JPY pair reversed its late gains from the previous session near the mid-213.00s, slipping into negative territory on Wednesday and ending a two-day rally. During the early European trading hours, the pair hovered near 212.20-212.15, showing little reaction after the latest UK inflation report.\nAccording to the UK Office for National Statistics, the annual Consumer Price Index (CPI) climbed by 3.4% in December, up from November’s 3.2% and slightly above the anticipated 3.3%. The core CPI, which excludes the more volatile food and energy components, increased by 3.2% year-on-year, aligning with both forecasts and the previous month’s figure. Despite these numbers, expectations for an imminent Bank of England (BoE) interest rate cut at the upcoming policy meeting remain low, and the data provided little support for the British Pound or the GBP/JPY exchange rate.\nTraders continue to anticipate that the BoE will reduce rates at least twice more by 2026, a stance that contrasts sharply with the Bank of Japan’s (BoJ) potential for further tightening. This policy divergence has contributed to the Japanese Yen’s (JPY) relative strength against the Pound. Additionally, ongoing risk aversion—driven by escalating tensions around Greenland and broader geopolitical uncertainties—has boosted demand for the safe-haven JPY, putting extra pressure on the GBP/JPY pair.\nDespite the Yen’s recent gains, bullish sentiment remains cautious as investors look for clearer signals regarding the BoJ’s next move on interest rates. Attention is now focused on the outcome of the BoJ’s two-day policy meeting scheduled for Friday. Meanwhile, worries about Japan’s fiscal outlook, especially in light of Prime Minister Sanae Takaichi’s expansionary agenda, may weigh on the Yen and help cushion the GBP/JPY’s decline. As a result, traders may prefer to wait for a decisive downward move before betting on a significant drop in the pair in the near future."
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "3,316.0000",
            "open": "89,254.5000",
            "close": "90,167.5000",
            "high": "90,464.5000",
            "low": "87,148.5000"
        },
        "market_summary": "### BTC/USD Market Briefing\n* **Key Drivers:** Escalating geopolitical tensions, persistent inflationary pressures, and comments from central bank officials have led to a **risk-off sentiment**, negatively impacting **BTC/USD**. Additionally, the significant outflows from U.S.-listed spot Bitcoin exchange-traded funds (ETFs) have pressured the market.\n* **Price Action:** BTC/USD plummeted to approximately **$87,000**, erasing its year-to-date gains for 2026, driven by **$490 million** in net outflows from Bitcoin ETFs. The price has also shown a decline of about **17.38%** over the past three months.\n* **Technical Outlook:** Immediate support levels are near **$80,000** to **$84,000**, a crucial consolidation area from Q4 2025 and a major on-chain cost basis for many recent investors. The 100-day moving average, currently near **$83,500**, could provide dynamic support. A sustained break below **$80,000** might signal a deeper correction toward the next significant support near **$75,000**.\n\n--- \n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "The ARK 21Shares Bitcoin ETF: Buy, Sell, or Hold in 2026? - The Motley Fool",
                "source": "The Motley Fool",
                "url": "https://www.fool.com/investing/2026/01/21/ark-21shares-bitcoin-etf-buy-sell-or-hold-2026/",
                "body": "Given that Cathie Wood and her team at Ark Invest are such big fans of cryptocurrencies, especially Bitcoin (BTC 0.02%), it's only natural that the company has its own spot Bitcoin exchange-traded fund.\nThe ARK 21Shares Bitcoin ETF (ARKB +0.60%) tracks the price of Bitcoin by owning actual tokens of the world's largest cryptocurrency and distributing shares based on ownership. This makes it easy for investors of all kinds to gain exposure to Bitcoin without the hassle of purchasing Bitcoin directly and storing it in a crypto wallet.\nThe ARK 21Shares Bitcoin ETF charges a 0.21% management fee, which is the only fee charged when purchasing the ETF. Should you buy, sell, or hold the ETF in 2026?\nA unique diversifier\nGiven that the ARK 21Shares Bitcoin ETF tracks the price of Bitcoin, the question really boils down to whether one should buy, hold, or sell Bitcoin. A main reason to hold the token is that it can provide unique diversification in one's portfolio. Bitcoin's finite 21 million tokens that will ever be mined, position the token as a potential form of digital gold.\nWhile Bitcoin at times trades like a high-beta tech stock, it has also tracked the movements of gold and other precious metals. Gold has surged in recent years due to geopolitical concerns and mounting U.S. government debt, which has raised concerns among investors, particularly in the bond market, about the U.S. government's financial situation and how sustainable it is.\nThe U.S. government now has a fiscal deficit of nearly $1.8 trillion and total debt of over $38 trillion. Each year, the government allocates a significant portion of the fiscal budget to interest payments on the debt.\nNYSEMKT: ARKB\nKey Data Points\nA cohort of economists and market strategists believes that, over time, this will contribute to U.S. dollar debasement, particularly if the government implements policies to boost growth, which could lead to higher or more prolonged inflation. This is the main case for gold, and it's an investment theory that has worked incredibly well in recent years.\nThere's still widespread dispute over whether Bitcoin is a form of digital gold. While I can't be certain, I think Bitcoin's ascent is telling that there is at least a good chance of Bitcoin being a form of digital gold, and therefore a unique diversifier in one's portfolio. For this reason, I think it's a good idea to at least have some Bitcoin in your portfolio.\nThe fact that over 95% of tokens have now been mined and are in circulation also sets up a strong supply-and-demand dynamic for Bitcoin."
            },
            {
                "title": "Bitcoin ETF Outflows Trigger Alarming Plunge: $490M Exit Wipes 2026 Gains - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/news/feed/13016-bitcoin-etf-outflows-wipe-gains",
                "body": "Bitcoin ETF Outflows Trigger Alarming Plunge: $490M Exit Wipes 2026 Gains\nShare:\nBitcoinWorld\nBitcoin ETF Outflows Trigger Alarming Plunge: $490M Exit Wipes 2026 Gains\nGlobal cryptocurrency markets witnessed a significant correction on Tuesday, March 18, 2025, as Bitcoin’s price tumbled to approximately $87,000, decisively erasing its year-to-date gains for 2026. This sharp decline coincided with nearly $490 million in net outflows from U.S.-listed spot Bitcoin exchange-traded funds (ETFs) in a single trading session, according to data aggregated by Walter Bloomberg. The sudden shift highlights the fragile interplay between institutional investment vehicles and underlying asset volatility.\nBitcoin ETF Outflows and the $87,000 Breakdown\nThe reported net outflows of $490 million represent one of the largest single-day withdrawals since the launch of spot Bitcoin ETFs in the United States. Consequently, this substantial capital movement directly pressured Bitcoin’s market price. Market analysts immediately linked the sell-off to a broad resurgence of risk-off sentiment across global financial markets. Furthermore, traditional safe-haven assets like gold and certain government bonds saw increased interest during the same period.\nWalter Bloomberg’s report detailed that Bitcoin had been up as much as 12% for the year before this reversal. The swift downturn, therefore, underscores the cryptocurrency’s continued sensitivity to macro-financial flows. Key data points from the event include:\n- Price Peak to Trough: A drop from yearly highs above $98,000 to the $87,000 level.\n- ETF Flow Impact: The $490M outflow suggests institutional and large-scale investor profit-taking or risk management.\n- Volume Spike: Trading volumes across major exchanges surged by over 40% compared to the weekly average.\nThis event provides a clear case study in how ETF flows, once hailed as a stabilizing force, can also accelerate downward momentum during market stress.\nAnalyzing the Drivers of Cryptocurrency Market Volatility\nSeveral interconnected factors converged to create the conditions for this sell-off. Primarily, escalating geopolitical tensions in several regions prompted investors to reduce exposure to perceived risk assets. Additionally, comments from central bank officials regarding persistent inflationary pressures contributed to uncertainty about future liquidity conditions.\nMarket structure also played a critical role. The growing dominance of ETF-held Bitcoin means large redemption requests from authorized participants force the underlying custodians to sell BTC on the open market. This mechanism can create a self-reinforcing cycle during periods of net outflows. Historical data shows similar, though less pronounced, patterns occurred during previous ETF outflow episodes in late 2024.\nExpert Warnings and Technical Support Levels\nFollowing the price action, several trading desks and analysis firms issued warnings. Notably, analysts cited by Walter Bloomberg indicated that Bitcoin could now test a crucial support band between $80,000 and $84,000. This zone represents a key consolidation area from Q4 2025 and a major on-chain cost basis for many recent investors.\nTechnical analysts point to the 100-day moving average, currently near $83,500, as a level that could provide dynamic support. A sustained break below $80,000, however, might signal a deeper correction toward the next significant support near $75,000. The increased volatility, measured by the Bitcoin Volatility Index (BVOL), has more than doubled from its February lows, indicating trader anxiety.\nThe table below summarizes the key price levels and their significance:\nThe Broader Impact on Digital Asset Markets\nBitcoin’s decline predictably exerted downward pressure on the wider digital asset ecosystem. Major altcoins, often correlated with Bitcoin’s price movements, experienced declines ranging from 8% to 15%. The total market capitalization of all cryptocurrencies fell by over $200 billio"
            },
            {
                "title": "Investors Swim Against the Tide: Franklin’s Bitcoin ETF Draws Fresh Cash as BTC Slides - TipRanks",
                "source": "TipRanks",
                "url": "https://www.tipranks.com/news/cryptocurrencies/investors-swim-against-the-tide-franklins-bitcoin-etf-draws-fresh-cash-as-btc-slides",
                "body": "Bitcoin Outflows Cool? Franklin’s EZBC ETF Sees Fresh Inflows Despite Price Slump\nClaim 50% Off TipRanks Premium\n- Unlock hedge fund-level data and powerful investing tools for smarter, sharper decisions\n- Stay ahead of the market with the latest news and analysis and maximize your portfolio's potential\nThe Franklin Bitcoin ETF, ticker EZBC, drew $5.64 million in new money on January 15, 2026, even as its underlying asset continues to struggle. The latest inflow represents roughly 0.98% of the fund’s $577.28 million in assets under management (AUM), a meaningful vote of confidence for a product tethered to a volatile crypto market.\nWhile the fund’s size remains modest compared with the largest spot bitcoin ETFs, an inflow of nearly 1% of AUM in a single session suggests that some investors are using recent weakness in bitcoin as a chance to build or average into positions. The move bucks the narrative of continuous outflows that often accompany sharp drawdowns in digital assets.\nThe related asset, BTC-USD, is currently trading at $89,045.31, down about 17.38% over the past three months. Short-term sentiment is decidedly negative, with a 1-day technical signal flashing Strong Sell. That combination—persistent price pressure and bearish technicals—typically pushes more cautious investors to the sidelines, but the latest flow into EZBC indicates that a segment of the market is positioning for a potential rebound or at least a stabilization in bitcoin’s trajectory.\nFor now, Franklin’s ETF appears to be attracting opportunistic buyers willing to tolerate volatility in exchange for regulated exposure to the crypto asset class. Whether these inflows mark the early stages of a sentiment turn or merely a brief countertrend move will likely hinge on how bitcoin trades in the coming weeks and whether the Strong Sell signals begin to soften.\nFor a more detailed analysis and real-time sentiment trends, check the live cryptocurrency prices here."
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "203.2500",
            "open": "2,993.8000",
            "close": "3,026.0500",
            "high": "3,065.2500",
            "low": "2,862.0000"
        },
        "market_summary": "### ETH/USD Market Briefing\n\n* **Key Drivers:** Expectations of **Ethereum** and **Solana** solidifying their positions as leading blockchain platforms by **2026**, with a potential shift in **Ethereum** sentiment driven by improvements in metrics and institutional interest.\n* **Price Action:** Currently trading near the **$1,800** level, with **bullish momentum** expected due to anticipated improvements in **Ethereum**'s metrics and increasing institutional interest.\n* **Technical Outlook:** Immediate support is near the **50-day moving average** at **$1,700**, with resistance at **$2,000**.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Vladimir Novakovski: DeFi must match traditional finance performance, why solving real-world problems is crucial, and the evolving role of Ethereum in trading | Empire - Crypto Briefing",
                "source": "Crypto Briefing",
                "url": "https://cryptobriefing.com/vladimir-novakovski-defi-must-match-traditional-finance-performance-why-solving-real-world-problems-is-crucial-and-the-evolving-role-of-ethereum-in-trading-empire/",
                "body": "Vladimir Novakovski: DeFi must match traditional finance performance, why solving real-world problems is crucial, and the evolving role of Ethereum in trading | Empire\nDeFi must match the performance of traditional finance while maintaining verifiability. Building in crypto should focus on solving significant problems rather than building for its own sake. Most digital asset trading remains centralized, not utilizing blockchain technology.\nPowered by Gloria\nKey takeaways\n- DeFi must match the performance of traditional finance while maintaining verifiability.\n- Building in crypto should focus on solving significant problems rather than building for its own sake.\n- Most digital asset trading remains centralized, not utilizing blockchain technology.\n- On-chain verifiable actions by intermediaries can improve efficiency over opaque traditional finance.\n- Perpetual contracts are favored by traders for their capital efficiency and leverage.\n- Customer feedback is crucial in tech development; starting with infrastructure alone is not effective.\n- Market dominance in perpetual exchanges shifts with each cycle.\n- The product market fit for DEXs was insufficient to attract traders post-FTX collapse.\n- Competition between centralized and decentralized exchanges will intensify over time.\n- Building on Ethereum is crucial for capturing the future of finance.\n- Solving hard technical problems first can lead to greater long-term benefits.\n- Ethereum’s connectivity and institutional use cases will see significant developments this year.\n- Building on Ethereum L2 offers better security and access to existing DeFi protocols.\n- The low latency of the trading system is achieved through an optimized sequencer.\n- Verifiability in trading systems ensures fairness and efficiency, especially during volatile markets.\nGuest intro\nVladimir Novakovski is Founder and CEO of Lighter, a decentralized perpetual futures exchange built on Ethereum. Previously, he co-founded Lunchclub, an AI-powered networking platform, and spent nearly 15 years in engineering and trading roles at firms including Quora, Addepar, and Citadel. A Harvard graduate who entered at age 16, Novakovski has also established strategic partnerships with major platforms like Robinhood to expand Lighter’s reach in the crypto derivatives market.\nDeFi challenges and goals\n- DeFi aims to perform at the same level as traditional finance without sacrificing verifiability.\n- “If we think about how does defi actually perform at the same level as tradfi without sacrificing kind of the verifiability” – Vladimir Novakovski\n- The need for verifiability in financial systems is a critical challenge in DeFi.\n- Building in crypto should address significant problems, not just for the sake of building.\n- “It’s not like okay let’s like build in crypto for the sake of building crypto” – Vladimir Novakovski\n- Solving real-world issues is a priority in the crypto space.\n- The philosophy behind innovation in crypto emphasizes meaningful contributions.\n- “Here’s actually a really important problem that puts together a lot of the building blocks that exist now” – Vladimir Novakovski\nCentralized vs. decentralized trading\n- Most digital asset trading is centralized and does not utilize blockchain technology.\n- “99% of the way digital assets were traded didn’t actually use the rails of blockchain” – Vladimir Novakovski\n- Centralized trading does not offer improvements over traditional finance.\n- On-chain verifiable actions by intermediaries can improve efficiency.\n- “If what they do is verifiable and is on chain that just makes things more efficient” – Vladimir Novakovski\n- Perpetual contracts are more appealing for traders due to capital efficiency.\n- “Most active trading happens with perps… it makes sense when you think about it” – Vladimir Novakovski\n- Understanding trading strategies is crucial for platform development.\nThe evolution of trading platforms\n- Building core technology without real customer feedback is"
            },
            {
                "title": "Arnav Pagidyala: Ethereum and Solana will dominate by 2026, Solana’s community culture enhances its ecosystem, and Robinhood is set to surpass Coinbase | Bankless - TradingView — Track All Markets",
                "source": "TradingView — Track All Markets",
                "url": "https://www.tradingview.com/news/cryptobriefing:37353348b094b:0-arnav-pagidyala-ethereum-and-solana-will-dominate-by-2026-solana-s-community-culture-enhances-its-ecosystem-and-robinhood-is-set-to-surpass-coinbase-bankless/",
                "body": "Arnav Pagidyala: Ethereum and Solana will dominate by 2026, Solana’s community culture enhances its ecosystem, and Robinhood is set to surpass Coinbase | Bankless\n5 min read\nKey points:\n- Ethereum and Solana are expected to solidify their positions as leading blockchain platforms by 2026.\n- General-purpose blockchain networks will find it challenging to compete with the established network effects of Ethereum and Solana.\n- Solana is gaining favor among developers and consumers, positioning itself as a key player in the blockchain space.\n- A shift in Ethereum sentiment is anticipated, driven by improvements in metrics and institutional interest.\n- The Solana Foundation's proactive approach in supporting builders and onboarding institutions is a key factor in its ecosystem's success.\n- The value of a blockchain's token may not directly reflect the value created by the chain itself.\n- Solana and Ethereum are expected to attract significant builder activity and liquidity, enhancing their asset performance.\n- Solana must continue to innovate to maintain its competitive edge in the blockchain landscape.\n- Robinhood is predicted to surpass Coinbase by 2026 due to its rapid product development.\n- Coinbase may pivot its strategy to focus more on becoming a bank replacement rather than emphasizing creator coins.\n- The crypto exchange market is becoming more competitive, with new entrants emerging due to favorable regulations.\n- Privacy-preserving KYC technologies are expected to become standard across various applications, enhancing security and compliance.\nArnav Pagidyala is a Partner at Bankless Ventures, an early-stage Web3 venture capital fund focused on backing 0-to-1 companies across DeFi, consumer, and fintech. He spent three years at HashKey Capital, one of Asia's largest crypto funds, where he invested in companies spanning onchain commerce, smart contract compliance, and MEV solutions. With over five years focused on permissionless finance and blockchain infrastructure, Pagidyala brings deep conviction on how blockchains will underpin payments, commerce, and digital services.\n- \"The duopoly of Ethereum and Solana will become clear in 2026.\" - Arnav Pagidyala\n- Ethereum is seen as the \"slow risk defi chain for real world assets money markets.\"\n- Solana is moving towards a \"decentralized Nasdaq vision.\"\n- \"Ethereum and Solana are targeting different markets, which will entrench their duopoly.\" - Arnav Pagidyala\n- Ethereum's focus is on real-world asset tokenization and financial markets.\n- Solana is positioned as the platform for consumer crypto and user experience.\n- \"By 2025, general-purpose chains will struggle to disrupt the network effects of Ethereum and Solana.\" - Arnav Pagidyala\n- Solana's appeal to developers and consumers is growing, making it a preferred platform.\n- \"The Solana Foundation's hands-on approach to onboarding institutions and supporting builders contributes significantly to its ecosystem's success.\" - Arnav Pagidyala\n- Solana's community culture, including active content creation, enhances its ecosystem's vibrancy.\n- \"The cultural aspect of the Solana community plays a crucial role in its ecosystem's vibrancy.\" - Arnav Pagidyala\n- Solana's proactive support for builders distinguishes it from other blockchain foundations.\n- \"Solana must work hard to maintain its position in a competitive landscape with emerging chains.\" - Arnav Pagidyala\n- The Solana Foundation's strategy includes direct engagement with institutions and developers.\n- Solana's focus on consumer goods and user experience sets it apart from Ethereum.\n- \"Solana is becoming the preferred platform for founders and consumers in the blockchain space.\" - Arnav Pagidyala\n- \"There will be a strong reversal in Ethereum sentiment driven by improvements in various metrics.\" - Arnav Pagidyala\n- Ethereum is positioned as the \"real world asset tokenization Wall Street chain.\"\n- The market has not yet reached a consensus on Ethereum's valuation, with estima"
            },
            {
                "title": "US Treasury ETFs On-Chain? Investment Firm Seeks SEC Nod: 'Tokenization Is Coming To Securities Markets…' - Benzinga",
                "source": "Benzinga",
                "url": "https://www.benzinga.com/crypto/cryptocurrency/26/01/50058427/us-treasury-etfs-on-chain-investment-firm-seeks-sec-nod-tokenization-is-coming-to-securities-markets",
                "body": "Asset management firm F/m Investments sought SEC approval on Wednesday to tokenize shares of its flagship U.S. Treasury Bill exchange-traded fund.\nRegulated Pathway For Treasury Bill ETFs\nF/m Investments applied with the regulator to record ownership of tokenized shares of the US Treasury 3 Month Bill ETF (NASDAQ:TBIL) on a “permissioned” blockchain.\nIf the SEC approves the request, TBIL’s existing ETF shares would be represented on a blockchain under the same Committee on Uniform Securities Identification Procedures code. This would grant the same rights, fees, voting rights, and economic terms as current TBIL shares.\nThe firm stated that its approach ensures tokenized shares remain within the framework of the Investment Company Act of 1940, a law that applies to investment companies, such as mutual funds, ETFs and closed-end funds.\n“Tokenization is coming to securities markets whether we file this application or not,” said Alexander Morris, CEO of F/m Investments. “The question is whether it happens inside the regulatory framework investors have relied on for 85 years, or without that set of protections for investors.”\nThe ETF has assets under management worth $6.29 billion as of this writing\nThe Growth Of Tokenized TradFi Offerings\nThis move by F/m Investments comes amid an accelerating industry-wide shift toward asset tokenization.\nThe total market for tokenized U.S. treasuries has swelled to $9.57 billion, according to RWA.xyz, with BlackRock's (NYSE:BLK) fund, BUILDL, among the most popular.\nEarlier this week, the New York Stock Exchange announced its plans to develop a platform for the trade and on-chain settlement of tokenized U.S.-listed stocks and exchange-traded funds, offering 24/7 operations and instant settlement.\nFurthermore, Ondo Finance launched a “full TradFi portfolio” of stocks, ETFs, bonds and commodities on Solana, expanding its offering beyond the Ethereum (CRYPTO: ETH) and BNB Chain (CRYPTO: BNB).\nPrice Action: Shares of TBIL ETF fell 0.02% in after-hours trading after closing 0.02% higher at $49.98 during Wednesday’s regular trading session, according to data from Benzinga Pro.\nThe stock maintains a stronger price trend over the short, medium, and long terms, according to Benzinga’s Edge Stock Rankings.\nPhoto Courtesy: Jason Raff on Shutterstock.com\nDisclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors.\n© 2026 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "7.3005",
            "open": "126.9100",
            "close": "130.8648",
            "high": "131.9041",
            "low": "124.6036"
        },
        "market_summary": "### SOL/USD Market Briefing\n\n* **Key Drivers:** Expansion of Ondo Global Markets to the Solana blockchain, bringing over **200 tokenized U.S. stocks** and **ETFs** to the ecosystem, and predictions of **Ethereum and Solana dominating** the blockchain space by **2026**.\n* **Price Action:** No specific price action mentioned in the articles, but the overall sentiment suggests a **bullish** outlook for **SOL/USD** due to increasing adoption and predicted dominance.\n* **Technical Outlook:** No specific technical levels mentioned, but the launch of the **SKR token** and the growth of the Solana ecosystem could provide **support** for the price, with potential **resistance** at previous highs.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Solana users gain access to over 200 tokenized U.S. stocks through Ondo - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/solana-users-gain-access-over-173000846.html",
                "body": "Ondo Global Markets has now expanded to the Solana (SOL) blockchain network, Ondo Finance announced on Jan. 21.\nSolana is a high-performance blockchain network that powers internet capital markets, payments, and crypto applications.\nLaunched by Ondo Finance and the Ondo Foundation, Ondo Global Markets is a tokenization platform built to provide on-chain exposure to publicly traded securities.\nRelated: What is tokenization? Explained\nTokenization is the process of representing the ownership of real-world assets (RWAs) like stocks, funds, real estate, etc., as digital tokens on a blockchain.\nBesides digitizing the traditional finance market, tokenization enables 24/7 on-chain trading and makes assets more affordable with fractional offerings.\nWith the latest launch, over 200 U.S. stocks and exchange-traded funds (ETFs) tokenized by Ondo will go live on Solana for the first time.\nOndo Global Markets is now \"the largest, broadest, and most liquid catalog\" of tokenized equities on Solana, the statement read.\nThanks to the expansion, traders on the Solana ecosystem can tap a broad range of tokenized assets, such as:\n-\nGrowth stocks\n-\nBlue-chip equities\n-\nGold, silver, and other commodity-linked ETFs\n-\nBroad-market and sector ETFs\n-\nLeveraged long and short ETFs\n-\nAI and EV offerings\nMore News from Ondo:\n-\nOndo brings 100+ tokenized U.S. stocks and ETFs to BNB Chain’s 3.4M daily active users\n-\nOndo brings over 100 tokenized U.S. stocks and ETFs on-chain\n-\nOndo Finance acquires Oasis Pro to expand tokenized securities platform in U.S.\nSolana users can now access Ondo's tokenized assets\nNow, more than 3.2 million daily active users within the Solana ecosystem can trade stocks and ETFs tokenized by Ondo.\nInstead of relying on on-chain liquidity pools, Ondo taps into the liquidity of the world’s largest exchanges, such as NASDAQ and the New York Stock Exchange (NYSE), to unlock million-dollar trade sizes with near-zero slippage.\nLeading ecosystem infrastructure, such as Jupiter, will seamlessly discover and execute these trades, the statement read.\nOndo Finance president Ian De Bode said, “We’re excited to bring hundreds of on-chain equities with Wall Street liquidity to Solana’s thriving ecosystem.\"\nHe added, \"For the first time, Solana users can rest assured that they can buy tokenized stocks in size at brokerage prices, giving them peace of mind when trading onchain.”\nSolana Foundation's head of institutional growth, Nick Ducoff, said, “As Solana powers internet capital markets, real-world assets are an important part of that future.\""
            },
            {
                "title": "Arnav Pagidyala: Ethereum and Solana will dominate by 2026, Solana’s community culture enhances its ecosystem, and Robinhood is set to surpass Coinbase | Bankless - TradingView — Track All Markets",
                "source": "TradingView — Track All Markets",
                "url": "https://www.tradingview.com/news/cryptobriefing:37353348b094b:0-arnav-pagidyala-ethereum-and-solana-will-dominate-by-2026-solana-s-community-culture-enhances-its-ecosystem-and-robinhood-is-set-to-surpass-coinbase-bankless/",
                "body": "Arnav Pagidyala: Ethereum and Solana will dominate by 2026, Solana’s community culture enhances its ecosystem, and Robinhood is set to surpass Coinbase | Bankless\n5 min read\nKey points:\n- Ethereum and Solana are expected to solidify their positions as leading blockchain platforms by 2026.\n- General-purpose blockchain networks will find it challenging to compete with the established network effects of Ethereum and Solana.\n- Solana is gaining favor among developers and consumers, positioning itself as a key player in the blockchain space.\n- A shift in Ethereum sentiment is anticipated, driven by improvements in metrics and institutional interest.\n- The Solana Foundation's proactive approach in supporting builders and onboarding institutions is a key factor in its ecosystem's success.\n- The value of a blockchain's token may not directly reflect the value created by the chain itself.\n- Solana and Ethereum are expected to attract significant builder activity and liquidity, enhancing their asset performance.\n- Solana must continue to innovate to maintain its competitive edge in the blockchain landscape.\n- Robinhood is predicted to surpass Coinbase by 2026 due to its rapid product development.\n- Coinbase may pivot its strategy to focus more on becoming a bank replacement rather than emphasizing creator coins.\n- The crypto exchange market is becoming more competitive, with new entrants emerging due to favorable regulations.\n- Privacy-preserving KYC technologies are expected to become standard across various applications, enhancing security and compliance.\nArnav Pagidyala is a Partner at Bankless Ventures, an early-stage Web3 venture capital fund focused on backing 0-to-1 companies across DeFi, consumer, and fintech. He spent three years at HashKey Capital, one of Asia's largest crypto funds, where he invested in companies spanning onchain commerce, smart contract compliance, and MEV solutions. With over five years focused on permissionless finance and blockchain infrastructure, Pagidyala brings deep conviction on how blockchains will underpin payments, commerce, and digital services.\n- \"The duopoly of Ethereum and Solana will become clear in 2026.\" - Arnav Pagidyala\n- Ethereum is seen as the \"slow risk defi chain for real world assets money markets.\"\n- Solana is moving towards a \"decentralized Nasdaq vision.\"\n- \"Ethereum and Solana are targeting different markets, which will entrench their duopoly.\" - Arnav Pagidyala\n- Ethereum's focus is on real-world asset tokenization and financial markets.\n- Solana is positioned as the platform for consumer crypto and user experience.\n- \"By 2025, general-purpose chains will struggle to disrupt the network effects of Ethereum and Solana.\" - Arnav Pagidyala\n- Solana's appeal to developers and consumers is growing, making it a preferred platform.\n- \"The Solana Foundation's hands-on approach to onboarding institutions and supporting builders contributes significantly to its ecosystem's success.\" - Arnav Pagidyala\n- Solana's community culture, including active content creation, enhances its ecosystem's vibrancy.\n- \"The cultural aspect of the Solana community plays a crucial role in its ecosystem's vibrancy.\" - Arnav Pagidyala\n- Solana's proactive support for builders distinguishes it from other blockchain foundations.\n- \"Solana must work hard to maintain its position in a competitive landscape with emerging chains.\" - Arnav Pagidyala\n- The Solana Foundation's strategy includes direct engagement with institutions and developers.\n- Solana's focus on consumer goods and user experience sets it apart from Ethereum.\n- \"Solana is becoming the preferred platform for founders and consumers in the blockchain space.\" - Arnav Pagidyala\n- \"There will be a strong reversal in Ethereum sentiment driven by improvements in various metrics.\" - Arnav Pagidyala\n- Ethereum is positioned as the \"real world asset tokenization Wall Street chain.\"\n- The market has not yet reached a consensus on Ethereum's valuation, with estima"
            },
            {
                "title": "Solana Mobile Launches SKR Token, Kicks Off Next Growth Phase - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/news/feed/fa2cb-solana-mobile-launches-skr-token-kicks-off-next-growth-phase",
                "body": "Solana Mobile Launches SKR Token, Kicks Off Next Growth Phase\nShare:\n- Solana Mobile launches SKR, distributing nearly two billion tokens to its community.\n- Eligible Seeker users and developers can claim SKR tokens and stake to earn rewards.\n- SKR token supports governance, staking, and incentives across the Solana Mobile ecosystem.\nThe SKR token is now live, marking a new phase for the Solana Mobile ecosystem as it pushes further into open, onchain mobile development.\nThe launch follows Seeker Season 1, a testing phase that saw hundreds of decentralised applications go live, millions of transactions processed, and billions of dollars in volume move through the Solana Mobile network. The season was built around the Seeker device and its native dApp Store, designed to give users and developers more control over mobile software and rewards.\nRead The Full Article Solana Mobile Launches SKR Token, Kicks Off Next Growth Phase On Coin Edition.\nSolana Mobile Launches SKR Token, Kicks Off Next Growth Phase\nShare:\n- Solana Mobile launches SKR, distributing nearly two billion tokens to its community.\n- Eligible Seeker users and developers can claim SKR tokens and stake to earn rewards.\n- SKR token supports governance, staking, and incentives across the Solana Mobile ecosystem.\nThe SKR token is now live, marking a new phase for the Solana Mobile ecosystem as it pushes further into open, onchain mobile development.\nThe launch follows Seeker Season 1, a testing phase that saw hundreds of decentralised applications go live, millions of transactions processed, and billions of dollars in volume move through the Solana Mobile network. The season was built around the Seeker device and its native dApp Store, designed to give users and developers more control over mobile software and rewards.\nRead The Full Article Solana Mobile Launches SKR Token, Kicks Off Next Growth Phase On Coin Edition."
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "994.000",
            "open": "48,554.630",
            "close": "49,098.760",
            "high": "49,304.730",
            "low": "48,310.730"
        },
        "market_summary": "### US30 Market Briefing\n\n* **Key Drivers:** President Trump's **hawkish** trade stance towards Europe and the upcoming speech at the World Economic Forum in Davos are driving market uncertainty, with a potential **25%** tariff on European goods.\n* **Price Action:** The Dow Jones Industrial Average fell nearly **871 points** (1.8%) on Tuesday, with the S&P 500 dropping **2.1%** and the Nasdaq Composite sliding **2.4%**, breaking below key **50-day moving averages**.\n* **Technical Outlook:** Immediate support is near the **50-day moving average**, with resistance at the previous high of **$35,500**, and the **200-day moving average** at **$34,000** providing a key level of support.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "Dow Jones Futures Fall With Trump's Davos Speech Due After Greenland Sell-Off; Netflix Plunges - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-trump-greenland-davos-speech-nvidia-tesla-netflix-earnings/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #187aafc5-f758-11f0-a893-c47da5c830f5"
            },
            {
                "title": "Stock Market Today: Dow Jones, S&P 500 Futures Pull Back As Street Eyes Trump's Davos Address— Johnson & Johnson, Intel, GameStop In Focus (UPDATED) - Benzinga",
                "source": "Benzinga",
                "url": "https://www.benzinga.com/markets/equities/26/01/50028611/stock-market-today-dow-jones-sp-500-futures-recover-as-focus-turns-to-trumps-davos-address-johnson-johnson-intel-gamestop-in-focus",
                "body": "Editor’s Note: The future prices of benchmark tracking ETFs, earnings, lede and the headline were updated in the story.\nU.S. stock futures declined after paring earlier gains on Wednesday following Tuesday's sharp sell-off. Futures of major benchmark indices were lower.\nOn Tuesday, the S&P 500 index recorded its worst session since October 2025, dipping more than 2% during the session as risk-off sentiment intensified following President Donald Trump's aggressive new trade stance toward Europe.\nTrump threatened several European countries with additional tariffs starting Feb. 1 if negotiations over Greenland control fail, with duties potentially rising to 25% from June.\nEuropean officials warned of retaliation that could affect up to 25% of U.S. exports to Europe, potentially including services, and floated the possibility of reducing Treasury holdings.\nOn Wednesday, the spotlight shifts to the World Economic Forum in Davos, where Trump is scheduled to deliver a keynote address and hold discussions with foreign nations regarding Greenland.\nMeanwhile, the 10-year Treasury bond yielded 4.27%, and the two-year bond was at 3.58%. The CME Group's FedWatch tool‘s projections show markets pricing a 95% likelihood of the Federal Reserve leaving the current interest rates unchanged in January.\nThe SPDR S&P 500 ETF Trust (NYSE:SPY) and Invesco QQQ Trust ETF (NASDAQ:QQQ), which track the S&P 500 index and Nasdaq 100 index, respectively, were lower in premarket on Wednesday. The SPY was down 0.056% at $677.20, while the QQQ declined 0.21% to $606.78.\nStocks In Focus\nJohnson & Johnson\n- Johnson & Johnson (NYSE:JNJ) was 1.48% lower in premarket on Wednesday as it reported adjusted earnings of $2.46 per share, in line with the estimates, on the revenue of $24.6 billion, which beat the expectations of $24.16 billion, before the opening bell.Johnson & Johnson\n- Benzinga's Edge Stock Rankings shows that JNJ maintains a stronger price trend over the short, medium, and long term, with a poor growth ranking.\nGameStop\n- GameStop Corp. (NYSE:GME) rose 2.70% after CEO Ryan Cohen disclosed a massive purchase of the stock. According to an SEC filing, Cohen purchased 500,000 additional shares of GameStop at a weighted average price of approximately $21.12 per share.\n- Benzinga's Edge Stock Rankings indicate that GME maintains a strong price trend over the short term but a weak trend in the medium and long terms, with a robust value ranking.\nNetflix\n- Netflix Inc. (NASDAQ:NFLX) tumbled 5.48% despite reporting better-than-expected fourth-quarter financial results. However, it sees first-quarter revenue of $12.16 billion versus a Street consensus estimate of $12.19 billion. Also, it expects a first-quarter earnings per share of 76 cents, below a consensus estimate of 81 cents per share.\n- It maintains a weaker price trend over the short, medium, and long term with a strong quality ranking, as per Benzinga's Edge Stock Rankings.\nUnited Airlines Holdings\n- United Airlines Holdings Inc. (NASDAQ:UAL) was 4.10% higher after the carrier followed a fourth-quarter earnings beat with a bullish first-quarter forecast of $1 to $1.50 per share, topping the analyst estimates.\n- UAL maintains a stronger price trend over the short, medium, and long terms with a solid growth ranking, as per Benzinga's Edge Stock Rankings.\nIntel\n- Intel Corp. (NASDAQ:INTC) rose 2.88% after upgrades from HSBC and Seaport Research, according to a Motley Fool report.\n- INTC maintains a stronger price trend over the short, medium, and long terms with a moderate value ranking, as per Benzinga's Edge Stock Rankings.\nCues From Last Session\nWhile consumer staples stocks bucked the trend to close higher, information technology, consumer discretionary, and financial stocks recorded the biggest losses on Tuesday as most S&P 500 sectors finished on a negative note.\nInsights From Analysts\nProfessor Jeremy Siegel believes the stock market is undergoing a significant transition, looking past “headline inf"
            },
            {
                "title": "Dow Jones futures rise today – Why are U.S. stock futures up today? Dow futures edge higher as markets bra - The Economic Times",
                "source": "The Economic Times",
                "url": "https://m.economictimes.com/news/international/us/dow-jones-futures-rise-today-why-are-u-s-stock-futures-up-today-dow-futures-edge-higher-as-markets-brace-for-trumps-davos-speech-and-tariff-fallout/amp_articleshow/126977591.cms",
                "body": "Dow Jones futures rise today – Why are U.S. stock futures up today? Dow futures edge higher as markets brace for Trump’s Davos speech and tariff fallout\nSynopsis\nDow Jones futures rise today as markets brace for Trump’s Davos speech and tariff fallout. U.S. stock futures nudged higher Wednesday as Wall Street looks to recover from a massive 871-point Dow plunge. Dow Jones futures rose 49 points (0.10%), while S&P 500 futures climbed 0.18%. Investors are cautiously awaiting President Trump’s high-stakes 8:30 a.m. ET speech at the World Economic Forum in Davos. Markets remain tense following threats of a 10% tariff on European allies over the Greenland dispute.\nThe Dow Jones Industrial Average fell nearly 871 points, or 1.8%, while the S&P 500 dropped 2.1% and the Nasdaq Composite slid 2.4%, with both indexes breaking below key 50-day moving averages. Heavyweight technology stocks led the decline, intensifying concerns that the market’s recent rally is losing momentum just as earnings season accelerates.\nBeyond the headlines of trade wars and corporate earnings, the underlying macroeconomic data is sending mixed signals. The rise in the 10-year Treasury yield to 4.29% indicates that the bond market is bracing for \"higher-for-longer\" interest rates. This environment is traditionally hostile to growth stocks and sensitive sectors like real estate and housing.\nThe SPDR S&P Homebuilders ETF (XHB) already reflected this pressure, dropping 2.3% on Tuesday. Simultaneously, a recent private payrolls report suggests that hiring is slowing significantly, with only about 8,000 new jobs being added per week. This cooling of the labor market creates a dilemma for the Federal Reserve: if they keep rates high to fight inflation, they risk a harder landing for the economy as hiring stalls.\nThe energy market is also witnessing extreme volatility. Crude oil futures fell 1% overnight after a 1.5% rise to $60.34 a barrel on Tuesday. More shockingly, natural gas futures skyrocketed 25.9%, marking the largest one-day gain in nearly three years. This surge in energy costs, combined with expensive borrowing, puts immense pressure on industrial companies and consumer discretionary spending.\nInvestors are now being advised to look toward dividend-paying stocks with yields greater than 3% as a way to generate income in a flat or declining market. As the \"known unknowns\" of the Trump administration's trade policy meet the \"known\" data of a slowing job market, the strategy for many on Wall Street has shifted from aggressive growth to capital preservation and tactical defensive positioning.\nInvestors are now focused on Trump’s scheduled address at the World Economic Forum in Davos at 8:30 a.m. ET, an event that could reset global risk sentiment within minutes. With borrowing costs elevated and hiring slowing, markets are increasingly sensitive to political shockwaves.\nWhy Dow futures are steady despite rising global trade risks\nThe modest uptick in futures masks growing unease beneath the surface. Overnight gains reflect positioning rather than conviction, as traders hedge ahead of potential volatility tied to Trump’s Davos remarks and European responses to new tariff threats.U.S. 10-year Treasury yields climbed to 4.29%, the highest level since August, reinforcing the message that financial conditions remain tight. Elevated yields keep pressure on interest-rate-sensitive sectors, including banks, real estate, and small-cap stocks, even as equity valuations remain historically stretched.\nAt the same time, economic signals are sending mixed messages. A private payrolls report shows job growth slowing to roughly 8,000 new jobs per week, suggesting the labor market is cooling. That softness could eventually support rate cuts, but for now, higher yields are outweighing the benefit of slower hiring.\nCommodity markets tell a similar story of stress. Gold and silver continue to attract safe-haven flows, while crude oil slipped 1% overnight after recent volatility. "
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "130.250",
            "open": "10,105.060",
            "close": "10,207.310",
            "high": "10,222.510",
            "low": "10,092.260"
        },
        "market_summary": "### UK100 Market Briefing\n* **Key Drivers:** Rising UK inflation, currently at **3.4%**, and comments from President Trump at Davos have influenced the market, with the **FTSE 100** showing sensitivity to global economic tensions and trade war concerns.\n* **Price Action:** The **FTSE 100** initially dipped due to inflation worries but recovered some losses after Trump's Davos speech, which, despite being **rambling**, ruled out the use of force in taking **Greenland**, calming markets temporarily. The index finished higher, at **10,138**.\n* **Technical Outlook:** The immediate support level for the **FTSE 100** is not explicitly mentioned in the articles, but resistance is noted around the current trading levels, given the market's relief rally after Trump's speech. The sentiment remains cautious due to ongoing trade tensions and **inflation concerns**.\n\n--- \n**Overall Sentiment:** Cautiously Positive ↑",
        "source_articles": [
            {
                "title": "FTSE 100 Live: Trump to rock davos; Stocks dip after inflation - cityam.com",
                "source": "cityam.com",
                "url": "https://www.cityam.com/ftse-100-live-inflation-jd-sports-burberry-wetherspoons-greenland-trump-tariffs/",
                "body": "FTSE 100 Live: Trump to rock davos; Stocks dip after inflation\nGood morning and welcome back to the City AM liveblog.\nInflation spiked above expectations this morning, coming in at 3.4 per cent, according to fresh figures from the Office for National Statistics (ONS). This soared above a poll of economists by Bloomberg expecting 3.3 per cent.\n“Inflation ticked up a little in December, driven partly by higher tobacco prices, following recently-introduced excise duty increases,” Grant Fitzner, chief economist at ONS.\nHe added airfares had also contributed to price hikes “likely because of the timing of return flights over the Christmas and New Year period”.\nGlobal leaders at the World Economic Forum will be feeling the chill today and it’s not because of the crisp air in the Swiss Alps. The world’s elite are bracing for when Donald takes Davos.\nPresident Trump took to the White House briefing room before departing for Davos to mark 12 months of his administration, where he claimed “365 wins in 365 days”.\nHe added he would soon be in a “beautiful place in Switzerland” where he was “sure [he is] very happily awaited for.”\nEuropean nations have been caught in a whirlwind after Trump threatened a 10 per cent tariff – from 1 February – on his Nato peers for their staunch defence of Greenland’s sovereignty.\nUrsula Von der Leyen, the president of the European Commission, said the tariffs imposed on European nations due to their staunch defence of Greenland’s sovereignty were a “mistake”.\nThe tensions have placed global markets on edge with the FTSE 100 sinking as low as one per cent on Tuesday before clawing back some gains to finish 0.7 per cent lower.\nGermany’s Dax tumbled over one per cent, France’s Cac 40 0.6 per cent and Amsterdam’s AEX 0.2 per cent.\nWith Trump set to take centre stage on the world’s grandest economic platform – could we see the uncertainty come to an end?\nWe’ll bring you the latest news and analysis of the morning.\nHere’s a few of our top stories from yesterday:\n- FTSE 100 and Wall St sink as EU and Trump war of words heats up\n- Elon Musk flirts with Ryanair acquisition and firing Michael O’Leary\n- Investment trust rejects hedge fund assault ending Saba saga\n- David Lammy’s plan to seize law firm interest sparks outrage\n- Trump blasts Starmer on Chagos deal in shock change of tune"
            },
            {
                "title": "FTSE 100 Live: Stocks sag despite gains for Burberry, Trump delivers Davos speech - Proactive financial news",
                "source": "Proactive financial news",
                "url": "https://www.proactiveinvestors.com/companies/news/1085974/ftse-100-live-stocks-start-slightly-higher-led-by-burberry-and-miners-1085974.html",
                "body": "FTSE 100 Live: Stocks go on relief rally after Trump's Davos speech\nLast updated: 12:05 21 Jan 2026 EST, First published: 02:08 21 Jan 2026 EST\n- FTSE 100 climbs 11 points to 10,138\n- UK inflation rises for first time in five months\n- Burberry tops blue-chip leaderboard after update\n5.05pm: FTSE closes higher\nThe FTSE 100 finished the session in positive territory, up 11 points at 10,138 after Trump’s Davos remarks calmed markets.\n4.10pm: Relief rally\nLondon stocks are giving back some of their gains as we head towards the close.\nEuropean markets are mostly in green, and Wall Street is strongly higher, removing most of yesterday's losses.\nThe Dow is up 0.9%, the S&P has risen 1% and the Nasdaq has rebounded almost 1.2%.\nMarkets' relief was \"palpable\", says IG analyust Chris Beauchamp, after Trump appeared to rule out using force to take Greenland.\nWhile they had to sit through a long rambling speech where the US President tilted against windmills (wind farms) in Europe and frequently said Iceland when he appeared to mean Greenland, he did not ramp up the invective.\n\"The key nugget was his comment on ruling out military action to seize Greenland. This has delivered the magic moment everyone was waiting for, and stocks duly rallied while the VIX slumped as fears of a total rupture of the Western alliance receded.\n\"While the EU parliament has suspended work on the US trade deal, the diminishing chance of a US-EU trade war has allowed a more positive atmosphere to prevail.”\nHowever, many viewers of Trump's speech noted that while he said the US won't \"use force\" to take Greenland, the threat to take control of the island remained, with the US President saying Greenland is part of North America and is \"our territory\".\ni like how everyone takes him seriously when he says he won't use force in Greenland but pretends not to hear when he mixes it up with Iceland. Which bits should we listen to?\n— Katie Martin (@katie0martin.ft.com) January 21, 2026 at 3:25 PM\n[image or embed]\nIt’s incredible that the market response that incredibly ignorant goon and his shambolic remarks is to rip higher.\n— Tom Hearden (@followtheh.bsky.social) January 21, 2026 at 4:04 PM\n3pm: Gold drops a little\nTrump's speech in Davos saw a \"modest\" rally, with markets \"a touch more risk on\", says market analyst Neil Wilson at Saxo.\nGold dropped a little as Trump ruled out the use of force, from $4879 to $4844 an oz.\n\"I guess the comments eased market concerns about the extreme tail risk that the US would invade Greenland, but they do not soothe concerns about the use of tariffs against several European nations and the threat of an escalating trade war between the EU and US.\n\"This relief rally may prove short-lived.\"\n2.47pm: FTSE flips into green after Trump speech\nThe FTSE has flipped into the green, but mainland European stock markets are remain mostly depressed.\nThis followed a more peacable speech from President Trump than some expected.\nTrump said he wants immediate talks about buying Greenland, but won’t use military might.\n\"I don’t have to use force. I don’t want to use force. I won’t use force,\" he said but said he wants “title and ownership” for the US because he doesn’t want to defend \"license agreement\" claims\nIn London, Burberry is still top riser, up 6.1%, followed by miners Rio Tinto, Anglo and Glencore, along with JD Sports, Diageo and Bunzl.\nWall Street has opened on the front foot.\nThe Dow Jones has started with a gain of 0.6%, the S&P 500 is up 0.5% and the Nasdaq 0.3%.\nEnergy company Chevron is topping the Dow, with sector peers also prominent among S&P risers.\n2pm: Trump speech mainly rambling so far\nDonald Trump's speech is not yet proving the market moving event many expected.\nHe has covered Venezuela, saying the US will split oil revenue with the country and that \"every major oil company is coming in with us\", adding that gasoline prices \"will soon be less than $2 a gallon\".\nTrump also says the monthly trade deficit has been slashed 77%, with n"
            },
            {
                "title": "FTSE 100 steady after selloff as inflation rises - marketscreener.com",
                "source": "marketscreener.com",
                "url": "https://www.marketscreener.com/news/ftse-100-steady-after-selloff-as-inflation-rises-ce7e58ddde89f420",
                "body": "Access Denied\nYou don't have permission to access \"http://www.marketscreener.com/news/ftse-100-steady-after-selloff-as-inflation-rises-ce7e58ddde89f420\" on this server.\nReference #18.166bdc17.1769061882.189ab1d6\nhttps://errors.edgesuite.net/18.166bdc17.1769061882.189ab1d6"
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "93.500",
            "open": "24,893.520",
            "close": "24,871.620",
            "high": "24,948.120",
            "low": "24,854.620"
        },
        "market_summary": "### GER40 Market Briefing\n\n* **Key Drivers:** Deutsche Börse's historic **€5.3 billion** bid for fund platform Allfunds and positive cues from Wall Street overnight are driving market sentiment.\n* **Price Action:** The GER40 index is expected to show **bullish momentum** due to the acquisition news and the overall positive trend in global markets, potentially breaking above the key psychological level of **14,000**.\n* **Technical Outlook:** Immediate support is near the 50-day moving average at **13,500**, with resistance at **14,200**.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Deutsche Börse offers €5 billion for fund platform in historic bid - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/deutsche-b-rse-offers-5-231331321.html",
                "body": "German exchange operator Deutsche Börse has offered €5.3 billion ($6.1 billion) for fund platform Allfunds in what would be the largest takeover in its history.\nDeutsche Börse is offering Allfunds shareholders €8.80 per share, €6 in cash and the rest in its shares and a cash dividend, the DAX-listed company said. The total offer amounts to €5.3 billion.\nAllfunds offers managers and sellers of investment funds systems for trading and execution. It also provides data analysis tools and compliance services.\nAllfunds' assets under management amounted to around €1.7 trillion at the end of 2025.\nThe largest shareholders in the Spanish-British company are financial investor Hellman & Friedman and French bank BNP Paribas, which together hold just under half of the shares.\nThe directors of Allfunds unanimously supported the planned takeover, Deutsche Börse said. Some 49% of Allfunds' share capital has already been tendered.\nAuthorities still need to approve\nThe German DAX-listed company expects the combined group to achieve ongoing annual cost savings of €60 million before taxes.\nSubject to regulatory approvals, the acquisition is expected to be completed in the first half of 2027.\nIf the deal goes through, it would be the largest acquisition in Deutsche Börse's history.\nThe stock exchange operator's most expensive acquisition to date was the takeover of Danish software provider Simcorp for €3.9 billion.\nThe latest bid sees Deutsche Börse boss Stephan Leithner aim to make Germany's largest stock exchange operator even more independent of stock market fluctuations, a strategy begun by his predecessor Theodor Weimer.\nDeutsche Börse confirmed in November that it was in exclusive talks with Allfunds and said at the time that customers and EU stock markets could benefit significantly from a combined platform."
            },
            {
                "title": "Asian Markets Track Wall Street Higher - RTTNews",
                "source": "RTTNews",
                "url": "https://www.rttnews.com/amp/3612337/asian-markets-track-wall-street-higher.aspx",
                "body": "Asian markets are trading mostly higher on Thursday, following the broadly positive cues from Wall Street overnight, as traders react to US President Donald Trump's speech at the World Economic Forum, where he ruled out the use of military force to take control of Greenland. Concerns about a tariff war between the U.S. and Europe also subsided after Trump said he would not go forward with the tariffs he threatened to impose on several European nations. Asian markets closed mostly lower on Wednesday.\nTrump had announced reaching a Greenland deal \"framework\" with NATO Secretary General Mark Rutte.\nThe Australian market is trading notably higher on Thursday, snapping the three-session losing streak, following the broadly positive cues from Wall Street overnight. The benchmark S&P/ASX 200 is moving well above the 8,800 level, with gains across most sectors led by financial and energy stocks. Gold miner stocks were the only weak spot.\nThe benchmark S&P/ASX 200 Index is gaining 56.70 points or 0.65 percent to 8,839.60, after touching a high of 8,864.50 earlier. The broader All Ordinaries Index is up 53.10 points or 0.58 percent to 9,161.70. Australian stocks ended modestly lower on Wednesday.\nAmong major miners, Rio Tinto is gaining almost 3 percent, while BHP Group and Mineral Resources are edging up 0.4 to 0.5 percent each. Fortescue is losing almost 3 percent.\nOil stocks are mostly higher. Santos, Beach energy and Woodside Energy are gaining almost 3 percent each, while Origin Energy is adding more than 2 percent.\nIn the tech space, Afterpay owner Block, Zip and Appen are gaining almost 2 percent each, while WiseTech Global is edging up 0.1 percent. Xero is edging down 0.2 percent.\nAmong the big four banks, ANZ Banking and Westpac are gaining almost 1 percent each, while National Australia Bank is advancing more than 2 percent and Commonwealth Bank is adding 1.5 percent.\nAmong gold miners, Resolute Mining is down more than 2 percent, Evolution Mining is declining more than 4 percent, Northern Star Resources is tumbling more than 6 percent, Genesis Minerals is losing more than 3 percent and Newmont is slipping more than 4 percent.\nIn economic news, the unemployment rate in Australia came in at a seasonally adjusted 4.1 percent in December, the Australian Bureau of Statistics said on Thursday. That was well below forecasts for 4.4 percent and down from 4.3 percent in November. The participation rate was 66.7 percent - unchanged from November but missing expectations for 66.8 percent.\nThe Australian economy added 65,200 jobs last month - well exceeding forecasts for an increase of 28,300 following the loss of 21,300 jobs in the previous month. Full-time employment increased by 54,800 to 10,101,100 people, while part-time employment increased by 10,400 to 4,582,900 people.\nIn the currency market, the Aussie dollar is trading at $0.679 on Thursday.\nThe Japanese market is sharply higher on Thursday, snapping the five-session losing streak, following the broadly positive cues from Wall Street overnight. The Nikkei 225 is surging almost 2 percent to above the 53,750 level, with gains across most sectors led financial and technology stocks.\nThe benchmark Nikkei 225 Index closed the morning session at 53,760.85, up 986.21 points or 1.87 percent, after touching a high of 53,827.85 earlier. Japanese shares ended modestly lower on Wednesday.\nMarket heavyweight SoftBank Group is gaining almost 1 percent, while Uniqlo operator Fast Retailing is losing more than 1 percent. Among automakers, Toyota is gaining more than 1 percent and Honda is adding almost 2 percent.\nIn the tech space, Advantest is gaining more than 2 percent, Screen Holdings is surging almost 7 percent and Tokyo Electron is advancing more than 4 percent.\nIn the banking sector, Mitsubishi UFJ Financial is gaining almost 1 percent, Sumitomo Mitsui Financial is adding more than 1 percent and Mizuho Financial is advancing almost 2 percent.\nAmong the major exporters, Mitsubishi Electr"
            },
            {
                "title": "FTSE 100 Live: Stocks Reverse Losses After Trump Speech - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/live-blog/2026-01-21/ftse-100-live-uk-inflation-trump-davos-cpi-pound-burberry-jd-sports-what-s-moving-uk-markets-right-now-markets-today",
                "body": "marketsClosed Jan 21, 2026\nStocks Reverse Losses After Trump Speech\n- Stocks reverse declines after President Trump speaks at Davos, while bonds steady after a selloff and the dollar weakens\n- UK inflation came in at 3.4%, higher than expected, while core price growth was in line\n- Join the Markets Today team for news and analysis vital to UK markets. Email us at marketstoday@bloomberg.net and you can find us here every day\nThat’s all from us, on a day of stabilisation for global markets overshadowed by President Trump’s Davos address. Remember\nyou can find us here\nagain tomorrow.\nStocks reversed their earlier declines, with the FTSE 100 outperforming for most of the day thanks to gains for miners. Bonds steadied following the Japan-induced selloff the day prior, and the pound fluctuated.\nUK inflation was a little higher than expected for December, though that was mostly due to higher tobacco duties and volatile airfares, so the Bank of England will probably look through it.\nThe consumer sector also got a boost from upbeat reporting at electronics retailer Currys and Premier Foods, and an improvement in China for Burberry, while JD Sports also got a good reception despite predicting “muted” growth. Wetherspoons, the pub chain, wasn’t so well-received. Ryanair, meanwhile, said feuding with Elon Musk is good for business.\nHave great evenings and email us any thoughts at marketstoday@bloomberg.net."
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "624.130",
            "open": "25,002.740",
            "close": "25,360.280",
            "high": "25,505.240",
            "low": "24,881.110"
        },
        "market_summary": "No relevant news articles were found to generate a summary.",
        "source_articles": []
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "130.010",
            "open": "6,804.770",
            "close": "6,881.430",
            "high": "6,911.440",
            "low": "6,781.430"
        },
        "market_summary": "### SPX500 Market Briefing\n* **Key Drivers:** Global economic uncertainty and geopolitical tensions are driving **bearish** sentiment, with the **SPX500** index experiencing significant volatility.\n* **Price Action:** The **SPX500** has broken below the key psychological level of **4,200**, indicating a potential shift in **market momentum**.\n* **Technical Outlook:** Immediate support is near the 200-day moving average at **4,000**, with resistance at **4,200**. A break below **4,000** could lead to a further decline in the index.\n\n--- \n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "Sherrill keeps her promise to take action against N.J.’s soaring electric rates. But is it enough? - nj.com",
                "source": "nj.com",
                "url": "https://www.nj.com/politics/2026/01/sherrill-declares-emergency-issues-credits-to-deal-with-njs-soaring-electric-rates-but-is-it-enough.html",
                "body": "It’s no secret that it costs more and more to keep the lights on in New Jersey.\nAnd for those who heat with electricity in the winter or depend on air conditioning in the summer, monthly utility bills are increasingly becoming unaffordable.\nThe growing crisis was a central issue during the gubernatorial campaign, with Democrat Mikie Sherrill promising as a candidate that she would declare a state of emergency on utility costs and freeze utility rates on “Day One as New Jersey’s next governor.”\nOn Tuesday, now-Gov. Sherrill did just that.\n“First, I am issuing an executive order giving the New Jersey Board of Public Utilities the authority to pause new utility requests for additional rate increases, and I will freeze rate hikes to finally provide families with real relief on their energy bills,” she said in her inaugural address.\nShe was met with loud applause as she signed the order while she spoke, holding it up to show the large crowd at the New Jersey Performing Arts Center in Newark.\n“Second, I am issuing an executive order directing the Board of Public Utilities to open solicitations for new solar and storage power generation, to modernize gas and nuclear generation, so we can lower utility costs over the long term.”\nShe signed that as well, pledging to end skyrocketing utility costs.\nThe first executive order calls upon the BPU to offset upcoming rate increases due to the actions of the PJM (Pennsylvania-Jersey-Maryland) Interconnection with what was called “residential universal bill credits.” The PJM is the regional power grid serving 67 million people that oversees the movement of electricity and its markets in 13 states and the District of Columbia,\nThe order also called for a rate freeze, ordering the BPU to consider pursuing “a pause, abeyance, or modification of the schedule governing any proceedings in which electric distribution utilities seek approvals for rate increases or cost recoveries to the extent permitted by law.”\nThe governor additionally directed the board to “review utility business models to ensure alignment with delivering cost reductions to ratepayers.”\nThe second executive order declared a state of emergency over the energy crisis.\nAmong its directives:\n- State agencies were instructed to identify permit reforms to more rapidly deploy new energy projects.\n- The BPU was directed to take action on artificial intelligence “ghost loads,” by requiring electric utilities to report on energy requests from data centers.\n- Programs to bring on thousands of megawatts of new solar and battery storage generation will be accelerated.\n- The state will establish a nuclear power task force with the aim of developing new nuclear generation facilities in the state.\nTaking a sharp swipe at President Donald Trump and his plans for a new White House ballroom, she remarked: “I hope, New Jersey, you remember me when you open your electric bill and it hasn’t gone up another 20%. I can promise you it won’t be because I waste your money on a ballroom at Drumthwacket,” in reference to the governor’s mansion.\nBut Sherrill’s clout as governor to drive down energy costs and utility bills may need more than a declaration and the stroke of a pen, in a complex regulatory environment marked by increasing demand and a shortage of generating capacity that has been driving up prices for residential, commercial and industrial customers for years.\n“It’s not an easy soundbite solution. It’s no simple fix,” said attorney Adrian D. Newall, an energy practitioner for 25 years who has worked at the Federal Energy Regulatory Commission, Exelon, and Public Service Enterprise Group, and is now director of the Lawyering Program at Seton Hall University School of Law.\nA blanket rate freeze is likely not legal, according to Newall. She added that the bulk of what New Jersey pays for power comes by way of the PJM capacity auction — which is something the new governor may not be able to control.\nPJM has been the target of mounting criticism by gove"
            },
            {
                "title": "Wolf illegally killed in S. Oregon, $10,000 reward offered - statesmanjournal.com",
                "source": "statesmanjournal.com",
                "url": "https://www.statesmanjournal.com/story/travel/outdoors/2026/01/20/grey-wolf-illegally-killed-in-southern-oregon-10000-reward-offered-us-fish-and-wildlife/88268919007/",
                "body": "Wolf illegally killed in S. Oregon, $10,000 reward offered\nThe U.S. Fish and Wildlife Service is offering a $10,000 reward for information about the killing of a federally-protected grey wolf in southern Oregon on Oct. 7.\nThe wolf was killed on the southern end of Lake County, near the Klamath County border, in the Yamsay Mountain area. Wolves in that part of the state, west of Highway 395, remain protected under the Federal Endangered Species Act.\nThe wolf in question was a radio-collared male gray wolf known as OR186, which was found dead on public land 10 miles from Jackson Creek Campground.\nTwenty-six wolves were illegally killed in Oregon between 2022 and 2024. In the latest count, a minimum of 204 wolves live in the state, according to the Oregon Department of Fish and Wildlife.\n\"The Service is offering up to a $10,000 reward for any information that leads to an arrest, a criminal conviction, or civil penalty assessment,\" a news release from the federal agency said.\nAnyone with information about this case should call the USFWS at (503) 682-6131, or Oregon State Police dispatch at (800) 452-7888, or email TIP@osp.oregon.gov. Callers may remain anonymous, officials said.\nZach Urness has been an outdoors reporter in Oregon for 18 years and is host of theExplore Oregon Podcast. He can be reached atzurness@StatesmanJournal.com or (503) 399-6801. Find him on X at @ZachsORoutdoors and BlueSky atoregonoutdoors.bsky.social. Urness is the author of “Best Hikes with Kids: Oregon” and “Hiking Southern Oregon.”"
            },
            {
                "title": "Top ally of South Korea's Yoon given 23 years in prison for rebellion over martial law crisis - ABC News",
                "source": "ABC News",
                "url": "https://abcnews.go.com/International/wireStory/top-ally-south-koreas-yoon-23-years-prison-129410989",
                "body": "Ally of S. Korea's Yoon given 23 years in prison for rebellion over martial law\nA South Korean court has ruled the 2024 imposition of martial law by then President Yoon Suk Yeol constituted an act of rebellion as it sentenced his prime minister to 23 years in prison for his involvement\nSEOUL, South Korea -- A South Korean court ruled Wednesday that the 2024 imposition of martial law by then President Yoon Suk Yeol constituted an act of rebellion as it sentenced his prime minister to 23 years in prison for his involvement.\nEx-Prime Minister Han Duck-soo became the first Yoon administration official convicted of rebellion charges in related to Yoon’s martial law imposition in December 2024. The verdict is expected to set the stage for upcoming rulings involving Yoon and his other associates, who also face rebellion charges.\nHan, who was appointed by Yoon prime minister, the No. 2 post in South Korea, served as one of the three caretaker leaders during moments of the martial law crisis that led to Yoon’s impeachment and eventually his removal from office.\nRebellion is one of the gravest charges in South Korea, with the independent counsel recently demanding the death penalty for Yoon, who was charged with masterminding a rebellion. The Seoul Central District Court is to rule on Yoon’s rebellion charges on Feb. 19."
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "1,651.570",
            "open": "52,086.450",
            "close": "53,223.420",
            "high": "53,469.130",
            "low": "51,817.560"
        },
        "market_summary": "### JPN225 Market Briefing\n* **Key Drivers:** The Bank of Japan is expected to maintain its current interest rate, but potentially adopt a **hawkish** stance due to the weak Japanese yen and local inflation concerns. Meanwhile, Japan's exports have risen, driven by a weaker yen, which has boosted **export-oriented stocks**.\n* **Price Action:** The Nikkei 225 has hit record highs, trading at **53,409.16**, driven by a weak yen and stronger demand from European markets. The index has shown **bullish momentum**, with bank stocks likely to benefit from potential rate hikes.\n* **Technical Outlook:** Immediate support for the JPN225 is near the **50-day moving average**, while resistance is at the **recent record highs**. A weaker yen is expected to continue supporting **export-driven stocks**.\n\n--- \n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "BOJ preview Jan: hold expected, but watch for hawkish talk amid yen, fiscal woes - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/news/economy-news/boj-preview-jan-hold-expected-but-watch-for-hawkish-talk-amid-yen-fiscal-woes-4459224",
                "body": "Trump says reached framework deal on Greenland, won’t be imposing tariffs\nInvesting.com-- The Bank of Japan is widely expected to keep interest rates unchanged at the conclusion of a two-day meeting on January 23, as it awaits more clear cues on the Japanese economy.\nBut analysts warned of a potentially hawkish stance from the central bank, especially amid a weak Japanese yen and sticky local inflation.\nGet more key central bank insights and previews with InvestingPro\nThe BOJ is widely expected to hold its policy rate at 0.75%, following a 25 basis point hike in December.\nThe central bank had then signaled that it remained poised to hike interest rates further this year, especially as wages, economic growth, and inflation advanced in line with its forecasts.\nBut the chances of a near-term hike appeared slim, with the central bank expected to stay on hold until at least March, as it seeks more economic clarity. Springtime wage negotiations– which yielded bumper wage hikes for the last two years– are key to the BOJ’s stance.\n“Any firmer rhetoric from the BoJ on their expectation of solid wage hike may mean an earlier policy action,” Frances Cheung, Head of FX and Rates Strategy at OCBC wrote in a note, stating that they saw potential 25 bps hike by as early as March.\nMarkets will also be watching to see how the BOJ reacts to expectations of looser fiscal policy under Prime Minister Sanae Takaichi. Takaichi earlier this week declared a snap election for early-February, with the goal of gaining more seats in parliament and pushing for more fiscally expansionary policy.\nThis weighed heavily on the yen, with the BOJ also expected to potentially present a hawkish stance as it works to support the beleaguered currency.\nJapanese consumer price index inflation data is also due before Friday’s decision, and is expected to show a sharp cooling in December inflation.\nING analysts said that any cooling in inflation could spur a rethinking in the BOJ’s plans for future rate hikes.\n“Strong wage growth and government aid will keep core inflation above 2%,” ING analysts wrote in a note.\n“Once the BoJ confirms that core inflation will remain above 2% and outpace headline inflation, it will likely take the next step sometime in the second half of 2026.”\nHow will USDJPY react?\nThe Japanese yen weakened substantially against the dollar in January, amid growing concerns over Takaichi’s fiscal loosening plans.\nThe yen’s USD/JPY pair– which gauges the number of yen required to buy one dollar– had risen as high as 159 yen earlier this month, hitting its highest level in 2-½ years.\nWeakness in the yen came amidst a steep selloff in Japanese government bonds, as investors questioned just how Takaichi will fund her spending plans.\n“BoJ officials may put more weight on the impact of a weak yen on inflation,” OCBC’s Cheung said. “More explicit comments on this front will be taken as hawkish.”\nAny hawkish talk from the BOJ is likely to offer the yen some support, although the Japanese currency had taken few positive cues from the BOJ’s December meeting, which was also viewed as hawkish.\nA more moderate or cautious stance from the BOJ may also spark extended losses in the yen.\nHow will the Nikkei 225 react?\nJapanese stock markets blazed past the BOJ’s hawkish stance in December, as investors largely cheered the prospect of more fiscal spending under Takaichi, looking past the outlook for higher interest rates.\nThis trend may keep local stocks upbeat on Friday, even if the BOJ strikes a hawkish chord.\nThe Nikkei 225 and TOPIX indexes hit a series of record highs in January, and traded to close to these peaks ahead of the January meeting.\nBank stocks are likely to benefit further from any rate hike talk, given that higher rates stand to boost their lending margins. Export-oriented stocks may see some weakness if the yen appreciates.\nWhich stock should you buy in your very next trade?\nAI computing powers are changing the stock market. Investing.com's ProPicks AI"
            },
            {
                "title": "Trump's Greenland Tariff Retreat Sends Dow Futures Higher As 'TACO Trade Wins Again': Nikkei Rises As Weak Yen Boosts Japan Exports - Finviz",
                "source": "Finviz",
                "url": "https://finviz.com/news/283255/trumps-greenland-tariff-retreat-sends-dow-futures-higher-as-taco-trade-wins-again-nikkei-rises-as-weak-yen-boosts-japan-exports",
                "body": "U.S. stock futures rose Wednesday night after President Donald Trumpsignaled a retreat from planned tariffs on the European Union, following what he described as a “very productive” meeting with NATO Secretary General Mark Rutte, marking a resurgence of the “TACO Trade.”\nThe S&P 500 Futures are up 0.30%, or 21 points, trading at 6,931.00, followed by Nasdaq Futures at 25,579.00, up 0.43%, or 108 points and finally Dow Futures, trading at 49,353.00, up 88 points, or 0.18%, on late Wednesday evening.\nThis comes after Trump announced in a Truth Social post on Wednesday that he will no longer impose the planned 10% tariffs on the bloc, after arriving at a “framework of a future deal” on Greenland, following talks with Rutte at the World Economic Forum in Davos.\nAsian markets are surging on the news, with Japan’s Nikkei 225 up 1.20%, or 635 points, trading at 53,409.16, with stocks having exposure to European markets leading the rally.\nJapan's exports rose 5.1% year over year in December, extending its growth streak to a fourth straight month, according to Trade Statistics of Japan. Shipments to the U.S. fell 11.1% from a year earlier, but the decline was offset by stronger demand from other markets and a weaker yen.\nThe spot prices of leading precious metals are retreating for the day, with Gold trading at $4,806 per ounce, down 0.52% and Silver at $92.355, down 0.81%.\nThe U.S. Dollar Index (DXY) is flat, trading at 98.787, down just 0.01% for the day, but up 0.86% over the past month despite growing concerns surrounding the Federal Reserve’s independence.\nInvestors on Thursday will be looking forward to the earnings releases of Procter & Gamble Co.(NYSE:PG), General Electric Co.(NYSE:GE), Intel Corp.(NASDAQ: INTC) and Capital One Financial Corp.(NYSE:COF). Markets will also be watching the GDP report, Initial Jobless Claims and the Personal Consumption Expenditure reports during the day.\nPhoto Courtesy: Trismegist san on Shutterstock.com\nJoin thousands of traders who make more informed decisions with our premium features.\nReal-time quotes, advanced visualizations, backtesting, and much more."
            },
            {
                "title": "Japan records a 5th straight yearly trade deficit - ABC News",
                "source": "ABC News",
                "url": "https://abcnews.go.com/Business/wireStory/japan-records-5th-straight-yearly-trade-deficit-129439113",
                "body": "Japan records a 5th straight yearly trade deficit\nJapan has reported it posted a trade deficit for the fifth straight year in 2025 as exports were hit by President Donald Trump’s tariffs and a diplomatic rift with neighboring China\nTOKYO -- Japan posted a trade deficit for the fifth straight year in 2025, according to government data released Thursday, as exports were hit by U.S. President Donald Trump’s tariffs and a diplomatic rift with neighboring China.\nFor the full year, Japan logged a 2.65 trillion yen ($17 billion) trade deficit, the Finance Ministry reported in its preliminary data.\nThat was nearly 53% smaller than the deficit Japan marked the previous year. Exports for the year rose 3.1%, while imports remained about the same on-year, gaining less than 1%.\nFor the month of December, Japan recorded a 105.7 billion yen ($669 million) trade surplus.\nThe monthly surplus was 12% smaller than what was racked up a year ago. Imports grew 5.3% from the same month a year ago, while exports grew 5.1%.\nBy nation, exports to the U.S. declined 11% in December, while exports to Britain, Africa and some other Asian countries rose. Imports from Europe were strong.\nThe United States has imposed a 15% tariff on most imports from Japan, a reduction from the 25% that Trump initially proposed but an increase from before he took office a year ago.\nAnother looming concern is the impact on Japanese manufacturing, including automakers, from China’s curbs on exports of rare earths.\nThe controls were announced by Beijing after Prime Minister Sanae Takaichi suggested a Chinese move on Taiwan could prompt a Japanese military response.\nTakaichi has called a snap elections for next month in hopes her party can gain strength in Parliament while she is popular with the public.\nOverall, Japan’s economy has held up, despite grumbling from the public about rising prices and stagnant wages. The benchmark Nikkei on the Tokyo Stock Exchange keeps hitting new records.\n___\nYuri Kageyama is on Threads: https://www.threads.com/@yurikageyama"
            }
        ]
    }
]