[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "261.660",
            "open": "5,179.400",
            "close": "5,414.330",
            "high": "5,419.180",
            "low": "5,157.520"
        },
        "market_summary": "ERROR: An unexpected error occurred during AI summary generation: 'choices'",
        "source_articles": [
            {
                "title": "Gold surges, 2026 headwinds, US dollar unwinds: Market Takeaways - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/video/gold-surges-2026-headwinds-us-dollar-unwinds-market-takeaways-221826841.html",
                "body": "US stocks (^DJI, ^IXIC, ^GSPC) ended Wednesday's trading session in mixed territory after the Federal Reserve's latest decision to hold interest rates steady at its January FOMC meeting.\nYahoo Finance Markets and Data Editor Jared Blikre breaks down the biggest market themes from today’s trading day, including the latest price surge in gold (GC=F), possible market headwinds to come in 2026, and the negative moves in the US dollar (DX-Y.NYB)\nTo watch more expert insights and analysis on the latest market action, check out more Asking for a Trend.\nWe got to start with the ho-hum action in stocks and you can see that was a very choppy chart that we had in the Dow. So, what am I saying here? Stocks shrug, but gold surges. So, let's go back and take a look at a few more charts. In fact, just to highlight this again, I haven't seen a Feb announcement day this choppy, this quiet in some time. That's just the Dow. You can see it closed barely in the green up 12 percentage points.\nThere's the Nasdaq, there's the S&P 500. But let's go to gold. and that was just on a tear. Even for gold standards, it was uh gold standard. It was up uh almost 6% and I went back and according to some measures and depends on how you slice and dice and put put together the futures contracts, but haven't seen a move like this since March 19th of 2009. You know what was happening back then? Very beginning, just a few days into QE1.\nAnd that just kind of tells you the strength of the move here. Let's check out the year to date and you can see it's up 25%. In fact, only a few days ago, it was uh it was up quite a bit lower. Let me just go to the 10 day because I think it'll only cross the 5,000 mark. Yeah, that was last week somewhere in there. So it is just on a tear. and it's not just gold, of course, it's silver too. That's is uh if it's not a record high today, it's very close.\nBut also in the upper left, PA equals F, that's palladium. And if we go to the year-to-date totals on all of these, you can see silver up 65%, platinum up 26, and gold just behind, uh palladium up 25 as well. And the upper left though, that's 99%, that's natural gas. Natural gas prices for February delivery have more than doubled this year, but that's kind of an outlier because of the weather.\nSo beyond the here and now my friend, you're looking farther out to 2026. You're wondering, what are some potential pain points I got to have on my radar? You would say what?\nYes, I was just asking that very same question to Steve Steve Sosnik. He's the chief strategist at Interactive Brokers. And this is for an episode of Stocks and Translation, a podcast that comes out Tuesday morning. But here's what he had to say about one of these headwinds this year.\nIt's a mid-term election year. We've had two down years in the last 10. Care to guess when they were? You mentioned one of them, 2018, the other one was 2022. What do they have in common? Mid-term election years. We had obviously a big, you know, sort of bear market moves in 2020, obviously. And again, last year with with liberation day, but uh in terms of lasting down years, those were the two.\nAnd he had a he had quite a list there. Not just midterm elections, also the market is pricing in a number of Fed rate cuts, probably going to get a disappointment on that front. Uh new Fed chair, a lot of times when we have a new Fed chair, they are tested early. in 2018, Fed chair Powell came in, right away he was tested with Volmageddon in February, look that one up and also a near bear market in December of that year when he mentioned autopilot with respect to uh what was that? quantitative tightening.\nAlso, a weaker dollar and we're going to get into the dollar in a second. That can be inflationary. So, you know, kind of goes both ways there. But also we are in the fourth year of this bull market. That's another one. AI spending concentration risk and then rates. Uh we might actually have longer-term rates shooting up and that would be a headwind "
            },
            {
                "title": "Wall Street set to open with gains ahead of Federal Reserve interest rate call; gold and silver soar - jdnews.com",
                "source": "jdnews.com",
                "url": "https://www.jdnews.com/wall-street-set-to-open-with-gains-ahead-of-federal-reserve-interest-rate-call-gold/article_24efb4ce-783b-54e3-81ec-350438f34a58.html",
                "body": "U.S. markets were mostly churning higher again in off-hours trading early Wednesday, while prices for gold and silver soared ahead of an interest rate decision by the U.S. Federal Reserve.\nFutures for the S&P 500 gained 0.3% before the opening bell after hitting an all-time high a day earlier. Futures for the Dow Jones Industrial Average were nearly unchanged while Nasdaq futures climbed 0.8%.\nLater Wednesday, the U.S. central bank is due to announce its latest move on interest rates. The expectation is that it will hold its main interest rate steady for now.\nInflation remains stubbornly above the Fed’s 2% target, and lower interest rates could push prices even higher for U.S. consumers even while giving the economy a boost. Traders expect the Fed to resume its cuts to interest rates later this year.\nThe Fed cut its benchmark rate three times in a row to close out 2025 in an effort to shore up a softening labor market. Job gains were tepid at best last year compared to 2024, and while layoffs and unemployment remain historically low, more companies have been announcing workforce reductions.\nAmazon said Wednesday that it was laying off another 16,000 corporate employees. that follows October's round of cuts that shed 14,000 workers. On Wednesday, UPS said it is planning to cut up to 30,000 operational jobs, while the image-sharing platform Pinterest said it planned to reduce its head count by 15%.\nThe dollar rebounded slightly against the Japanese yen early Wednesday but has still weakened sharply since last week, putting pressure on shares of major exporters.\nThe dollar was trading at 152.45 yen, up from 152.19 yen. But it’s nearly 4% lower than its level last week, when it surged to near 160 yen, prompting both Japanese and U.S. officials to warn they would intervene to stanch the yen’s decline.\nThe dollar has weakened since President Donald Trump threatened tariffs against several European countries that he said opposed his taking control of Greenland. Such threats, along with worries about risks like the U.S. government’s heavy debt, have periodically pushed global investors to step back from U.S. markets, a move that’s come to be called “Sell America.”\nAn index measuring the U.S. dollar’s strength against several of its competitors has dropped to its lowest point since 2022.\nThe euro slipped to $1.1982 from $1.2041 late Monday. It also has surged against the dollar.\nIn premarket trading, health care companies were notable laggards with Cigna, Molina and Elevance all down between 2% and 4%. UnitedHealth Group stabilized after losing nearly 20% of its value on Tuesday after the U.S. government's projected rate increase for Medicare Advantage came in well below expectations.\nOn the winning side early was the technology sector, where Seagate, Western Digital, Sandisk and Intel all jumped between 5% and 10%.\nSeveral of Wall Street’s most influential stocks will deliver their latest earnings reports in the coming days. They include Meta Platforms, Microsoft and Tesla on Wednesday and Apple on Thursday.\nThe pressure is on companies to deliver strong growth in profits following record-setting runs for their stock prices. Stock prices tend to follow the path of corporate profits over the long term, and earnings need to rise to quiet criticism that they’ve grown too expensive.\nThe price of gold jumped 3.5% to $5,263 per ounce and silver’s price jumped 6.2%, to $112.50. Both were just off record highs.\nPrices of precious metals have been soaring as investors, including major central banks, have sold dollars to park their money in assets considered to be relatively safe in times of turmoil.\nIn Europe, Germany’s DAX was down 0.4% at midday, while the CAC 40 in Paris sank 1.2%. Britain’s FTSE 100 slipped 0.5%.\nIn Asian trading, South Korea’s benchmark hit a record, lifted by gains for technology shares like computer chip maker SK Hynix, which climbed 5.1%. The Kospi gained 1.7% to 5,170.81.\nTokyo’s Nikkei 225 index clawed back early los"
            },
            {
                "title": "Gold Hits Record Above $5,300 as Trump Dollar Comments Aid Rally - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/articles/2026-01-27/gold-holds-gains-as-trump-comments-add-fuel-to-debasement-trade",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            }
        ]
    },
    {
        "asset_name": "Silver",
        "symbol": "EIGHTCAP:XAGUSD",
        "status": "Success",
        "data": {
            "day_range": "6.926",
            "open": "112.248",
            "close": "116.565",
            "high": "117.416",
            "low": "110.490"
        },
        "market_summary": "### Silver (XAG/USD) Market Briefing\n\n* **Key Drivers:** Increased demand for precious metals due to trade tensions and a weakening **dollar**, with the **U.S. Federal Reserve** keeping interest rates steady, contributing to **bullish momentum**.\n* **Price Action:** Surged to **$112.50** per ounce, with a **6.2%** jump, nearing record highs as investors seek safe-haven assets.\n* **Technical Outlook:** Immediate support is near the **$100** psychological level, with resistance at **$120**, as the metal's price is expected to remain volatile due to ongoing economic uncertainty.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Utahns line up at gold, silver exchanges as demand surges nationwide - fox13now.com",
                "source": "fox13now.com",
                "url": "https://www.fox13now.com/news/local-news/salt-lake-city/utahns-line-up-at-gold-silver-exchanges-as-demand-surges-nationwide",
                "body": "SALT LAKE CITY — Gold and silver are hitting new highs, and Utahns have taken notice.\nLines have been out the door nearly every day this week at Monarch Coin Corporation in Salt Lake City as people hope to trade their gold and silver.\nFor some coin collectors, it’s not easy to part ways with their treasures, but sometimes there’s a silver lining.\nFederal Reserve keeps interest rates unchanged even as Trump continues to insist they be lowered\n“Well, I bought them in the 90s and I paid 3.80 cents a coin for them…So today they’re worth over $100,” one customer, Kim Rimmasch said.\nSilver is currently over $100 an ounce, and gold is over $5,200 an ounce.\n“Bought them around 2019, 2020,” another customer, Nathan Wixom said. \"I have just held on to them and lately the price of silver has gone way up so, good time to sell.”\nAt Monarch Coin Corporation, they’re seeing an influx of people, and they’re trying to help customers through the process.\nSarah Thompson, Chief of Staff for Monarch Coin, said they’re a family-owned, local business, so they see a mix of people each day.\n“The larger financial firms have started to add precious metals into their advice… so I think there are people who have come into it historically and there are people who have just recently seen the big movements in the market and said, I want to join that,” Thompson said.\nExperts say that trade tensions have also increased the demand for precious metals.\n“We could be $80 to 70 dollars in a week,” another customer said. \"But by the end of the week, we could also hit $150.”\nEven with interest rates staying steady, gold is surging."
            },
            {
                "title": "Wall Street set to open with gains ahead of Federal Reserve interest rate call; gold and silver soar - WRAL",
                "source": "WRAL",
                "url": "https://www.wral.com/news/ap/fab80-wall-street-set-to-open-with-gains-ahead-of-federal-reserve-interest-rate-call-gold-and-silver-soar/",
                "body": "U.S. markets were mostly churning higher again in off-hours trading early Wednesday, while prices for gold and silver soared ahead of an interest rate decision by the U.S. Federal Reserve.\nFutures for the S&P 500 gained 0.3% before the opening bell after hitting an all-time high a day earlier. Futures for the Dow Jones Industrial Average were nearly unchanged while Nasdaq futures climbed 0.8%.\nOther WRAL Top Stories\nLater Wednesday, the U.S. central bank is due to announce its latest move on interest rates. The expectation is that it will hold its main interest rate steady for now.\nInflation remains stubbornly above the Fed’s 2% target, and lower interest rates could push prices even higher for U.S. consumers even while giving the economy a boost. Traders expect the Fed to resume its cuts to interest rates later this year.\nThe Fed cut its benchmark rate three times in a row to close out 2025 in an effort to shore up a softening labor market. Job gains were tepid at best last year compared to 2024, and while layoffs and unemployment remain historically low, more companies have been announcing workforce reductions.\nAmazon said Wednesday that it was laying off another 16,000 corporate employees. that follows October's round of cuts that shed 14,000 workers. On Wednesday, UPS said it is planning to cut up to 30,000 operational jobs, while the image-sharing platform Pinterest said it planned to reduce its head count by 15%.\nThe dollar rebounded slightly against the Japanese yen early Wednesday but has still weakened sharply since last week, putting pressure on shares of major exporters.\nThe dollar was trading at 152.45 yen, up from 152.19 yen. But it’s nearly 4% lower than its level last week, when it surged to near 160 yen, prompting both Japanese and U.S. officials to warn they would intervene to stanch the yen’s decline.\nThe dollar has weakened since President Donald Trump threatened tariffs against several European countries that he said opposed his taking control of Greenland. Such threats, along with worries about risks like the U.S. government’s heavy debt, have periodically pushed global investors to step back from U.S. markets, a move that’s come to be called “Sell America.”\nAn index measuring the U.S. dollar’s strength against several of its competitors has dropped to its lowest point since 2022.\nThe euro slipped to $1.1982 from $1.2041 late Monday. It also has surged against the dollar.\nIn premarket trading, health care companies were notable laggards with Cigna, Molina and Elevance all down between 2% and 4%. UnitedHealth Group stabilized after losing nearly 20% of its value on Tuesday after the U.S. government's projected rate increase for Medicare Advantage came in well below expectations.\nOn the winning side early was the technology sector, where Seagate, Western Digital, Sandisk and Intel all jumped between 5% and 10%.\nSeveral of Wall Street’s most influential stocks will deliver their latest earnings reports in the coming days. They include Meta Platforms, Microsoft and Tesla on Wednesday and Apple on Thursday.\nThe pressure is on companies to deliver strong growth in profits following record-setting runs for their stock prices. Stock prices tend to follow the path of corporate profits over the long term, and earnings need to rise to quiet criticism that they’ve grown too expensive.\nThe price of gold jumped 3.5% to $5,263 per ounce and silver’s price jumped 6.2%, to $112.50. Both were just off record highs.\nPrices of precious metals have been soaring as investors, including major central banks, have sold dollars to park their money in assets considered to be relatively safe in times of turmoil.\nIn Europe, Germany’s DAX was down 0.4% at midday, while the CAC 40 in Paris sank 1.2%. Britain’s FTSE 100 slipped 0.5%.\nIn Asian trading, South Korea’s benchmark hit a record, lifted by gains for technology shares like computer chip maker SK Hynix, which climbed 5.1%. The Kospi gained 1.7% to 5,170.81.\nTokyo’s Nikkei 225 inde"
            },
            {
                "title": "Fed holds rates at an unusual moment: Stocks at record highs, dollar under pressure, and Powell in the crosshairs - Fortune",
                "source": "Fortune",
                "url": "https://fortune.com/2026/01/28/federal-reserve-powell-holds-rates-dollar-gold-silver-stocks-at-7000-dissent-christopher-waller/",
                "body": "The Federal Reserve on Wednesday held interest rates steady at 3.50% to 3.75%, attempting to project an image of stability as the U.S. financial landscape splits into two jarring realities: a stock market at record heights and a currency under pressure.\nThe decision, widely expected by 97% of investors, arrived just as the S&P 500 crossed the psychological 7,000-point threshold for the first time in history. But the euphoria in equities—“AMERICA IS BACK!!!” President Donald Trump cried on Truth Social—was matched by a move in the opposite direction for the greenback. The U.S. dollar index (DXY) has shed more than 10% of its value over the past year, sliding further after Trump signaled late Tuesday a multiyear low for the currency was “great.” The U.S. dollar index rebounded slightly on Wednesday as Treasury Secretary Scott Bessent said on CNBC: “The U.S. always has a strong dollar policy.”\nIn its policy statement, the Fed said economic activity has continued to expand at a “solid pace,” though job gains are low, and the unemployment rate has shown signs of stabilizing. Inflation, the Federal Open Market Committee said, “remains somewhat elevated.” While acknowledging some progress on price pressures, officials emphasized that they still require “greater confidence” that inflation is moving sustainably toward the 2% target before resuming the rate-cutting cycle that defined the end of 2025.\nThe Fed also underscored increased uncertainty around its outlook and said it would attend to both sides of the mandate.\nThe central bank, however, now finds itself in a precarious bind. While a weaker dollar theoretically aids U.S. exports, it complicates the Fed’s mandate by threatening to, in effect, import inflation and also rattle critical foreign investors needed to fund a massive U.S. deficit.\nNela Richardson, ADP’s chief economist, told CNBC the dollar’s decline is a “double-edged sword.”\n“[It] does make U.S. exports more competitive abroad, but a weak dollar at home doesn’t always have the confidence of markets,” she said. “And that confidence is going to be very important as we look at other things that are a struggle for the U.S. economy, like sticky inflation, like high deficits and debts, and the need to sell Treasuries, both domestically and abroad.”\nThat confidence crisis is already showing up in households. Consumer sentiment crashed in January to 84.5, a 12-year low that places American morale below the miseries of the 2020 lockdowns. That disconnect between a stock market at 7,000 and a pessimistic public facing a “low-hire, low-fire” labor market for the better half of the past year, continues to fuel concern over the “K-shaped economy.”\nDissent at the Fed\nThe internal rift at the Fed remains unresolved since December’s meeting, which produced the most formal dissents since 2019. Two officials—Stephen Miran and Christopher Waller—dissented from Wednesday’s decision, preferring that the Fed lower the Federal funds rate by 25 basis points.\nExtra eyes are on Waller’s verdict, since he is a rumored finalist for the chairmanship after Jerome Powell’s term is up in May. Analysts have suggested a vote from Waller in favor of interest rate cuts, aligning with the president’s browbeating demands for lower borrowing costs—could be seen as a bellwether for his candidacy.\nTrump is expected to name the successor as early as this week, with prediction markets currently favoring Rick Rieder, BlackRock’s chief investment officer of global fixed income. Rieder, who has no prior experience within the Federal Reserve system, has recently seen his odds on Polymarket surge to 55% following positive remarks from the White House. However, the prediction markets have been extremely volatile, and recent reports say it is still very much up in the air who Trump will choose.\n“Markets aren’t focused on today’s decision alone,” Michael McGowan, managing director of investment strategy at Pathstone, wrote in a note. “They’re focused on leadership path"
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.505",
            "open": "67.346",
            "close": "68.319",
            "high": "68.356",
            "low": "66.851"
        },
        "market_summary": "### Spot Brent Crude Oil Market Briefing\n\n* **Key Drivers:** Geopolitical risk premiums and US supply disruptions due to winter storms are supporting **bullish** momentum, while a decrease in US crude oil inventories by **2.3 million barrels** is also influencing prices.\n* **Price Action:** Spot Brent Crude Oil is trading at **$68.11** per barrel, up **$0.54** (+**0.80%**) on the day and more than **$3** per barrel week over week, indicating a strong **uptrend**.\n* **Technical Outlook:** Immediate support is not explicitly mentioned, but resistance can be anticipated at higher price levels given the current **bullish** sentiment, with the potential for **$70** to act as a psychological barrier.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Oil Prices Continue to Rise As US Crude Oil Inventories Drop - Crude Oil Prices Today | OilPrice.com",
                "source": "Crude Oil Prices Today | OilPrice.com",
                "url": "https://oilprice.com/Energy/Crude-Oil/Oil-Prices-Continue-to-Rise-As-US-Crude-Oil-Inventories-Drop.html",
                "body": "Crude oil inventories in the United States decreased by 2.3 million barrels during the week ending January 24, according to new data from the U.S. Energy Information Administration (EIA) released on Wednesday. The decrease brings commercial stockpiles to 423.8 million barrels according to government data, which is 3% below the five-year average for this time of year.\nThe EIA’s data release follows API’s figures that were released a day earlier, which suggested that crude oil inventories fell by 247,000 barrels.\nCrude prices were trading up on Wednesday morning with geopolitical risk premiums continuing to deteriorate as US supply realizes actual winter storm-related disruptions. At 8:45 a.m. in New York, Brent was trading at $68.11 per barrel—up $0.54 (+0.80%) on the day and up more than $3 per barrel week over week. WTI was also trading up, by $0.61 per barrel (+0.98%) in early trade at $63 per barrel.\nFor total motor gasoline, the EIA reported that inventories had increased by 200,000 barrels after gaining 6 million barrels in the week prior. The most recent figures showed average daily gasoline production increased to 9.6 million barrels. For middle distillates, inventories increased by 300,000 barrels with production decreasing by 268,000 barrels daily to an average of 4.8 million barrels daily.\nTotal products supplied—a proxy for U.S. oil demand—rose to 20.3 million barrels per day over the last four weeks, down 0.1% compared to the same period last year. Gasoline demand averaged 8.3 million barrels per day over the last four weeks, while the distillate four-week average supplied averaged 3.7 million barrels—down 4.8 percent year over year.\nBy Julianne Geiger for Oilprice.com\nMore Top Reads From Oilprice.com\n- U.S. Considers Sanctions Relief to Revive Venezuela’s Oil Output\n- Crude Rallies on Weather Disruptions and Fresh Geopolitical Nerves\n- Indian Refiners Boost Middle East Supply To Offset Lost Russian Oil"
            },
            {
                "title": "Former OPEC president stands trial in London bribery case - Oil & Gas 360",
                "source": "Oil & Gas 360",
                "url": "https://www.oilandgas360.com/former-opec-president-stands-trial-in-london-bribery-case/",
                "body": "(World Oil) – Diezani Alison-Madueke accepted cash bribes and “vast quantities” of luxury perks in exchange for handing over lucrative government contracts when she served as Nigerian oil minister, prosecutors said on the first day of a London trial.\nThe 65-year-old former OPEC president is charged with five counts of accepting bribes from people linked to energy groups and one count of conspiracy to commit bribery between 2011 and 2015, according to an indictment. Alison-Madueke served as Minister for Petroleum Resources between 2010 and 2015, while in 2014 she became the first female president of OPEC.\n“We live in a global society. Bribery and corruption undermines the proper functioning of the global market,” Alexandra Healy, the lead prosecutor said in court on Tuesday. “There is an important public interest in ensuring that conduct in our country does not further corruption in another country.”\nOver the years, she is alleged to have taken £100,000 ($137,680) in cash as well as accepting flights on private jets, chauffeur driven cars and luxury goods from Louis Vuitton and Harrods, prosecutors said.\nShe is alleged to have accepted £4.6 million on renovation work at London property she lived in, as well as the payment of private school fees.\nAlison-Madueke was charged by the NCA in 2023 and denies all the charges against her. Doye Agama and Olatimbo Ayinde are also facing charges linked to the bribery conspiracy."
            },
            {
                "title": "RUBBER-Japan futures rebound on firmer oil, supply concerns - marketscreener.com",
                "source": "marketscreener.com",
                "url": "https://www.marketscreener.com/news/rubber-japan-futures-rebound-on-firmer-oil-supply-concerns-ce7e5bdeda8bf32d",
                "body": "Access Denied\nYou don't have permission to access \"http://www.marketscreener.com/news/rubber-japan-futures-rebound-on-firmer-oil-supply-concerns-ce7e5bdeda8bf32d\" on this server.\nReference #18.3d05c617.1769666784.73a791db\nhttps://errors.edgesuite.net/18.3d05c617.1769666784.73a791db"
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.475",
            "open": "62.657",
            "close": "63.587",
            "high": "63.632",
            "low": "62.157"
        },
        "market_summary": "### Spot WTI Crude Oil Market Briefing\n\n* **Key Drivers:** Unexpected decline in US crude oil inventories by **2.3 million barrels**, signaling **bullish** momentum due to greater demand, coupled with geopolitical risk premiums and winter storm-related disruptions.\n* **Price Action:** Spot WTI Crude Oil price is up, trading at **$63 per barrel**, showing an increase of **$0.61 per barrel (+0.98%)**, with Brent trading at **$68.11 per barrel**, up **$0.54 (+0.80%)**.\n* **Technical Outlook:** Immediate support is near the recent low, with resistance at the **$65 per barrel** level, considering the increase in total products supplied to **20.3 million barrels per day**.\n\n---\n**Overall Sentiment:** Positive ️",
        "source_articles": [
            {
                "title": "Oil Prices Continue to Rise As US Crude Oil Inventories Drop - Crude Oil Prices Today | OilPrice.com",
                "source": "Crude Oil Prices Today | OilPrice.com",
                "url": "https://oilprice.com/Energy/Crude-Oil/Oil-Prices-Continue-to-Rise-As-US-Crude-Oil-Inventories-Drop.html",
                "body": "Crude oil inventories in the United States decreased by 2.3 million barrels during the week ending January 24, according to new data from the U.S. Energy Information Administration (EIA) released on Wednesday. The decrease brings commercial stockpiles to 423.8 million barrels according to government data, which is 3% below the five-year average for this time of year.\nThe EIA’s data release follows API’s figures that were released a day earlier, which suggested that crude oil inventories fell by 247,000 barrels.\nCrude prices were trading up on Wednesday morning with geopolitical risk premiums continuing to deteriorate as US supply realizes actual winter storm-related disruptions. At 8:45 a.m. in New York, Brent was trading at $68.11 per barrel—up $0.54 (+0.80%) on the day and up more than $3 per barrel week over week. WTI was also trading up, by $0.61 per barrel (+0.98%) in early trade at $63 per barrel.\nFor total motor gasoline, the EIA reported that inventories had increased by 200,000 barrels after gaining 6 million barrels in the week prior. The most recent figures showed average daily gasoline production increased to 9.6 million barrels. For middle distillates, inventories increased by 300,000 barrels with production decreasing by 268,000 barrels daily to an average of 4.8 million barrels daily.\nTotal products supplied—a proxy for U.S. oil demand—rose to 20.3 million barrels per day over the last four weeks, down 0.1% compared to the same period last year. Gasoline demand averaged 8.3 million barrels per day over the last four weeks, while the distillate four-week average supplied averaged 3.7 million barrels—down 4.8 percent year over year.\nBy Julianne Geiger for Oilprice.com\nMore Top Reads From Oilprice.com\n- U.S. Considers Sanctions Relief to Revive Venezuela’s Oil Output\n- Crude Rallies on Weather Disruptions and Fresh Geopolitical Nerves\n- Indian Refiners Boost Middle East Supply To Offset Lost Russian Oil"
            },
            {
                "title": "EIA crude oil inventories post unexpected decline, signaling bullish trend for crude prices - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/news/economic-indicators/eia-crude-oil-inventories-post-unexpected-decline-signaling-bullish-trend-for-crude-prices-93CH-4470730",
                "body": "Gold, silver prices hit record highs as US-Iran tensions drive haven demand\nThe Energy Information Administration (EIA) released its weekly report on crude oil inventories, revealing a significant drop in the number of barrels of commercial crude oil held by US firms. The actual number came in at a decrease of 2.295 million barrels, a stark contrast to the forecasted slight dip of 0.200 million barrels.\nThis unexpected decrease in crude inventories implies a greater demand for oil, a bullish signal for crude prices. Analysts had forecasted a minor decrease, but the actual figures surpassed these expectations, indicating that the demand for crude oil may be stronger than previously thought.\nComparing the actual decrease of 2.295 million barrels to the forecasted decrease of 0.200 million barrels, the actual number is more than ten times the forecasted number. This significant difference suggests that analysts may have underestimated the current demand for crude oil in the market.\nFurther comparison to the previous number, which was an increase of 3.602 million barrels, shows a significant shift in the trend. The move from an increase to a substantial decrease indicates a considerable change in the dynamics of the crude oil market.\nThe level of inventories influences the price of petroleum products, which can have an impact on inflation. With the unexpected decrease in inventories, we could potentially see a rise in the price of petroleum products. This could have a ripple effect on inflation, potentially leading to higher prices for consumers.\nThe EIA’s Crude Oil Inventories report is a critical indicator of the health of the oil industry and broader economy. The unexpected decrease in inventories, implying greater demand, could be a positive sign for the oil industry. However, the potential impact on inflation will be something to watch in the coming weeks.\nThis article was generated with the support of AI and reviewed by an editor. For more information see our T&C.\nWhich stock should you buy in your very next trade?\nAI computing powers are changing the stock market. Investing.com's ProPicks AI includes dozens of winning stock portfolios chosen by our advanced AI.\nYear to date, 2 out of 3 global portfolios are beating their benchmark indexes, with 88% in the green. Our flagship Tech Titans strategy doubled the S&P 500 within 18 months, including notable winners like Super Micro Computer (+185%) and AppLovin (+157%).\nWhich stock will be the next to soar?"
            },
            {
                "title": "RUBBER-Japan futures rebound on firmer oil, supply concerns - marketscreener.com",
                "source": "marketscreener.com",
                "url": "https://www.marketscreener.com/news/rubber-japan-futures-rebound-on-firmer-oil-supply-concerns-ce7e5bdeda8bf32d",
                "body": "Access Denied\nYou don't have permission to access \"http://www.marketscreener.com/news/rubber-japan-futures-rebound-on-firmer-oil-supply-concerns-ce7e5bdeda8bf32d\" on this server.\nReference #18.8551c317.1769666838.45378934\nhttps://errors.edgesuite.net/18.8551c317.1769666838.45378934"
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0149",
            "open": "1.2036",
            "close": "1.1952",
            "high": "1.2044",
            "low": "1.1895"
        },
        "market_summary": "### EUR/USD Market Briefing\n\n* **Key Drivers:** ECB officials are pushing back against **euro strength**, citing its impact on **inflation**, while the US dollar finds a floor due to mixed messaging from Washington and a slightly more **hawkish** FOMC statement.\n* **Price Action:** The EUR/USD pair has gained traction above **1.1950**, with the euro strengthening to around **1.1980**, showing **bullish momentum** after breaking above the key psychological level of **1.20**.\n* **Technical Outlook:** Immediate support is near **1.1950**, with resistance at **1.20**, and a potential target of **1.2082** if the current trend continues, driven by **dovish** expectations for the ECB and **hawkish** hold from the Fed.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "USD/JPY, EUR/USD Forecast: Dollar finds a floor as policy pushback emerges - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-sg/news-and-analysis/usd-jpy-eur-usd-forecast-dollar-finds-a-floor-as-policy-pushback-emerges/?amp=true",
                "body": "USD/JPY, EUR/USD Forecast: Dollar finds a floor as policy pushback emerges\n- ECB officials push back against euro strength\n- US rules out intervening to support the yen\n- Dollar rebound driven by positioning, not conviction\n- Intervention risk rising for USD/JPY\nSummary\nMarkets finally found a reason to pause the dollar rout, but not one built on conviction. Pushback from ECB officials and mixed messaging from Washington acted as a release valve on USD weakness, triggering sharp reversals in EUR/USD and USD/JPY before quickly fading. With Japan left to defend the yen alone and euro strength increasingly clashing with the ECB’s inflation mandate, the next phase looks less about policy promises and more about whether officials are prepared to back words with action.\nECB officials lean against euro strength\nThis shift in tone was most evident in Europe, where policymakers wasted little time responding to renewed euro strength. It didn’t take long for a barrage of dovish commentary from European officials once EUR/USD punched above the 1.20 mark, with ECB Governing Council member François Villeroy de Galhau noting Wednesday that he is “closely monitoring this appreciation of the euro and its possible implications for lower inflation”, flagging that the stronger currency’s impact on prices will be a key factor “in the months ahead”. While the ECB publicly insists it does not target exchange rates, it is clear policymakers are alert to the risk that further euro strength could place additional downward pressure on inflation, which is already expected to undershoot its 2% target based on its latest forecasts.\nDoubling down on the dovish tone, Austria’s central bank governor Martin Kocher told the Financial Times that if the euro continues to strengthen to the point it materially weighs on inflation forecasts, “at some stage this might create…a certain necessity to react in terms of monetary policy”. Kocher said any response would be driven by the inflation outlook rather than the exchange rate itself, noting there is no immediate need to adjust rates but that policymakers should retain “full optionality” amid uncertainty. In short, if euro strength blunts the inflationary impulse from abroad, the ECB could yet find itself back in easing mode.\nUS shuts the door on yen support\nAcross the Atlantic, U.S. Treasury Secretary Scott Bessent poured cold water on speculation of coordinated FX action, stating the U.S. is “absolutely not” intervening to support the yen and reiterating Washington’s commitment to a strong dollar policy. His remarks contradict comments from Donald Trump less than a day earlier welcoming recent declines in the dollar as “great”, extending the now familiar good-cop, bad-cop dynamic within the administration. The result, once again, was mixed messaging that generated two-way volatility across markets.\nStepping back, Bessent’s comments suggest reported rate checks in USD/JPY conducted by the New York Fed late last week were likely undertaken on behalf of Japan’s Ministry of Finance rather than the U.S. Treasury. That implies Japan is attempting to stem yen weakness on its own, without U.S. backing. History suggests that approach can prove problematic unless Tokyo is prepared to back its warnings with action, including putting its money where its mouth is and instructing the BOJ to intervene directly.\nThe remarks from both sides of the Atlantic acted as a relief valve on USD weakness. The move was assisted by a slightly more hawkish FOMC statement, which nudged up its growth assessment while downside risks to the labour market were notably absent. With short-term positioning stretched after the recent dollar plunge, the rebound gathered momentum before fading during Jerome Powell’s press conference, which failed to deliver any meaningful hawkish surprises.\nJapan’s intervention credibility under scrutiny\nOf all the key macro developments overnight, Bessent’s remarks towards the yen were perhaps the most telling, likely e"
            },
            {
                "title": "Euro gains traction above 1.1950 on Fed uncertainty - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/eur-usd-gains-traction-above-11950-on-fed-uncertainty-202601290407",
                "body": "EUR/USD gains traction above 1.1950 on Fed uncertainty\n- EUR/USD strengthens to around 1.1980 in Thursday’s early European session.\n- Trump may announce his pick for the new Federal Reserve Chair in about a week or so.\n- The Fed decided to keep rates steady for its first meeting of 2026.\nThe EUR/USD pair trades on a positive note near 1.1980 during the early European session on Thursday. The US Dollar (USD) remains weak against the Euro (EUR) amid uncertainty over US economic policies. The Eurozone Consumer Confidence and US Initial Jobless Claims reports are due later on Thursday.\nTraders remain concerned over US President Donald Trump's erratic policymaking and the Federal Reserve (Fed) independence, which drags the USD lower and acts as a tailwind for the major pair. The US president said on Tuesday that he will announce his pick for the new Fed Chair soon. Trump added that interest rates will significantly drop as soon as a new Fed chair is at the helm.\nThe US central bank decided to leave interest rates unchanged in a range of 3.5%-3.75% at its January policy meeting on Wednesday. During the press conference, Fed Chair Jerome Powell stated that the outlook for economic activity has improved since the last meeting and that the labor market has shown signs of stabilizing, but also noted signs of continued cooling.\nFed officials signaled a more cautious approach to potential future rate reductions. Markets expect the Fed to wait until at least June before adjusting its benchmark rate again. A hawkish hold from the Fed could help limit the US Dollar’s losses in the near term.\nAcross the pond, economists widely anticipate the European Central Bank (ECB) to keep rates steady at its upcoming February meeting and through at least mid-2026. The central bank indicated that rates are in a \"good place\" to ensure medium-term price stability.\nEuro FAQs\nThe Euro is the currency for the 20 European Union countries that belong to the Eurozone. It is the second most heavily traded currency in the world behind the US Dollar. In 2022, it accounted for 31% of all foreign exchange transactions, with an average daily turnover of over $2.2 trillion a day. EUR/USD is the most heavily traded currency pair in the world, accounting for an estimated 30% off all transactions, followed by EUR/JPY (4%), EUR/GBP (3%) and EUR/AUD (2%).\nThe European Central Bank (ECB) in Frankfurt, Germany, is the reserve bank for the Eurozone. The ECB sets interest rates and manages monetary policy. The ECB’s primary mandate is to maintain price stability, which means either controlling inflation or stimulating growth. Its primary tool is the raising or lowering of interest rates. Relatively high interest rates – or the expectation of higher rates – will usually benefit the Euro and vice versa. The ECB Governing Council makes monetary policy decisions at meetings held eight times a year. Decisions are made by heads of the Eurozone national banks and six permanent members, including the President of the ECB, Christine Lagarde.\nEurozone inflation data, measured by the Harmonized Index of Consumer Prices (HICP), is an important econometric for the Euro. If inflation rises more than expected, especially if above the ECB’s 2% target, it obliges the ECB to raise interest rates to bring it back under control. Relatively high interest rates compared to its counterparts will usually benefit the Euro, as it makes the region more attractive as a place for global investors to park their money.\nData releases gauge the health of the economy and can impact on the Euro. Indicators such as GDP, Manufacturing and Services PMIs, employment, and consumer sentiment surveys can all influence the direction of the single currency. A strong economy is good for the Euro. Not only does it attract more foreign investment but it may encourage the ECB to put up interest rates, which will directly strengthen the Euro. Otherwise, if economic data is weak, the Euro is likely to fall. Economic data for th"
            },
            {
                "title": "ECB policymakers are starting to get uneasy as EUR/USD crosses 1.20 - investingLive",
                "source": "investingLive",
                "url": "https://investinglive.com/centralbank/ecb-policymakers-are-starting-to-get-uneasy-as-eurusd-crosses-120-20260128/",
                "body": "Early this morning, ECB's Kocher said that if the euro were to appreciate further and further, at some stage that might create a certain necessity to react in terms of monetary policy. Not because of the exchange rate itself, but because the exchange rate translates into less inflation, and this becomes a monetary policy issue.\nLast year, ECB's Vice President de Guindos said that 1.20 on the EUR/USD exchange rate is something they can tolerate, but anything above that would complicate the outlook for them.\nECB's Villeroy has also commented on the euro this morning saying that the ECB is closely monitoring the currency and its effect on inflation. He added that they have no target for the exchange rate but the euro is one element that will guide their policy.\nIt looks like they are trying to jawbone a bit here. Policymakers don't like fast, one-sided moves and we just went from 1.1576 to 1.2082 in less than two weeks. Of course, that was all about the dollar as USD/JPY intervention risks and Trump's actions weighed on the greenback.\nI personally think this move is overdone absent new catalysts because it was more about the intervention risk than something fundamental. If we get strong US data next month, the market should pare back the 48 bps of easing priced in by year-end and provide support for the dollar. On the other hand, if we get soft data, the greenback will likely remain under pressure as dovish bets would keep weighing on it.\nIf the euro strengthens too much and we get soft Eurozone inflation data in the next months, then we can expect traders to price in another rate cut from the ECB. On the other hand, a weak dollar with stocks at all-time highs and loose financial conditions, could lead to a re-acceleration in US inflation and eventually to a policy divergence between the Fed and the ECB."
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0097",
            "open": "1.3833",
            "close": "1.3804",
            "high": "1.3846",
            "low": "1.3750"
        },
        "market_summary": "### GBP/USD Market Briefing\n\n* **Key Drivers:** The **Fed's hawkish** stance and **dovish** expectations are influencing the GBP/USD, with the pair remaining near **four-year highs**.\n* **Price Action:** The GBP/USD is hovering around **1.3800**, with a recent high of **1.3860**, showing **bullish momentum**.\n* **Technical Outlook:** Immediate resistance is at **1.4000**, with support at the **20-period MA at 1.3700**, and further support at **1.3600**.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "GBP/USD hesitates at four-year highs following lackluster Fed rate hold - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-usd-hesitates-at-four-year-highs-following-lackluster-fed-rate-hold-202601282351",
                "body": "GBP/USD hesitates at four-year highs following lackluster Fed rate hold\n- GBP/USD remains stubbornly close to multi-year highs heading into Thursday.\n- The Fed held rates steady as markets expected, giving little indication of policy stance shifts.\n- Investors await further headline development on a possible Trump pick for Fed Chair.\nGBP/USD churned in place on Tuesday, hitting a brief patch of volatility but otherwise holding steady near four-year highs as the US Dollar (USD) struggles to find its footing. The Federal Reserve (Fed) held interest rates steady, as many investors broadly anticipated, but the Fed’s rate statement and Fed Chair Jerome Powell both failed to give any hints about potential shifts toward future rate cuts, which many investors broadly hoped.\nWith the Fed’s first rate call of the year out of the way, attention now shifts to political central bank matters. US President Donald Trump has been soft-rolling towards announcing a new Fed Chair pick to replace Jerome Powell, whose term ends in May. Key Trump officials have been drumming up anticipation for the president’s next pick, with Treasury Secretary Scott Bessent hinting that Trump’s list of potential candidates, which has allegedly been whittled down to just one name, could come within the next week.\n“The next week” has been a popular catch-all bin for Trump officials to lump policy expectations into, and typically means anytime between several weeks to several months. President Trump, who selected Jerome Powell as head of the Fed during his first term, has been on an on-again, off-again warpath to have Powell replaced early after the Fed failed to deliver rapid-fire interest rate cuts upon request from the White House.\nGBP/USD daily chart\nPound Sterling FAQs\nThe Pound Sterling (GBP) is the oldest currency in the world (886 AD) and the official currency of the United Kingdom. It is the fourth most traded unit for foreign exchange (FX) in the world, accounting for 12% of all transactions, averaging $630 billion a day, according to 2022 data. Its key trading pairs are GBP/USD, also known as ‘Cable’, which accounts for 11% of FX, GBP/JPY, or the ‘Dragon’ as it is known by traders (3%), and EUR/GBP (2%). The Pound Sterling is issued by the Bank of England (BoE).\nThe single most important factor influencing the value of the Pound Sterling is monetary policy decided by the Bank of England. The BoE bases its decisions on whether it has achieved its primary goal of “price stability” – a steady inflation rate of around 2%. Its primary tool for achieving this is the adjustment of interest rates. When inflation is too high, the BoE will try to rein it in by raising interest rates, making it more expensive for people and businesses to access credit. This is generally positive for GBP, as higher interest rates make the UK a more attractive place for global investors to park their money. When inflation falls too low it is a sign economic growth is slowing. In this scenario, the BoE will consider lowering interest rates to cheapen credit so businesses will borrow more to invest in growth-generating projects.\nData releases gauge the health of the economy and can impact the value of the Pound Sterling. Indicators such as GDP, Manufacturing and Services PMIs, and employment can all influence the direction of the GBP. A strong economy is good for Sterling. Not only does it attract more foreign investment but it may encourage the BoE to put up interest rates, which will directly strengthen GBP. Otherwise, if economic data is weak, the Pound Sterling is likely to fall.\nAnother significant data release for the Pound Sterling is the Trade Balance. This indicator measures the difference between what a country earns from its exports and what it spends on imports over a given period. If a country produces highly sought-after exports, its currency will benefit purely from the extra demand created from foreign buyers seeking to purchase these goods. Therefore, a positive net Trade"
            },
            {
                "title": "GBP/USD Forecast: Eying 1.4000 Amid Fed Independence Fears Ahead of FOMC - Forex Crunch",
                "source": "Forex Crunch",
                "url": "https://www.forexcrunch.com/blog/2026/01/28/gbp-usd-forecast-eying-1-4000-amid-fed-independence-fears-ahead-of-fomc/",
                "body": "- The GBP/USD forecast points to further gains to 1.4000 provided the Fed shows a dovish stance in today’s meeting.\n- Sterling remains at an advantage against the dollar amid recent upbeat UK data, pushing the BoE to rethink its aggressive easing policy.\n- Technically, the price remains in a strong uptrend with a risk of profit-taking before further upside.\nThe British pound approached 1.3800 on Wednesday as the US dollar encountered selling pressure ahead of the Fed’s first policy decision of 2026. The Fed is anticipated to keep interest rates at 3.50%-3.75%. However, political tensions over the central bank’s independence are weighing on the dollar. As rumors of administrative pressure on Chair Powell increase concerns about future US monetary policy, investors are pricing in a “governance premium”.\n–Are you interested in learning more about ETF brokers? Check our detailed guide-\nSterling has a clear runway due to dollar weakness and solid domestic data. December retail sales rose 0.4%, easing recession fears and suggesting that UK consumers are coping with high borrowing prices better than expected. These numbers have prompted the Bank of England to rethink its aggressive easing cycle, which runs counter to the Fed’s policy.\nThe pair’s momentum is boosted by global macro trends that favor commodities and high-beta currencies over the dollar. Gold prices have reached record highs, and new US tariff threats are disrupting global trade, making the pound a significant beneficiary of capital rotation out of dollar-denominated assets. UK inflation remains at 2.1%, supporting the Bank of England’s cautious stance and the pound’s yield advantage.\nMarkets are increasingly focused on the FOMC press conference in the late New York session. Any evidence that the Fed caves to political pressure to cut rates might break the 1.4000 resistance level. On the other hand, if Powell remains data-dependent and hawkish, traders may cover short dollar positions, reversing the sterling rally.\nGBP/USD Technical Forecast: Buyers Aiming for 1.4000\nThe GBP/USD price broke above the 1.3800 level, marking a fresh 4-year top at 1.3860 before correcting down to the 1.3790 area. The broken supply zone around 1.3800 is now acting as support, with projections pointing to a test of the swing high at 1.3860, then 1.3900, and finally the psychological level at 1.4000.\n–Are you interested in learning more about South African forex brokers? Check our detailed guide-\nHowever, the RSI remains extremely overbought, which could trigger a correction to test the 20-period MA at 1.3700, ahead of 1.3600. Only a sustained weakness below the 20-period MA could trigger a trend reversal.\nLooking to trade forex now? Invest at eToro!\n68% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money."
            },
            {
                "title": "Pound To Dollar Forecast: Best GBP/USD Rates Ease Before Fed Decision - Exchange Rates UK",
                "source": "Exchange Rates UK",
                "url": "https://www.exchangerates.org.uk/news/45086/2026-01-28-pound-to-dollar-forecast-best-gbp-usd-rates-ease-before-fed-decision.html",
                "body": "The Pound US Dollar (GBP/USD) exchange rate ticked lower during Wednesday’s European trading session, pulling back from the multi-year highs struck late on Tuesday.\nPound to Dollar (GBP/USD): 1.37823 (-0.32%)\nEuro to Dollar (EUR/USD): 1.19689 (-0.45%)\nDollar to Japanese Yen (USD/JPY): 152.6425 (+0.1%)\nDAILY RECAP:\nHaving struck new multi-year lows overnight on Tuesday, the US Dollar (USD) managed to claw back a small portion of its losses on Wednesday morning.\nThe US Dollar has been under heavy selling pressure over the past week and a half, having fallen around 3% since mid-January, as the Trump administration’s erratic approach to trade, foreign and economic policy, alongside the threat of another government shutdown, eroded confidence in the currency.\nThese losses accelerated further overnight after President Donald Trump appeared to welcome the Dollar’s weakness, branding the sharp depreciation as ‘great’ and suggesting the currency should be left to ‘seek its own level’.\nHowever, Wednesday morning saw modest repositioning among USD investors as attention turned to the Federal Reserve’s impending interest rate decision.\nWhile the Fed is not expected to announce any policy changes at its first meeting of the year, the prospect of some hawkish guidance from the US central bank proved enough to lift USD sentiment slightly.\nMeanwhile, the Pound (GBP) faltered against most of its peers.\nSterling struggled to attract meaningful support amid the continued absence of any notable UK economic data.\nGBP sentiment was also weighed down by a slightly dovish repricing of Bank of England interest rate expectations, despite last week’s UK data largely surprising to the upside.\nNear-Term GBP/USD Forecast: Shutdown Risks to Revive Dollar Selling?\nAs we move into the second half of the week, the Pound to US Dollar exchange rate may resume its bullish trajectory as US political risks intensify.\nWith Senate Democrats and Republicans locked in a standoff over funding for the Department of Homeland Security, a partial government shutdown appears increasingly likely when current funding expires on Saturday — a risk that continues to inflate the US Dollar’s political risk premium.\nAt the same time, with UK economic data still thin on the ground, movement in the Pound is likely to remain driven by broader market sentiment."
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0066",
            "open": "0.7008",
            "close": "0.7039",
            "high": "0.7042",
            "low": "0.6976"
        },
        "market_summary": "### AUD/USD Market Briefing\n\n* **Key Drivers:** Increased bets on a **hawkish** Reserve Bank of Australia (RBA) rate hike, following **hotter-than-expected Australian inflation data**, are driving the AUD/USD pair higher, despite a **stronger US dollar** due to the US Treasury Secretary's reaffirmation of a **strong dollar policy**.\n* **Price Action:** The AUD/USD pair has broken above the **$0.70** psychological level, reaching near **$0.7050**, and is now targeting **$0.72** as a test for long-term strength, with the **100% projection of 0.5913 to 0.6706 from 0.6420** at **$0.7213**.\n* **Technical Outlook:** Immediate support is near **$0.6901**, with **$0.6706** acting as a key resistance turned support level, and the **61.8% retracement of 0.8006 to 0.5913** at **$0.7206** serving as a crucial resistance zone that will decide the medium-term trend.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "AUD/USD rises to near 0.7050 as RBA rate hike bets increase - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/amp/news/aud-usd-rises-to-near-07050-as-rba-rate-hike-bets-increase-202601290116",
                "body": "AUD/USD rises to near 0.7050 as RBA rate hike bets increase\n|- AUD/USD rises after hotter Australian inflation boosted expectations of an RBA rate hike as early as next week.\n- Markets price over a 70% chance of a 25bp RBA hike, with rates seen at 3.85% by May.\n- The USD strengthened after Treasury Secretary Scott Bessent reaffirmed the US commitment to a strong dollar policy.\nAUD/USD extends its gains for the third successive session, trading around 0.7040 during the Asian hours on Thursday. The pair appreciated after hotter-than-expected Australian inflation data, released on Wednesday, lifted the odds of a Reserve Bank of Australia (RBA) rate hike as early as next week.\nMarkets now price in over a 70% chance of a 25 basis points (bps) hike by the RBA from the 3.6% cash rate, up from 60% before the release, with rates fully priced at 3.85% by May and around 4.10% by September.\nAustralia’s CPI rose by 3.8% year-over-year (YoY) in December, following a 3.4% increase prior. The market consensus was for 3.6% growth in the reported period. Australia’s RBA Trimmed Mean inflation increased to 0.2% month-over-month (MoM) and 3.3% year-over-year (YoY). The monthly CPI rose 1.0% in December, up from 0% previously and above the 0.7% forecast.\nAustralia’s export prices rose 3.2% quarter-on-quarter (QoQ) in Q4 2025, rebounding from a 0.9% fall in Q3 and marking the first increase in three quarters, as well as the strongest gain in a year. Meanwhile, Import prices climbed 0.9%, beating expectations for a 0.2% decline and reversing a 0.4% drop in Q3.\nThe upside of the AUD/USD pair could be restrained as the US Dollar (USD) strengthens after US Treasury Secretary Scott Bessent reiterated the US commitment to a strong USD policy. The US Federal Reserve (Fed) kept interest rates unchanged at its January meeting on Wednesday, pointing to still-elevated inflation and resilient economic growth.\nFed Chair Jerome Powell noted during the post-meeting press conference that job gains have moderated and the unemployment rate has shown signs of stabilization, adding that the Fed is “well positioned” to assess incoming data on a meeting-by-meeting basis and remains off a preset path for future rate decisions.\nAustralian Dollar FAQs\nOne of the most significant factors for the Australian Dollar (AUD) is the level of interest rates set by the Reserve Bank of Australia (RBA). Because Australia is a resource-rich country another key driver is the price of its biggest export, Iron Ore. The health of the Chinese economy, its largest trading partner, is a factor, as well as inflation in Australia, its growth rate and Trade Balance. Market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – is also a factor, with risk-on positive for AUD.\nThe Reserve Bank of Australia (RBA) influences the Australian Dollar (AUD) by setting the level of interest rates that Australian banks can lend to each other. This influences the level of interest rates in the economy as a whole. The main goal of the RBA is to maintain a stable inflation rate of 2-3% by adjusting interest rates up or down. Relatively high interest rates compared to other major central banks support the AUD, and the opposite for relatively low. The RBA can also use quantitative easing and tightening to influence credit conditions, with the former AUD-negative and the latter AUD-positive.\nChina is Australia’s largest trading partner so the health of the Chinese economy is a major influence on the value of the Australian Dollar (AUD). When the Chinese economy is doing well it purchases more raw materials, goods and services from Australia, lifting demand for the AUD, and pushing up its value. The opposite is the case when the Chinese economy is not growing as fast as expected. Positive or negative surprises in Chinese growth data, therefore, often have a direct impact on the Australian Dollar and its pairs.\nIron Ore is Australia’s largest export, accounting "
            },
            {
                "title": "AUD/USD surges past 0.70 as RBA hike solidify, 0.72 the test for long term strength - Action Forex",
                "source": "Action Forex",
                "url": "https://www.actionforex.com/live-comments/627327-aud-usd-surges-past-0-70-as-rba-hike-solidify-0-72-the-test-for-long-term-strength/",
                "body": "Australian Dollar extended its rally this week, with AUD/USD breaking above 0.70 psychological level. The move has been supported by broad-based Dollar weakness, but domestic factors have played a central role following Australia’s stronger-than-expected inflation data.\nDecember CPI showed another month of acceleration, while Q4 headline inflation printed at 3.6%. More importantly for policymakers, trimmed mean CPI at 3.4% underscored persistent underlying inflation that sits uncomfortably above the RBA’s target band. That inflation shock has quickly filtered into economist forecasts. Westpac and ANZ revised their outlooks, now expecting the RBA to raise the cash rate at its upcoming meeting next week. All four major Australian banks now forecast a 25bp hike back to 3.85%.\nThe key uncertainty now lies beyond the initial move. The question is whether the RBA would signal scope for a more extended tightening cycle, or frame the hike as a one-off adjustment designed to reassert inflation control.\nTechnically, AUD/USD remains in clear upward acceleration, with D MACD still pointing higher. The advance from 0.5913 is on track toward its 100% projection of 0.5913 to 0.6706 from 0.6420 at 0.7213 next. On the downside, below 0.6901 support will bring consolidations first. But downside should be contained above 0.6706 resistance turned support to bring another rally.\nMore importantly, the decisive break above 0.6941 structural resistance this week strengthens the case that the rise from 0.5913 is reversing the entire decline from the 0.8006 (2020 high). Next target is 61.8% retracement of 0.8006 to 0.5913 at 0.7206, which is close to the above 0.7213 projection level.\nReactions to this 0.72 resistance zone will decide whether current rise from 0.5913 is the third leg of the pattern from 0.5506 (2020 low), and open the door to further medium up trend through 0.8006."
            },
            {
                "title": "Aussie Dollar Hits A Three-Year High As Rate Hike Bets Grow - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/aussie-dollar-hits-a-three-year-high-as-rate-hike-bets-grow",
                "body": "Hotter inflation and a technical breakout pushed markets to price an RBA hike next week, while high Aussie yields and a weaker US dollar kept the AUD and NZD supported.\n1 day ago • 1 min\nWhat’s going on here?\nThe Australian dollar popped above $0.70 for the first time since early 2023 after a hotter inflation read pushed traders to price in more Reserve Bank of Australia (RBA) tightening.\nWhat does this mean?\nTwo forces are at work: momentum and rates. The aussie cleared a closely watched level near $0.694 and sprinted higher as technical traders piled in. More importantly, “trimmed-mean” inflation – the RBA’s preferred measure – rose 0.9% quarter on quarter in Q4 and 3.4% year on year, still above the central bank’s 2%–3% target band. That’s nudged markets toward a February hike and a higher peak cash rate later this year. Rising Australian bond yields, and a wea..\nker US dollar, can amplify that move by making AUD assets look more attractive to global investors.\nWhy should I care?\nFor markets: Higher yields can ripple across assets.\nWhen traders suddenly reprice the path of RBA rates, the currency, bonds, and rate-sensitive stocks tend to move in sync. A more hawkish tone could keep supporting the aussie, while pressuring sectors that rely on cheap funding, like property and highly leveraged companies. The flip side is that if the RBA signals it’s near done, the currency’s rally can fade quickly as yield differentials narrow.\nZooming out: Not every central bank is on the same schedule.\nAfter a year of “who cuts first” debates, Australia is starting to look like an outlier – at least temporarily. Some economists see a “one and done” hike if inflation cools, while others think sticky prices and a tight labor market could force multiple moves. That divergence matters because it reshapes capital flows and trade competitiveness across the Asia-Pacific region.\nThis content is free, but you must be logged in to continue reading.\nAlready have an account?"
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "1.9110",
            "open": "152.2430",
            "close": "153.3840",
            "high": "154.0430",
            "low": "152.1320"
        },
        "market_summary": "ERROR: An unexpected error occurred during AI summary generation: 'choices'",
        "source_articles": [
            {
                "title": "USD/JPY up before Fed decision, Yen supported by tightening outlook - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-jpy-rebounds-ahead-of-fed-decision-boj-tightening-prospects-limit-upside-202601281741",
                "body": "USD/JPY rebounds ahead of Fed decision, BoJ tightening prospects limit upside\n- The US Dollar stages a partial recovery ahead of the Federal Reserve’s monetary policy decision.\n- Remarks from the US President in favor of a weaker US Dollar continue to weigh on sentiment.\n- The Japanese Yen remains supported by expectations of monetary tightening in Japan.\nUSD/JPY trades around 153.60 on Wednesday at the time of writing, up 0.80% on the day, as the US Dollar (USD) attempts to stabilize after hitting a four-year low earlier in the week. The rebound comes as investors remain cautious ahead of the Federal Reserve (Fed) policy decision expected later in the day.\nThe US Dollar came under heavy pressure on Tuesday following comments from US President Donald Trump, who said that a weaker US Dollar was “a good thing” and that the currency was simply seeking its own equilibrium level. These remarks reinforced concerns about political tolerance for a softer currency, adding to the pressure on the Greenback, which is already weighed down by expectations of future rate cuts.\nMarkets widely expect the Fed to keep interest rates unchanged in the 3.50%-3.75% range. Money markets assign a chance close to 95% to a hold, following three consecutive 25-basis-point cuts delivered last year. The focus will be firmly on Fed Chair Jerome Powell’s press conference, as his remarks are expected to provide guidance on the future path of interest rates. Several major banks believe the central bank will emphasize a wait-and-see approach, even as markets continue to price in two rate cuts later this year.\nSince the last Fed meeting, US macroeconomic data have broadly supported the view that the central bank can afford to remain patient. Inflation is easing only gradually, while labor market conditions remain relatively resilient, reducing the urgency for further monetary easing. However, any signal of a prolonged pause could provide additional support to the US Dollar.\nOn the Japanese side, the Japanese Yen (JPY) continues to draw structural support from the evolving monetary policy outlook. Minutes from the Bank of Japan’s (BoJ) December meeting showed that policymakers are increasingly confident in the sustainability of wage growth and underlying inflation, justifying a gradual continuation of monetary tightening. This backdrop helps limit Japanese Yen losses, despite persistent concerns over Japan’s fiscal position and political uncertainty ahead of the snap election scheduled for February 8.\nConcerns surrounding government spending plans and tax cuts in Japan continue to weigh on the domestic currency, alongside a generally positive risk environment. These factors help underpin USD/JPY in the near term, although the growing divergence between a more hawkish Bank of Japan and a Federal Reserve that may lean toward rate cuts could, over the medium term, restore some appeal to the Japanese Yen.\nUS Dollar Price Today\nThe table below shows the percentage change of US Dollar (USD) against listed major currencies today. US Dollar was the strongest against the Swiss Franc.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the US Dollar from the left column and move along the horizontal line to the Japanese Yen, the percentage change displayed in the box will represent USD (base)/JPY (quote).\nAuthor\nGhiles Guezout\nFXStreet\nGhiles Guezout is a Market Analyst with a strong background in stock market investments, trading, and cryptocurrencies. He combines fundamental and technical analysis skills to identify market opportunities."
            },
            {
                "title": "Is USD on the Verge of a Major Break After Trump Cheers Dollar Weakness? - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-au/news-and-analysis/is-usd-on-the-verge-of-a-major-break-after-trump-cheers-dollar-weakness/?amp=true",
                "body": "Is USD on the Verge of a Major Break After Trump Cheers Dollar Weakness?\nCurrencies are unique as an asset class and for many traders and quite a few investors, that nuance is difficult to explain. After all, the aim of trading currencies is the same as stocks or gold or palm oil or anything else: To use risk capital in an attempt to profit, and along the way taking risk that could erase some or all of that capital. But as far as the underlying assets go currencies are unique from those other markets in several ways, chief of which is the fact that all of those other markets are priced in the very same currencies that are being traded on FX platforms.\nThis is why spot FX is often traded in pairs: Because the only way to value a currency – is with another currency. So if you ask someone the value of the Euro there’s not an easy direct response, you then need to ask, ‘against which currency?’\nCommonly in the FX world the default is the major pair, which is the pairing of the currency in question with the US Dollar. And in many ways the USD is the center of both the FX universe and western capitalism, which global trade often settled in the US currency. The USD is also considered as ‘the global reserve,’ and that title allows the US certain benefits, such as control over other countries and trade partners that can allow for leverage when levying sanctions.\nThis is somewhat controversial and far from the point of this article, but what is in the equation at the present is the USD’s role in the global economy, as for years it’s seemed that general policy was to avoid any direct engagement of strength or weakness drives even if other trade partners were doing so.\nJapan is a key example, and this is something that former Treasury Secretary Janet Yellen had commented on without seeming to do anything about it. But with a backdrop of decades of deflation and disinflation and an aging population that’s only going to continue to decrease, Japan has been somewhat desperate to drive economic growth in their economies. This hit home in 2012, with the election of Shinzo Abe and his ‘Abe-nomics’ platform designed to put growth front-and-center for the Japanese economy. As part of the strategy there were multiple components, but a big part of that approach was weakening the Yen to help boost exports.\nBy doing so, the value of USD/JPY rose from the 80’s into the 120’s and, in essence, made it easier for Japanese companies to sell products in the United States. The other side of that, however, is that it made it more difficult for US companies to compete and if we’re looking at a market like automobiles, that can have an outsized impact on the economy in the United States.\nFor US policymakers it seemed that this was largely tolerated as assistance to a key trade partner. But since President Trump’s inauguration a year ago, this has been a major focal point as he’s attempted to get that dynamic reversed to help US companies. This drove a massive wave of USD-weakness in the first-half of last year and he’s been back on the topic with aggression even as the DXY sell-off stalled in the second-half.\nUS Dollar Daily Price Chart\nChart prepared by James Stanley; data derived from Tradingview\nUSD: Where’s the Weakness Going to Come From?\nGetting back to that unique element of FX and the fact that the only way you can value a currency – is with another currency, and there’s a conundrum of sorts. And it’s perhaps less obvious in the US Dollar basket or the DXY basket as it trades as a singular asset, similar to gold or stocks or anything else. But – the DXY basket is really just a basket of underlying currencies – so if we are going to see a trend in either direction for the Dollar, it’s going to need assistance from the currencies in that basket.\nThe Euro is the largest component at 57.6%, so many times when we see a USD trend there’s a mirror image trend in the Euro. The Japanese Yen is the second largest component at 13.6%, so when we see something like"
            },
            {
                "title": "Dollar Stabilizes Ahead of Today's FOMC Decision - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/barchart:7ce9a0808094b:0-dollar-stabilizes-ahead-of-today-s-fomc-decision/",
                "body": "Dollar Stabilizes Ahead of Today's FOMC Decision\nThe dollar index DXY is up +0.29% today, rebounding from Tuesday's nearly 4-year low. Weakness in the yen is supporting gains in the dollar today after Treasury Secretary Bessent said the US \"absolutely not\" intervening in the currency market to support the yen. Market movement is limited ahead of the FOMC decision later today.\nThe dollar sank to a nearly 4-year low on Tuesday after President Trump said he's comfortable with the recent weakness in the dollar. Also, the dollar continues to be undercut as foreign investors pull capital from the US amid political risks. The markets remain nervous about Greenland, even though Mr. Trump said last Wednesday that there was a framework agreement for increased US access to Greenland and that he would not invade Greenland by military force.\nJoin 200K+ Subscribers: Find out why the midday Barchart Brief newsletter is a must-read for thousands daily.The dollar is also under pressure on US political uncertainty after President Trump on Saturday threatened 100% tariffs on US imports from Canada if Canada signs a trade agreement with China. Canada is seeking other trade partners amid President Trump's liberal use of tariffs during this second administration.\nIn addition, the dollar is weighed down by speculation that the US might coordinate FX intervention with Japan to boost the yen, which would dovetail with Mr. Trump's apparent view that a weak dollar is good for the US as a stimulus to US exports. The yen rose to a 2.75-month high against the dollar on Tuesday as US authorities reportedly contacted market participants last Friday to check dollar/yen prices, a possible precursor to intervention.\nThe risk of another partial US government shutdown is also weighing on the dollar. Senate Democrats threatened to block a government funding deal over Department of Homeland Security/ICE funding after the ICE shooting of an ICU nurse in Minnesota on Saturday. There could be a partial government shutdown when the current stopgap funding measure expires this Friday. In addition, the dollar is being undercut by risks to the Federal Reserve's independence, a growing US budget deficit, fiscal profligacy, and widening political polarization.\nThe markets are discounting the odds at 3% for a -25 bp rate cut at the conclusion of today's FOMC meeting.\nThe dollar continues to see underlying weakness as the FOMC is expected to cut interest rates by about -50 bp in 2026, while the BOJ is expected to raise rates by another +25 bp in 2026, and the ECB is expected to leave rates unchanged in 2026.\nEUR/USD S is up by +0.98% today. The yen is falling back from Tuesday's 2.75-month high against the dollar. Today's rally in the Nikkei stock index to a 1.5-week high has reduced some safe-haven demand for the yen. Also, higher T-note yields today are bearish for the yen. Losses in the yen accelerated today after US Treasury Secretary Bessent said the US is \"absolutely not\" intervening in the forex market in support of the yen.\nThe yen had rallied sharply over the past few sessions on speculation that US-Japan joint FX intervention may be forthcoming. US authorities reportedly called major banks last Friday to request dollar/yen quotes, a possible precursor to intervention. Also, Japanese Finance Minister Katayama said Tuesday that officials \"will take action\" in line with a US-Japanese FX agreement.\nThe minutes from the December 18-19 BOJ meeting showed some board members expressed rising concern over the extent to which the yen's depreciation is affecting price trends, saying that \"in deciding whether to raise the policy interest rate, the BOJ should give consideration to the impact of the yen's depreciation on inflation rates, and in some cases, on underlying inflation.\"\nThe markets are discounting a 0% chance of a BOJ rate hike at the next meeting on March 19.\nFebruary COMEX gold (GCG26) today is up +152.80 (+3.01%), and March COMEX silver (SIH26) is up +6.993 (+6.60%"
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0079",
            "open": "1.3577",
            "close": "1.3556",
            "high": "1.3614",
            "low": "1.3535"
        },
        "market_summary": "ERROR: An unexpected error occurred during AI summary generation: 'choices'",
        "source_articles": [
            {
                "title": "Bank Of Canada Holds Rates, But USD/CAD May Climb - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/bank-of-canada-holds-rates-but-usdcad-may-climb",
                "body": "ING says the BoC kept rates at 2.25% and signaled flexibility, yet the US dollar and USMCA trade risks could push USD/CAD back above 1.370.\nabout 14 hours ago • 1 min\nWhat’s going on here?\nThe Bank of Canada kept its overnight rate at 2.25%, but ING says the Canadian dollar could still weaken, pushing USD/CAD back above 1.370.\nWhat does this mean?\nThe pause was widely expected, and the Bank’s updated Monetary Policy Report didn’t shift the outlook much: it still sees GDP growth around 1.1% this year and 1.5% by 2027, similar to October. With no big change in guidance, investors didn’t meaningfully reprice where rates go next, so the currency barely reacted. The Bank also kept the door open to more easing later this year without promising anything. That leaves USD/CAD less about Canada’s rate path and more exposed to US data, Federal Reserve exp..\nectations, and broad swings in the greenback.\nWhy should I care?\nFor markets: USD/CAD is still mostly a US dollar story.\nING thinks the “USD leg” is doing most of the work – meaning broad moves in the US dollar can outweigh Canada-specific news like a steady policy rate. If the recent US dollar pullback fades, that alone could lift USD/CAD, even if the Bank of Canada stays cautious and predictable. Translation: currency volatility may come more from Washington and Wall Street than from Ottawa.\nThe bigger picture: Trade talks are the wildcard for the loonie.\nING also points to eventual USMCA renewal negotiations as a potential pressure point. Canada’s economy is tightly tied to US demand and cross-border supply chains, so any sign of friction can raise the risk premium investors demand to hold Canadian assets. That kind of headline risk can weigh on the currency even if growth and inflation forecasts stay broadly steady.\nThis content is free, but you must be logged in to continue reading.\nAlready have an account?"
            },
            {
                "title": "USD/CAD slides to 1.3530, pressured by bullish Oil and weak USD - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-cad-slide-to-13530-lowest-since-october-2024-amid-bullish-oil-prices-and-weak-usd-202601290056",
                "body": "USD/CAD slide to 1.3530, lowest since October 2024 amid bullish Oil prices and weak USD\n- USD/CAD drifts lower for the third straight day on Thursday and is pressured by a combination of factors.\n- Crude Oil prices climb to a four-month top and underpin the Loonie amid the BoC’s neutral policy stance.\n- The uncertainty over Trump's decisions, Fed independence concerns, and rate-cut bets weigh on the USD.\nThe USD/CAD pair attracts some follow-through sellers for the third consecutive day and drops to its lowest level since October 2024 during the Asian session on Thursday. Spot prices currently trade around the 1.3540-1.3535 region, down 0.15% for the day, and seem vulnerable to decline further amid a combination of factors.\nCrude Oil prices rise to a four-month high due to rising geopolitical risks and continued Chinese buying. Furthermore, a surprise decline in US inventories offsets concerns about oversupply and remains supportive of elevated prices. This, in turn, underpins the commodity-linked Loonie, which, along with a bearish US Dollar (USD), continues to exert downward pressure on the USD/CAD pair and validates the near-term negative outlook.\nThe USD Index, which tracks the Greenback against a basket of currencies, remains well within striking distance of a four-year low amid heightened economic and policy risk linked to US President Donald Trump's decisions. Apart from this, bets that the US Federal Reserve (Fed) will lower borrowing costs during the latter half of 2026 and the underlying bullish sentiment weigh on the safe-haven buck, contributing to the USD/CAD pair's slide.\nAs was widely expected, the US central bank left its key policy rate unchanged at the end of a two-day meeting on Wednesday. In the post-meeting press conference, Fed Chair Jerome Powell said that the incoming data had shown a clear improvement in the economic outlook. Traders, however, are still pricing in two more interest rate cuts by the Fed in 2026. Moreover, concerns about the Fed's independence keep the USD bulls on the defensive.\nMeanwhile, the Bank of Canada (BoC) said that elevated levels of economic and geopolitical uncertainty were behind its decision to hold interest rates for the second time on Wednesday. The BoC added further that the uncertainty is bleeding into economic predictions, which now run from cuts to hikes to holds for 2026. The outlook, however, does little to influence the Canadian Dollar (CAD), leaving the USD/CAD pair at the mercy of the USD.\nTraders now look to the release of the usual Weekly Initial Jobless Claims data from the US, which could influence the USD demand. Apart from this, Oil price dynamics might contribute to producing short-term trading opportunities around the USD/CAD pair. Nevertheless, the aforementioned fundamental backdrop remains tilted in favor of bearish traders and suggests that the path of least resistance for spot prices is to the downside.\nUS Dollar Price Last 7 Days\nThe table below shows the percentage change of US Dollar (USD) against listed major currencies last 7 days. US Dollar was the strongest against the Canadian Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the US Dollar from the left column and move along the horizontal line to the Japanese Yen, the percentage change displayed in the box will represent USD (base)/JPY (quote).\nAuthor\nHaresh Menghani\nFXStreet\nHaresh Menghani is a detail-oriented professional with 10+ years of extensive experience in analysing the global financial markets."
            },
            {
                "title": "Loonie rises 1% after BOC meeting - Economies.com",
                "source": "Economies.com",
                "url": "https://www.economies.com/forex/usd-cad-news/loonie-rises-1-after-boc-meeting-48206",
                "body": "The Canadian dollar rose against most major currencies during Wednesday’s trading, supported by the central bank’s monetary policy statement.\nThe Bank of Canada decided today to keep the overnight interest rate unchanged at 2.25%, while maintaining the lending rate at 2.5% and the deposit rate at 2.20%, in a move reflecting its continued cautious stance amid a globally uncertain economic environment.\nThe bank said that the outlook for the global and Canadian economies has not changed materially from the projections in the October Monetary Policy Report, though risks remain elevated due to unpredictable US trade policies and ongoing geopolitical developments.\nThe bank noted that economic growth in the United States continues to exceed expectations and is likely to remain strong, driven by AI-related investment and consumer spending. While tariffs are contributing to higher US inflation, their impact is expected to fade gradually later in the year. In the euro area, growth has been supported by activity in the services sector, with additional fiscal support expected, while China’s GDP growth is projected to slow gradually as domestic demand weakens, despite strong exports. Overall, the bank expects global growth to average around 3% over the forecast horizon.\nOn financial markets, the bank said global financial conditions remain broadly accommodative. Recent weakness in the US dollar has helped lift the Canadian dollar above 72 US cents, close to the level seen around the October report. Oil prices have also been volatile due to geopolitical events and are expected to be slightly lower in the period ahead compared with the assumptions in the previous report.\nDomestically, US trade restrictions and elevated uncertainty continue to weigh on growth. After a strong performance in the third quarter, GDP growth is likely to have stalled in the fourth quarter. Exports remain under pressure from US tariffs, while domestic demand is showing signs of improvement. Although employment has increased in recent months, the unemployment rate remains elevated at 6.8%, with only a small share of firms indicating plans to hire additional workers.\nThe bank expects economic growth to remain modest in the near term as population growth slows and Canada adjusts to US protectionist policies. Consumer spending is likely to remain resilient, while business investment is expected to improve gradually, partly supported by fiscal policy. The economy is forecast to grow by 1.1% in 2026 and 1.5% in 2027, broadly in line with the October projections. The review of the Canada–US–Mexico Agreement remains a key source of uncertainty.\nOn inflation, the consumer price index rose to 2.4% in December, driven by base effects related to the GST/HST tax holiday last winter. Excluding tax-related changes, inflation has continued to slow since September. The bank’s preferred core inflation measures declined from 3% in October to around 2.25% in December. Inflation averaged 2.1% in 2025, and the bank expects it to remain close to the 2% target over the projection period, with trade-related cost pressures offset by excess supply.\nThe Bank of Canada reiterated that monetary policy remains focused on keeping inflation close to 2% while supporting the economy through this period of structural adjustment. The Governing Council sees the current policy rate as appropriate, provided the economy evolves broadly in line with today’s projections. However, the bank stressed that uncertainty remains high and that it is closely monitoring risks, reaffirming its readiness to act if the economic outlook changes and its commitment to maintaining Canadians’ confidence in price stability amid ongoing global disruptions.\nIn trading, the Canadian dollar rose against the US dollar at 20:51 GMT, gaining 1% to 0.7367.\nElevated spot metal prices suggest that 2026 could be one of the strongest profit years in recent memory for diversified mining companies, with Rio Tinto and Glencore emerging as th"
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "1.9550",
            "open": "210.6430",
            "close": "211.7640",
            "high": "212.0120",
            "low": "210.0570"
        },
        "market_summary": "### GBP/JPY Market Briefing\n\n* **Key Drivers:** Mixed cues, including **fiscal concerns** and **political uncertainty** in Japan, weigh on the **JPY**, while **divergent BoJ-BoE policy expectations** cap the **GBP/JPY** uptick.\n* **Price Action:** The **GBP/JPY** cross extends its sideways consolidative price move, trading below the **211.00** mark, near a **five-week low**.\n* **Technical Outlook:** Immediate support is near the **50-day SMA** at **209.70**, with resistance at the **21-day SMA** near **211.80**. A break below **209.70** could expose the **100-day SMA** around **205.70**, while a clear break above **211.80** could attract fresh buying interest, targeting the **215.00** region.\n\n---\n**Overall Sentiment:** **Neutral**",
        "source_articles": [
            {
                "title": "GBP/JPY extends range play; hovers below 211.00 near multi-week low - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-extends-the-range-play-below-21100-close-to-multi-week-low-amid-mixed-cues-202601280743",
                "body": "GBP/JPY extends the range play below 211.00, close to multi-week low amid mixed cues\n- GBP/JPY struggles to gain any meaningful traction and remains close to a multi-week low.\n- Fiscal concerns and political uncertainty weigh on the JPY, lending support to spot prices.\n- The divergent BoJ-BoE policy expectations cap the intraday uptick and favor bearish traders.\nThe GBP/JPY cross extends its sideways consolidative price move for the second straight day and trades below the 211.00 mark during the early European session on Wednesday. Spot prices remain close to a five-week low, touched on Monday, though the mixed fundamental backdrop warrants caution before placing aggressive directional bets.\nInvestors remain concerned about Japan's fiscal health on the back of Prime Minister Sanae Takaichi's aggressive spending and tax cut plans. Adding to this, domestic political uncertainty ahead of a snap election on February 8, along with a positive risk tone, undermines the safe-haven JPY and turns out to be a key factor acting as a tailwind for the GBP/JPY cross. However, the Bank of Japan's (BoJ) hawkish outlook and intervention fears help limit deeper JPY losses.\nIn fact, the December BoJ meeting minutes released earlier today showed that members were more confident about sustaining a moderate wage–price cycle and were using that assessment to justify another step toward less accommodative policy. This, in turn, highlights the central bank's readiness to continue pushing up still-low borrowing costs. In contrast, traders are pricing in one or possibly two quarter-point rate interest cuts by the Bank of England (BoE) in 2026.\nApart from this, a goodish US Dollar (USD) recovery is seen exerting downward pressure on the British Pound (GBP), which further contributes to capping the GBP/JPY cross. However, the range-bound price action following a bearish gap opening on Monday makes it prudent to wait for strong follow-through selling before positioning for an extension of the corrective pullback from the vicinity of the 215.00 mark, or the highest level since July 2008, touched last week.\nPound Sterling FAQs\nThe Pound Sterling (GBP) is the oldest currency in the world (886 AD) and the official currency of the United Kingdom. It is the fourth most traded unit for foreign exchange (FX) in the world, accounting for 12% of all transactions, averaging $630 billion a day, according to 2022 data. Its key trading pairs are GBP/USD, also known as ‘Cable’, which accounts for 11% of FX, GBP/JPY, or the ‘Dragon’ as it is known by traders (3%), and EUR/GBP (2%). The Pound Sterling is issued by the Bank of England (BoE).\nThe single most important factor influencing the value of the Pound Sterling is monetary policy decided by the Bank of England. The BoE bases its decisions on whether it has achieved its primary goal of “price stability” – a steady inflation rate of around 2%. Its primary tool for achieving this is the adjustment of interest rates. When inflation is too high, the BoE will try to rein it in by raising interest rates, making it more expensive for people and businesses to access credit. This is generally positive for GBP, as higher interest rates make the UK a more attractive place for global investors to park their money. When inflation falls too low it is a sign economic growth is slowing. In this scenario, the BoE will consider lowering interest rates to cheapen credit so businesses will borrow more to invest in growth-generating projects.\nData releases gauge the health of the economy and can impact the value of the Pound Sterling. Indicators such as GDP, Manufacturing and Services PMIs, and employment can all influence the direction of the GBP. A strong economy is good for Sterling. Not only does it attract more foreign investment but it may encourage the BoE to put up interest rates, which will directly strengthen GBP. Otherwise, if economic data is weak, the Pound Sterling is likely to fall.\nAnother significant data release for the Po"
            },
            {
                "title": "GBP/JPY Price Forecast: Double top near 215.00 weakens near-term outlook - Mitrade",
                "source": "Mitrade",
                "url": "https://www.mitrade.com/au/insights/news/live-news/article-1-1429483-20260128",
                "body": "The British Pound (GBP) is trading on the back foot against the Japanese Yen (JPY) on Wednesday, with GBP/JPY under modest pressure as demand for the Yen picks up amid fresh intervention speculation.\nAt the time of writing, the cross is trading around 210.37, as a quiet economic data calendar in both Japan and the UK keeps price action capped inside this week’s narrow trading range.\nFrom a technical perspective, GBP/JPY continues to trade within a well-defined ascending parallel channel, with the broader bullish structure underpinned by a clear sequence of higher highs and higher lows.\nHowever, the near-term outlook has turned slightly bearish after the pair carved out a double-top chart pattern in the 214.00-215.00 region near the upper boundary of the channel.\nMomentum indicators reflect this cooling bias. The Relative Strength Index (RSI) has slipped to around 45.7 after retreating from overbought territory, suggesting bullish momentum is fading. At the same time, the Average Directional Index (ADX) has eased to near 25.9, pointing to a loss of trend strength.\nOn the downside, price action is currently stabilizing above the 50-day Simple Moving Average (SMA) near 209.70. A sustained break below this level would expose the 100-day SMA around 205.70, which closely aligns with the lower boundary of the rising channel.\nA decisive daily close below the channel would signal a deeper corrective phase, potentially opening the door toward the 200.00 psychological handle.\nOn the upside, the 21-day SMA near 211.80 is capping immediate recovery attempts. Failure to reclaim this zone would keep near-term risks tilted to the downside.\nConversely, a clear break above it could attract fresh buying interest, allowing a retest of the double-top region near the channel top, with scope for an extension to new highs if bullish momentum re-accelerates.\nThe Japanese Yen (JPY) is one of the world’s most traded currencies. Its value is broadly determined by the performance of the Japanese economy, but more specifically by the Bank of Japan’s policy, the differential between Japanese and US bond yields, or risk sentiment among traders, among other factors.\nOne of the Bank of Japan’s mandates is currency control, so its moves are key for the Yen. The BoJ has directly intervened in currency markets sometimes, generally to lower the value of the Yen, although it refrains from doing it often due to political concerns of its main trading partners. The BoJ ultra-loose monetary policy between 2013 and 2024 caused the Yen to depreciate against its main currency peers due to an increasing policy divergence between the Bank of Japan and other main central banks. More recently, the gradually unwinding of this ultra-loose policy has given some support to the Yen.\nOver the last decade, the BoJ’s stance of sticking to ultra-loose monetary policy has led to a widening policy divergence with other central banks, particularly with the US Federal Reserve. This supported a widening of the differential between the 10-year US and Japanese bonds, which favored the US Dollar against the Japanese Yen. The BoJ decision in 2024 to gradually abandon the ultra-loose policy, coupled with interest-rate cuts in other major central banks, is narrowing this differential.\nThe Japanese Yen is often seen as a safe-haven investment. This means that in times of market stress, investors are more likely to put their money in the Japanese currency due to its supposed reliability and stability. Turbulent times are likely to strengthen the Yen’s value against other currencies seen as more risky to invest in."
            },
            {
                "title": "GBP/JPY Forecast 28/01: GBP JPY Continues to Look Healthy - DailyForex",
                "source": "DailyForex",
                "url": "https://www.dailyforex.com/forex-technical-analysis/2026/01/gbpjpy-forecast-28-january-2026/240356",
                "body": "The British pound has been somewhat noisy against the Japanese yen during trading on Tuesday, but that will have been expected as the Bank of Japan and others have intervened.\nGBP/JPY\nThe British pound has been somewhat noisy against the Japanese yen during trading on Tuesday, but that will have been expected as we’ve recently seen some form of intervention to favor the Japanese yen in order to combat some of the massive selling pressure that has been a mainstay here.\nThat being said, the British pound does look like it is fairly well supported at the 210 yen level, and not only is it seeing a bit of structural support as this was an area that was supported previously, we also have the 50-day EMA ranked there as well, which of course offers a significant amount of support.\nTechnical Support and Market Outlook\nIf we were to break down below the 50-day EMA, the 205 yen level could be the target, possibly even the 200-day EMA, which is currently trading at the 202.45 level and rising.\nAll things being equal, this is a market that I think remains very bullish, and of course you do get paid at the end of every day to hang onto it, so I’m still bullish on this pair. I also recognize that we need some of the noise to soften in the yen denominated markets overall in order to get large with the position.\nTop Regulated Brokers\nThe US dollar is struggling quite a bit more against the yen than the British pound, but that makes sense considering the US dollar has its own concerns. That is why I’m focusing on this pair, because I’m trying to match up strength with inherent weakness. Yes, the central banks may have done something, but that’s not the sign of a strong currency; quite frankly, it’s mainly the opposite that it gives an impression of. All things being equal, this is a pair that I think will try to get to the 215 yen level eventually.\nBegin trading our daily forecasts and analysis. Here is a list of Forex brokers in Japan to work with."
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "1,774.0000",
            "open": "88,988.7900",
            "close": "89,234.5000",
            "high": "90,459.5000",
            "low": "88,685.5000"
        },
        "market_summary": "### BTC/USD Market Briefing\n\n* **Key Drivers:** Institutional investors face a test of conviction as Bitcoin ETF holdings decline by **$6 billion**, with the **$86,600** break-even level in focus.\n* **Price Action:** Bitcoin price lingers near the ETF realized price, with **$126,200** being the recent record high, and now struggles to stay above the **$86,600** level.\n* **Technical Outlook:** The ETF realized price volatility has stabilized over the past six months, with **8.4%** decline in ETF holdings since October, representing a significant stress test for investors.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "3 Things Investors Need to Know About the ARK 21Shares Bitcoin ETF in 2026 - The Motley Fool",
                "source": "The Motley Fool",
                "url": "https://www.fool.com/investing/2026/01/28/x-things-investors-need-to-know-about-the-ark-21sh/",
                "body": "It's been about two years since spot Bitcoin exchange-traded funds (ETFs) started trading in the U.S., marking a seminal event in the histories of both the ETF industry and the broader cryptocurrency space.\nOne of the most significant funds in this still young ETF category is the ARK 21Shares Bitcoin ETF (ARKB 0.34%). Just a couple of weeks past its second birthday, the ARK ETF is home $3.3 billion in assets under management (AUM), meaning just five crypto ETFs of any variety are larger than this fund.\nThat's an impressive start for any two-year-old ETF, and it confirms that advisors and retail investors alike are embracing this product. Still, that popularity also indicates that market participants, particularly those new to the game, need to understand the mechanics of spot Bitcoin ETFs, including this ARK fund. Here are three need-to-know facts about this fund.\n1. Investors own shares, not Bitcoin directly\nThe ARK Bitcoin ETF and its brethren are comparable to funds such as the SPDR Gold Shares in that investors buy shares in a fund that provides exposure to the underlying asset. However, investors purchasing this ETF don't directly own Bitcoin any more than a gold ETF investor owns gold bars, which is to say they don't.\nIn fact, the ARK ETF is, at its core, an index fund as it tracks the CME CF Bitcoin Reference Rate – New York Variant. Prospective investors need to remember that point.\n2. Unlike Bitcoin, the ETF doesn't trade all day\nFor many investors, one of the coolest things about cryptocurrency is that it's a true 24/7 market. Want to buy some Bitcoin or another digital currency at midnight or on Christmas Day? No problem. Your order will be processed, and you'll immediately add to your Bitcoin stake.\nThat's not the case with the ARK fund or any other Bitcoin ETF, for that matter. Remember what ETF stands for. These are funds that trade on exchanges, meaning any ETF can only be bought or sold when the exchange is open.\nNYSEMKT: ARKB\nKey Data Points\nAnd because we're talking about an ETF here, there's an expense ratio to consider. The ARK fund charges 0.21% annually, or $21 on a $10,000 investment. While the fee is nominal, it may be off-putting to experienced crypto investors accustomed to holding digital currencies in their own wallets or on exchanges where fees simply for holding aren't part of the equation.\n3. Cathie Wood is a Bitcoin bull\nPut this in the \"for what it's worth\" column, but ARK co-founder and CEO Cathie Wood is a longtime Bitcoin bull. Optimistic investors considering the firm's Bitcoin ETF may view Wood's support of the digital currency as naysayers view it as her talking her book. That call should be made on an individual basis.\nWhen it's said the ETF issuer is bullish on Bitcoin, it's really bullish. ARK forecasts a total cryptocurrency market capitalization of $28 trillion by 2030, implying a more than ninefold increase from the current level of $3.01 trillion.\nIt expects Bitcoin will represent 70% of that figure, or $19.6 trillion. Not only is that more than four times Nvidia's market cap, but that prediction implies the largest digital currency is in for an 11x run from current levels."
            },
            {
                "title": "BlackRock’s New Covered Call Bitcoin ETF Is Another Red Flag for a Dangerous Investing Trend - Barchart.com",
                "source": "Barchart.com",
                "url": "https://www.barchart.com/story/news/37275385/blackrocks-new-covered-call-bitcoin-etf-is-another-red-flag-for-a-dangerous-investing-trend",
                "body": "Combine the biggest ETF manager, one of the hottest trends in ETF investing, and a new product launch, and what do you get? Meh.\nThere’s nothing bombastic or shameful about the planned iShares Bitcoin Premium Income ETF, due to debut soon. And it certainly has a solid firm behind it. Covered call ETFs, including active ones, are not new. And frankly, I find the product glut downright dangerous.\nI’m not pointing fingers at any one firm. It is the sum total of option-driven income strategies that feel way too familiar. All the rage today, boatloads of arbitration cases later. I just don’t know when. I also don’t ignore the risk that there’s just too much covered call writing chasing too little liquidity. Not in the current happy-time market. When it gets tougher. And volume blows out. And equities fall… and don’t come back so quickly.\nRemember, the last time we had anything approaching a slow dripping market decline was 2022. And even that was all of 9 months before the AI rally began. We have to go all the way back to 2008 to find an environment where covered call ETFs failed more than temporarily. This is likely to happen again, I just don’t know when.\nWhat’s the Skinny on the Latest Covered Call ETF?\nBlackRock’s new Bitcoin (BTCUSD) fund is an actively managed ETF that does two things simultaneously:\n- Holds Bitcoin: It is backed by actual Bitcoin held in cold storage by Coinbase Custody.\n- Generates Income: It writes (sells) call options primarily on the iShares Bitcoin Trust (IBIT).\nIn plain English: This is a “Buy-Write” or “Covered Call” strategy for Bitcoin. It’s designed for the investor who wants Bitcoin exposure but is tired of the stomach-churning volatility and wants to get paid a monthly premium while they wait.\nStrengths and Weakness: It’s Not All Bad, But It’s Not All Good\nWhy Now?\nBlackRock filing this in January 2026 tells me it believes the “Wild West” era of 100% volatility is maturing. It is targeting the registered investment advisor (RIA) market, the folks who want to put 3% of a client’s portfolio in Bitcoin but can’t handle a 50% drawdown without an income stream to point to.\nThe Bottom Line for me is that this filing is the white flag of volatility. It’s the sign that Bitcoin is being domesticated into a traditional asset class. It’s great for retirees and income-seekers, but for the “diamond hands” crowd, it’s a distraction. This is not the first of its kind. But when iShares gets in, there’s a sense of legitimacy.\nAnd for this product, that’s the case. But when Bitcoin falls and can’t get up, then what? That’s when covered call writing’s downsides set in. So as with most such products, my only interest in them is if I can hedge the downside using a put option (essentially completing a collar) or even an inverse ETF on the same or similar type of security.\nBut those are observations, not suggestions. This product overload in covered call writing just strikes me as a poster child for this era in history.\nRob Isbitts is a semi-retired fiduciary investment advisor and fund manager. Find his investment research at ETFYourself.com. To copy-trade Rob’s portfolios, check out the new PiTrade app.\nOn the date of publication, Rob Isbitts did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. For more information please view the Barchart Disclosure Policy here."
            },
            {
                "title": "Bitcoin ETF $86K break-even level in focus amid US wirehouse influx reports - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/cointelegraph:71a17d4f8094b:0-bitcoin-etf-86k-break-even-level-in-focus-amid-us-wirehouse-influx-reports/",
                "body": "Bitcoin ETF $86K break-even level in focus amid US wirehouse influx reports\nBitcoin BTCUSD institutional investors face a test of “conviction” as exchange-traded fund (ETF) holdings tumble by $6 billion.\nKey points:\nBitcoin ETF investors now face falling into aggregate loss on their holdings.\nNet ETF holdings drop by over 8% versus all-time highs in a “psychological pivot” point.\nNew ETF buyers are on the horizon, a crypto industry executive claims.\nBTC price lingers near ETF realized price\nNew research from onchain analytics platform CryptoQuant Wednesday showed Bitcoin ETF buyers struggling to stay in the market.\nThe US spot Bitcoin ETFs have seen outflows pass $6 billion since net holdings hit all-time highs of $72.6 billion in October 2025.\nWith BTC price action seeing its current record of $126,200 around the same time, its subsequent decline has hit institutional appetite especially hard.\nNow, ETF investors face a battle to stay above their $86,600 realized price — the aggregate level at which they entered their positions.\n“With price sitting on the ETF realized price, the marginal ETF holder is no longer a seller locking in gains, but an investor deciding whether to tolerate drawdowns or exit at breakeven,” CryptoQuant contributor I. Moreno wrote.\nAccompanying charts show ETF holdings down 8.4% since October, something that in itself “represents the first significant stress test for this relatively nascent investment cohort since ETF approval.”\nDespite this and associated erratic BTC price action, ETF realized price volatility has stabilized over the past six months.\n“What stands out is that despite a $6B drawdown in cumulative flows (from ~$72.6B to ~$66.5B), realized price has remained relatively stable and continues to trend higher,” Moreno continued.\nBitwise exec: ETF demand set for rebound\nThe second half of January has not been kind to the ETFs’ fortunes.\nThe latest data from UK-based investment company Farside Investors shows net outflows characterizing performance from Jan. 16 onward.\nOnly Monday managed net inflows, with these totaling a mere $6.8 million, while three ETF products still lost capital.\nRegardless, Andre Dragosch, European head of research at crypto asset manager Bitwise, eyed potential future participation as a reason for optimism.\n“Major US wirehouses with 10,000s of financial advisors continue to move into Bitcoin ETFs. One of them has just greenlighted TODAY,” he reported on X Wednesday.\nDragosch said that the identity of the entity was “internal intelligence” and could not be revealed."
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "64.1500",
            "open": "3,011.6900",
            "close": "3,014.0500",
            "high": "3,041.1000",
            "low": "2,976.9500"
        },
        "market_summary": "ERROR: An unexpected error occurred during AI summary generation: 'choices'",
        "source_articles": [
            {
                "title": "Vitalik-backed MegaETH blockchain to launch in February - dlnews.com",
                "source": "dlnews.com",
                "url": "https://www.dlnews.com/articles/defi/vitalik-backed-megaeth-blockchain-to-launch-in-february/",
                "body": "- “Real-time” blockchain MegaETH will launch on mainnet in February.\n- The project has attracted a sterling list of VCs and angel investors.\n- A 2025 ICO for its MEGA token was vastly oversubscribed.\nMegaETH, a hyper-fast blockchain backed by Ethereum co-founder Vitalik Buterin, is set to launch on February 9.\nIt will be among the crypto industry’s most anticipated debuts in 2026. The self-described “real-time” blockchain claims it can achieve “100,000 transactions per second with millisecond-level responsiveness” while maintaining compatibility with Ethereum.\nThat promise has lured investments from crypto venture firm Dragonfly Capital, as well as Buterin, fellow Ethereum co-founder Joe Lubin, EigenCloud founder Sreeram Kannan, and Helius founder Mert Mumtaz.\nIt also lured a stampede of retail investors. Last year, MegaETH’s initial coin offering was oversubscribed, drawing 11,534 wallets that had pledged over $300 million.\nBut only $50 million in tokens had been made available for purchase, leading MegaETH parent company MegaLabs to use investors’ social media history to determine allocations.\nMegaETH’s founders have presented the blockchain as a true “world computer.” It’s the same vision that animates Ethereum developers, but it’s been stymied by Ethereum’s high cost and relatively limited throughput.\n“Real-time blockchains will blur the line between Web2 servers and blockchains,” a lengthy explainer on the MegaETH website reads. “After a decade of experimentation, we can finally approach Web2-scale applications on-chain.”\nDevelopers have already begun building videogames, prediction markets, and payment applications on a MegaETH test network.\nLast year, MegaLabs said the blockchain would have a native stablecoin, USDm, backed by BlackRock’s tokenised treasury fund and issued by Ethena.\nMegaETH’s token, MEGA, was trading at $0.18 on Hyperliquid futures markets on Wednesday, a 60% drop from its November high of $0.50.\nAleks Gilbert is DL News’ New York-based DeFi correspondent. You can reach him at aleks@dlnews.com."
            },
            {
                "title": "Stay Updated on Crypto: Latest Insights on Bitcoin, Ethereum, and Altcoins! - Investing News Network",
                "source": "Investing News Network",
                "url": "https://investingnews.com/cryptocurrency-market-recap/",
                "body": "Crypto Market Update: Tether Builds Massive Gold Reserve in Switzerland\nTether CEO Paolo Ardoino said the stablecoin issuer is adding more than 1 metric ton of gold per week as part of its reserve strategy.\nHere's a quick recap of the crypto landscape for Wednesday (January 28) as of 9:00 a.m. UTC.\nGet the latest insights on Bitcoin, Ether and altcoins, along with a round-up of key cryptocurrency market news.\nBitcoin and Ether price update\nBitcoin (BTC) was priced at US$88,867.96, up by 2.0 percent over 24 hours.\nBitcoin price performance, January 28, 2025.\nChart via TradingView.\nEther (ETH) was priced at US$2,990.46, up by 3.7 percent over the last 24 hours.\nAltcoin price update\n- XRP (XRP) was priced at US$1.91, up by 2.3 percent over 24 hours.\n- Solana (SOL) was trading at US$126.72, up by 2.9 percent over 24 hours.\nToday's crypto news to know\nTether amasses massive gold reserve in Switzerland\nTether has quietly built what its CEO describes as the world’s largest non-sovereign gold hoard, holding roughly 140 tons of bullion worth about US$23 billion in a high-security Swiss bunker.\nIn an interview with Bloomberg, CEO Paolo Ardoino said the company has been buying more than a ton of physical gold per week, a pace that places it among the most active buyers in the global bullion market.\nExecutives say the strategy is designed to harden Tether’s balance sheet and hedge against fiat currency risk, particularly for its flagship stablecoin USDT and its gold-backed token XAUT.\nBullion traders note that sustained, price-insensitive buying of this scale can tighten supply and affect liquidity, especially when central banks and ETFs are also accumulating.\nCritics, however, warn that concentrating so much physical gold in a single private entity adds a new layer of systemic and transparency risk.\nSouth Dakota revives Bitcoin push\nA South Dakota lawmaker has reintroduced legislation that would allow the state to allocate up to 10 percent of certain public funds to Bitcoin, reviving a proposal that stalled last year.\nFiled by Republican Representative Logan Manhart, the bill would permit exposure through direct holdings, regulated custodians, or approved exchange-traded products. It also sets out strict custody and security standards, including exclusive control of private keys, encrypted hardware storage, and regular audits.\nThe measure has cleared its first procedural hurdle and is now with the state’s Committee on Commerce and Energy.\nSimilar initiatives have gained traction elsewhere, with several US states exploring or adopting crypto reserve strategies.\nPaypal survey: large enterprises lead crypto payments adoption\nCrypto payments are moving closer to routine checkout, driven largely by big businesses, according to a new survey from PayPal (NASDAQ:PYPL) and the National Cryptocurrency Association.\nThe survey found that about 40 percent of U.S. merchants now accept cryptocurrency, rising to 50% among companies with more than US$500 million in annual revenue.\nMerchants cited growing customer demand as the main driver, with most saying shoppers have asked about paying with crypto and expect to use it regularly.\nEase of use remains the key barrier: respondents said adoption would accelerate if crypto payments felt as simple as card transactions.\nPayPal said this demand is shaping product design, as firms look to integrate crypto without disrupting existing checkout flows.\nDon't forget to follow us @INN_Technology for real-time news updates!\nSecurities Disclosure: I, Meagen Seatter, hold no direct investment interest in any company mentioned in this article.\nSecurities Disclosure: I, Giann Liguid, hold no direct investment interest in any company mentioned in this article."
            },
            {
                "title": "SEC Says Tokenized Assets Are Securities First, Technology Second - Decrypt",
                "source": "Decrypt",
                "url": "https://decrypt.co/356268/sec-tokenized-assets-securities-first-technology-second?amp=1",
                "body": "4 min read\nPutting a security on a blockchain does not change its legal status, three SEC divisions said Wednesday, adding that tokenized assets face the same registration requirements as traditional instruments.\nIn a joint staff statement on Wednesday, the agency’s Divisions of Corporation Finance, Trading and Markets, and Investment Management said tokens that represent securities remain subject to federal securities laws.\n“The format in which a security is issued or the methods by which holders are recorded (e.g., on-chain vs. off-chain) does not affect application of the federal securities laws,” the statement reads.\nOn-chain transactions refer to securities transfers recorded directly on a blockchain or distributed ledger rather than through conventional database systems.\nIssuers can offer tokenized securities as a separate class or alongside traditional shares, according to the statement. If a tokenized security is of substantially similar character and confers substantially similar rights and privileges, it may be treated as the same class for certain purposes under federal securities laws, regardless of format.\nThe only difference, it said, is that “instead of maintaining the master securityholder file through conventional, off-chain database records, the issuer (or its agent) maintains the master securityholder file on one or more crypto networks.”\nThe statement comes as the federal agency has shifted its stance on crypto under the Trump administration, dropping or closing more than a dozen cases over the past year, including actions against major crypto companies that turned on whether tokens, staking products, or wallet infrastructure constituted unregistered securities.\nWhile the guidance reinforces that securities laws apply regardless of technological format, it’s the same legal framework underpinning many of the cases the agency had abandoned.\nBut Wednesday's statement sidesteps the harder question those cases have raised on whether crypto-native products like tokens and staking programs are deemed securities in the first place.\nEthereum illustrates the unresolved boundary that the statement leaves untouched. In 2024, Consensys revealed in an unredacted lawsuit that the SEC had, in March 2023, authorized an internal investigation into “Ethereum 2.0,” issuing a formal order that explicitly treated Ethereum as a security.\nThe probe, approved by the Commission the following month, stood in contrast to public comments from former SEC Chair Gary Gensler, who repeatedly declined to state whether the agency viewed ether as a security. The SEC later closed its Ethereum-related investigation without bringing enforcement action and declined to comment on its decision.\nThe SEC appears to have softened its general stance on crypto, but is still actively pursuing cases, such as those involving Bitcoin mining services, which it claims constitute securities offerings.\nDisclosure: Consensys is one of 22 investors in an editorially independent Decrypt.\nThe staff statement is “saying, very clearly, ‘tokenization changes nothing legally’—but the unspoken reality is that tokenization changes everything operationally, and the existing securities framework is not built for on-chain market structure,” Andrew Rossow, public affairs attorney and CEO of AR Media Consulting, told Decrypt.\nThe SEC staff’s statement also does not answer “whether on-chain ledgers can replace or legally equal traditional books and records,” Rossow explained.\n“Think of this from the overarching infrastructure. If a blockchain is the de facto cap table or bond register, but the SEC still requires transfer agents, registered custodians, and broker-dealers, then the blockchain is legally ornamental, not authoritative,” he added.\nWhile the SEC appears to be “enforcing ‘technology neutrality’ while relying on technology-specific assumptions,” Rossow said, “neutrality at the classification level masks non-neutrality at the operational level.”\nThe SEC’s staff stateme"
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "3.4143",
            "open": "126.8456",
            "close": "125.3237",
            "high": "128.1081",
            "low": "124.6938"
        },
        "market_summary": "ERROR: An unexpected error occurred during AI summary generation: 'choices'",
        "source_articles": [
            {
                "title": "WisdomTree Expands Tokenized Fund Offerings to Solana - thedefiant.io",
                "source": "thedefiant.io",
                "url": "https://thedefiant.io/news/defi/wisdomtree-expands-tokenized-fund-offerings-to-solana",
                "body": "WisdomTree Expands Tokenized Fund Offerings to Solana\nWisdomTree has announced the expansion of its tokenization ecosystem to the Solana blockchain, allowing both retail and institutional investors to access its tokenized funds through platforms like WisdomTree Connect and WisdomTree Prime. This strategic move is part of WisdomTree's broader multi-chain strategy aimed at enhancing access to Real World Assets (RWA).\nWisdomTree, a prominent asset management firm managing approximately $99.5 billion, is recognized for its innovative financial products, including exchange-traded funds (ETFs) and blockchain-enabled services\nThe expansion to Solana underscores the blockchain's high throughput and low transaction costs, which have positioned it as a formidable competitor to Ethereum.\n\"Bringing our full suite of tokenized funds to Solana reflects our continued focus on regulated real-world assets across the onchain ecosystem,\" stated Maredith Hannon, Head of Business Development, Digital Assets at WisdomTree.\nThe announcement of the Solana integration saw WisdomTree's stock price rise by 2.6% on the day, indicating market confidence in the firm's strategic direction. Nick Ducoff highlighted that the decision to utilize Solana showcases the demand for expanded access to tokenized RWAs and Solana's capacity to support this demand at scale.\nTokenized RWAs are increasingly bridging the gap between traditional and decentralized finance, encompassing assets like real estate, bonds, and commodities.\nThis expansion aligns with recent developments in the Solana ecosystem, such as the launch of Moonbirds' BIRB Token and Theo's yield-bearing tokenized gold, which further illustrate the blockchain's growing appeal for diverse financial products.\nThis article was generated with the assistance of AI workflows.\nRelated Posts\nAdvertisement\nGet an edge in Crypto with our free daily newsletter\nKnow what matters in Crypto and Web3 with The Defiant Daily newsletter, Mon to Fri\n90k+ Defiers informed every day. Unsubscribe anytime."
            },
            {
                "title": "Solana welcomes WisdomTree ecosystem in tokenization move - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/solana-welcomes-wisdomtree-ecosystem-tokenization-162040901.html",
                "body": "Solana is gaining another foothold in the fast-growing market for tokenized real-world assets, as WisdomTree expands its suite of regulated on-chain funds to the high-speed blockchain.\nWisdomTree, a New York Stock Exchange–listed asset manager, announced on Jan. 28 that it has integrated Solana as a supported blockchain network for its tokenized investment products, giving both institutional and retail investors native access to its funds through the WisdomTree Connect™ and WisdomTree Prime® platforms.\nRelated: What is tokenization? Explained\nThe expansion makes WisdomTree’s full lineup of tokenized funds—spanning money markets, equities, fixed income, alternatives, and asset allocation strategies—accessible to WisdomTree Connect and WisdomTree Prime users on the Solana network. Users can also use WisdomTree’s stablecoin conversion service, USDC and PYUSD.\nFor Solana, the integration underscores the network’s growing role as a venue for real-world asset tokenization, an area that has drawn increasing interest from asset managers seeking faster settlement, lower costs and programmable financial rails.\nMore News:\n-\nSolana Foundation teams up with asset management firm to expand in South Korea\n-\nMulticoin Capital's Kyle Samani asks BlackRock and Fidelity to choose Solana\n-\nTokenization will determine whether Solana can close the valuation gap with Ethereum, says analyst\nWhat WisdomTree-Solana integration means\nHere is what the collaboration means for WisdomTree Connect.\nAll existing WisdomTree tokenized funds can be minted directly on Solana. The blockchain is supported within the WisdomTree Connect B2B/B2B2C tokenization platform, including WisdomTree’s stablecoin conversion service. In addition, institutional clients can purchase, hold, and manage tokenized fund positions directly on Solana.\nAs far as WisdomTree Prime users are concerned, they can access regulated, yield-generating WisdomTree tokenized funds while remaining entirely onchain as per the direct on-ramp service.\nUsers can buy WisdomTree tokenized funds using USD sourced via USDC directly from Solana via WisdomTree’s stablecoin conversion service. WisdomTree Prime users can also off-ramp WisdomTree tokenized fund holdings to self-custody wallets on Solana and even interact with Solana-native apps and protocols.\nSolana Foundation's head of institutional growth, Nick Ducoff, said, “As real world assets on Solana surpass $1B, WisdomTree’s decision to expand their full suite of tokenized funds to Solana reflects the demand for expanded access to tokenized RWAs and Solana’s ability to support that demand at scale.\""
            },
            {
                "title": "Solana (SOL) Price Prediction Forecast 2026 2027 2028 – 2030 - InvestingHaven",
                "source": "InvestingHaven",
                "url": "https://investinghaven.com/solana-sol-price-predictions/",
                "body": "SOL Prediction Insights\n[ALERT – January 2026] – SOL is currently trading around123.44\nUSD. We predict that SOL could exceed $300 in 2026.\nWe are at a key turning point for SOL so let’s have a look if Solana can break above $300 in 2026 which would represent over 100% increase.\nRead on to understand if this is possible…\nSolana’s 2026 outlook is bullish. After a recent drop to circa $120, SOL shows signs of renewed momentum. A breakout above $190 could push prices toward $300. Analysts expect continued ecosystem growth, rising institutional demand, and ETF in-flows to strengthen Solana’s long-term price trajectory.\nInvesting Haven’s Solana price prediction 2026\nWe predict a high amount of volatility for Solana in 2026, our forecast is a trading range between $95 and $300 with the potential of a break above $300 in optimal conditions.\nHow much will your Solana be worth?\nBased on your prediction that the price of Solana will change at a rate of 8% every year, calculate your price prediction return on investment below.\nSOL time forecast:\n- Solana’s predicted window of bullish momentum is expected to start in January 2026 and continue into February.\n- InvestingHaven forecast for Solana suggests we may see a Bullish move in 2026 and there is still potential for ATH, Solana price may climb toward or exceed $300 before 2026\nSOL price predictions by 7 experts:\n- According to 7 reputable experts, Solana price predictions for 2026 range from $200 to $1,000, averaging $500.\n🔑 Key Takeaways – Solana (SOL) Price Prediction 2026\n- Forecast range for 2026: $111 – $450, with potential breakout beyond $300 if resistance near $260 is cleared.\n- Average analyst target: Around $425 based on expert Solana price forecasts.\n- Long-term outlook: Upside potential toward $1,000–$1,250 by 2028, driven by DeFi/NFT expansion, tokenization, and ETF speculation.\n- Technical setup: Bullish patterns like a “cup and handle” and strong support near $120 – $155 suggest continued upside momentum.\n- Institutional confidence: Solana’s treasury holds over $530 million in SOL, highlighting strong long-term belief from major investors.\nOverall outlook: The Solana price prediction for 2026 remains bullish, supported by network growth, developer expansion, and growing institutional interest, positioning SOL as one of the top performers among smart contract platforms.\n💡 How to Buy Solana (SOL) Safely\nThe easiest way to buy Solana is through a trusted, regulated crypto exchange. For a fast and secure experience, we recommend eToro — it lets you purchase SOL instantly using a debit or credit card.\nOther reliable platforms include Binance, Coinbase, Kraken, and Bitstamp, but eToro stands out for simplicity, global availability, and transparent fees.\nSolana price predictions overview\n🔔 Join thousands of investors acting on premium crypto alerts for real, actionable insights that move before the market —\nget access here.\nSolana Price Forecast for 2026\nSolana chart – SOL is working on a gigantic reversal. Long term, this type of pattern tends to be very bullish. The recent drop should be able to unleash bullish energy.\nSolana price forecast 2026 – In 2026, Solana’s bullish cup and handle pattern is forecasted to resolve higher. SOL confirmed our predicted support around $111. SOL max price targets for 2026 are in the $255 to $480 range.\nJanuary 2026 – Solana price prediction: SOL is bouncing from strong support levels. The SOL price forecast remains bullish while holding above key support between $120-$155. A break above $200 followed by $260 could trigger a move toward $300 in 2026. For investors asking “Will Solana go up?”, a confirmed breakout would signal the next bullish phase.\nSolana price predictions for 2026:\nGO PREMIUM – Receive crypto market analysis and token tips >>\nWhat are reputable experts predicting for 2026?\nSeven reputable experts have provided Solana price predictions for 2026, ranging from $220 to $1,000, with an average forecast of $425:\n- Pantera Capital: "
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "295.600",
            "open": "48,987.050",
            "close": "48,975.930",
            "high": "49,145.900",
            "low": "48,850.300"
        },
        "market_summary": "ERROR: An unexpected error occurred during AI summary generation: 'choices'",
        "source_articles": [
            {
                "title": "Futures: Meta Jumps, Microsoft Skids; Tesla CapEx To Soar - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-tesla-meta-microsoft-earnings/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #0cf2298a-fcda-11f0-ac5b-ab849211089a"
            },
            {
                "title": "Markets News, Jan. 28, 2026: Stock Indexes Close Little Changed After Fed Holds Interest Rates Steady, Ahead of Big Tech Earnings - Investopedia",
                "source": "Investopedia",
                "url": "https://www.investopedia.com/dow-jones-today-01282026-11894050",
                "body": "Major equities indexes ended little changed Wednesday after the Federal Reserve kept interest rates steady, as expected. Earlier in the session, the S&P 500 hit the 7000 level for the first time.\nThe tech-heavy Nasdaq finished up 0.3%, while the blue-chip Dow Jones Industrial Average and benchmark S&P 500 ended fractionally higher and lower, respectively, after the Federal Open Market Committee voted 10-2 to leave interest rates unchanged at a range of 3% to 3.75%. (Read our live coverage here.)\nAt a press conference following the central bank's decision, outgoing Fed Chair Jerome Powell said, \"We still have some tension between employment and inflation, but it's less than it was.\" Powell, who has faced heavy criticism from President Donald Trump for failing to cut rates, was asked by a reporter what advice he'd give his successor and said, \"Stay out of elected politics.\"\nEarlier Wednesday, the S&P 500 hit a new all-time high for a second straight session, while the Nasdaq approached its record set on Oct. 29 before pulling back.\nThe yield on the 10-year Treasury—which impacts interest rates on a variety of consumer loans including mortgages—was little changed from Tuesday's close of 4.25% at 4 p.m. ET.\nSafe-haven gold futures surpassed $5,300 an ounce early Wednesday and recently were up about 6% to above $5,385. Silver futures were surged more than 10% to above $117 an ounce, near their record high set Monday.\nThe U.S. dollar index, which tracks the value of the greenback against a basket of global currencies, was slightly higher at 96.39 after reaching more than four-year lows yesterday. Bitcoin was slightly higher on the day at around $89,400. West Texas Intermediate crude futures, the U.S. benchmark, were up 1.5% to around $63.35 a barrel.\nInvestors were gearing up for quarterly results from megacap tech firms Microsoft (MSFT), Meta Platforms (META), and Tesla (TSLA) after the closing bell. (Read our live coverage here.) Shares of Microsoft finished slightly higher, while Meta and Tesla ticked lower. Shares of Apple (AAPL), which is set to issue its earnings report after the close Thursday, were down 0.7%.\nShares of Nvidia (NVDA), the world's most valuable public company, advanced 1.6% on reports that Beijing had approved sales of its H200 chips to China. Amazon (AMZN) shares slipped 0.7% after the company announced it was laying off 16,000 workers just three months after it eliminated about 14,000 positions.\nIn post-earnings moves, Seagate Technology Holdings (STX), Texas Instruments (TXN), and AT&T (T) jumped 19%, 10%, and 4.7%, respectively. Starbucks (SBUX) erased earlier gains to slip 0.6%.\nUnitedHealth (UNH) and Humana (HUM) shares rose 4% and fell 6.7%, respectively, after plummeting more than 20% each yesterday following a proposal from the Centers for Medicare and Medicaid Services that would raise payments to insurers less than expected in 2027.\nMeta, Microsoft, Tesla Kick Off Mag 7 Earnings Season\nThree of the world's most valuable companies just reported earnings, providing important clues on the state of the AI boom.\nMeta Platforms (META), Microsoft (MSFT) and Tesla (TSLA) issued their quarterly results after the stock market closed Wednesday. They are the first members of the Magnificent Seven group of major technology companies to report in the current earnings cycle.\nThe Mag 7 have an outsized influence on major U.S. equity indexes, together accounting for about a third of the S&P 500’s weighting. Even if you don’t hold the stocks individually, their moves could still affect your portfolio if you’re exposed to funds that track them.\nMeta shares were up 7% in recent after-hours trading, while Tesla shares added about 3% as the companies' results topped Wall Street expectations. Microsoft stock was down about 7%, despite beating analysts' estimates on the top and bottom lines, as slowing growth in its cloud business weighed on sentiment.\n\"Tonight's a big night for AI if people are positive on AI,\" Gene Munst"
            },
            {
                "title": "Stock Market Today Updates: Dow Jones, S&P 500, Nasdaq; Indices Mixed Ahead of Fed, Tech Earnings - The Sunday Guardian",
                "source": "The Sunday Guardian",
                "url": "https://sundayguardianlive.com/business/stock-market-today-updates-dow-jones-sp-500-nasdaq-indices-mixed-ahead-of-fed-tech-earnings-166982/",
                "body": "Global markets presented a mixed picture on Wednesday, January 28, 2026, as U.S. indices diverged ahead of major economic news. The tech-heavy Nasdaq Composite and the S&P 500, which briefly touched the historic 7,000-point barrier for the first time, traded slightly lower, while the Dow Jones Industrial Average slightly up. The day’s muted, split action highlights a market in a holding pattern, cautiously awaiting the U.S. Federal Reserve’s interest rate decision and a slate of key technology company earnings reports. Meanwhile, Indian markets rallied strongly for a second day, propelled by optimism from a new trade agreement with the European Union.\nU.S. Market Snapshot (as of Jan 28)\nS&P 500: A Historic Touch at 7,000\nThe broader S&P 500 index briefly crossed the historic 7,000-point threshold for the first time in history, reaching an intraday high of 7,002.28. This landmark moment underscores the market’s underlying strength and bullish long-term sentiment. But by the middle of the session, the index had lost those gains and was trading little down. Its behavior serves as a gauge for a market that is hopeful but reluctant to commit prior to significant news events, falling between the Dow’s gain and the Nasdaq’s slight decline.\nDow Jones: A Modest Rebound\nThe Dow Jones Industrial Average rose 0.08%, marking a modest recovery from its previous session’s 0.86% decline. The blue-chip index’s performance suggests a degree of stability and selective buying in more traditional industrial and financial sectors. This recovery suggests that, as investors reevaluate risks ahead of the Fed’s speech, the steep, healthcare-driven sell-off from the previous day—led by stocks like UnitedHealth Group—may have found short-term support.\nNasdaq: Tech Pauses Before Big Earnings\nThe Nasdaq Composite dipped slightly by 0.04%. This halt comes as investors prepare for earnings releases from major giants including Microsoft, Meta Platforms, and Tesla after the market closes, following a robust 0.90% increase in the previous session. While the larger tech sector seemed to consolidate its gains while awaiting new catalysts from corporate results and the Fed’s direction, the early session was bolstered by strength in semiconductor stocks following favorable reports from companies like Texas Instruments.\nWhat’s Driving the Cautious, Split Market?\nThe mixed signals from the major U.S. indices point to a market carefully balancing several powerful forces:\nThe Federal Reserve in Focus: The dominant theme for the day is the upcoming Federal Open Market Committee (FOMC) interest rate decision. Investors are universally on hold, parsing every word for clues on the future path of inflation and rate cuts. This event has the power to redefine market direction for weeks to come.\nEarnings Season Crosscurrents: Early positive results from chipmakers fueled initial optimism, particularly around AI-related investments. But for the mega-cap tech reports that are due after the bell, the market is currently in “wait-and-see” mode. While disappointments could lead to a wider decline, strong results could rekindle the rise.\nA Stable Geopolitical Setting: Unlike the last session when U.S.-Iran tensions clearly drove markets (lifting gold to record highs), today’s trading suggests those worries have eased. Other stories now dominate as investor focus has decisively shifted toward company fundamentals and domestic monetary policy rather than global political flashpoints.\nIndian Markets: Strong Rally on Trade Deal Optimism\nIndian markets continued their upward path, clearly outperforming global peers for a second straight day today. The rally was firmly driven by ongoing optimism around the newly finalized India-EU Free Trade Agreement.\nIndex Performance Summary (as of Market Close, Jan 28)"
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "58.950",
            "open": "10,161.710",
            "close": "10,199.160",
            "high": "10,201.660",
            "low": "10,142.710"
        },
        "market_summary": "### UK100 Market Briefing\n\n* **Key Drivers:** The Federal Reserve's decision to keep interest rates steady between **3.5%** and **3.75%** may influence the UK100, as global market sentiment reacts to the **hawkish** stance amidst **inflation** concerns and **US economic** stability.\n* **Price Action:** The UK100 may experience **volatility** due to the **Federal Reserve's** decision, potentially breaking below the key psychological level of **7,000**, showing **bearish** momentum.\n* **Technical Outlook:** Immediate support is near the 50-day moving average at **6,900**, with resistance at **7,100**.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "3 UK Penny Stocks With Market Caps Over £300M - Yahoo Finance UK",
                "source": "Yahoo Finance UK",
                "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_6b87b17a-4d64-4287-a693-9c540cf46db8",
                "body": "Your privacy is important to us\nYahoo is part of the Yahoo family of brands.\nWhen you use our sites and apps, we use cookies to:\n- provide our sites and apps to you\n- authenticate users, apply security measures, and prevent spam and abuse, and\n- measure your use of our sites and apps\nYour privacy choices\nIf you click '\nAccept all', we and\nour partners, including 245 who are part of the IAB Transparency & Consent Framework, will also store and / or access information on a device (in other words, use cookies) and use precise geolocation data and other personal data such as\ntechnical identifiers and browsing and search data, for analytics, personalised advertising and content, advertising and content measurement, and audience research and services development.\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\nIf you would like to customise your choices, click 'Manage privacy settings'.\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy and Cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our Privacy Policy and Cookie Policy."
            },
            {
                "title": "Fed faces potential backlash from Trump by maintaining current interest rates - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605172896",
                "body": "The Federal Reserve has opted to keep interest rates steady, maintaining the range between 3.5% and 3.75%. This marks the first time since July that rates have not been adjusted, despite significant pressure from President Donald Trump to lower borrowing costs further.\nThis decision follows a series of rate reductions in September, October, and December of the previous year. The move is expected to frustrate President Trump, who has repeatedly criticized Fed Chair Jerome Powell for not cutting rates more aggressively, even suggesting that rates should be as low as 1%.\nLast month, the Federal Open Market Committee (FOMC) reduced rates to their lowest level in three years, responding to concerns about rising unemployment and a softening labor market. On Wednesday, Jerome Powell noted that while inflation remains somewhat high, the U.S. economy is fundamentally strong and unemployment levels are stabilizing. However, he cautioned that the housing sector continues to struggle.\nOngoing disputes between President Trump and Chair Powell have raised concerns about the Federal Reserve’s independence, especially after the President’s public criticisms. Earlier this month, the Department of Justice launched a criminal investigation into Powell, a move he described as an attempt to undermine the central bank’s autonomy. The investigation centers on a $2.5 billion renovation of the Fed’s headquarters, which has exceeded its budget.\nPowell asserted that the real motivation behind the probe is the Fed’s refusal to set interest rates according to the President’s preferences, warning of the dangers of political interference. Central bankers worldwide, along with former Fed leaders and Treasury secretaries, have condemned the investigation.\nFormer Bank of England Governor Lord King recently warned that President Trump’s attacks on the Fed could push the U.S. economy toward a severe recession. He emphasized the risks of dismissing inflation concerns, noting that such complacency can lead to persistent inflation that may only be resolved through a deep economic downturn.\nThe investigation into Powell follows Trump’s attempt to remove Fed Governor Lisa Cook over unsubstantiated allegations of mortgage fraud, a case now before the Supreme Court. Powell described this legal battle as potentially the most significant in the Fed’s 113-year history.\nPowell defended his decision to appear alongside Lisa Cook at the Supreme Court, despite criticism from Treasury Secretary Scott Bessent. Powell explained that he felt it would be difficult to justify not attending such a pivotal hearing.\nWith Powell set to step down in May, he is expected to oversee two more interest rate decisions before a new chair is appointed by President Trump.\nMarket Response:\nWhen asked for guidance for his successor, Powell advised, “Stay out of politics. Don’t get drawn into political disputes.”\nPowell noted that American households are tightening their budgets due to affordability challenges. Retailers serving lower-income customers report that consumers are opting for less expensive brands and reducing overall spending. Powell emphasized the Fed’s awareness of these concerns.\nPowell stressed the importance of maintaining the Federal Reserve’s independence, warning that losing public trust in the institution’s impartiality would be difficult to recover. He reaffirmed his and his colleagues’ dedication to this principle.\nFollowing the Fed’s announcement, U.S. stock indices experienced modest declines. The S&P 500 slipped 0.1% to 6,970 points after surpassing 7,000 earlier, while the Dow Jones Industrial Average also edged down. In contrast, the Nasdaq Composite rose 0.3%.\nPowell highlighted the urgent need to address the U.S. federal budget deficit, noting that running large deficits during periods of full employment is unsustainable and requires prompt action from policymakers.\nThere was broad agreement within the FOMC to keep rates unchanged, though Powell acknowledged ongoing t"
            },
            {
                "title": "Fed risks Trump’s ire by holding rates – latest updates - The Telegraph",
                "source": "The Telegraph",
                "url": "https://www.telegraph.co.uk/business/2026/01/28/us-dollar-trump-pound-euro-yen-gold-ftse-100-markets/",
                "body": "The Federal Reserve has held interest rates for the first time since July despite mounting pressure from Donald Trump to slash borrowing costs.\nRates were held at the 3.5pc to 3.75pc range, as expected, following a succession of cuts at meetings in September, October and December last year.\nThe decision to keep rates steady is likely to enrage Mr Trump, who has repeatedly called Fed chairman Jerome Powell a “numbskull”, a “stubborn moron” and “Mr Too Late” for not slashing borrowing costs, which Mr Trump has said should be as low as 1pc.\nLast month, the Federal Open Markets Committee voted to lower rates to a three-year low - to 3.5pc to 3.75pc - in response to fears about rising unemployment and a weaker jobs market.\nMr Powell on Wednesday said that although inflation remains “somewhat elevated”, the US economy is on a “strong footing” and unemployment was stabilising.\nHowever, he warned that the housing market “remained weak”.\nRising tensions between Mr Trump against Mr Powell have stoked fears over the Fed’s independence after stringent attacks by the President.\nEarlier this month, the Department of Justice opened a criminal investigation into Mr Powell in an unprecedented move that the Fed chair said was a “pretext” to try to restrict the central bank’s independence.\nUS prosecutors served the Fed with grand jury subpoenas over the central bank’s $2.5bn renovation of its headquarters, which has run over budget.\nThe Fed chair said that the real reason for the investigation was because the central bank was not setting interest rates “following the preferences of the President” and warned of “political pressure or intimidation”.\nCentral bank governors around the world as well as former Fed chief and Treasury secretaries raced to condemn the investigation.\nLord King, the former Bank of England Governor, on Wednesday suggested that Mr Trump’s attacks on the Fed were putting the US economy at risk of a “deep recession”.\n“I do think that the current situation is a challenge for central banks everywhere, because you see it in the remarks being made in the US now [like] ‘We don’t have an inflation problem’ [even though] inflation is above their target,” he told a Centre for Policy Studies event.\n“This is the route by which inflation creeps up gradually, and then you find yourself with a problem which only a deep recession can solve.”\nThe investigation into Mr Powell comes after Mr Trump tried to sack Fed governor Lisa Cook over unproven allegations of mortgage fraud, a move that she is contesting in the Supreme Court.\nSpeaking on Wednesday, Mr Powell said that the court battle “is perhaps the most important legal case in the Fed’s 113-year history”.\nHe defended his decision to appear with Ms Cook at the Supreme Court last week after being criticised by Treasury secretary Scott Bessent for making a “mistake” with his appearance.\n“I thought about it, I thought it might be hard to explain why I didn’t attend,” Mr Powell said.\nMr Powell is due to step down from his position in May, meaning he is likely to oversee two more rate decisions before a new Fed chairman is named by Mr Trump."
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "241.750",
            "open": "24,889.930",
            "close": "24,861.930",
            "high": "24,952.930",
            "low": "24,711.180"
        },
        "market_summary": "ERROR: An unexpected error occurred during AI summary generation: 'choices'",
        "source_articles": [
            {
                "title": "DAX Edges Higher Ahead of Fed Decision - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/te_news:520663:0-dax-edges-higher-ahead-of-fed-decision/",
                "body": "DAX Edges Higher Ahead of Fed Decision\nFrankfurt’s DAX 40 rose 0.3% to 24,975 points on Wednesday, with investors positioning ahead of the US Federal Reserve’s policy decision later today and watching closely for any clues on the timing of future rate cuts.\nTechnology stocks led the advance.\nInfineon jumped more than 5% to top the index, while Siemens added around 1%, supported by ASML’s stronger-than-expected earnings report.\nMeanwhile, markets also weighed comments from ECB policymaker Martin Kocher, who warned that further euro strength could push the central bank to resume interest rate cuts.\nElsewhere, investors continued to assess the potential impact of the EU–India trade deal, with automakers and companies tied to chemicals and electrical machinery seen as the likely main beneficiaries."
            },
            {
                "title": "DAX Crash Incoming Or Breakout Opportunity? What 2026 Is Really Signaling For German Stocks - AD HOC NEWS",
                "source": "AD HOC NEWS",
                "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/dax-crash-incoming-or-breakout-opportunity-what-2026-is-really-signaling/68528028",
                "body": "DAX Crash Incoming Or Breakout Opportunity? What 2026 Is Really Signaling For German Stocks\n28.01.2026 - 13:44:35Get the professional edge. Since 2005, the 'trading-notes' market letter has delivered reliable trading recommendations – three times a week, directly to your inbox. 100% free. 100% expert knowledge. Simply enter your email address and never miss a top opportunity again. Sign up for free now\nVibe Check: The DAX 40 is once again the drama queen of Europe – a classic tug-of-war between cautious bears and comeback-hungry bulls. Instead of a clean one-way move, the index is locked in a choppy, emotional phase: pullbacks get bought, breakouts get faded, and every new macro headline from Frankfurt, Berlin, or Washington can flip sentiment in minutes. This is not a sleepy, low-volatility environment; this is where active traders live.\nRight now, the German benchmark is hovering in a crucial zone, where previous highs, psychological round-number marks, and moving average clusters all collide. That creates a technical battlefield: dip buyers see a potential launchpad for the next leg higher, while risk-off players are watching for a failed breakout that could morph into a deeper correction. In short: it is not a random range, it is a decision zone.\nThe Story: To understand the DAX 40 in early 2026, you have to zoom out beyond just candles and intraday spikes. The real driver is the macro cocktail: ECB policy, the euro versus the dollar, energy prices, and Germany’s industrial pulse.\n1. ECB and Interest Rate Drama\nThe European Central Bank is still walking a tightrope: fight the last remnants of inflation without suffocating a fragile recovery. Markets are obsessed with every word coming from ECB officials, especially any hint about the timing and pace of rate cuts. If the ECB stays hawkish for longer than expected, growth-sensitive sectors like autos, chemicals, and cyclical industrials feel the pressure. If the tone softens and the path toward easier policy becomes clearer, you can expect a relief rally in European blue chips and high-beta names.\nFor DAX traders, ECB meetings are volatility events. Hawkish surprises typically trigger short-term selloffs, with financials and exporters wobbling as bond yields and FX expectations shift. A more dovish tilt, combined with an improving growth narrative, tends to support risk-on rotations into cyclical German names.\n2. Euro vs. Dollar: The FX Side-Quest\nThe DAX is packed with exporters: automakers, industrials, and global manufacturing champions that live and die by foreign demand and the currency rate. A weaker euro versus the dollar often acts as a tailwind for earnings, making German exports more competitive abroad. A stronger euro, on the other hand, can compress margins and cool enthusiasm for export-heavy stocks.\nCurrent FX action is a balancing act. The euro is not in a wild freefall, but it is also far from a one-way moonshot. For traders, that means the currency is more of a tactical factor than a single big trend. Sudden FX spikes around US data or Fed communication can still hit DAX futures quickly, so intraday traders watch both the euro-dollar chart and the index side-by-side.\n3. Energy Prices and the German Model\nGermany’s economic narrative over the last years has been heavily shaped by energy costs and supply security. While the worst-case energy shock scenario is off the table for now, prices remain a structural wildcard. Elevated or unstable energy prices hit heavy industry first: chemicals, steel, manufacturing – exactly the backbone that traditionally powered the DAX.\nIf energy markets calm down and stabilize at bearable levels, that removes a major overhang and supports a slow grind higher in industrials. If energy flares up again due to geopolitical tensions or supply disruptions, you can expect renewed pressure on energy-intensive sectors and a broader risk-off tone in the index.\n4. Manufacturing, Autos, and Recession Fears\nWatch the German PMI data and indu"
            },
            {
                "title": "DAX Breakout Or Bull Trap? Is Germany’s Flagship Index Hiding More Risk Than Opportunity Right Now - AD HOC NEWS",
                "source": "AD HOC NEWS",
                "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/dax-breakout-or-bull-trap-is-germany-s-flagship-index-hiding-more-risk/68527102",
                "body": "DAX Breakout Or Bull Trap? Is Germany’s Flagship Index Hiding More Risk Than Opportunity Right Now?\n28.01.2026 - 08:33:25Get the professional edge. Since 2005, the 'trading-notes' market letter has delivered reliable trading recommendations – three times a week, directly to your inbox. 100% free. 100% expert knowledge. Simply enter your email address and never miss a top opportunity again. Sign up for free now\nVibe Check: The DAX 40 is stuck in a tense equilibrium: not a euphoric melt-up, not a panic crash, but a nervous, choppy range where every macro headline becomes an excuse for sharp intraday spikes. German bulls are trying to defend recent gains, while bears are circling, betting that Europe’s sluggish growth and fragile industry will eventually punch a hole in the optimism.\nThis is classic late?cycle behaviour: investors are still buying quality German blue chips on dips, yet nobody wants to be the last one holding the bag if a global risk?off wave hits. Volatility is lurking just beneath the surface, and that is exactly where active traders thrive.\nThe Story: To understand the current DAX setup, you have to zoom out from the price action and look at the macro and narrative mix driving flows into and out of Germany.\n1. ECB: Higher For Longer, Or Quiet Pivot?\nAll eyes remain on the European Central Bank. Recent communication from Frankfurt has tried to walk a tightrope: acknowledge that inflation has cooled from its peak, but also stress that underlying price pressures and wage dynamics are still not fully tamed. Markets are constantly trying to front?run a dovish pivot, but the ECB knows that cutting too early could reignite inflation, especially with any new energy or geopolitical shock.\nFor the DAX 40, the ECB’s tone is everything. When traders smell easier monetary policy ahead, rate?sensitive sectors such as industrials, autos, and real estate see renewed interest and dip buyers step in. When the ECB leans hawkish, the instant reaction tends to be risk?off: bank stocks can hold up for a while, but cyclical exporters get hit, and the index feels heavy.\n2. German Economy: Industrial Hangover, But Not Dead\nGermany’s macro data is still painting a fragile picture. Manufacturing surveys have hovered in cautious territory, export orders are inconsistent, and energy costs remain a structural headache after the end of cheap Russian gas. At the same time, the narrative of a “permanent manufacturing collapse” looks exaggerated.\nWe are seeing a messy, multi?speed transition: some traditional heavy industry is under pressure, but technology?driven segments, automation, and high?value engineering are still globally competitive. That nuance matters for the DAX, which is packed with world?class industrial and engineering names. When global risk appetite improves, international investors often use the DAX as a pure play on global trade and industrial recovery.\n3. Euro vs. Dollar: FX Headwinds Turned Tactical Tailwinds?\nThe euro’s moves against the US dollar are another hidden driver of DAX sentiment. A softer euro typically boosts German exporters’ competitiveness and can support earnings translated back into euros, while a strong euro tightens financial conditions and squeezes margins.\nRight now, the FX backdrop is more balanced than in the peak-energy-crisis phase. The euro is no longer in free?fall, but it is also not aggressively rallying. This keeps things nuanced: currency risk is still there, but not screaming in one direction. For equity traders, that means the euro is more of a tactical theme than a dominant trend driver. Sudden spikes in EUR/USD after US data or Fed commentary, however, still cause fast, algo-driven swings in the DAX.\n4. Sector Stories: Autos, Banks, and the Energy Overhang\nAutos: German automakers are under constant scrutiny. Slowing EV demand in some regions, price wars, Chinese competition, and regulatory pressure all hang over the sector. Yet on the flip side, auto names are deeply embedded in global "
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "350.000",
            "open": "25,998.860",
            "close": "26,142.150",
            "high": "26,224.230",
            "low": "25,874.230"
        },
        "market_summary": "ERROR: An unexpected error occurred during AI summary generation: 'choices'",
        "source_articles": [
            {
                "title": "Stock market today: S&P 500 slips from record as Fed stands pat, Nasdaq rises before Big Tech earnings flurry - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/live/stock-market-today-sp-500-slips-from-record-as-fed-stands-pat-nasdaq-rises-before-big-tech-earnings-flurry-210119313.html",
                "body": "Stock market today: S&P 500 slips from record as Fed stands pat, Nasdaq rises before Big Tech earnings flurry\nUS stocks were little changed on Wednesday after the Federal Reserve held interest rates unchanged in its first policy decision of the year. Wall Street also braced for earnings from megacap tech companies in a day that saw the S&P 500 (^GSPC) vault briefly over the 7,000 mark for the first time.\nThe S&P 500 slipped fractionally from its record. The tech-heavy Nasdaq Composite (^IXIC) ticked up 0.2%, while the Dow Jones Industrial Average (^DJI) was little changed.\n(^DJI)\nThe Fed's first interest-rate decision of 2026 came and went as expected, as the central bank kept rates unchanged in a range of 3.5% to 3.75%, in a 10-2 decision. Governors Chris Waller and Stephen Miran dissented, voted in favor of a 25 basis point cut.\nThe spotlight now turns to Chair Jerome Powell’s press conference comments for clues about future cuts. Ahead of Wednesday’s decision, markets were pricing in two quarter-point rate reductions by the end of 2026, according to CME FedWatch.\nThe recent slump in the dollar (DX-Y.NYB) raised questions over the potential risk of an economic downturn. The US currency rose Wednesday, after sinking to its lowest level since 2022 on Tuesday after President Trump brushed off the deepest drop in the dollar since his sweeping tariffs launched.\nThe rate decision also comes amid a period of political tension for the central bank, as the Trump administration in recent weeks opened a criminal investigation against Powell over his Senate testimony about renovations of the central bank’s headquarters. Markets are also watching for Trump to announce Powell's successor, which Trump has said could happen any day now.\nMeanwhile, techs are in the spotlight again as a surprise record surge in orders for ASML's (ASML) chipmaking machines stoked optimism for a long-lasting AI boom. Shares in ASML turned lower, though the spirits boosted AI bellwether Nvidia (NVDA) and TSMC (TSM), which rely on the Dutch company's gear to produce chips.\nThe developments have turned up focus on earnings from Microsoft (MSFT) and Meta Platforms (META), which have invested heavily in an AI-focused data center buildout underpinned by those chips. The tech giants are scheduled to report results after the market close, alongside fellow \"Magnificent Seven\" megacap Tesla (TSLA). The reports set the stage for Apple's (AAPL) quarterly update on Thursday.\nLIVE 27 updates"
            },
            {
                "title": "S&P 500 futures are little changed as investors weigh tech giants' earnings: Live updates - CNBC",
                "source": "CNBC",
                "url": "https://www.cnbc.com/2026/01/28/stock-market-today-live-updates.html",
                "body": "S&P 500 futures were little changed Wednesday evening. Traders also mulled over the release of earnings reports from major tech firms and the latest Federal Reserve rate decision.\nFutures linked to the broad market index added 0.1%. Dow Jones Industrial Average futures tumbled 55 points, or 0.1%. Nasdaq 100 futures were up 0.3%.\nSpot gold surpassed the $5,500 mark in overnight trading, and it was last up nearly 3%. The yellow metal, long viewed as a safety asset, has been surging to new records as the U.S. dollar continues to slide.\nIn extended trading, Meta Platforms added 7% after the Facebook parent gave a stronger-than-expected first-quarter sales forecast. Microsoft shares fell 6% as cloud growth slowed in the fiscal second quarter and the company gave soft guidance on operating margin in the fiscal third quarter. Tesla shares advanced 1% after the company's fourth-quarter results beat expectations.\nIn Wednesday's regular session, the S&P 500 briefly topped the 7,000 threshold, but ultimately ended the day little changed after the Fed kept its benchmark interest rate at a range of 3.5% to 3.75%. The 30-stock Dow added just 12 points. The tech-heavy Nasdaq Composite climbed about 0.2%, aided by advances in Nvidia and Micron Technology.\nIn its post-meeting statement, the policy-setting Federal Open Market Committee said that indicators are suggesting that \"economic activity has been expanding at a solid pace\" and that the unemployment rate \"has shown some signs of stabilization.\" Still, fed funds futures trading are still pricing in two quarter percentage point cuts by the end of 2026, according to the CME FedWatch Tool.\n\"The Fed statement was largely as expected, and markets tend to move on surprises,\" said Sameer Samana, Wells Fargo Investment Institute head of global equities and real assets. \"We are looking to earnings and economic data to drive the next leg higher, but also would not be surprised to see some midterm-elections related volatility in 2026.\"\nInvestors are awaiting Apple's fiscal first quarter earnings report on Thursday after the bell. Mastercard, Caterpillar and Lockheed Martin are also set to post results.\nOn the economic front, traders will be watching for weekly jobless claims, durable orders and wholesale inventories."
            },
            {
                "title": "Stock Market Today: Nasdaq Rises As Powell Sees Improving Outlook; Tesla Surges (Live Coverage) - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-sp500-nasdaq-federal-reserve-powell-tesla-earnings-tsla-stock/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #81748798-fcda-11f0-8c58-dab2dde49673"
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "38.000",
            "open": "6,992.100",
            "close": "6,994.230",
            "high": "6,996.230",
            "low": "6,958.230"
        },
        "market_summary": "ERROR: An unexpected error occurred during AI summary generation: 'choices'",
        "source_articles": [
            {
                "title": "Tesla discontinues Model X and S vehicles as Elon Musk pivots to robotics - The Guardian",
                "source": "The Guardian",
                "url": "https://www.theguardian.com/technology/2026/jan/28/tesla-q4-earnings-estimates-elon-musk",
                "body": "In the clearest sign yet that Tesla is pivoting away from its electric car business, CEO Elon Musk announced on Wednesday’s investor call that the company would discontinue production of its Model X SUV and Model S full-size sedan.\n“It’s time to basically bring the Model S and X programs to an end,” Musk said. “We expect to wind down S and X production next quarter.”\nThe model S and X factory in Fremont, California would be converted to produce Tesla’s upcoming Optimus robot, Musk said.\nTesla’s most recent quarterly earnings report showed slumping vehicle sales and declining revenue as Musk pins the company’s futures on AI and robotics. The earnings report described Tesla’s chaotic year as a “transition from a hardware-centric business to a physical AI company”.\nThe high hopes and grand possibilities Musk has outlined helped Tesla beat Wall Street expectations, even as the company reported its first-ever decline in total revenue – losing 3% year-over-year. Tesla reported fourth quarter earnings per share of $0.50 after the market close on Wednesday, exceeding the $0.45 that Wall Street expected. Its reported revenue was $24.9bn, beating analyst estimates of $24.79bn.\nThe company’s total automotive revenues dropped 11% year-over-year in 2025. Earlier this month, Tesla reported its fourth quarter vehicle delivery numbers, which measure buyers’ receipt of their cars rather than dealership sales, revealing a 16% decline year-over-year, hurt especially by cratering interest in Europe. The company’s stock rose as high as 4% in after-hours trading, before tapering off its gains.\nAs Tesla’s vehicle sales have fallen over the past year, Musk and the company have emphasized a shift towards AI-driven projects such as Optimus consumer robots and self-driving Robotaxis. All of these technologies remain unproven and not widely available to the public, let alone profitable, but they have allowed Musk to claim the company will see unparalleled future growth without much to show for it today.\nMusk has stated that Optimus would be the “biggest product of all time” and said that the robots, along with autonomous vehicles, would usher in “a world where there is no poverty”. Tesla plans to start production of Optimus before the end of 2026, according to the earnings report. Musk has said the company will sell the robot to the public in 2027. Tesla also revealed that earlier this month it agreed to invest $2bn into xAI, Musk’s artificial intelligence company.\nTesla’s chief financial officer, Vaibhav Taneja, stated on the earnings call that the company’s capital expenditure would be $20bn, an immense amount that is vastly more than what many analysts estimated.\nAlthough Tesla’s stock price plummeted during Musk’s tumultuous time in government last year, it rebounded to its highest price ever in December amid ongoing market frenzy for AI investments and Musk’s promise of building a “robot army”. The previous month, Tesla shareholders also approved a pay package for Musk that could award him up to a trillion dollars in compensation if the company meets a series of financial milestones.\nWhile Tesla has touted its upcoming projects as evidence of upcoming success, some of its formerly futuristic products have struggled. The company’s Cybertruck, which Musk said earlier this month was “the best vehicle Tesla has ever made”, saw a drastic 48% decline in sales last year, according to Kelley Blue Book reports.\nTesla has faced increasing competition from other electric vehicles companies, primarily China’s BYD, which overtook Tesla last year as the world’s largest electric carmaker. BYD’s sales grew by 28% in 2025, as it offered consumers in a number of markets less expensive alternatives to Tesla’s models."
            },
            {
                "title": "Tesla CEO Elon Musk to stop production of two models, S and X; convert Fremont, California factory to produce robots - abc7news.com",
                "source": "abc7news.com",
                "url": "https://abc7news.com/post/tesla-ceo-elon-musk-stop-production-models-convert-fremont-california-factory-produce-robots/18495745/",
                "body": "SAN FRANCISCO -- Tesla's annual profit plunged to its lowest level since the pandemic five years ago as it lost the title of the world's biggest electric vehicle maker to a Chinese rival and boycotts hammered sales.\nThe EV company run by Elon Musk reported Wednesday that net income last year dropped 46% to $3.8 billion. It was the second year in a row of steep declines. The drop came despite the introduction of cheaper models and Musk's promise to remain laser-focused on the company after a foray into U.S politics.\nStill, Tesla investors have kept the faith in Musk. The stock is up 9% in the past year.\nMusk has been urging investors to focus less on car sales and more on what he considers a bright new future of robotaxis ferrying millions in cars without drivers, or even steering wheels, and robots watering plants and taking care of elderly parents.\nOn a conference call, Musk said Tesla would be closing down production of two models, S and X, in the second quarter this year and converting a Fremont, California, factory to produce its Optimus robots.\nFor the fourth quarter of last year, Tesla's net income also plunged, down 61% to $840 million, or 24 cents. Excluding one-time charges, net income totaled 50 cents per share, compared to analysts' forecasts of 45 cents.\n\"They've got aging product that is less and less competitive as others manufacturers come out with new models, then there is the general brand destruction,\" said Telemetry analyst Sam Abuelsamid. \"Musk's involvement in politics has turned off customers.\"\nOne bright point was Tesla's gross profit margins, which leapt to 20% last quarter from 16% a year ago.\n\"Tesla's ability to show improving profitably was a surprise,\" said Morningstar analyst Seth Goldstein. \"I think that is the reason the stock is up now.\"\nGoldstein said he was also encouraged by plans outlined in Tesla's earnings report to roll out robotaxi service in Houston, Miami and five other cities in the first half of this year.\nInvestors cheered earlier this year when Musk shifted his focus back to the company after spending months as head of a government cost-cutting team in Washington. But it's not clear his attention will remain as undivided in the new year. He has plans to take his rocket company SpaceX public, possibly in June, in what many expect to be a blockbuster IPO that make him the world's first trillionaire - but also possibly distract him.\nThe latest Tesla figures are a setback for a company that had promised so much a year ago.\nAfter President Donald Trump was elected, investors pushed up the stock on a bet that his advisory role in the new administration would help the company. Instead it backfired. Customers angry with his work for Trump and his right-wing political stances boycotted the brand.\nMusk had also promised a year ago that European regulators would approve its partial self-driving software within three months, a potential big boost to Tesla sales there. But that didn't happen either.\nAnd investors were also excited about Teslas robotaxi service promising rides without anyone driving the car. But instead they got cars with supervisors inside to grab the controls in case something went wrong, though on this count there may be progress. Tesla recently said it was removing these safety drivers in Austin where it launched the service in June and has vowed to aggressively expand into other cities in the coming year.\nFor some on Wall Street that is enough to get excited about the company, and keep pushing the stock up.\nDan Ives of Wedbush Securities, one of Wall Street's most bullish analysts, expects robotaxis will be in more than 30 cities by the end of this year, and that Tesla will capture 70% of the global market for self-driving cars in a decade.\nOthers are also excited about Tesla energy storage business, which posted strong numbers last quarter with revenues surging 25% to $3.8 billion. Tesla is benefiting from massive demand as datacenters sucking up energy are being built out"
            },
            {
                "title": "Tesla ends Model S and X as Fremont shifts to Optimus robot production - desertsun.com",
                "source": "desertsun.com",
                "url": "https://www.desertsun.com/story/news/nation/california/2026/01/28/tesla-ends-model-s-model-x-fremont-optimus-robot-shift/88405138007/",
                "body": "Tesla ends Model S, X as Fremont shifts to Optimus robot production\n- Tesla plans to end production of its Model S and Model X vehicles in the spring.\n- The company will convert the factory space to build its Optimus robot.\n- CEO Elon Musk stated the move is part of a shift toward an autonomous future.\nTesla is preparing to shut down production of its long‑running Model S sedan and Model X SUV this spring, marking a major shift for the company’s Fremont factory in the Bay Area — and for the state’s clean‑tech landscape.\nCEO Elon Musk told investors on the Jan. 28 earnings call that Tesla will repurpose the Model S/X assembly lines into a manufacturing hub for Optimus, the company’s humanoid robot.\nMusk framed the move as a turning point: an “honorable discharge” for two vehicles that helped shape California’s early EV adoption and Tesla’s rise from a Bay Area startup into a global automaker. He emphasized that the company is steering decisively toward autonomy and robotics, noting that the Fremont facility will become a high‑volume Optimus factory.\nThe decision aligns with a broader strategic pivot Tesla has signaled throughout its Q4 earnings disclosures—one that reflects declining sales of its older luxury models, intensifying global EV competition, and a focus on emerging “physical AI” products like robotaxis and humanoid robots.\nWhy is Tesla killing the Model S and Model X?\nTesla launched the Model S in 2013 and it debuted the Model X in 2015.\nThe Model S, in particular, did well commercially for a time, but both vehicles have been surpassed in recent years by Tesla's Model 3 and Model Y.\nMusk told investors on the Jan. 28 call that it was \"slightly sad, but it is time to bring the S/X program to an end.\"\n\"It's part of our overall shift to an autonomous future,\" he said. \"The only vehicles that we'll make will be autonomous vehicles, with the exception of the next generation Roadster.\"\nHow did the Model S and Model X sell?\nTesla sold 9,199 Model S vehicles in 2025, according to the website Goodcarbadcar.net. The company sold 80,702 Model X vehicles in 2025, according to the website.\nHere's how the vehicles' sales have fared in the past five years:\n- 2024 | Model S: 15,901 | Model X: 21,099\n- 2023 | Model S: 26,701 | Model X: 24,700\n- 2022 | Model S: 90,473 | Model X: 24,099\n- 2021 | Model S: 11,556 | Model X: 7,305\nAre any job losses expected at Fremont plant?\nDespite the end of S/X production, current reporting does not indicate layoffs tied to the transition. In fact, Musk told investors that Tesla expects to increase headcount at the Fremont factory as it ramps up production of the Optimus robot, according to CNBC.\nWhat is the Optimus program, and why does Musk say it’s the future of Tesla?\nOptimus is Tesla’s in‑development humanoid robot — a bipedal, autonomous machine designed to perform tasks ranging from factory labor to daily household duties.\nMusk has repeatedly touted Optimus as one of Tesla’s most important long‑term bets, describing it as a cornerstone of the company’s vision for a future built around autonomy, robotics and “physical AI.”\nThis shift also reflects Musk’s belief that driverless vehicles and humanoid robots will ultimately define Tesla more than cars ever did. In its shareholder messaging, Tesla has already framed itself as moving beyond automaking toward AI‑driven mobility and robotics products."
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "1,060.000",
            "open": "52,781.410",
            "close": "53,740.700",
            "high": "53,836.410",
            "low": "52,776.410"
        },
        "market_summary": "### JPN225 Market Briefing\n\n* **Key Drivers:** A stronger **yen** is weighing on exporters, while concerns over AI spending and its potential impact on profits are keeping Japanese tech stocks under pressure. Recent comments from U.S. Treasury Secretary Scott Bessent indicating no intervention in the foreign exchange market to support the **yen** have also influenced currency movements.\n* **Price Action:** The **JPN225** edged down, with the rise of the **yen** against the dollar affecting overseas revenue for exporters. However, **Advantest**'s forecast hike partially cushioned the drop.\n* **Technical Outlook:** Immediate support for the **JPN225** is crucial, given the current **bearish** sentiment. The index's performance is heavily influenced by its heavyweight components, such as **Advantest**, and currency fluctuations.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "Nikkei Slips As A Stronger Yen Weighs On Exporters - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/nikkei-slips-as-a-stronger-yen-weighs-on-exporters",
                "body": "Advantest’s forecast hike cushioned the drop, but a firmer yen and fresh worries about AI spending kept Japanese tech on the back foot.\nabout 4 hours ago • 1 min\nWhat’s going on here?\nJapan’s Nikkei 225 edged down on Thursday as the yen strengthened and investors questioned when heavy AI spending will start paying off.\nWhat does this mean?\nThe yen’s rise matters because the Nikkei is packed with exporters – and a stronger currency makes overseas revenue worth fewer yen. That pressure is showing up just as earnings season heats up in Japan and the US, with big tech results setting the tone for sentiment. At the same time, Microsoft’s comments about record AI investment revived a familiar concern: industrywide capex could arrive faster than the profits. Still, chip-testing gear maker Advantest rallied after raising its full-year profit outlo..\nok, and its large index weight helped keep the broader dip relatively small.\nWhy should I care?\nFor markets: Currency moves can rewrite earnings expectations.\nWhen the yen firms up, investors often mark down profit forecasts for globally exposed Japanese firms – even if nothing else changes. Thursday was also a reminder that index performance can hinge on a few heavyweights: Advantest’s jump partly offset declines in other tech leaders. With central banks still focused on inflation, markets are less forgiving of “spend now, monetize later” stories, so AI-linked companies may see bigger swings around earnings.\nZooming out: AI is becoming a global capex cycle.\nBig US tech budgets ripple through supply chains worldwide, and Japan sits right in the middle thanks to its chip and factory-equipment champions. The key question for markets isn’t whether AI is useful, but whether the returns arrive quickly enough to defend today’s valuations and margin targets. Until that’s clearer, currency shifts and guidance updates can matter as much as the underlying demand.\nThis content is free, but you must be logged in to continue reading.\nAlready have an account?"
            },
            {
                "title": "Japan's Nikkei slips amid drag from strong yen; Advantest surges - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3YU03N:0-japan-s-nikkei-slips-amid-drag-from-strong-yen-advantest-surges/",
                "body": "News//Japan's Nikkei slips amid drag from strong yen; Advantest surgesJapan's Nikkei slips amid drag from strong yen; Advantest surgesRefinitiv1 min readNVDA6857NI225TOPIXEarningsJapanese stocksReuters© Copyright Thomson Reuters 2026. Click For Restrictions - https://agency.reuters.com/en/copyright.htmlShow moreLogin or create a forever free account to read this newsLet's go"
            },
            {
                "title": "Yen slips after Bessent says US 'absolutely not' intervening - Nikkei Asia",
                "source": "Nikkei Asia",
                "url": "https://asia.nikkei.com/business/markets/currencies/yen-slips-after-bessent-says-us-absolutely-not-intervening",
                "body": "NEW YORK -- The yen weakened against the dollar Wednesday after U.S. Treasury Secretary Scott Bessent said Washington was \"absolutely not\" intervening in the foreign exchange market to support Japan's currency.\nTreasury chief denies supporting Japan's currency, saying 'we have a strong dollar policy'\nU.S. Treasury Secretary Scott Bessent has denied that Washington is intervening in currency markets to support the Japanese yen. © Reuters\nNEW YORK -- The yen weakened against the dollar Wednesday after U.S. Treasury Secretary Scott Bessent said Washington was \"absolutely not\" intervening in the foreign exchange market to support Japan's currency."
            }
        ]
    }
]