[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "53.140",
            "open": "3,642.670",
            "close": "3,684.250",
            "high": "3,685.530",
            "low": "3,632.390"
        },
        "market_summary": "Gold is trading at new all-time highs, having surpassed its inflation-adjusted record from 1980, while silver is also breaking multi-year highs. The rally is primarily driven by expectations of imminent interest rate cuts from the Federal Reserve, persistent inflation concerns, and strong safe-haven demand from both investors and central banks. Market focus is now on upcoming economic data and Fed communications for further policy signals.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Editor's Picks: Gold Knocks Out Inflation-Adjusted High, Silver Breaks US$42 - Investing News Network",
                "source": "Investing News Network",
                "url": "https://investingnews.com/top-stock-market-news-12092025-gold-high/",
                "body": "Editor's Picks: Gold Knocks Out Inflation-Adjusted High, Silver Breaks US$42\nShe leads the Investing News Network's video and event coverage, and guides a team of writers reporting on niche investment markets.\nElsewhere in the resource space, Anglo American and Teck Resources announced plans to merge in a US$53 billion transaction will create one of the world's top copper producers.\nGold's record-setting price run continued this week, with yet another new all-time high in the books. Silver also fared well, breaking US$42 per ounce.\nAccording to Bloomberg, gold has now also surpassed its inflation-adjusted all-time high of US$850 per ounce, which it set more than 45 years ago on January 21, 1980. The news outlet notes that at the time the US was dealing with currency issues, inflation and recession concerns.\nThese are problems that sound all too familiar today. This week brought the release of the latest US consumer price index (CPI) data, which shows a 0.4 percent month-on-month increase for the all-items index — that's ahead of estimates and the most since the start of 2025.\nMeanwhile, core CPI, which excludes the food and energy categories, was up 0.3 percent from July. On an annual basis, core CPI was up 3.1 percent, while overall CPI rose 2.9 percent.\nUS producer price index (PPI) data also came out this week.\nThe index, which measures costs at a wholesale level, showed an unexpected 0.1 percent month-on-month decrease for August; the result was the same for core PPI.\nAttention is now shifting to the US Federal Reserve's next meeting, which is set to run from September 16 to 17. For weeks now the central bank has been widely expected to cut interest rates, and experts believe this week's CPI and PPI numbers support that idea.\n“Today’s CPI may appear to offset yesterday’s PPI, but it wasn’t hot enough to distract the Fed from the softening jobs picture. That translates into a rate cut next week — and, likely, more to come\" — Ellen Zentner, Morgan Stanley Wealth Management\nCME Group's (NASDAQ:CME) FedWatch tool now shows odds of 93.9 percent for a 25 basis point cut, while the likelihood of a 50 basis point reduction stands at 6.1 percent.\nBullet briefing — Mining majors in mega M&A, Newmont to exit TSX\nAnglo, Teck to merge in US$53 billion deal\nAnglo American (LSE:AAL,OTCQX:AAUKF) and Teck Resources (TSX:TECK.A,TSX:TECK.B,NYSE:TECK) announced that they plan to merge in a US$53 billion transaction.\nThe new entity, which the companies say will be one of the world's largest copper producers, will have assets in Canada, the US, Latin America and Southern Africa.\nIts primary listing will be in London, but its headquarters will be in Canada — a commitment that Teck CEO Jonathan Price told BNN Bloomberg will be \"perpetual.\" In a bid to safeguard its critical minerals sector, Canada said last year that it will only greenlight foreign takeovers of large critical minerals miners in \"exceptional circumstances.\"\nThe companies expect annual pre-tax synergies of about US$800 million by the end of the fourth year following the completion of the arrangement.\nExperts say the zero-premium, all-share tie up is the second largest mining deal ever, and the biggest in more than a decade. It comes not long after other high-profile M&A attempts involving both companies — Teck rejected a bid from (LSE:GLEN,OTC Pink:GLCNF) in 2023, and Anglo turned down an offer from BHP (ASX:BHP,NYSE:BHP,LSE:BHP) last year.\nNewmont to delist from TSX\nWhile the Anglo-Teck deal puts Canada front and center, major miner Newmont (TSX:NGT,NYSE:NEM,ASX:NEM) is backing away from the northern nation. The company said it has applied to voluntarily delist its shares from the TSX amid low volumes.\nNewmont also said the move will help boost administrative efficiency and reduce expenses. The firm has faced increasing costs since acquiring Newcrest Mining in 2023, and sources familiar with the matter recently told Bloomberg that it's looking to lower costs by around 20 percent.\n"
            },
            {
                "title": "Gold Shines As Investors Eye Fed Policy Moves - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/gold-shines-as-investors-eye-fed-policy-moves",
                "body": "Join the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nGold prices are camped just below record highs, as investors pile in ahead of key US inflation data and look for clues from the Federal Reserve.\nWhat does this mean?\nGold’s up more than 40% this year, as persistent inflation and global jitters have investors searching for a safe haven. With the Federal Reserve cutting interest rates by 25 basis points—and floating the possibility of even deeper cuts—markets now expect two more rate drops before year-end. New Fed voices like Governor Stephen Miran are leaning dovish, fueling bets on looser policy. In turn, gold-backed ETF holdings spiked, with SPDR Gold Trust up 2% in a day, reflecting that investors aren’t just talking about safety—they’re acting on it. Meanwhile, silver is also closing in on 14-year highs, while platinum and palladium are moving less decisively.\nWhy should I care?\nFor markets: Safe-haven fever is taking hold.\nDovish central banks and mounting economic unease are steering investors toward gold. The metal’s strong performance this year is hard to ignore, bolstered by both robust ETF inflows and central bank buying. With tools like the CME FedWatch showing strong odds of two more rate cuts, market players are tilting portfolios toward lower-risk bets like gold and, increasingly, silver. This safety-first approach may help keep gold prices pumped up as long as monetary policy stays loose and uncertainty lingers.\nThe bigger picture: Monetary policy is reshaping global flows.\nRecent Fed moves are sending shockwaves beyond the US, shifting confidence and risk appetite worldwide. Central banks in China and the euro area are also guiding expectations with fresh updates on lending and sentiment, pushing investors toward traditional safe havens. That strong demand could keep gold in the spotlight as markets navigate an uncertain recovery and brace for more policy shifts ahead.\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies."
            },
            {
                "title": "Gold holds firm near record high as markets eye Fed policy signals - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/reuters.com,2025:newsml_L2N3V900S:0-gold-hovers-near-record-high-as-markets-eye-fed-policy-signals/",
                "body": "Gold hovers near record high as markets eye Fed policy signals\n- Fed speakers in focus for further policy insight\n- Fed's Miran defends call for steep rate cuts\n- Silver hovers near 14-year high\nBy Anmol Choubey\nGold hovered near a record high on Monday as investors braced for a slew of speeches from U.S. Federal Reserve officials and inflation data this week, after the central bank cut interest rates last week and signalled potential further easing.\nSpot gold GOLD was up 0.2% at $3,691.53 per ounce, as of 0418 GMT. Bullion hit a record high of $3,707.40 on Wednesday.\nU.S. gold futures GOLD for December delivery climbed 0.6% to $3,727.40.\n\"Gold is back on the doorstep of the $3,700 level and new high watermarks could be hit this week if U.S. macro data continues to support the dovish Fed narrative,\" KCM Trade Chief Market Analyst Tim Waterer said.\nMarket focus has shifted to the release of the U.S. core Personal Consumption Expenditure (PCE) price index, the central bank's preferred inflation gauge, on Friday.\n\"The combination of a dovish Fed and constant central bank buying is keeping momentum on the side of gold,\" Waterer said.\nAt least a dozen Fed officials are scheduled to speak this week, including Chair Jerome Powell on Tuesday, as markets look for further insights into the central bank's monetary policy outlook.\nThe Fed cut interest rates by 25 basis points on Wednesday while cautioning about persistent inflation, casting doubt over the pace of future easing.\nNew Fed Governor Stephen Miran on Friday defended himself as an independent policymaker after dissenting in favour of steep rate cuts at Wednesday's policy meeting.\nInvestors are broadly expecting two more rate cuts this year — 25 bps each in October and December — with probabilities of 93% and 81%, respectively, according to the CME FedWatch tool.\nBullion, which typically performs well in a low-interest-rate environment, has risen more than 40% this year, driven by broader geopolitical and economic uncertainty, central bank buying, and monetary policy easing.\nSpot silver XAGUSD1! rose 1% to $43.49 per ounce, hovering near a 14-year high. Platinum PL1! gained 0.4% to $1,409.47 and palladium XPDUSD1! rose 0.8% to $1,157.75."
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.205",
            "open": "67.522",
            "close": "66.585",
            "high": "67.647",
            "low": "66.442"
        },
        "market_summary": "Brent crude oil prices edged higher due to geopolitical tensions in Europe and the Middle East, which threaten regional energy security and supply. However, these gains are being capped by concerns over increasing supply from producers like Iraq and worries that global trade tariffs could weaken fuel demand. Furthermore, a broader energy transition trend, exemplified by new funds for clean energy, suggests a potential long-term structural decline in oil demand.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Oil inches up as tension flares in Europe, Middle East - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/oil-inches-tension-flares-europe-012214787.html",
                "body": "By Florence Tan and Mohi Narayan\nSINGAPORE/NEW DELHI (Reuters) -Oil prices gained in Asian trade on Monday supported by geopolitical tension in Europe and the Middle East, although the prospect of more oil supply and concern about the impact of trade tariffs on global fuel demand weighed.\nBrent crude futures rose 34 cents, or 0.54%, to $67.07 a barrel by 0317 GMT while the U.S. West Texas Intermediate crude contract for October was at $63.02 a barrel, up 34 cents, or 0.54%.\nInvest in Gold\nThe October WTI contract expires on Monday and the more active November contract gained 36 cents, or 0.58%, at $62.76 a barrel.\n\"Reports over the weekend that Russia was threatening over the Polish border has provided traders with a timely reminder of the ongoing risks to European energy security from the north east,\" said Michael McCarthy, CEO of investment platform Moomoo Australia and New Zealand.\nPolish and allied aircraft were deployed early on Saturday to ensure the safety of Polish airspace after Russia launched airstrikes targeting western Ukraine near the border with Poland, armed forces of the NATO-member country said.\nThe deployment came after three Russian military jets violated NATO Estonia's airspace for 12 minutes on Friday, while on Sunday, Germany's air force reported that a Russian military plane entered neutral airspace over the Baltic Sea.\nThe United Nations Security Council is due to meet on Monday over Estonia's accusation that Russian fighter jets violated its airspace, diplomats said.\nIn recent weeks, Ukraine stepped up drone attacks on Russia's energy infrastructure, hitting terminals and refineries, while U.S. President Donald Trump has urged the European Union to halt Russian oil and gas purchases.\nIn the Middle East news, four Western nations recognised Palestinian state, prompting a furious response from Israel and adding to jitters in the key oil-producing region.\nBrent and WTI settled down more than 1% on Friday to mark a slight decline last week as worries about large supplies and declining demand outweighed expectations that the year's first interest-rate cut by the U.S. Federal Reserve would trigger more consumption.\nIraq has increased oil exports following the gradual unwinding of voluntary production cuts under an OPEC+ agreement, the country's state oil marketer SOMO said on Sunday.\nIraq's oil exports averaged 3.38 million barrels per day in August, according to the oil ministry. SOMO expects September's average exports to range from 3.4 million to 3.45 million bpd.\n\"Rising inventories over the past six months have also confirmed that supply has been outpacing demand,\" Tim Evans said in the newsletter Evans on Energy."
            },
            {
                "title": "Hong Kong’s Templewater links Asia’s robust EV growth with Middle East’s clean-energy demand - South China Morning Post",
                "source": "South China Morning Post",
                "url": "https://www.scmp.com/business/china-business/article/3326342/hong-kongs-templewater-eyes-middle-east-opportunities-growing-clean-energy-sector",
                "body": "Hong Kong’s Templewater eyes Middle East opportunities for growing clean energy sector\nPrivate equity firm sees EV and energy-storage opportunities as Middle East shifts away from traditional oil reliance\nHong Kong private-equity manager, Templewater, sees significant opportunities in connecting Asia’s fast-growing electric vehicle (EV) and energy-storage industries with Middle Eastern markets seeking clean-energy solutions as the region shifts away from oil reliance.\nTemplewater, which this month held a signing ceremony in Hong Kong with Omani sovereign wealth fund Future Fund Oman for the launch of Oman’s first Energy Transition Fund, believes the fund will appeal to investors aiming to tap into Asia’s clean-energy growth story.\nYufeng Wan, partner and head of energy transition at Templewater, said battery technologies, core components and specialised EVs such as self-driving logistics vans were already a strong investment focus in Asia.\nHe said the entire energy-transition supply chain – from solar and wind to batteries and EVs – was a “growing” segment.\n“We continue to see strong and rising interest from investors in this space”, which was delivering strong financial rewards, he added.\nThe fund, with initial capital of US$200 million, is expected to scout, cultivate and bring to Oman Asian companies focusing on clean molecules, energy storage, e-fuels, smart mobility, renewables, and green data centres over the next decade.\nThe Omani sovereign wealth fund would serve as the cornerstone investor, committing US$100 million into the Energy Transition Fund, according to Wan."
            },
            {
                "title": "Travis Kelce returns after fine, as fans wonder if Taylor Swift will be hidden this time - Berawang News",
                "source": "Berawang News",
                "url": "https://berawangnews.com/travis-kelce-returns-after-fine-as-fans-wonder-if-taylor-swift-will-be-hidden-this-time/",
                "body": "Baca juga:\nJohn M. Anderson\nEditor in Chief\nJohn M. Anderson\nJohn has over 15 years of experience in American media, previously working with The Washington Post and Politico. He specializes in U.S. politics and policy analysis, ensuring every piece published by Berawang News meets the highest standards of accuracy and fairness."
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "1.145",
            "open": "63.716",
            "close": "62.791",
            "high": "63.781",
            "low": "62.636"
        },
        "market_summary": "WTI crude oil prices are experiencing upward pressure from geopolitical tensions in Europe and the Middle East, as well as a supportive Fed rate cut. However, these gains are being capped by persistent bearish fundamentals, including robust U.S. production, OPEC's ineffectiveness in tightening the market, and concerning signals of weak fuel demand evidenced by a large build in distillate inventories. A longer-term IEA report warns of an urgent need for investment to offset accelerating field decline rates, adding a structural supply concern to the mix.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "WTI rises above $63.20 amid geopolitical risks - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/amp/news/wti-rises-above-6320-amid-geopolitical-risks-202509220219",
                "body": "WTI rises above $63.20 amid geopolitical risks\n|- WTI price jumps to near $63.20 in Monday’s early Asian session.\n- Geopolitical risks in Europe and the Middle East boost the WTI price.\n- Persistent oversupply and soft fuel demand in the US might cap the upside for the WTI.\nWest Texas Intermediate (WTI), the US crude oil benchmark, is trading around $63.20 during the early Asian trading hours on Friday. The WTI rises amid escalating geopolitical tension in Europe and the Middle East. Oil traders brace for the American Petroleum Institute (API) weekly crude oil stock report later on Tuesday.\nReuters reported that Polish and allied aircraft were sent on Saturday to protect Polish airspace after Russia attacked western Ukraine near the Polish border, according to the NATO-member country's military. \"Reports over the weekend that Russia was threatening over the Polish border have provided traders with a timely reminder of the ongoing risks to European energy security from the northeast,\" said Michael McCarthy, CEO of investment platform Moomoo Australia and New Zealand.\nThe US Federal Reserve (Fed) last week approved a widely anticipated rate cut and signaled that two more reductions are on the way before the end of the year. Lower interest rates generally support oil demand, and the Fed’s guidance suggests it now views risks from rising unemployment as outweighing those from persistent inflation.\nOn the other hand, the prospect of more oil supply and concerns over a slowdown in the US economy could weigh on the WTI price. US crude oil stockpiles fell sharply last week as net imports dropped to a record low while exports jumped to a near two-year high, according to the Energy Information Administration (EIA). However, a rise in distillate stockpiles, which increased by 4 million barrels versus predictions of a 1 million barrel increase, raised worries about demand in the world's top oil consumer.\nWTI Oil FAQs\nWTI Oil is a type of Crude Oil sold on international markets. The WTI stands for West Texas Intermediate, one of three major types including Brent and Dubai Crude. WTI is also referred to as “light” and “sweet” because of its relatively low gravity and sulfur content respectively. It is considered a high quality Oil that is easily refined. It is sourced in the United States and distributed via the Cushing hub, which is considered “The Pipeline Crossroads of the World”. It is a benchmark for the Oil market and WTI price is frequently quoted in the media.\nLike all assets, supply and demand are the key drivers of WTI Oil price. As such, global growth can be a driver of increased demand and vice versa for weak global growth. Political instability, wars, and sanctions can disrupt supply and impact prices. The decisions of OPEC, a group of major Oil-producing countries, is another key driver of price. The value of the US Dollar influences the price of WTI Crude Oil, since Oil is predominantly traded in US Dollars, thus a weaker US Dollar can make Oil more affordable and vice versa.\nThe weekly Oil inventory reports published by the American Petroleum Institute (API) and the Energy Information Agency (EIA) impact the price of WTI Oil. Changes in inventories reflect fluctuating supply and demand. If the data shows a drop in inventories it can indicate increased demand, pushing up Oil price. Higher inventories can reflect increased supply, pushing down prices. API’s report is published every Tuesday and EIA’s the day after. Their results are usually similar, falling within 1% of each other 75% of the time. The EIA data is considered more reliable, since it is a government agency.\nOPEC (Organization of the Petroleum Exporting Countries) is a group of 12 Oil-producing nations who collectively decide production quotas for member countries at twice-yearly meetings. Their decisions often impact WTI Oil prices. When OPEC decides to lower quotas, it can tighten supply, pushing up Oil prices. When OPEC increases production, it has the opposite"
            },
            {
                "title": "Oil News: Crude Outlook Bearish Below 52-Week Average as Demand and OPEC Lag - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/oil-news-crude-outlook-bearish-below-52-week-average-as-demand-and-opec-lag-1549871",
                "body": "Light crude oil futures settled the week at $62.40, up just $0.06, or +0.10%, after a volatile stretch dominated by bearish macro fundamentals and waning demand signals.\nDespite the modest gain, futures closed below key levels—including the 52-week moving average at $63.09 and the long-term pivot at $64.21—confirming sustained downside pressure on crude.\nThe bearish tone is rooted in persistent oversupply concerns. OPEC’s trimmed output curbs have failed to meaningfully tighten the market, while Russian crude exports remain largely unaffected by sanctions.\nAccording to industry analysts, continued flows from sanctioned producers are flooding an already well-supplied global market. U.S. production remains robust, adding further weight to the supply side of the equation.\nTraders have also been unimpressed by recent geopolitical events. Despite Ukrainian drone strikes on Russian energy infrastructure—including export terminals and refineries—disruption has proven limited and transient. This has eroded the geopolitical risk premium that had previously supported prices.\nFundamentals on the demand side are equally underwhelming. While the Federal Reserve implemented a widely expected 25 basis point rate cut, the move has failed to lift crude demand expectations. Weak U.S. economic data—ranging from slumping homebuilding activity to tepid job market figures—has deepened skepticism about future energy consumption.\nAnalysts note that without stronger demand recovery or more aggressive monetary easing, rate cuts will have limited impact on crude markets. “A symbolic cut won’t drive oil demand unless it spurs real economic momentum,” one strategist said. Instead, the rate move has simply underscored macroeconomic fragility.\nFurther reinforcing the bearish bias, the latest EIA report revealed a surprise 4 million barrel build in U.S. distillate inventories, suggesting weakening diesel demand. This followed earlier API data showing similar trends. Combined with strong exports and reduced net imports, the inventory data reflects a domestic market increasingly cautious on refined product consumption.\nThe near-term oil prices forecast remains bearish. Crude’s failure to reclaim the $64.21 pivot or the 52-week average at $63.09 keeps downside targets firmly in play. Key support rests at $60.77, followed by the Fibonacci level at $59.91.\nUnless OPEC+ revises its strategy or demand metrics improve, crude is likely to remain under pressure with rallies capped near $65.68. Traders should expect continued selling on strength until fundamentals shift.\nMore Information in our Economic Calendar.\nJames Hyerczyk is a U.S. based seasoned technical analyst and educator with over 40 years of experience in market analysis and trading, specializing in chart patterns and price movement. He is the author of two books on technical analysis and has a background in both futures and stock markets."
            },
            {
                "title": "IEA warns urgent investment needed immediately - Petroleum Australia",
                "source": "Petroleum Australia",
                "url": "https://petroleumaustralia.com.au/news_article/iea-warns-urgent-investment-needed-immediately/",
                "body": "The International Energy Agency (IEA) has issued a critical report warning of accelerated decline rates in global oil and gas fields, underscoring the urgent need for sustained investment to secure future energy supplies.\nThe report, titled The Implications of Oil and Gas Field Decline Rates, draws on extensive data from about 15,000 oil and gas fields worldwide.\nAccording to the IEA’s analysis, the pace of production decline is intensifying due to increased reliance on shale and deep offshore resources.\nThis trend presents significant challenges in maintaining current production levels.\nThe agency highlights that to offset these supply losses, nearly 90 per cent of upstream investment each year is necessary just to sustain existing output.\nFatih Birol, IEA executive director, emphasised the gravity of the situation, stating: “Decline rates are the elephant in the room for any discussion of investment needs in oil and gas.”\nThe report reveals wide variations in decline rates depending on the type of field and region.\nOnshore supergiant oil fields in the Middle East exhibit relatively low annual declines of less than 2 per cent, while smaller offshore fields in Europe face declines exceeding 15 per cent per year.\nEven more pronounced are tight oil and shale gas fields, where output can fall by more than 35% within the first year without new investment.\nThe consequences of insufficient investment have grown more severe over time.\nIn 2010, a cessation of upstream investment would have cut oil supply by just under 4 million barrels per day (mbbl/d) annually.\nToday, that risk has increased to 5.5 mbbl/d. Similarly, natural gas decline rates have surged from 180 billion cubic metres (bcm) per year to 270 bcm annually.\nTo maintain current production levels, the IEA warns that developing new resources is indispensable.\nThe report estimates that by 2050, more than 45 mbbl/d of oil and nearly two trillion cubic metres of gas from new conventional fields will be required — an output equivalent to the combined total of the world’s top three producers.\nHowever, the IEA notes that demand reductions could ease this burden somewhat.\nThe agency also points out the long timelines involved in bringing new oil and gas projects online, typically taking nearly 20 years from exploration license issuance to first production.\nThis duration includes roughly a decade for discovery followed by another decade for appraisal, approval, and construction.\nThe IEA report highlights the critical role of continued investment to counteract accelerating decline rates and ensure long-term energy security amid a shifting global energy landscape."
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0064",
            "open": "1.1782",
            "close": "1.1743",
            "high": "1.1792",
            "low": "1.1728"
        },
        "market_summary": "The EUR/USD retreated from fresh multi-year highs after the Federal Reserve delivered a widely anticipated 25 basis point rate cut. The initial dollar weakness reversed as the Fed's messaging was perceived as less dovish than hoped, with its projections signaling a cautious pace for future cuts. The pair's decline was further supported by mixed messages from ECB officials and a focus on upcoming key US data, particularly the PCE inflation report, which will be crucial for near-term direction.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "EUR/USD Weekly Forecast: US Dollar firmer post Fed, PCE inflation comes next - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/analysis/eur-usd-weekly-forecast-us-dollar-firmer-post-fed-pce-inflation-comes-next-202509191504",
                "body": "- The Federal Reserve cut its benchmark rate by 25 basis points as expected.\n- European Central Bank officials delivered mixed messages on future policies.\n- EUR/USD retreated sharply after hitting fresh 2025 highs, steeper slide on the cards.\nThe EUR/USD pair peaked at 1.1918, a fresh four-year high on Wednesday, giving up most of its gains and settling at around 1.1750 by the end of the week. Central banks lead the way, with the Federal Reserve (Fed) monetary policy decision rocking the board and giving fresh impetus to the US Dollar (USD).\nFederal Reserve delivers first 2025 rate cut\nWhereas such USD strength would be sustainable in time, it depends on the upcoming macroeconomic data. The Federal Open Market Committee (FOMC) delivered a cautious cut, announcing the reduction of its benchmark rate by 25 basis points (bps) after the September two-day meeting. Even further, the Summary of Economic Projections (SEP) showed that Fed officials anticipate two more rate cuts in 2025, confirming the market’s speculation of additional cuts in October and December. However, the same SEP showed policymakers retain the view of just one cut in 2026.\nOf course, there was one dissenter, the newly appointed by United States (US) President Donald Trump, Stephen Miran. Miran voted for a 50 bps interest rate cut, and aimed for a 150 bps trim before year-end.\nThe decision fell short of President Trump’s desire, but pointed in the right direction. Market players were pricing in more than one cut in 2026, and the less dovish delivery ended up benefiting the Greenback after the initial USD sell-off.\nWall Street, however, rallied with the news, with the Dow Jones Industrial Average (DJIA) reaching unexplored territory. Gold price, on the contrary, eased from record highs, all of which reflects mounting optimism.\nChair Jerome Powell made some relevant comments in the press conference that followed the announcement. He said that the overall effect on economic activity of President Trump’s tariffs “remains to be seen,” adding that the lower immigration is below the softening jobs market rather than tariffs. \"There's very little growth, if any, in the supply of workers,\" he stated.\nOf course, he reiterated that the Fed is not on a preset path. \"Our obligation is to ensure that a one-time increase in the price level does not become an ongoing inflation problem,” he said, while repeating that monetary policy decisions will be made meeting-by-meeting.\nUS-China trade relationship returns to the limelight\nMeanwhile, US President Trump and his Chinese counterpart, Xi Jinping, had a call on Friday to discuss the permanence of the TikTok app in the US. Investors hope both leaders also discussed their trade relationship, further softening tensions between Washington and Beijing.\nAhead of the call, Trump noted that he could also grant his giant rival an extension to the trade truce, maintaining financial markets in a good mood ahead of the weekly close. Additional headlines on the matter will likely come in the next few days.\nMixed message from European Central Bank officials\nThe European Central Bank (ECB) had little to offer these last few days, after announcing its decision to keep interest rates unchanged on September 11. ECB Vice President Luis de Guindos noted the central bank needs to follow a “very prudent” approach to monetary policy amid still high uncertainty, but added there was “very positive” news on inflation. Finally, he noted that the present policy stance is appropriate.\nECB Governing Council member Mario Centeno, on the other hand, had a more dovish approach and said that the “next move is still likely to be a rate cut.” He also noted that the central bank cannot tolerate inflation below 2% for too long, a level it's likely to reach in 2028, according to forecasts. Nevertheless, he still sees inflation risks to the downside.\nData to become more relevant\nThe positive news from the inflation front that De Guindos mentioned came from the Eurozone"
            },
            {
                "title": "EUR/USD Price Forecast - EUR to USD Near 1.1800 as Fed Cut Sparks Volatility, PCE Data Looms - tradingnews.com",
                "source": "tradingnews.com",
                "url": "https://www.tradingnews.com/news/eur-usd-price-forecast-eur-to-usd-struggles-at-1-1800-after-fed-cut",
                "body": "EUR/USD Price Forecast - EUR to USD Struggles at 1.1800 After Fed Cut, Eyes on PCE and GDP\nEuro’s rally fades near 1.1920 as dollar strength, sticky U.S. inflation, and key data releases drive volatility in EUR/USD | That's TradingNEWS\nEUR/USD Struggles Near 1.1860 as Fed Cut Sparks Volatility\nThe euro-dollar pair opened the week near 1.1730 and rallied quickly into the 1.1920 region before fading. The Federal Reserve’s 25 basis-point cut, taking the federal funds rate to 4.00%–4.25%, initially sent EUR/USD higher, but momentum soon reversed. By Friday, the pair slipped back to 1.1800, with sellers pressing toward 1.1780. The inability to sustain above 1.1860 reflects both technical exhaustion and lingering macro headwinds.\nFederal Reserve Dovish Shift Meets Inflation Concerns\nMarkets widely expected the rate cut, but the tone of Chair Jerome Powell’s comments mattered more. While policymakers penciled in two more cuts in 2025, Powell underscored inflation risks, with core PCE at 2.9% year-over-year in July — the highest since February. That hawkish undertone muted euro gains. Futures markets still price in another 50–75 basis points of easing by year-end, but the lack of strong forward guidance limited the euro’s follow-through.\nTechnical Breakdown Highlights 1.1800 as Make-or-Break Support\nEUR/USD broke its ascending trendline late in the week, a signal traders view as a structural shift. Immediate resistance now stands at 1.1867, while a close above that level could re-open the path back to 1.1920 and potentially 1.2000. On the downside, 1.1800 remains pivotal — failure there exposes 1.1730 and then 1.1580 as the next major targets. The pair printed a bearish pin bar on the weekly chart, rejecting levels above 1.1900, leaving momentum firmly tilted to the downside unless bulls reclaim 1.1860–1.1870 quickly.\nDollar Strength Anchored by Rate Expectations and GDP Optimism\nThe U.S. Dollar Index (DXY) rebounded to 97.28, up 0.31%, after four weeks of declines. Stronger U.S. retail sales at +0.6% in August, versus 0.2% expected, reinforced the dollar’s bid. Treasury yields remain soft, with the 10-year at 4.13% and the 30-year at 4.74%, but investors shifted toward the dollar on expectations of steady U.S. growth. GDP data due this Thursday is forecast to remain firm, with Friday’s core PCE release likely to determine whether the Fed maintains its dovish bias or reconsiders pace.\nEuro Faces Cross-Currents from ECB Policy and Global Data\nThe euro has been unable to extend gains despite relative resilience in European inflation at 3.8% YoY. The ECB has held rates unchanged, but hawkish dissent within the Governing Council signals potential friction. Meanwhile, flash PMIs from Germany and the eurozone this week will test whether economic momentum can stabilize. Without fresh growth catalysts, the euro’s reliance on dollar weakness remains its main driver.\nRead More\n-\nVirtus PFFA ETF: 9.05% Yield at $22.43 with Strong Sector Allocation and Income Stability\n21.09.2025 · TradingNEWS ArchiveStocks\n-\nBitcoin ETF Inflows of $2.8B Fuel $115K Price, Institutional Rotation Signals Bullish Path\n21.09.2025 · TradingNEWS ArchiveCrypto\n-\nNatural Gas (NG=F) Holds $3.10 as Storage Builds and LNG Policy Fuels Long-Term Bull Case\n21.09.2025 · TradingNEWS ArchiveCommodities\n-\nUSD/JPY Price Forecast - USD to JPY Holds 147.95 as Fed Eases and BoJ Faces Rising Pressure Ahead of October Shift\n21.09.2025 · TradingNEWS ArchiveForex\nShort-Term Price Action Signals Market Caution\nThursday’s move to 1.1850 lacked conviction, with lower highs forming across intraday charts. Institutions appear cautious ahead of U.S. GDP and PCE prints, with order books showing heavier selling pressure above 1.1860. Bears are eyeing 1.1735 as the logical dip target, with stops building just below that zone. A break could accelerate losses to 1.1580, while bulls would need a sustained daily close above 1.1867 to regain control.\nPositioning and Market Sentiment Skewed Toward Down"
            },
            {
                "title": "EUR/USD Weekly Forecast: Markets Shrug Off Fed Rate Cut - Forex Crunch",
                "source": "Forex Crunch",
                "url": "https://www.forexcrunch.com/blog/2025/09/21/eur-usd-weekly-forecast-markets-shrug-off-fed-rate-cut/",
                "body": "- The EUR/USD weekly forecast shows a rebound in the dollar.\n- The greenback fell in anticipation of a rate cut by the Fed.\n- Powell noted that employment risks had increased.\nThe EUR/USD weekly forecast shows weakness as the US dollar recovers ground after the Fed’s rate cut, as the impact has already been priced.\nUps and downs of EUR/USD\nThe EUR/USD pair had a bullish week but closed well below its highs as the dollar ended the week strong. At the start of the week, the greenback fell in anticipation of a rate cut by the Fed. As a result, EUR/USD gained. However, the trend soon shifted after the Fed meeting.\n–Are you interested in learning more about MT5 brokers? Check our detailed guide-\nPolicymakers voted to lower borrowing costs as expected. Moreover, they noted that employment risks had increased. However, the central bank will also keep monitoring inflation risks. Since there were few surprises, the dollar recovered from its lows, sending EUR/USD lower.\nNext week’s key events for EUR/USD\nNext week, the US will release its GDP and durable goods orders reports. These figures will indicate how the economy and growth are performing and will continue to influence the outlook for Fed rate cuts.\nSo far, it is only the labor market that has shown significant weakness. Softness in other sectors of the economy would increase pressure on the Fed to lower borrowing costs. On the other hand, upbeat reports would ease worries about the state of the economy.\nEUR/USD weekly technical forecast: Weaker bullish momentum, RSI divergence\nOn the technical side, the EUR/USD price is pulling back to retest the 22-SMA support line after making a new high. However, since it is still above the SMA and the RSI is over 50, the bullish bias is strong. At the same time, the price trades in a bullish channel with clear support and resistance lines.\n–Are you interested in learning more about forex signals telegram groups? Check our detailed guide-\nA break below the SMA would allow the price to retest the channel support before either breaking below or bouncing higher. On the other hand, if the SMA holds firm the price will bounce higher, likely breaking above the 1.2005 key resistance.\nMeanwhile, although the bias is bullish and the price has made a higher high and low, the RSI has made lower ones. Therefore, there is a bearish divergence, a sign that bullish momentum is fading. This could give bears an upper hand if bulls do not regain momentum.\nLooking to trade forex now? Invest at eToro!\n68% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money."
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0096",
            "open": "1.3548",
            "close": "1.3466",
            "high": "1.3559",
            "low": "1.3463"
        },
        "market_summary": "The GBP/USD is under significant pressure, declining to near 1.3480 as a combination of weak UK fundamentals and a strong US Dollar weighs on the pair. UK public sector borrowing surged to a five-year high, undermining Sterling, while the Federal Reserve's relatively hawkish tilt and strong US economic data are boosting the Dollar. Technical analysis indicates a break of key support levels could see the pair fall further toward the July lows of 1.3415.\n\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "GBP/USD Slides to 1.3480 as UK Borrowing Hits £18B, Dollar Strengthens on Fed Hawkish Tilt - tradingnews.com",
                "source": "tradingnews.com",
                "url": "https://www.tradingnews.com/news/sterling-drops-gbp-usd-price-at-13480--n-fiscal-shock",
                "body": "Sterling Drops: GBP/USD Price at 1.3480 on Fiscal Shock and Fed-Backed Dollar Strength\nUK deficit climbs to five-year highs, consumer confidence slips, and BoE stays cautious as Fed hawkish tilt and strong U.S. data lift the dollar, pressuring GBP/USD toward July lows at 1.3415 | That's TradingNEWS\nGBP/USD Under Pressure as UK Borrowing Surges\nRead More\n-\nVirtus PFFA ETF: 9.05% Yield at $22.43 with Strong Sector Allocation and Income Stability\n21.09.2025 · TradingNEWS ArchiveStocks\n-\nBitcoin ETF Inflows of $2.8B Fuel $115K Price, Institutional Rotation Signals Bullish Path\n21.09.2025 · TradingNEWS ArchiveCrypto\n-\nNatural Gas (NG=F) Holds $3.10 as Storage Builds and LNG Policy Fuels Long-Term Bull Case\n21.09.2025 · TradingNEWS ArchiveCommodities\n-\nUSD/JPY Price Forecast - USD to JPY Holds 147.95 as Fed Eases and BoJ Faces Rising Pressure Ahead of October Shift\n21.09.2025 · TradingNEWS ArchiveForex\nGBP/USD Technical Outlook: Key Levels to Watch\nThe GBP/USD pair now faces immediate resistance near 1.3600, with sellers dominating below this threshold. Support sits at 1.3480, with a break below exposing the 1.3415 July lows. Momentum indicators point to further downside, especially as U.S. yields remain attractive and UK fiscal conditions deteriorate. Bulls need a decisive reclaim of 1.3650 to challenge the broader bearish momentum.\nGlobal Risk Sentiment and Correlation with U.S. Indices\nDespite Sterling’s weakness, U.S. equities surged to fresh highs. The S&P 500 closed near 6,664 (+0.49%), while the Nasdaq 100 hit a record above 24,500 (+2.32%). The divergence highlights how capital continues to flow into U.S. risk assets, while UK assets face fiscal drag. With the U.S. economy still printing growth, and the UK dealing with structural deficits, GBP/USD’s correlation with equity flows increasingly favors further dollar strength.\nOutlook: Fiscal Shock Leaves Sterling Vulnerable\nWith borrowing at a five-year high, consumer sentiment falling, and the BoE hesitant to cut aggressively, Sterling’s path remains fragile. The Fed’s hawkish tilt and resilient U.S. data set a bullish backdrop for the dollar. Unless the UK government offers credible fiscal adjustments in the November budget, GBP/USD risks sliding toward 1.34, with downside bias intensifying on further gilt market instability."
            },
            {
                "title": "Pound Sterling eyes upside ahead of key data releases - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/analysis/gbp-usd-weekly-forecast-pound-sterlings-bullish-potential-appears-intact-202509191454",
                "body": "- Pound Sterling witnessed two-way swings versus the US Dollar, and failed to sustain above 1.3600 yet again.\n- GBP/USD awaits preliminary US/UK business PMI reports ahead of US PCE inflation.\n- Technically, GBP/USD remains a ‘buy-the-dip’ trade as long as the daily RSI remains above the midline.\nThe Pound Sterling (GBP) witnessed an eventful and volatile week against the US Dollar (USD) as markets weighed monetary policy decisions by the US Federal Reserve (Fed) and the Bank of England (BoE).\nPound Sterling reversed weekly gains\nEven though the week was dominated by high-impact labor and inflation data from the United Kingdom (UK), the main driver behind the GBP/USD price action remained the USD and the sentiment surrounding the Fed easing outlook.\nThe week began with the extension of the USD’s downtrend as markets had almost priced in three interest rate cuts by the Fed this year amid heightened stagflation risks in the United States (US) economy.\nThat, combined with the highest inflation in the UK since January 2024, propelled the pair above the 1.3650 area before reaching fresh 11-week highs at 1.3723 in a knee-jerk reaction to the Fed policy announcements.\nThe UK's Office for National Statistics (ONS) showed on Wednesday that the annual Consumer Price Index (CPI) rose by 3.8% in August, missing the estimates for a 3.9% growth. The reading was well above the BoE’s 2% inflation target.\nMeanwhile, the UK labor data published on Tuesday highlighted that the annual growth in Average Earnings Excluding Bonus slowed to 4.8% in the three months to July from 5% previously, while the Unemployment Rate remained unchanged at 4.7%, both readings matching the analysts’ estimates.\nThe Fed lowered rates by the expected 25 basis points (bps) on Wednesday, while the Summary of Economic Projections (SEP), the so-called Dot Plot chart, showed that the Fed policymakers foresee two additional rate cuts this year.\nHowever, Fed Chairman Jerome Powell, in his post-policy meeting press conference, adopted a measured rhetoric on further policy easing. Powell called the rate cut a risk management policy action and maintained the bank’s ‘meeting-by-meeting’ stance.\nThe USD dived to a fresh three-and-a-half-year low against its six major rivals following the Fed’s policy verdict, but quickly changed course and rebounded firmly on Powell’s reassurance. Subsequently, the pair tripped from over two-month highs, extending its corrective decline in the remainder of the week toward 1.3500.\nThursday’s BoE cautious hold also failed to save the day for the Pound Sterling as the Greenback recovery gathered strength on encouraging US economic data releases.\nThe BoE policymakers voted 7-2 to hold the policy rate at 4% and also to slow the annual pace at which the central bank unloads the gilts that it purchased from 2009 and 2021 to 70 billion pounds from 100 billion pounds. There was no change in the language of the policy statement.\nMeanwhile, data on Thursday showed that Initial claims for state unemployment benefits decreased 33,000 to a seasonally adjusted 231,000 for the week ended September 13, partially reversing a surge in the prior week to the highest level since October 2021.\nThe Philadelphia Federal Reserve Manufacturing Index surged to 23.2 in September, a significant leap from the estimated rebound of 2.3.\nOn Friday, the ONS said that British Retail Sales rose by a stronger-than-expected 0.5% over the month in August. The forecast was for a 0.4% increase.\nThe annual Retail Sales slowed slightly to 0.7% in the same period, although beat expectations of 0.6%. The upbeat data failed to pause the pair’s corrective downside.\nFocus is back on US/UK PMIs and PCE inflation\nWith the Fed and BoE monetary policy outcomes out of the way, the focus is back on the top-tier economic data releases from both sides of the Atlantic.\nSpeeches from Fed policymakers will also be closely scrutinized alongside any fresh developments on the geopolitical and trade front.\nDat"
            },
            {
                "title": "GBP/USD: Cable Bears Face Headwinds from Daily Cloud Top - Action Forex",
                "source": "Action Forex",
                "url": "https://www.actionforex.com/contributors/technical-analysis/612720-gbp-usd-cable-bears-face-headwinds-from-daily-cloud-top/",
                "body": "Cable remains in a step fall from last Wednesday’s 2 ½ month peak (1.3725) which has so far retraced over 61.8% of recent 1.3333/1.3725 rally and cracked next significant support at 1.3465 (daily cloud top).\nPound was initially hit by stronger dollar after Fed disappointed expectations for keeping very dovish stance, with signals from BoE Governor for possible further rate reductions, boosting bears on Thursday, while Friday’s unexpectedly high rise in UK borrowing sparked fresh acceleration lower.\nTechnical studies weakened on daily chart, with the pair being on track for weekly close in red (potential formation of bearish engulfing and long upper shadow on weekly candle add to negative signals).\nOn the other hand, daily cloud top offers solid support, which may hold bears for some time, with limited upticks to be capped under 1.3530 (daily Kijun-sen / broken Fibo 50%) to offer better selling levels and keep bears in play.\nRes: 1.3500; 1.3530; 1.3559; 1.3575\nSup: 1.3465; 1.3426; 1.3397; 1.3333"
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0034",
            "open": "0.6612",
            "close": "0.6586",
            "high": "0.6619",
            "low": "0.6585"
        },
        "market_summary": "The Australian Dollar is under pressure against a strengthening US Dollar following a less-dovish-than-expected Federal Reserve stance, leading to a three-day decline for AUD/USD. Key events this week, including Australian CPI and PMI data alongside US PCE inflation, will be critical in determining if the retreat continues. Market positioning shows a rise in bearish bets and falling implied volatility, indicating cautious sentiment ahead of these high-impact releases.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "Australian Dollar Outlook: AUD/USD Under Pressure Ahead of CPI and PMIs - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/australian-dollar-outlook-aud-usd-under-pressure-ahead-of-cpi-and-pmis/?amp=true",
                "body": "Australian Dollar Outlook: AUD/USD Under Pressure Ahead of CPI and PMIs\nThe Australian dollar is under pressure, with AUD/USD falling for a third day after the Federal Reserve’s less-dovish stance triggered renewed strength in the US dollar. Risk reversals show bearish bets building against the Aussie, while implied volatility continues to drift lower. This week’s spotlight is on Australia’s CPI and flash PMIs, alongside US PCE inflation, all of which could determine whether AUD/USD extends its retreat or finds support.\nView related analysis:\n- ASX 200 Outlook: RBA to Stay Cautious After Softer Employment Report\n- US Dollar Reverses Post-Fed: AUD/USD, GBP/AUD in Focus for AU Jobs, UK CPI\n- Australian CPI Data Supports RBA’s Cautious Approach on Rate Cuts\nChart prepared by Matt Simpson - data source: LSEG\n- AUD/USD extended losses for a third straight day after a less-dovish-than-expected FOMC meeting, with risk reversals showing a rise in bearish bets over bullish ones.\n- Implied volatility continues to trend lower for the Australian dollar.\n- Wednesday’s inflation report will be key to determining whether last month’s rise was driven mainly by temporary factors or broader price pressures.\n- Flash PMIs and US PCE data are additional events to watch.\nAustralian PMIs Signal Expansion Ahead of Inflation Data\nAustralia’s flash PMIs for September are due on Tuesday. While they are not usually a major market mover, they continue to show the economy in expansionary territory. July’s services report highlighted the steepest increase in activity in more than three years, alongside gains in employment, business activity, exports, and the forward-looking future activity index. Domestic and external demand are both improving.\nPrice pressures remained elevated in July but showed signs of easing. If this trend is repeated in the August data, it could raise hopes for a softer CPI reading in Wednesday’s monthly inflation release. That said, last month’s inflation surprise to the upside leaves open the question of whether it was a temporary blip or the start of a new inflationary phase.\nChart analysis by Matt Simpson - data source: S&P Global, LSEG\nAustralian Inflation in Focus as RBA Rate Cut Bets Shift\nWednesday’s inflation report will be closely watched to determine whether July’s sharp CPI rise was mainly due to the expiry of electricity subsidies, or if price pressures were more broadly spread. Trimmed mean CPI rose 0.6 percentage points in July, though this measure excludes the top 15% of volatile items, suggesting the reflation may have been subsidy-driven.\nIf inflation remains elevated or accelerates further, expectations for RBA rate cuts could be pushed well into next year. To gain confidence that July’s spike was temporary, traders would likely want to see annual trimmed mean inflation fall by at least 0.6 percentage points.\nChart prepared by Matt Simpson - data source: ABS, LSEG\nAUD/USD Holds Strong Ties to China, NZD and Inverse USD Relationship\nThe relationship between the Australian dollar and China is realigning, with the 20-day correlation between AUD/USD and both copper and the CSI 300 index now back above 0.8. The correlation with the New Zealand dollar also remains strong, as does the inverted relationship with the US dollar.\nChart prepared by Matt Simpson - data source: LSEG\nAustralian Dollar Implied Volatility Drops, Bearish Bets Rise\nExpectations of future volatility in AUD/USD continue to trend lower, with 1-month implied volatility falling to a 14-month low last week. While overnight implied volatility spiked around the FOMC meeting, it too dropped back to a 2-month low by Friday’s close, sitting well below the 1-week measure. With US PCE inflation now the key data point rather than employment, volatility is likely to remain subdued unless Australia’s CPI delivers a surprise or another fresh catalyst emerges.\nRisk reversals have eased from their recent cycle highs alongside AUD/USD after the FOMC meeting, reflecting a "
            },
            {
                "title": "Australian Dollar Outlook: AUD/USD Under Pressure Ahead of CPI and PMIs - City Index UK",
                "source": "City Index UK",
                "url": "https://www.cityindex.com/en-uk/news-and-analysis/australian-dollar-outlook-aud-usd-under-pressure-ahead-of-cpi-and-pmis/",
                "body": "The Australian dollar is under pressure, with AUD/USD falling for a third day after the Federal Reserve’s less-dovish stance triggered renewed strength in the US dollar. Risk reversals show bearish bets building against the Aussie, while implied volatility continues to drift lower. This week’s spotlight is on Australia’s CPI and flash PMIs, alongside US PCE inflation, all of which could determine whether AUD/USD extends its retreat or finds support.\nView related analysis:\n- ASX 200 Outlook: RBA to Stay Cautious After Softer Employment Report\n- US Dollar Reverses Post-Fed: AUD/USD, GBP/AUD in Focus for AU Jobs, UK CPI\n- Australian CPI Data Supports RBA’s Cautious Approach on Rate Cuts\nChart prepared by Matt Simpson - data source: LSEG\n- AUD/USD extended losses for a third straight day after a less-dovish-than-expected FOMC meeting, with risk reversals showing a rise in bearish bets over bullish ones.\n- Implied volatility continues to trend lower for the Australian dollar.\n- Wednesday’s inflation report will be key to determining whether last month’s rise was driven mainly by temporary factors or broader price pressures.\n- Flash PMIs and US PCE data are additional events to watch.\nAustralian PMIs Signal Expansion Ahead of Inflation Data\nAustralia’s flash PMIs for September are due on Tuesday. While they are not usually a major market mover, they continue to show the economy in expansionary territory. July’s services report highlighted the steepest increase in activity in more than three years, alongside gains in employment, business activity, exports, and the forward-looking future activity index. Domestic and external demand are both improving.\nPrice pressures remained elevated in July but showed signs of easing. If this trend is repeated in the August data, it could raise hopes for a softer CPI reading in Wednesday’s monthly inflation release. That said, last month’s inflation surprise to the upside leaves open the question of whether it was a temporary blip or the start of a new inflationary phase.\nChart analysis by Matt Simpson - data source: S&P Global, LSEG\nAustralian Inflation in Focus as RBA Rate Cut Bets Shift\nWednesday’s inflation report will be closely watched to determine whether July’s sharp CPI rise was mainly due to the expiry of electricity subsidies, or if price pressures were more broadly spread. Trimmed mean CPI rose 0.6 percentage points in July, though this measure excludes the top 15% of volatile items, suggesting the reflation may have been subsidy-driven.\nIf inflation remains elevated or accelerates further, expectations for RBA rate cuts could be pushed well into next year. To gain confidence that July’s spike was temporary, traders would likely want to see annual trimmed mean inflation fall by at least 0.6 percentage points.\nChart prepared by Matt Simpson - data source: ABS, LSEG\nAUD/USD Holds Strong Ties to China, NZD and Inverse USD Relationship\nThe relationship between the Australian dollar and China is realigning, with the 20-day correlation between AUD/USD and both copper and the CSI 300 index now back above 0.8. The correlation with the New Zealand dollar also remains strong, as does the inverted relationship with the US dollar.\nChart prepared by Matt Simpson - data source: LSEG\nAustralian Dollar Implied Volatility Drops, Bearish Bets Rise\nExpectations of future volatility in AUD/USD continue to trend lower, with 1-month implied volatility falling to a 14-month low last week. While overnight implied volatility spiked around the FOMC meeting, it too dropped back to a 2-month low by Friday’s close, sitting well below the 1-week measure. With US PCE inflation now the key data point rather than employment, volatility is likely to remain subdued unless Australia’s CPI delivers a surprise or another fresh catalyst emerges.\nRisk reversals have eased from their recent cycle highs alongside AUD/USD after the FOMC meeting, reflecting a rise in puts (bearish bets) relative to calls (bullish bets). Whether th"
            },
            {
                "title": "Australian Dollar remains weak following remarks from RBA Governor Bullock - Mitrade",
                "source": "Mitrade",
                "url": "https://www.mitrade.com/insights/news/live-news/article-1-1139577-20250922",
                "body": "EN\nEnglish\n繁體中文\nไทย\nTiếng việt\n简体中文\nEspañol\nPortuguês\nDeutsch\n한국어\nEnglish(Australia)\nالعربية\nEnglish\n繁體中文\nไทย\nTiếng việt\n简体中文\nEspañol\nPortuguês\nDeutsch\n한국어\nEnglish(Australia)\nالعربية\nMarkets\nPopulars\nForex\nCommodities\nShares\nIndices\nCrypto\nETFs\nBonds\nNews\nAll\nForex\nCommodities\nShares\nIndices\nCryptocurrencies\nTechnical Analysis\nEconomic Indicator\nAnalysis\nAll\nEconomics\nCurrencies\nCommodity\nShares\nCryptocurrency\nTrading Tools\nEconomic Calendar\nTrading Analysis\nBlog\nAll\nForex\nCommodity\nShare\nIndices\nCryptocurrency\nOthers\nEducation\nCourses\nAbout us\nOur Professional Partners\nEditorial Policy\nMarkets\nNews\nAnalysis\nTrading Tools\nBlog\nEducation\nAbout us\nOFFICIAL TRUMP\n8.11\n-2.05%\n8.11\nGold\n3698.61\n+0.37%\n3698.61\nEUR/USD\n1.17343\n-0.08%\n1.17343\nWTI\n62.737\n+0.85%\n62.737\nUSD/JPY\n148.249\n+0.24%\n148.249\nNAS100\n24604.2\n-0.04%\n24604.2\nAUD/USD\n0.65947\n+0.14%\n0.65947\nBrent\n67.16\n+0.66%\n67.16\nBitcoin\n114269.64\n-0.80%\n114269.64\nPopular Articles\nUSD/CHF refreshes weekly high around 0.7970 as US Dollar outperforms\n1758518749\nGBP/JPY sticks to intraday recovery gains above mid-199.00s amid notable JPY weakness\n1758518335\nFX option expiries for Sept 22 NY cut\n1758518286\nPopular Articles\nUSD/CHF refreshes weekly high around 0.7970 as US Dollar outperforms\n1758518749\nGBP/JPY sticks to intraday recovery gains above mid-199.00s amid notable JPY weakness\n1758518335\nEUR/USD weakens below 1.1750 as Eurozone Consumer Confidence and Fedspeak loom\n1758517329\nPopular Articles\nIndia Gold price today: Gold rises, according to FXStreet data\n1758516236\nGold remains close to all-time peak amid Fed's dovish stance and geopolitical tensions\n1758515666\nWTI rises above $63.20 amid geopolitical risks\n1758507571\nPopular Articles\nCould IonQ Outperform Nvidia in the Next Decade?\n1758502800\nIf I Could Only Buy and Hold a Single Stock, This Would Be It\n1758496740\nMy Top Growth Stock to Buy for 2026 (and It's Not Even Close)\n1758496080\nPopular Articles\nUS Dollar Index extends upside above 97.50 as traders brace for Fedspeak\n1758514175\nDow Jones Industrial Average chalks up strong weekly performance post-Fed\n1758303955\nUSD extends post-FOMC gains – Scotiabank\n1758282570\nPopular Articles\nDogecoin and Shiba Inu Bulls Nervous As Analysts Call Layer Brett The Only 100x Meme Play Left This Cycle\n1758517779\nDOGE ETF Debut Sees Strong Volume, Analysts Take Notice\n1758517200\nXRP Price Dips Below $3 – Could This Trigger a Bigger Bearish Wave?\n1758517119\nPopular Articles\nFX option expiries for Sept 22 NY cut\n1758518286\nRipple Price Forecast: XRP trades on shaky ground as downside risks emerge\n1758292200\nEUR/USD might retest the 1.1750 level – UOB Group\n1758278927\nPopular Articles\nJapan’s Hayashi says weak Japanese Yen contributes to inflation\n1758504253\nRBA's Bullock: Tightness remains in labour market\n1758503742\nPBOC leaves Loan Prime Rates unchanged in September\n1758503018\nPopular Analysis\nJapanese Yen drifts lower amid BoJ rate hike uncertainty and USD strength\n1758510710\nSilver Price Forecast: XAG/USD climbs beyond $43.00, highest since September 2011\n1758510432\nAustralian Dollar remains weak following remarks from RBA Governor Bullock\n1758510365\nPopular Analysis\nStocks, dollar, gold, oil, and Bitcoin show diverging moves post-Fed rate cut\n1758188760\nFederal Reserve set to resume interest-rate cuts as concerns over labor market mount\n1758103901\nBoC expected to cut interest rate as growth slows and the labour market weakens\n1758100286\nPopular Analysis\nJapanese Yen drifts lower amid BoJ rate hike uncertainty and USD strength\n1758510710\nAustralian Dollar remains weak following remarks from RBA Governor Bullock\n1758510365\nEUR/USD extends losses below 1.1750 ahead of Eurozone Consumer Confidence\n1758504706\nPopular Analysis\nSilver Price Forecast: XAG/USD climbs beyond $43.00, highest since September 2011\n1758510432\nSilver Price Forecast: XAG/USD advances to near $42.40 on Fed’s dovish policy outlook\n1758272441\nGold stalls corrective slide from record high as geopolitical risks boost safe-h"
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "1.0910",
            "open": "147.8890",
            "close": "147.9380",
            "high": "148.2800",
            "low": "147.1890"
        },
        "market_summary": "The USD/JPY is trading near the 148 level, caught between a stronger US Dollar supported by a relatively hawkish Fed and a weaker Japanese Yen hampered by uncertainty over the timing of the Bank of Japan's next rate hike. Political uncertainty in Japan surrounding the upcoming LDP leadership election adds another layer of complexity, with different outcomes potentially accelerating or delaying BoJ policy normalization. The pair is expected to remain volatile within a broad range, with key resistance near 150 and significant support at the 145 level.\n\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Japanese Yen drifts lower amid BoJ rate hike uncertainty and USD strength - Mitrade",
                "source": "Mitrade",
                "url": "https://www.mitrade.com/insights/forex-analysis/jpy/fxstreet-USDJPY-202509221111",
                "body": "Japanese Yen drifts lower amid BoJ rate hike uncertainty and USD strength\nThe Japanese Yen drifts lower at the start of a new week amid the BoJ rate hike ambiguity.\nSustained USD buying interest turns out to be another factor lending support to USD/JPY.\nThe divergent BoJ-Fed policy outlook could limit deeper losses for the lower-yielding JPY.\nThe Japanese Yen (JPY) kicks off the new week on a weaker note and seems vulnerable to prolong its retracement slide from the highest level since July 7, touched against a broadly firmer US Dollar (USD) last Wednesday. The initial market reaction to the Bank of Japan's (BoJ) hawkish on-hold decision on Friday turned out to be short-lived amid the uncertainty over the likely timing and the pace of rate hikes. This, along with a generally positive tone around the equity markets, undermines the safe-haven JPY.\nMeanwhile, expectations that the BoJ will stick to its policy normalization path mark a significant divergence in comparison to the Federal Reserve's (Fed) dovish signal that two more rate cuts would follow through the end of this year. This, in turn, could act as a headwind for the USD and offer some support to the lower-yielding JPY. This, in turn, makes it prudent to wait for some follow-through buying before placing fresh bullish bets around the USD/JPY pair and positioning for any further appreciation.\nThe Japanese Yen struggles to lure buyers despite the BoJ’s hawkish rate decision last Friday\nThe Bank of Japan left its Target Rate unchanged at 0.50%, as was expected, for its fifth straight meeting on Friday, though there were two dissenters voting for a rate hike. Investors, however, remain concerned that the BoJ could delay raising interest rates amid domestic political uncertainty and economic headwinds stemming from US tariffs.\nJapan's Chief Cabinet Secretary and Prime Minister contender, Yoshimasa Hayashi, said this Monday that the BoJ is conducting monetary policy in a way that does not deviate much from the government's thinking. If chosen as premier, will compile economic package to cushion blow from rising living costs, spending for disaster relief, Hayashi added.\nThe People’s Bank of China (PBOC) kept its benchmark lending rates unchanged for the fourth straight month in September, in line with expectations. The one-year and five-year Loan Prime Rates (LPRs) stood at 3.00% and 3.50%, respectively. This reflects a cautious approach to monetary easing amid easing US-China trade tensions, despite signs of a slowdown.\nMeanwhile, the Federal Reserve last week lowered its benchmark rate for the first time since December and saw the need for two more rate cuts this year amid worries about a softening US labor market. This marks a significant divergence in comparison to the BoJ's relative hawkish stance and could help limit deeper losses for the lower-yielding Japanese Yen.\nThe US Dollar is seen building on last week's goodish rebound from its lowest level since July 2022 amid a hawkish assessment of Fed Chair Jerome Powell's remarks. Powell said that the Fed's rate reduction move was a risk management cut and that he doesn't feel the need to move quickly on interest rates. This remains supportive of the USD/JPY pair's move up.\nThere isn't any relevant market-moving economic data due for release on Monday, either from Japan or the US. Hence, traders will closely scrutinize comments from a slew of influential FOMC members, including Powell. This, in turn, will drive the USD demand later during the North American session and provide some meaningful impetus to the currency pair.\nUSD/JPY might face stiff resistance at the 200-day SMA near 148.60\nFrom a technical perspective, acceptance above the 148.00 round figure factors the USD/JPY bulls. Moreover, oscillators on the daily chart have just started gaining positive traction and back the case for further appreciation. That said, any subsequent move up is more likely to confront stiff resistance near the 200-day Simple Moving Averag"
            },
            {
                "title": "UBS lifts USD/JPY forecast, yen seen stuck in 140–150 range amid political risks - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/forexlive:c60697b70094b:0-ubs-lifts-usd-jpy-forecast-yen-seen-stuck-in-140-150-range-amid-political-risks/",
                "body": "UBS lifts USD/JPY forecast, yen seen stuck in 140–150 range amid political risks\nUBS Group strategists have lifted their dollar-yen forecasts,\n- now seeing USD/JPY at 143 by the end of 2025\n- and 140 by the end of 2026,\ncompared with 130 previously.\nThe revision reflects rising political uncertainty in Japan, which UBS says has helped keep the Bank of Japan more dovish than markets once expected.\nWhile investors are still pricing in one more BoJ rate hike before January 2026, the yen has not fully benefited from tightening expectations. Strategists pointed to Japan’s strong equity market and lower volatility as additional drags on the currency. UBS said there is little sign of a coordinated move toward a stronger yen, such as a new Plaza Accord, and the pair is more likely to trade toward the lower end of a 140–150 range rather than break below it for long.\nOn the U.S. side, the bank expects the dollar to remain weak as labor market softness pressures short-term Treasury yields lower. This article was written by Eamonn Sheridan at investinglive.com."
            },
            {
                "title": "USD/JPY Price Forecast - USD to JPY at 147.95 After Fed Cut, BoJ Dissent and LDP Election Shape October Outlook - tradingnews.com",
                "source": "tradingnews.com",
                "url": "https://www.tradingnews.com/news/usd-jpy-price-forecast-usd-to-jpy-holds-147-as-fed-ease-and-boj-faces",
                "body": "USD/JPY Price Forecast - USD to JPY Holds 147.95 as Fed Eases and BoJ Faces Rising Pressure Ahead of October Shift\nWith U.S. GDP at 3.3%, PCE forecast at 3%, and Japan’s leadership race favoring Koizumi, USD/JPY faces resistance near 150 while downside risk sharpens toward 145 | That's TradingNEWS\nUSD/JPY Stays Volatile Near 148 as Fed Cuts Meet BoJ Dissent\nThe USD/JPY pair ended the week at 147.95, swinging between a low of 145.48 and a high of 148.28 as traders digested a 25-basis-point Fed rate cut and growing dissent within the Bank of Japan. While the Fed move was fully priced, the dollar initially slipped before rebounding on higher Treasury yields. Meanwhile, the BoJ held rates at 0.5%, but a 7–2 split on the vote signaled a deeper internal rift, raising expectations that a hike could arrive by October.\nJapanese Political Uncertainty Adds to Currency Pressure\nThe Liberal Democratic Party will choose a new leader on October 4, with Shinjiro Koizumi slightly ahead of Sanae Takaichi in recent polls. Koizumi, backed by former PM Suga and seen as market-friendly, holds a 70% probability of winning according to betting markets. His victory could accelerate BoJ normalization and strengthen the yen, while a Takaichi win, tied to fiscal expansion, may trigger short-lived dollar strength before fundamentals reassert downward pressure on USD/JPY.\nUpcoming Economic Data to Decide Fed’s Tone\nMarkets will watch the U.S. Services PMI on September 23 (expected 53), GDP on September 25 (Q2 growth at 3.3%), and the Core PCE Price Index on September 26 (forecast 3% YoY). Higher inflation and stronger services activity could dampen rate cut expectations, supporting the dollar, while weaker data may accelerate dovish pricing and weigh on USD/JPY. Initial jobless claims are also projected to rise to 240k, up from 231k, potentially adding pressure to the greenback if labor softens further.\nTechnical Outlook for USD/JPY Levels\nThe pair trades above both the 50-day and 200-day EMAs, confirming a bullish short-term bias. A break above 148.28 opens the door to resistance at 149.35, with the August 1 high of 150.91 as the next ceiling. On the downside, a move below the 200-day EMA exposes support at 145.00, a critical inflection level that could spark broader yen appreciation if BoJ policy tightens alongside Fed easing.\nRead More\n-\nVirtus PFFA ETF: 9.05% Yield at $22.43 with Strong Sector Allocation and Income Stability\n21.09.2025 · TradingNEWS ArchiveStocks\n-\nBitcoin ETF Inflows of $2.8B Fuel $115K Price, Institutional Rotation Signals Bullish Path\n21.09.2025 · TradingNEWS ArchiveCrypto\n-\nNatural Gas (NG=F) Holds $3.10 as Storage Builds and LNG Policy Fuels Long-Term Bull Case\n21.09.2025 · TradingNEWS ArchiveCommodities\n-\nSterling Drops: GBP/USD Price at 1.3480 on Fiscal Shock and Fed-Backed Dollar Strength\n21.09.2025 · TradingNEWS ArchiveForex\nBoJ ETF Unwind Signals Policy Shift\nThe Bank of Japan’s announcement to begin selling parts of its $250 billion ETF and J-REIT holdings marked a further step toward unwinding ultra-loose monetary policy. Combined with hawkish dissents from Takata and Tamura, this signals rising pressure on Governor Ueda to act. Traders recall how a surprise July 2024 rate hike and bond-purchase cuts drove USD/JPY from 155.21 to 139.57 within six weeks—underscoring the risk of a sharp yen rebound if policy turns hawkish faster than expected.\nMarket Positioning and Probability Bands\nEvent risk remains elevated ahead of October 4. Short-term, the market is treating 145.00 as the line in the sand, with Koizumi’s odds implying a potential gap lower if he wins the LDP leadership. Conversely, strength toward 149.50 could be faded as the dollar loses structural support from U.S.–Japan yield spreads. NFP on October 3 adds another layer: consensus points to a modest +70k payrolls, well below August’s weak print, a result that could reinforce dollar softness heading into the Japanese political pivot.\nVerdict on USD/JPY: Bearish Tilt "
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0057",
            "open": "1.3793",
            "close": "1.3771",
            "high": "1.3825",
            "low": "1.3768"
        },
        "market_summary": "The USD/CAD is currently elevated near 1.3800, supported by a Fed that is taking a cautious and gradual approach to cutting rates, which has strengthened the US Dollar. However, a forecast from Scotiabank projects significant long-term depreciation for the pair, predicting a drop to 1.28 by end-2026, driven by an expected series of Fed rate cuts that will narrow the interest rate differential with the BoC. Near-term support for the Canadian Dollar is also found in positive August retail sales estimates, which ease fears of an aggressive BoC easing cycle.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "USD/CAD rises to near 1.3800 due to Fed’s cautious policy outlook - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-cad-rises-to-near-13800-due-to-feds-cautious-policy-outlook-202509220250",
                "body": "- USD/CAD rises as the Fed signals a gradual approach to cutting borrowing costs in the coming months.\n- The Fed’s “dot plot” projects two additional rate cuts for this year.\n- The Canadian Dollar could gain support as August Retail Sales estimates ease concerns of a sharp BoC rate cut cycle.\nUSD/CAD recovers its recent losses, trading around 1.3800 during the Asian hours on Monday. The US Dollar (USD) gains ground against its peers as the Federal Reserve (Fed) indicated no rush to lower borrowing costs quickly in the coming months after delivering a widely anticipated quarter-basis-point rate cut last week.\nThe US Dollar Index (DXY), which measures the value of the US Dollar against six major currencies, is gaining ground and trading around 97.70 at the time of writing. Traders will likely observe the upcoming Personal Consumption Expenditures (PCE) Price Index later this week, the Federal Reserve’s preferred inflation gauge, which is expected to signal subdued price pressures.\nFed Chair Jerome Powell justified the cut rate after holding them steady since December amid growing signs of weakness in the labor market, along with concerns over tariff-driven inflation. Moreover, Powell also said that he doesn't feel the need to move quickly on rates and that the Fed is in a meeting-by-meeting situation regarding the outlook for interest rates. The Fed's rate projection, or the so-called \"dot plot,\" showed a forecast of two more rate cuts this year.\nThe Canadian Dollar (CAD) may gain support as advance estimates showed August retail sales rising 1.0%, offsetting July’s 0.8% drop and easing concerns of a sharp Bank of Canada (BoC) easing cycle. The Canadian central bank cut its benchmark rate by 25 bps to 2.50% last week as the labor market has weakened further, underlying inflationary pressures have eased, and Canada’s withdrawal of most retaliatory tariffs has lowered upside risks to inflation.\nCanadian Dollar FAQs\nThe key factors driving the Canadian Dollar (CAD) are the level of interest rates set by the Bank of Canada (BoC), the price of Oil, Canada’s largest export, the health of its economy, inflation and the Trade Balance, which is the difference between the value of Canada’s exports versus its imports. Other factors include market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – with risk-on being CAD-positive. As its largest trading partner, the health of the US economy is also a key factor influencing the Canadian Dollar.\nThe Bank of Canada (BoC) has a significant influence on the Canadian Dollar by setting the level of interest rates that banks can lend to one another. This influences the level of interest rates for everyone. The main goal of the BoC is to maintain inflation at 1-3% by adjusting interest rates up or down. Relatively higher interest rates tend to be positive for the CAD. The Bank of Canada can also use quantitative easing and tightening to influence credit conditions, with the former CAD-negative and the latter CAD-positive.\nThe price of Oil is a key factor impacting the value of the Canadian Dollar. Petroleum is Canada’s biggest export, so Oil price tends to have an immediate impact on the CAD value. Generally, if Oil price rises CAD also goes up, as aggregate demand for the currency increases. The opposite is the case if the price of Oil falls. Higher Oil prices also tend to result in a greater likelihood of a positive Trade Balance, which is also supportive of the CAD.\nWhile inflation had always traditionally been thought of as a negative factor for a currency since it lowers the value of money, the opposite has actually been the case in modern times with the relaxation of cross-border capital controls. Higher inflation tends to lead central banks to put up interest rates which attracts more capital inflows from global investors seeking a lucrative place to keep their money. This increases demand for the local currency, which in Canada’s case i"
            },
            {
                "title": "Scotiabank US Dollar To Canadian Dollar Forecast: USD/CAD Forecast At 1.28 By End-2026 - Forex Factory",
                "source": "Forex Factory",
                "url": "https://www.forexfactory.com/news/1362451-scotiabank-us-dollar-to-canadian-dollar-forecast-usdcad/amp",
                "body": "Scotiabank US Dollar To Canadian Dollar Forecast: USD/CAD Forecast At 1.28 By End-2026\nFrom exchangerates.org.uk\nThe US Dollar to Canadian Dollar (USD/CAD) exchange rate traded just above 1.3750 following the latest Bank of Canada (BoC) policy decision. Scotiabank expects one further rate cut by the central bank while it expects a series of Federal Reserve cuts which will narrow yield spreads and trigger fresh Canadian dollar gains. It projects USD/CAD losses to 1.34 by the end of 2025 and 1.28 by the end of next year. The BoC cut interest rates at the September 17th policy meeting with a further 25 basis-point cut to 2.50% which was in line with consensus forecasts. The bank noted that are risks to both costs and activity from ...\n(full story)"
            },
            {
                "title": "Scotiabank US Dollar To Canadian Dollar Forecast: USD/CAD Forecast At 1.28 By End-2026 - Exchange Rates Org UK",
                "source": "Exchange Rates Org UK",
                "url": "https://www.exchangerates.org.uk/news/44083/2025-09-21-scotiabank-us-dollar-to-canadian-dollar-forecast-usd-cad-forecast-at-1-28-by-end-2026.html",
                "body": "Scotiabank US Dollar To Canadian Dollar Forecast: USD/CAD Forecast At 1.28 By End-2026\nThe US Dollar to Canadian Dollar (USD/CAD) exchange rate traded just above 1.3750 following the latest Bank of Canada (BoC) policy decision.\nScotiabank expects one further rate cut by the central bank while it expects a series of Federal Reserve cuts which will narrow yield spreads and trigger fresh Canadian dollar gains.\nIt projects USD/CAD losses to 1.34 by the end of 2025 and 1.28 by the end of next year.\nThe BoC cut interest rates at the September 17th policy meeting with a further 25 basis-point cut to 2.50% which was in line with consensus forecasts.\nThe bank noted that are risks to both costs and activity from on-going tariffs and noted the high degree of uncertainty.\nAlthough it considers that policy is now well calibrated Scotiabank does expect that the central bank will cut again in October as an insurance against a further weakening in activity, especially given weak employment reports for the last two months.\nNevertheless, it is also concerned that inflation pressures will prove stubborn and expects that the central bank will start to increase interest rates again in the second half of 2026.\nIn contrast, it expects the Federal Reserve will continue to cut rates throughout next year which would help underpin the Canadian dollar and it also notes the possibility of more political control of the Fed which could trigger sharper US losses."
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "1.4300",
            "open": "200.2740",
            "close": "199.2440",
            "high": "200.6010",
            "low": "199.1710"
        },
        "market_summary": "The GBP/JPY pair is facing significant downward pressure, primarily driven by a resurgent US Dollar following a less dovish-than-expected Fed. This USD strength is negatively impacting GBP pairs broadly, as seen in GBP/USD testing key support levels amid a four-day losing streak. Concurrently, the Japanese Yen is showing resilience after the Bank of Japan's surprise announcement to scale back ETF purchases, which caught traders off guard and reduced net-long exposure to the yen.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "US Dollar, Japanese Yen, New Zealand Dollar: COT Report Analysis - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/us-dollar-japanese-yen-new-zealand-dollar-cot-report-analysis/",
                "body": "This week’s Commitment of Traders (COT) report revealed sharp shifts in positioning across the US dollar, Japanese yen, and New Zealand dollar. Asset managers and large speculators were caught off guard by central bank surprises, with the Fed proving less dovish, the BOJ announcing ETF sales, and weak GDP data fuelling RBNZ cut expectations. These moves highlight the risks of trading ahead of major policy events, as positioning frequently failed to anticipate the actual outcome.\nView related analysis:\n- Australian Dollar Outlook: AUD/USD Under Pressure Ahead of CPI and PMIs\n- USD/JPY, AUD/USD, Gold Analysis: COT report\n- Japanese Yen Rebound, USD Weakness, Commodity FX Diverge: COT Report\n- GBP/USD, EUR/GBP: COT Data Appears Favourable to British Pound Bulls\nWeekly COT Report Highlights:\n- US Dollar (USD): Traders increased their net-short exposure to the USD by $0.6 billion to -$9 billion last week\n- European dollar (EUR): Large speculators reduced their net-long exposure to euro futures by -7.9k contracts\n- British pound (GBP): Large speculators reduced net-short exposure to a mere -6.5k contracts, though bearish price action into Friday’s close suggests they will remain net-short in the next report\n- Japanese yen (JPY): Net-long exposure fell to a 30-week low\n- Australian dollar (AUD): Net-short exposure fell to an 18-week low\n- Canadian dollar (CAD): Large specs and asset managers increased gross-longs by a combined 6.4k contracts and reduced shorts by -2.7k contracts\n- Swiss franc (CHF): Asset managers reduced net-short exposure by -6.9kl contracts, their fastest weekly pace in 24\n- New Zealand dollar (NZD): Net-short exposure roughly doubled to -18k contracts amid rising expectations of RBNZ cuts\n- Gold (GC): Large speculators increased net-long exposure to a 31-week high\n- Crude Oil (WTI): Net-long exposure increased for the first week in four, rising 16.8k contracts with gross longs down -6.7% and longs up 1.5%\nChart analysis by Matt Simpson, Source: CME, IMM, LSEG\nCOT Report Analysis: US Dollar, Japanese Yen, New Zealand Dollar\nThere are several recent examples where market positioning failed to anticipate the actual move. Asset managers more than doubled their net-short exposure to the US Dollar Index (DXY) ahead of the FOMC meeting, only to see earlier USD losses mostly erased by the week’s close. Traders also shied away from net-long bets on the Japanese yen before the Bank of Japan (BOJ) meeting, yet the yen strengthened after the BOJ announced it would begin scaling back ETF purchases.\nSimilarly, large speculators in the British pound were close to flipping net-long, but GBP/USD futures instead printed a bearish outside day as the US dollar rebounded post-Fed. A notable bearish pinbar also appeared on the weekly EUR/USD chart, despite reduced gross-longs and an increase in gross-shorts by Tuesday’s close.\nUS Dollar Index (DXY) Positioning: Fed Resilience Fuels USD Rebound\nThe US dollar staged a strong rebound last week after the Federal Reserve proved less dovish than markets had anticipated. This saw the DXY print a bullish weekly pinbar candle into Friday’s close, highlighting the resilience of USD demand.\nLarge speculators were wrongfooted, having entered the week with rising net-short exposure to the US dollar. Importantly, the increase in net-short positioning came largely from long liquidation rather than an aggressive build-up of short bets. This dynamic suggests that much of the USD rebound was fuelled by fresh bullish positioning rather than simple short covering.\nAmong asset managers, net-short exposure to the US dollar was broadly flat. However, if USD momentum extends, the next Commitment of Traders (COT) report could reveal a meaningful increase in long positions from this group as well.\nChart analysis by Matt Simpson, Source: CME, IMM, LSEG\nJapanese Yen Futures: BOJ ETF Unwind Catches Traders Off Guard\nTraders appeared confident that the Bank of Japan (BOJ) would deliver another uneventful policy de"
            },
            {
                "title": "GBP/USD Price Forecast: Tests confluence zone around 1.3450 support - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-usd-price-forecast-tests-the-confluence-zone-around-13450-support-202509220451",
                "body": "- GBP/USD tests the ascending channel’s lower boundary around 1.3450.\n- The 14-day Relative Strength Index stays below 50, reinforcing the bearish bias.\n- The immediate barrier appears at the 50-day EMA of 1.3491.\nThe GBP/USD pair continues its four-day losing streak, trading around 1.3460 during the Asian hours on Monday. The bearish shift appears as the daily chart’s technical analysis shows that the pair is on the verge of breaking below the ascending channel pattern.\nHowever, the 14-day Relative Strength Index (RSI) remains below the 50 level, strengthening the bearish bias. Additionally, the GBP/USD pair is positioned below the nine-day Exponential Moving Average (EMA), suggesting the short-term price momentum is weaker.\nThe GBP/USD pair is testing its primary support at the ascending channel’s lower boundary around 1.3450. A break below the channel would confirm that the bearish bias is active and put downward pressure on the pair to test the monthly low at 1.3333, recorded on September 3, followed by the five-month low of 1.3141, which was reached on May 12.\nOn the upside, the GBP/USD pair may target the immediate barrier at the 50-day EMA of 1.3491, followed by the nine-day EMA at 1.3531. A break above these levels would improve the short- and medium-term price momentum and lead the pair to approach the two-month high of 1.3726, reached on September 17, followed by the 1.3788, the highest since October 2021, which was recorded on July 1.\nGBP/USD: Daily Chart\nPound Sterling Price Today\nThe table below shows the percentage change of British Pound (GBP) against listed major currencies today. British Pound was the weakest against the US Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the British Pound from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent GBP (base)/USD (quote).\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice.\nRecommended content\nEditors’ Picks\nAUD/USD eases below 0."
            },
            {
                "title": "GBP/USD: Cable Bears Face Headwinds from Daily Cloud Top - Action Forex",
                "source": "Action Forex",
                "url": "https://www.actionforex.com/contributors/technical-analysis/612720-gbp-usd-cable-bears-face-headwinds-from-daily-cloud-top/?amp",
                "body": "Cable remains in a step fall from last Wednesday’s 2 ½ month peak (1.3725) which has so far retraced over 61.8% of recent 1.3333/1.3725 rally and cracked next significant support at 1.3465 (daily cloud top).\nPound was initially hit by stronger dollar after Fed disappointed expectations for keeping very dovish stance, with signals from BoE Governor for possible further rate reductions, boosting bears on Thursday, while Friday’s unexpectedly high rise in UK borrowing sparked fresh acceleration lower.\nTechnical studies weakened on daily chart, with the pair being on track for weekly close in red (potential formation of bearish engulfing and long upper shadow on weekly candle add to negative signals).\nOn the other hand, daily cloud top offers solid support, which may hold bears for some time, with limited upticks to be capped under 1.3530 (daily Kijun-sen / broken Fibo 50%) to offer better selling levels and keep bears in play.\nRes: 1.3500; 1.3530; 1.3559; 1.3575\nSup: 1.3465; 1.3426; 1.3397; 1.3333"
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "746.0000",
            "open": "115,777.5000",
            "close": "115,364.5000",
            "high": "116,014.5000",
            "low": "115,268.5000"
        },
        "market_summary": "Bitcoin is experiencing a surge of institutional investment, with massive ETF inflows driving significant optimism. This is bolstered by positive technical indicators, historical seasonal trends like \"Uptober,\" and supportive macroeconomic factors including potential Federal Reserve rate cuts. Price predictions are extremely bullish, with analysts forecasting targets as high as $120,000 to $150,000.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Bitcoin ETF Inflows Spark New Optimism as MAGACOIN FINANCE Emerges - OneSafe",
                "source": "OneSafe",
                "url": "https://www.onesafe.io/blog/bitcoin-etf-inflows-magacoin-finance-crypto-outlook",
                "body": "Bitcoin is making headlines again, channeling the energy of a comeback into its technical performance. With Bitcoin ETF inflows skyrocketing to a staggering $246 million in a mere 24 hours, the digital currency is not just reclaiming its market stature—it’s fueling an intense revival of institutional faith. Investors are brimming with optimism for an explosive year-end rally, and the buzz is palpable. Analysts are whispering about the potential for Bitcoin to flirt with the monumental $120,000 milestone, a notion that has the crypto community buzzing with anticipation.\nThe Landscape of Bitcoin Price Predictions\nCoinciding with Bitcoin's stabilization and renewed appeal among institutions is a wave of invigorating price forecasts. Expectations are high, with many experts predicting that Bitcoin might soon challenge the coveted $120,000 mark. This forecast is grounded in significant whale accumulation and reassuring technical metrics. The recent uptick in the Relative Strength Index (RSI) suggests that the market might be gearing up for a substantial breakthrough. Historical patterns suggest that consolidations like this are precursors to price surges, hinting that Bitcoin could be on the verge of an exhilarating leap.\nInstitutional Movements Influencing Market Dynamics\nThe remarkable spike in Bitcoin ETF investments harmonizes with a backdrop of evolving macroeconomic factors. As market analysts speculate on possible interest rate cuts by the Federal Reserve, a sense of bullishness takes root. These expectations suggest potential liquidity boosts, encouraging institutions to redirect funds toward lucrative cryptocurrency ventures. Such institutional dynamics have historically played a pivotal role, often ushering in positive price shifts for Bitcoin and its vibrant ecosystem of altcoins.\nMAGACOIN FINANCE: The Altcoin Riding the Wave\nAmid Bitcoin's resurgence, retail investors are keenly focusing on dynamic altcoin projects like MAGACOIN FINANCE. This cryptocurrency is capturing attention through its well-executed tokenomics and a vibrant community presence. Analysts are drawing intriguing comparisons between MAGACOIN and early success stories like Shiba Inu, insinuating that it holds promise as a potential frontrunner in the altcoin arena. As retail enthusiasm crescendos, MAGACOIN FINANCE stands out as a tantalizing prospect for those eager to harness potential high returns.\nThe Allure of Emerging Cryptocurrencies\nIn an arena dominated by established players like Bitcoin, retail traders are fervently on the hunt for their next victory. MAGACOIN FINANCE distinguishes itself with its transparent smart contracts and limited token supply, tackling inflation concerns that burden many other altcoins. This strategic allure resonates with investors eager for substantial growth prospects. The heightened interest in burgeoning cryptocurrencies epitomizes a market fervently seeking high-reward opportunities, alongside the stability offered by leading tokens.\nFacing Regulatory Challenges in the Crypto Realm\nYet, as Bitcoin and MAGACOIN FINANCE entice investors, it’s crucial to grasp the intricate regulatory landscape that governs the crypto market. Startups must tread carefully as institutional players explore seamless crypto-fiat integration amid constantly shifting compliance requirements. With policymakers adapting to the nuances of the crypto realm, maintaining strong compliance frameworks will be critical for any emergent cryptocurrency aiming for sustainable longevity.\nConclusion\nThe surge in Bitcoin ETF inflows is ushering in a refreshing wave of optimism for the cryptocurrency market. With price predictions suggesting that Bitcoin is on the cusp of testing the $120K threshold, bolstered by institutional backing and positive market shifts, a sense of excitement prevails. As retail investors gravitate toward rising altcoins, MAGACOIN FINANCE stands as a beacon of potential opportunity. Navigating the delicate balance of embracing gro"
            },
            {
                "title": "Bitcoin ETF Inflows $2.8B Push BTC Toward $150K as Fed Cuts Rates, Institutions Pile In - tradingnews.com",
                "source": "tradingnews.com",
                "url": "https://www.tradingnews.com/news/bitcoin-etf-inflows-of-2-8b-usd-fuel-115k-usd-price",
                "body": "Bitcoin ETF Inflows of $2.8B Fuel $115K Price, Institutional Rotation Signals Bullish Path\nWith BlackRock and Fidelity driving ETF demand, miner costs near $115K, and Fed rate cuts boosting risk appetite, Bitcoin (BTC-USD) is positioned for a test of $117.9K resistance and a potential run to $150K | That's TradingNEWS\n9/21/2025 9:43:07 PM\nRead More\n-\nVirtus PFFA ETF: 9.05% Yield at $22.43 with Strong Sector Allocation and Income Stability\n21.09.2025 · TradingNEWS ArchiveStocks\n-\nSolana Price Forecast - SOL-USD at $237 Targets Breakout as CME Options and ETF Catalysts Shape Q4\n21.09.2025 · TradingNEWS ArchiveCrypto\n-\nNatural Gas (NG=F) Holds $3.10 as Storage Builds and LNG Policy Fuels Long-Term Bull Case\n21.09.2025 · TradingNEWS ArchiveCommodities\n-\nUSD/JPY Price Forecast - USD to JPY Holds 147.95 as Fed Eases and BoJ Faces Rising Pressure Ahead of October Shift\n21.09.2025 · TradingNEWS ArchiveForex"
            },
            {
                "title": "The ‘Uptober’ Effect: Why Analysts Are Bullish on Bitcoin’s Price in October - CryptoPotato",
                "source": "CryptoPotato",
                "url": "https://cryptopotato.com/the-uptober-effect-why-analysts-are-bullish-on-bitcoins-price-in-october/",
                "body": "Bitcoin (BTC) is on track for a third consecutive “green” September, a trend that has historically set the stage for a “double-digit” October rally.\nWith gains for the month currently hovering around 8%, analysts are watching to see if this pattern, dubbed “Uptober”, will repeat itself.\nLook Out for the Double-digit October\nAnalysts are watching BTC closely this month, noting that in past years, every September with an upward trend has been followed by double-digit gains in October. For example, in 2024, the asset recorded a +7.29% increase in September, which was followed by a +10.76% rise the next month. In 2023, it gained +3.91% during the same period and was followed by a +28.52% jump in October, as shown below:\nThis consistent trend has led experts to believe that traders and investors could be positioning their portfolios to anticipate a rally, which may result in a self-fulfilling prophecy. As institutional and retail money pours in, the heightened buying pressure creates the very surge they were predicting, amplifying the “Uptober” narrative and making it a key part of the market’s psychology.\nThe April 2024 Bitcoin halving, which slashed the reward for mining new blocks by 50%, has created a supply shock. Historically, the year following a halving has been a powerful growth period. The “Uptober” rally fits into this broader cycle, as the reduced supply meets sustained demand.\nPast data provide evidence of this trend. For instance, the 2016 halving was followed by a landmark bull run in 2017, where BTC’s price surged from a few hundred dollars to nearly $20,000. Similarly, the 2020 halving was the precursor to a historic surge in 2021, when the cryptocurrency’s price skyrocketed from around $10,000 to a peak near $69,000 by November.\nMacroeconomic Policy and Institutional Adoption\nFollowing months of economic uncertainty, recent actions by central banks, including a rate cut by the Federal Reserve in September 2025, have injected a sense of confidence into riskier assets. The recent reduction by 25 BPS saw the flagship cryptocurrency’s price rally to $118 K.\nAdditionally, recent shifts in U.S. government policy are seen as a bullish sign. The Trump administration has taken a pro-crypto stance, with the creation of a Strategic Bitcoin Reserve in March 2025.\nThe continued growth of spot Bitcoin ETFs, particularly in the United States, has also become a major driver of demand. Recent data highlights this trend. In the first half of September, these investment products saw their largest weekly inflows since July, with some funds accumulating hundreds of millions of dollars in a single day.\nInstitutional demand is said to be outpacing the pace of new BTC supply coming from mining. The combined holdings of US-listed ETFs have now crossed 1.3 million BTC, showing the adoption by large investors and its impact on market dynamics.\nLIMITED OFFER for CryptoPotato readers at Bybit: Use this link to register and open a $500 FREE position on any coin!"
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "58.1400",
            "open": "4,483.4300",
            "close": "4,475.8500",
            "high": "4,502.6900",
            "low": "4,444.5500"
        },
        "market_summary": "Ethereum's price has crossed the significant $4,600 threshold, reigniting market hype and momentum, partly fueled by macroeconomic factors like the Fed's rate cut. Co-founder Vitalik Buterin has published a blog post advocating for a strategic shift, arguing that sustainable revenue for Ethereum's economy should come from \"low-risk DeFi\" applications like payments and collateralized lending rather than from memecoins and speculative assets. This perspective is supported by the growing real-world adoption of stablecoins and real-world assets on the network, even as new DeFi projects like Mutuum Finance attract significant investment based on this sustainable model.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Low-risk DeFi, not memecoins, can best sustain Ethereum's economy, co-founder Vitalik Buterin says - theblock.co",
                "source": "theblock.co",
                "url": "https://www.theblock.co/post/371527/low-risk-defi-not-memecoins-can-best-sustain-ethereums-economy-co-founder-vitalik-buterin-says",
                "body": "Low-risk DeFi, not memecoins, can best sustain Ethereum's economy, co-founder Vitalik Buterin says\nQuick Take\n- Vitalik Buterin argued that low-risk decentralized finance can do for Ethereum what search does for Google by economically sustaining the network’s economy.\n- Payments, savings, and fully collateralized lending provide “irreplaceable value” while being “culturally congruent” with the Ethereum community, Vitalik said in a blog post.\nEthereum co-founder Vitalik Buterin called on the Ethereum community to put a stronger focus on low-risk decentralized finance protocols, arguing such protocols can economically sustain less profitable but still important applications on the network, in a new blog post published Sunday.\nIn the post, Buterin likened low-risk decentralized finance — namely payments, savings, fully collateralized lending, and other well-understood applications — to Google's advertising business, which accounted for more than three-quarters of the company's revenue in 2024. Google is able to sustain less profitable yet \"interesting and valuable...for the world\" product lines because of the revenue from ads, Buterin argued.\n\"Low-risk defi can play a similar role for Ethereum,\" Buterin wrote. \"Other applications (including non-financial and more experimental applications) are crucially important for Ethereum's role in the world and for its culture, but they do not need to be looked to as revenue generators.\"\nButerin said in the past he was suspicious of DeFi, arguing early risks were too high for sustainable use cases and that trading on speculative assets, or risky yield farming, made up too much of the industry's focus. Buterin pointed out that Yuga Labs' Otherdeed sale in 2022 was one of the single largest days in fees for Ethereum, after a poorly optimized smart contract led to a gas war between bidders.\nYet as risks have decreased, and global regulators have evolved, hacks and losses are \"increasingly being pushed out to further edges of the ecosystem where users are more experimental and speculative,\" Buterin wrote. Though tail risks are still worthy of concern, Vitalik argues, \"for many people worldwide the tail risks of tradfi are now greater than the tail risks of defi.\"\nButerin's blog post does not mention any other blockchain by name, though he implicitly implicitly contrasts Ethereum with ecosystems where memecoins dominate fee revenue.\n\"The revenue generator does not have to be the most revolutionary or exciting application of Ethereum. But it does need to be something that is at least not actively unethical or not embarrassing,\" Buterin wrote (emphasis in original). \"It's just not possible to say with a straight face you are excited about the ecosystem because it's positively changing the world, if its single largest application is political memecoins.\"\nLow-risk DeFi can also eventually evolve into other future applications, such as undercollateralized reputation-based lending, integrating prediction markets with existing DeFi structures, and moving away from USD adoption toward other stable forms of value, like \"flatcoins,\" Buterin wrote.\n\"Low-risk defi is already supporting the Ethereum economy, it is making the world a better place even today, and it is synergistic with many of the more experimental applications that people on Ethereum are building,\" Buterin concluded. \"It is a project that we can all be proud of.\"\nButerin's blog post follows significant changes to the Ethereum Foundation earlier this year. The organization, now run by co-Executive Directors Hsiao-Wei Wang and Tomasz K. Stańczak, has this year released a \"Trillion Dollar Security\" initiative, outlined an end-to-end privacy roadmap, and overhauled its grants program to reduce burn.\nDisclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange"
            },
            {
                "title": "Best ETH DeFi Crypto to Buy for 25x ROI as Ethereum Price Crosses $4600 - Cryptopolitan",
                "source": "Cryptopolitan",
                "url": "https://www.cryptopolitan.com/best-eth-defi-crypto-to-buy-for-25x-roi-as-ethereum-price-crosses-4600/",
                "body": "The Ethereum price has destroyed the $4,600 mark, and hype has again returned to the platform as whales seek higher upside. Ethereum (ETH) remains the stronghold of decentralized finance, but investors are eyeing ETH-built protocols with better potential.\nAmong them is Mutuum Finance (MUTM) at a presale price of $0.035. Mutuum Finance has raised more than $16.05 million and more than 16,450 individual investors. With a lending-and-borrowing mechanism based on Ethereum for application in the real world, MUTM is being tipped by analysts as one DeFi token poised to achieve 25x returns in the next bull cycle.\nEthereum Market Update\nEthereum (ETH) has recently soared past $4,600 and now holds at $4602. ETH’s momentum has reignited following the Fed’s decision to cut rates earlier this week. Analysts predict that the asset could continue higher to create a new all-time high above $5000.\nIts rise has created strong momentum in ETH-based altcoins, among them rising DeFi altcoin Mutuum Finance (MUTM). Currently in presale, the $0.035 token has quickly become a top buy.\nBuilding a Safe Platform\nMutuum Finance has taken that extra step to guarantee security in its platform and joined hands with CertiK to initiate an official bug bounty program with a minimum guaranteed reward pool of $50,000. The reward is of four levels of severity i.e. critical, major, minor and low in a way that each type of vulnerability can be exposed and removed.\nBy opening up its site for third-party auditing to developers and researchers, Mutuum is also welcoming its newest security technology, an additional security and confidence for its investor community.\nTiered Mutuum Loans to Value and liquidation ratios vary with the volatility of the underlying collateral. Reserve multipliers from a 10% safer to up to 35% of risk assets constitute the second source of stability. The system is so nicely balanced in terms of access and safety and increased market participation is possible and systemic risk is sustained.\nMutuum Finance Presale Impresses\nMutuum Finance (MUTM) is leading the way in its sixth round of presale wherein it is breaking records as investors jump in. The project has already gained over 16,450 investors and has crossed the $16.1 million capital hurdle. The trend will only continue to gain momentum. Record-breaking milestones like these are a reassuring sign of increasing confidence of the investors with the platform approaching launch time.\nApart from buying tokens at a cheaper price, investors are able to realize massive returns over the long term as the ecosystem keeps expanding. The project appeals to investors because of its twin lending mechanism, future prospects, open-source and audited codebase, and transparent tokenomics.\nMutuum Finance anticipates long-term growth within the DeFi market. The project is incentivizing early adoption by hosting a $100,000 giveaway campaign, where 10 users of the platform will receive $10,000 MUTM each. The project is well poised to be one of the top ETH-based DeFi projects to watch with Ethereum (ETH) prices over $4,600 now.\nCurrently in Stage 6 presale at $0.035, Mutuum Finance (MUTM) has already secured more than $16.05 million and 16,450+ investors, indicating strong momentum. Having a two-way lending model, CertiK-audited code, and a $50,000 bug bounty program on Ethereum, MUTM offers scalability and security. Professional investors are expecting 25x ROI during the next bull cycle and early entry is most attractive. Buy your tokens now before Stage 7 drives the price to $0.04.\nFor more information regarding Mutuum Finance (MUTM) please use the following links:\nWebsite: https://mutuum.com/\nLinktree: https://linktr.ee/mutuumfinance"
            },
            {
                "title": "Memecoins can’t be Ethereum’s flagship for revenue says co-founder Vitalik Buterin. ‘Low-risk DeFi’ could - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/memecoins-t-ethereum-flagship-revenue-173406587.html",
                "body": "Memecoins can’t be Ethereum’s flagship for revenue says co-founder Vitalik Buterin. ‘Low-risk DeFi’ could\nEthereum has long wrestled with the “non-ouroboros” problem: how to generate real revenue beyond speculative loops of buying, selling, and leveraging tokens on its chain.\nFor years, memecoins, non-fungible tokens, and incentive-driven decentralised finance apps have propped up activity but failed to provide a sustainable foundation for Ethereum’s nearly $100 billion DeFi economy according to DefiLlama data.\nNow, as Wall Street is increasingly betting on Ethereum as the backbone of the stablecoin boom, co-founder Vitalik Buterin argues that “low-risk DeFi,” which includes things like payments, savings, and collateralised lending, could finally give the network its flagship revenue engine.\n“Non-financial and more experimental applications, are crucially important for Ethereum’s role in the world and for its culture,” Buterin wrote in a blog post published Sunday. “But they do not need to be looked to as revenue generators.”\nThat’s a major shift from Ethereum’s earlier years, when DeFi was synonymous with double-digit yields on risky liquidity farms and frenzies over cartoon NFTs.\nButerin admits he was “more suspicious of DeFi” then, describing its main appeal as “making money from trading highly speculative tokens.”\nToday, he says, the centre of gravity has moved toward simpler financial products.\nThe raw numbers and other analysts agree.\nThe supply of stablecoins on Ethereum has ballooned 700% since the start of 2021 to more than $160 billion, while real-world assets like tokenised US Treasuries have grown from almost nothing into a $9 billion market.\n“Stablecoins are the ‘ChatGPT’ of crypto,” Tom Lee, chair of Ethereum treasury firm BitMine, told DL News in August. “And Ethereum is the backbone. It’s legally recognised, and has zero downtime.”\nCrypto market movers\n-\nBitcoin is down 0.4% in the past 24 hours and is trading at $115,440.\n-\nEthereum is down 0.3% in the same period to $4,472.\nWhat we’re reading\n-\nSaylor says Strategy stock under attack from bot army bankrolled by short sellers — DL News\n-\nPayPal’s PYUSD Integrates LayerZero to Expand Across Blockchains — Unchained\n-\nWhat you missed this week — Milk Road\n-\nQuestions linger over Hyperliquid stablecoin contest as critics allege unfair advantage — DL News\nKyle Baird is DL News’ Weekend Editor. Got a tip? Email at kbaird@dlnews.com."
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "5.7100",
            "open": "239.6200",
            "close": "237.4800",
            "high": "241.6900",
            "low": "235.9800"
        },
        "market_summary": "ERROR: AI summary request failed: 429 Client Error: Too Many Requests for url: https://openrouter.ai/api/v1/chat/completions",
        "source_articles": [
            {
                "title": "Solana News: SOL Price Set for New ATH, While This $0.035 DeFi Altcoin Builds Stronger Momentum - Cryptopolitan",
                "source": "Cryptopolitan",
                "url": "https://www.cryptopolitan.com/solana-news-sol-price-set-for-new-ath-while-this-0-035-defi-altcoin-builds-stronger-momentum/",
                "body": "Solana (SOL) is setting itself up for a possible new all-time high this weekend, as robust network activity and renewed investor enthusiasm continue to propel its price. But as Solana (SOL) dominates the headlines with its price, there is another project building strength even more quietly in presale, Mutuum Finance (MUTM).\nSolana Nears $245 as Resistance Tests Begin\nSolana (SOL) is trading about $245.50, with intraday highs near $253 and lows near $243. Recent price action has shown steady buyer demand, but SOL is also increasing to areas of resistance that had earlier held it back from a solid breakout. Support is starting to develop in the $220–$230 range, which gives some cushion to the downside.\nWhile bullish sentiment and Solana ecosystem activity continue to be confidence supportive, investors feel that newer DeFi venture Mutuum Finance, is offering more potential upside in the current market conditions.\nMutuum Finance Presale FOMO\nMutuum Finance is offering investors the opportunity to be early adopters of the project and invest in tokens at considerably lower rates than what they will be asked to pay after the project’s launch. At presale Phase 6, where it is $0.035 per MUTM, the token will be priced at Phase 7 at $0.04. Presale has succeeded with over $16.05 million collected and over 16,450 token holders, a reflection of confidence and optimism on the part of investors in the market.\nAt yet another security level, Mutuum Finance has also initiated an official Bug Bounty Program in collaboration with CertiK ensuring rewards of up to $50,000 USDT. Publicly announced, the program invites white-hat hackers, developers, and researchers to test the codebase for any weaknesses. The bounties are rewarded on a severity level basis, so even low-level bugs are already resolved before release.\nBeyond Presale\nMUTM is a two-layer hybrid lending protocol, with Peer-to-Contract (P2C) and Peer-to-Peer (P2P) models, to ensure ultimate flexibility. The P2C model is used to enable the contracts to monitor the market round-the-clock so that interest rates can be decided. It is designed such that investors will earn passive income and lenders will lend at the lowest interest rates and the contracts will execute the transaction automatically.\nP2P model enables lenders and borrowers to interact directly in real-time without an intermediary. The more dynamic of the two provides the possibilities for riskier products such as meme coins and freedom and efficiency in a trustless setting.\nIn the interest of providing precise and current prices, Mutuum Finance uses Chainlink oracles that feed on high-cap token price aggregations such as USD, ETH, MATIC, and AVAX. Fallback oracles, combined feeds, and on-chain data feeds are also used for security in a bear market. The stable foundation of sound pricing is used in stable collateral management, liquidation, and risk calculation for stability and efficiency of the protocol under all market conditions.\nMutuum Finance (MUTM) is picking up great momentum while Solana (SOL) is racing towards a fresh ATH above $300. Stage 6 presale tokens are worth $0.035, and the price will go up 14.29% to $0.04 in Stage 7. The project has raised a notable $16.05M in funds with 16,450+ holders, which means investors have confidence in it. With its double lending model of P2C and P2P, Chainlink oracle integration, and $50K CertiK bug bounty, MUTM offers a mix of innovation, flexibility, and security. As Solana tests for resistance, early investors see MUTM as the higher upside bet through 2025. Lock in Stage 6 tokens today before the next price spike.\nFor more information regarding Mutuum Finance (MUTM) please use the following links:\nWebsite: https://mutuum.com/\nLinktree: https://linktr.ee/mutuumfinance"
            },
            {
                "title": "Here’s what happened in crypto today - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/cointelegraph:b431ea497094b:0-here-s-what-happened-in-crypto-today/",
                "body": "Here’s what happened in crypto today\nToday in crypto, the first regulated China stablecoin launches as global stablecoin race heats up, Nasdaq-listed Flora Growth will rebrand to ZeroStack after raising $401 million to support 0G. Meanwhile, the Changpeng Zhao-backed YZi Labs grows stake in stablecoin issuer Ethena.\nThe first regulated CNH-pegged stablecoin launches as the global competition heats up\nThe first stablecoin pegged to the Chinese yuan (CNH) launched this week, as competition from sovereign governments to claim a piece of the stablecoin market mounts.\nFinancial technology company AnchorX debuted its AxCNH yuan-pegged stablecoin on Wednesday at the Belt and Road Summit in Hong Kong. The token is meant for international transactions and not for domestic use on the Chinese mainland.\nBDACS, a digital asset infrastructure company, also launched an overcollateralized Korean won-pegged stablecoin on Thursday, dubbed KRW1.\nThe developments come amid a push from China to challenge the US dollar's dominance in digital currency markets and to establish land and maritime trade routes around the world.\nCannabis firm Flora Growth launches $401M treasury backing Zero Gravity\nNasdaq-listed cannabis firm Flora Growth has launched a $401 million treasury initiative to back Zero Gravity (0G), a blockchain project focused on powering decentralized AI infrastructure.\nThe move comes through a private placement deal combining $35 million in cash with $366 million in in-kind digital assets, primarily denominated in 0G tokens. As part of the transaction, Flora will rebrand as ZeroStack while retaining its Nasdaq ticker, FLGC, according to a Friday announcement.\nSolana (SOL) treasury company DeFi Development Corp. (DFDV) led the deal, alongside Hexstone Capital and Carlsberg SE Asia PTE Ltd, with participation from firms including Dao5, Abstract Ventures and Dispersion Capital.\n“We’re thrilled to partner with FLGC on this fundraise and look forward to driving a deep collaboration between 0g and Solana,” said DFDV CEO Joseph Onorati. Flora will also hold a portion of its treasury in SOL tokens.\nChangpeng Zhao’s YZi Labs deepens stake in stablecoin issuer Ethena\nTech-focused venture capital firm YZi Labs has increased its stake in Ethena, the stablecoin issuer behind USDe, which will assist the digital dollar’s adoption across decentralized and centralized platforms.\nThe investment will assist Ethena USDe’s (USDe) expansion on BNB Chain while enabling Ethena to continue building its USDtb stablecoin and an institutional settlement layer, Converge, Changpeng Zhao’s YZi Labs said in a statement on Friday.\nUSDtb is backed by short-duration treasury assets, including BlackRock's BUIDL, while Converge is an Ethereum Virtual Machine-compatible chain focused on tokenizing real-world assets.\nThe move supports YZi’s mission to “support open, scalable digital dollar infrastructures that can serve as a backbone of efficiency and liquidity for the entire financial ecosystem.”\nEthena Labs CEO Guy Young added: “The holy grail of digital dollar distribution has always been embedding stable, yield-bearing assets directly into the core of the crypto economy. With USDe now scaling across exchanges, DeFi protocols, and global user bases, that vision is becoming a reality.”"
            },
            {
                "title": "Solana DApps Attracted $193 Million in Monthly Revenue, Led by Axiom, Pump.fun, Phantom, & Others, Commanding More Customers - BlockchainReporter",
                "source": "BlockchainReporter",
                "url": "https://blockchainreporter.net/solana-dapps-attracted-193-million-in-monthly-revenue-led-by-axiom-pump-fun-phantom-others-commanding-more-customers/",
                "body": "DApps (decentralized applications) on the Solana network produced $193 million over the last month, according to data released today by market analyst OxMarioNawfal. This remarkable record shows Solana’s growing impact in the DeFi and Web3 environments. As reported in the data, top Solana applications, including Axiom, Pump.fun, Phantom, Jupiter, Meteora, Raydium, Letsbonk, Photon, Pumpswap, and Gmgn registered higher revenues, showing their increasing popularity in the decentralized ecosystem. This impressive performance is majorly due to increased trading activity on decentralized applications connected to DeFi and meme asset protocols running on top of the Solana blockchain.\nSolana Top 10 DApps by Revenue\nAxiom\nAxiom, a Solana-based decentralized trading platform that enables customers to interact with yield mining, perpetual trading, meme coin trading, and other DeFi mechanisms, is at the top of the list. Axiom exchange registered a massive revenue of $49.1 million over the past 30 days, making it the top outstanding app on Solana.\nPump.fun\nNext is Pump.fun, a protocol that allows people to create and trade meme coins on the Solana chain. As per the data, Pump.fun drew a monthly revenue of $41 million. This is evidence that the Launchpad has become a go-to platform for customers who want to interact with meme coins and other virtual assets in a more user-friendly and accessible manner.\nPhantom\nPhantom, a non-custodial cryptocurrency wallet built on Solana, which enables people to store, send, and obtain Solana-based tokens, also appeared in this list. Phantom also allows users to access various decentralized applications and platforms, like NFT marketplaces and many more. According to the data, Phantom pulled in a monthly revenue of $22.3 million. This performance is due to the huge clients that the multi-crypto wallet attracted over the years. Its strong, simplified interface earned it long-term credibility through its robust security standards.\nJupiter\nJupiter, a decentralized exchange aggregator built on the Solana network that offers crypto customers rapid settlements of token swaps with reduced slippage, secured fourth place in this list. Besides swap trading, Jupiter also functions as a DEX aggregator that allows users to access optimized lending, trading, digital asset management, and user-centric governance. According to the data, Jupiter recorded $15.9 million in monthly revenue, an indicator of a thriving DEX platform, which continues to attract more users and liquidity to the Solana blockchain.\nMeteora\nFifth on the list is Meteora, a DEX platform built on Solana that allows people to trade cryptocurrencies with low-cost and fast transactions. It also functions as a liquidity protocol that enhances capital utilization and optimizes profitability for liquidity providers. As stated in the data, Meteora pulled in a monthly revenue of $9.1 million. This is a testimony of Meteora’s outstanding quality service. The DEX is recognized for enabling users to earn yields through various trading activities, making it a top preference for customers who value convenience and capital efficiency.\nOther Top Market Performers and Where Do These Revenues Come From?\nOther top Solana-based applications that generated impressive revenues over the past month include Raydium, Letsbonk, Photon, Pumpswap, and Gmgn, based on the data. The implication here is that decentralized applications have become vital pillars in blockchain networks. They are not only major drivers of profitability on blockchain networks, but also offer important solutions to DeFi clients.\nDApps normally generate revenue by charging a trading fee on every customer transaction. For example, DEXs often charge 0.2% fees on every token swap, with additional fees imposed on advanced services or features offered. For instance, customers may pay fees to secure exclusive access or speed up transaction settlement, and many others. A lesson drawn from this analysis is that with"
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "340.500",
            "open": "46,219.630",
            "close": "46,284.760",
            "high": "46,401.730",
            "low": "46,061.230"
        },
        "market_summary": "The provided articles indicate a focus on upcoming US corporate earnings reports, particularly from major banks and consumer companies, as a key market catalyst. There is significant discussion around potential regulatory changes, specifically the debate sparked by calls to abolish quarterly reporting, which could represent a major shift in corporate disclosure norms. The market is also closely watching key technical levels for major index components like Apple and Nvidia. The overall narrative centers on interpreting financial data, with an emphasis on cash flow analysis over reported profits.\n\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Dow Jones Futures Fall With Apple, Nvidia At Key Levels; Take In These Red-Hot Stocks? - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-apple-breaks-out-nvidia-take-profits-micron-ionq-oklo/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #d06b7ca8-9777-11f0-a9cb-961a1c427f99"
            },
            {
                "title": "Full Stock Market News from 2025-09-21 - Stock Titan",
                "source": "Stock Titan",
                "url": "https://www.stocktitan.net/news/2025-09-21/",
                "body": "Stock Market News 2025-09-21\n10 news published.\nDon't miss out on market-moving news. Bookmark this page and check back regularly for the most recent updates on stocks, sectors, and the overall market landscape. Stay informed, stay ahead, and make smarter investment choices with our comprehensive stock news coverage.\nStay ahead of the market with our list of today's most important stock news and financial updates. Whether you're a day trader, long-term investor, or market enthusiast, our news feed covers everything you need to know about publicly traded companies.\nOur news feed is designed for investors who want to stay informed about the latest developments affecting their portfolio or watchlist. Whether you're researching potential investments, monitoring your current holdings, or simply staying up-to-date with market trends, our stock news page provides the information you need to make informed decisions.\nWhat You'll Find on This Page:\n- Breaking financial news and market-moving headlines\n- FDA approvals and clinical trial results for biotech and pharma stocks\n- Stock offerings, dividends, and other corporate actions\n- Mergers, acquisitions, and strategic partnerships\n- Business news affecting company performance and stock prices\n- Easy-to-use tags for quick news categorization\n- Stock tickers for instant company identification\n- AI sentiment analysis to gauge market reaction\n- Estimated impact scores to assess potential stock movement"
            },
            {
                "title": "There is only one conversation happening in the Square Mile - The Telegraph",
                "source": "The Telegraph",
                "url": "https://www.telegraph.co.uk/money/investing/stocks-shares/there-is-only-one-conversation-happening-in-the-square-mile/",
                "body": "After a few decades as a daily stockpicking column, Questor today returns to its 60-year-old roots by taking a weekly view of the markets – what is moving them, what lies ahead and how all of this could affect your portfolios and financial goals. I’ll also aim to give you an inside track to the City, shedding light on what I’m hearing.\nRegular Questor readers will know me from the Tuesday column, where I offered insights into companies and unpicked their balance sheets. Join me every Monday, and we’ll demystify the City and empower your investment decisions.\nProfit is a matter of opinion\nLike it or not, the United States is the world’s largest economy and home to its largest stock market, biggest bond market and the globe’s reserve currency for good measure. When Washington and New York speak, everyone listens.\nIn this respect, the next round of quarterly updates from US companies should be as informative as ever, and it begins with figures from PepsiCo, Delta Air Lines and Walgreens Boots Alliance on Oct 9, with the mega-banks JPMorgan Chase, Wells Fargo, Goldman Sachs and Citigroup not far behind on Oct 14.\nAnalysts will look at the headline numbers, such as revenues and earnings per share (EPS), but take even greater interest in subtle shifts in management’s qualitative comments on trading and the outlook. They will pick apart the profit and loss account, but (should) spend even more time scrutinising the cash flow and balance sheet, as it is there that any signs of trouble may show first, often in the shape of bloated inventory, rising trade receivables or a capital expenditure splurge, or even just a mountain of debt or leases whose maturity is imminent.\nAs the old saying goes, profit is a matter of opinion, but cash is a matter of fact. The former can be manipulated, or at least flattered, by someone who is determined enough to do so. It is harder to cook up figures for cash flow and cash on the balance sheet.\nThis takes us to the issue that has caused more debate than any other this week, at least in a financial context. Questor has done the rounds in the Square Mile, and there is only one thing on everybody’s minds – President Donald Trump’s call for the abolition of quarterly reporting.\nNumbers game\nSome investors may shrug this off, or even actively agree with the president, as there is a three-pronged case to be made, judging by the feedback received this week.\nFirst, Trump has a plan to let the US economy run hot, via a lower dollar, lower interest rates, cheaper oil, reduced personal taxes and lighter regulation. An easing of reporting and disclosure rules is all part and parcel of this, as it will free up executives to focus on what really matters and unlock growth in the world’s largest economic engine."
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "52.500",
            "open": "9,246.060",
            "close": "9,225.560",
            "high": "9,251.260",
            "low": "9,198.760"
        },
        "market_summary": "The FTSE 100 is facing downward pressure due to a cyberattack causing airport disruptions and investor anxiety over inflation and regulatory uncertainty surrounding major mergers. This is partially offset by strength in the defence sector, exemplified by Babcock International's soaring share price, which is buoyed by robust UK defence spending and geopolitical tensions. Commodity prices, including oil and copper, are also rising amid ongoing Middle East tensions.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "FTSE Dips As Airlines Face Tech Turbulence And Mergers Await Approval - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/ftse-dips-as-airlines-face-tech-turbulence-and-mergers-await-approval",
                "body": "19 minutes ago • 2 mins\nJoin the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nEuropean stock markets are off to a rocky start this week, with the FTSE 100 drifting lower after a cyberattack triggered major airport delays and ongoing industry shake-ups have investors on edge.\nWhat does this mean?\nThe FTSE’s slow start reflects investors’ anxiety over persistent inflation and fresh operational shocks across critical sectors. Over the weekend, airports like London Heathrow suffered big delays after a cyberattack hit key systems, exposing just how fragile travel infrastructure can be. EasyJet shrugged off any sizeable impact, but market jitters remain. Meanwhile, the $53 billion planned merger between Teck Resources and Anglo American is drawing close attention from Canadian officials aiming to safeguard national interests—reminding investors that regulatory hurdles can slow even headline-making deals. The UK’s green light for a second Gatwick runway signals long-term optimism for travel, while plans to attract global talent with new visa rules stand in contrast to tightening restrictions in the US. On the commodities front, oil crept higher amid fresh Middle East tensions, gold hovered near record highs, and copper extended its recent climb—reminding everyone that geopolitical undercurrents continue to sway the market landscape.\nWhy should I care?\nFor markets: Flight delays and commodity rallies set the tone.\nTechnical snags and high-profile mergers are keeping volatility elevated for European stocks, especially in the travel and industrial sectors. With the FTSE sliding Friday and in futures, investors are keeping a close watch on companies dealing with tech risks or regulatory uncertainty. Commodity rallies—in oil, gold, and copper—highlight how fast-changing global events are shaping demand for safer assets and influencing market sentiment.\nThe bigger picture: State moves and supply chain risks reshape the landscape.\nTougher oversight on blockbuster deals and new infrastructure approvals underscore how government intervention is rewriting the playbook for entire industries. The UK’s openness to global talent and infrastructure investment stands in sharp relief to the US’s more guarded stance, fueling an international competition to attract skilled workers. Meanwhile, rising commodity prices underline how connected the global economy remains to shifting political and supply chain risks.\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies."
            },
            {
                "title": "Tempus AI Surges Since IPO as FDA Clearance Boosts Growth Outlook - Yahoo",
                "source": "Yahoo",
                "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_b1c09205-bace-492a-8d39-a0aa6165312d",
                "body": "Yahoo is part of the Yahoo family of brands.\nWhen you use our sites and apps, we use cookies to:\n- provide our sites and apps to you\n- authenticate users, apply security measures, and prevent spam and abuse, and\n- measure your use of our sites and apps\nIf you click '\nAccept all', we and\nour partners, including 238 who are part of the IAB Transparency & Consent Framework, will also store and/or access information on a device (in other words, use cookies) and use precise geolocation data and other personal data such as IP address and browsing and search data, for analytics, personalised advertising and content, advertising and content measurement, and audience research and services development.\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\nIf you would like to customise your choices, click 'Manage privacy settings'.\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy & cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our privacy policy and cookie policy."
            },
            {
                "title": "Up 135%, here’s a soaring FTSE 100 share to consider in October! - Fool UK",
                "source": "Fool UK",
                "url": "https://www.fool.co.uk/2025/09/22/up-135-heres-a-soaring-ftse-100-share-to-consider-in-october/",
                "body": "Defence stocks like Babcock International (LSE:BAB) have been among the best-performing UK shares in 2025. This particular contractor’s breakneck ascent saw it promoted to the FTSE 100 from the FTSE 250 mid-cap index in March.\nAt £11.85 per share, Babcock’s share price has risen a stunning 135% since 1 January.\nAnyone who’s opened a newspaper recently will understand renewed investor appetite for defence shares like this. Worries over Russia’s military goals are rising, as the Ukraine war rolls on and drone incursions into NATO countries become more frequent.\nElsewhere, the threat of widening conflict in the Middle East is substantial. And concerns are also high over Chinese foreign policy.\nThreats…\nWeapons spending is especially strong in Europe, which bodes well for local operators like Babcock. Continental defence spending breached €100bn for the first time in 2024, according the European Defence Agency. The body predicts that “the new NATO target of 3.5% of GDP will require even more effort”, with the entire defence bloc tipped to spend “more than €630bn a year.“\nHaving said that, there’s no guarantee that British operators will capture significant amounts of this business. According to The Guardian, France has suggested limiting the amount of UK military hardware provided to the European Union’s Security Action for Europe (SAFE) defence fund.\nBabcock also faces uncertainty in other regions, most notably the US. Mixed signals over foreign policy in Washington and intentions to engage in future conflicts are a possible danger for Stateside operators.\n… and enormous opportunities\nHelpfully though, Babcock sources only a tiny percentage of its sales from the US and Europe, leaving it less exposed than FTSE 100 peers like BAE Systems and Rolls-Royce.\nIn fact, as the graphic shows, it makes the lion’s share of sales from the UK, where defence spending commitments are especially robust.\nIndeed, Britain’s renewed investment drive opens doors for further significant sales opportunities. Analysts at RBC Capital believe the UK’s recent decision to join the multinational Common Armoured Vehicle (CAVS) programme, for instance, could open the door for Babcock to sell around 1,500 vehicles along with providing service support.\nI feel Babcock’s wide range of expertise — from servicing submarines and training pilots, through to manufacturing ships and land vehicles — sets it up well in the current landscape.\nA top growth share\nBabcock’s thriving at the moment, and earnings per share (EPS) rose 63% in the 12 months to March 2025.\nCity analysts expect this trend of strong growth to continue. They’re predicting an annual EPS improvement of 8% in financial 2026, and that growth will accelerate to 12% next year.\nThis all leaves Babcock shares trading on a forward price-to-earnings (P/E) ratio of 21.5 times. That looks toppy compared to the FTSE index’s broader multiple of 12.5 times. But then it’s worth remembering the defence stock’s superior growth opportunities compared to the broader blue-chip index.\nWhile it’s not without risk, I think Babcock’s worth serious consideration from savvy investors."
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "191.500",
            "open": "23,701.380",
            "close": "23,654.380",
            "high": "23,789.130",
            "low": "23,597.630"
        },
        "market_summary": "The GER40 (DAX) is struggling for clear direction following a US rate cut, while facing significant headwinds from its heavyweight automotive sector. Porsche's abrupt retreat from its electric vehicle strategy, including scrapping a key model and slashing its profit outlook, has sent shockwaves through the German auto industry and contributed to stock volatility. This pivot, driven by weaker-than-expected consumer demand for premium EVs and intense competition, signals broader structural challenges and a potential reassessment of the entire industry's electrification transition.\n\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "DAX Struggles for Direction Following US Rate Cut - MarketScreener",
                "source": "MarketScreener",
                "url": "https://www.marketscreener.com/news/dax-struggles-for-direction-following-us-rate-cut-ce7d58dfd881f423",
                "body": "Access Denied\nYou don't have permission to access \"http://www.marketscreener.com/news/dax-struggles-for-direction-following-us-rate-cut-ce7d58dfd881f423\" on this server.\nReference #18.4d0f3417.1758520219.3a36029\nhttps://errors.edgesuite.net/18.4d0f3417.1758520219.3a36029"
            },
            {
                "title": "Porsche retreats from EV push, jolts German auto industry - CHOSUNBIZ - Chosun Biz",
                "source": "Chosun Biz",
                "url": "https://biz.chosun.com/en/en-international/2025/09/22/KGSUKFPRZVAAXK5YOT2NZMI77I/",
                "body": "Porsche drastically revised its electric vehicle strategy, scrapping plans to launch a high-end electric sport utility vehicle (SUV) and moving to strengthen internal combustion engine and hybrid models. With weak EV demand and expense pressures overlapping, this year’s operating profit fell by €1.8 billion (about 2.66 trillion won), and the company sharply cut its outlook along with parent company Volkswagen. As a flagship German brand steps back from its EV transition strategy, shock is spreading across the industry.\nAccording to Bloomberg on the 22nd (local time), since its 2022 listing Porsche has made EV expansion its core strategy. But consumer preference for high-end EVs was lower than expected, and the global economic slowdown and tariff barriers were a major drag on results. In China, local player BYD has dominated the EV market, weakening Porsche’s position, and in the U.S. market, tariff policy under the Trump administration dealt an additional blow.\nOn this, auto analyst Matthias Schmidt said, “Consumers do not place great value on high-end EVs,” noting, “Porsche has ultimately reverted to internal combustion models with higher profitability.” In fact, Porsche scrapped plans for a new electric SUV and said it would add back internal combustion and hybrid vehicles to its lineup.\nThe weak results led to a stock plunge. Porsche shares fell enough to be dropped from DAX, Germany’s flagship stock index, and Volkswagen also warned of a non-cash loss of about €3 billion (about 4.4 trillion won) related to Porsche. Volkswagen lowered its operating margin outlook for this year to 2%–3% from up to 5%.\nVolkswagen, which had led the EV transition among German manufacturers, has partially scrapped its ambitious battery production project and is pursuing large-scale restructuring. It outperformed Tesla and BYD in the European market, but the slump among premium brands held it back. Audi Group, which includes Bentley, Lamborghini, and Ducati, already lowered its annual outlook as shipments fell in the first half of the year.\nPorsche is moving to cut expenses through executive reshuffles, layoffs, and scrapping its in-house battery production plan. But repeated outlook cuts are intensifying pressure on Chief Executive Officer Oliver Blume. Bloomberg said, “The Porsche-Piëch owner family is searching for a successor, and even the possibility of replacing the next management is being discussed.”\nExperts do not view this incident as merely a single company’s strategy tweak. The interpretation is gaining traction that weak EV demand is a signal exposing structural limits across the German auto industry. Even though automakers in European countries have poured in massive investments, EV sales have been weaker than expected, causing difficulties.\nA person in the auto industry said, “The Porsche case shows that even premium brands have failed to secure EV profitability,” adding, “The German auto industry’s EV strategy is back on the test stand.”"
            },
            {
                "title": "Porsche’s EV Pullback Highlights Cracks in German Auto Empire - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/articles/2025-09-21/porsche-s-ev-pullback-highlights-cracks-in-german-auto-empire?srnd=phx-industries-transportation",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "232.500",
            "open": "24,479.350",
            "close": "24,620.390",
            "high": "24,648.600",
            "low": "24,416.100"
        },
        "market_summary": "The NDX100 is experiencing a powerful rally, driven by Federal Reserve rate cuts, a reversal of trade tariffs, and sustained investor enthusiasm for large-cap technology stocks. Record highs across major indices, including the Nasdaq's significant 28% gain since April, highlight broad market strength, though performance remains heavily concentrated in AI and tech giants. While geopolitical events have caused brief volatility, they have been quickly discounted by a market focused on supportive monetary policy and a resilient economic backdrop.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Stock Market Weekly Forecast - S&P 500 at 6,664, Nasdaq +28%, Dow +12%: Fed Cuts and Tariff Shifts Ignite Rally - tradingnews.com",
                "source": "tradingnews.com",
                "url": "https://www.tradingnews.com/news/stock-market-weekly-forecast-sp500-at-6664-nasdaq-28-percent-dow-12-percent",
                "body": "Stock Market Weekly Forecast - S&P 500 at 6,664, Nasdaq +28%, Dow +12%: Fed Cuts and Tariff Shifts Ignite Rally\nU.S. indices break records as investors bet on lower rates, AI giants, and easing trade tensions despite geopolitical risks | That's TradingNEWS\nNasdaq, S&P 500 and Dow Power to Records as Fed Eases and Tariffs Recede\nThe U.S. equity market is heading into the last stretch of September with a momentum rarely seen since the post-pandemic rallies. The S&P 500 (^GSPC) closed the latest week at 6,664.36, gaining nearly 0.5% on Friday and standing over 20% above its April lows when President Trump shocked markets with his “Liberation Day” tariff wave. The Nasdaq Composite (^IXIC), driven by outsized gains in large-cap technology names, has added 28% since April, while the Dow Jones Industrial Average (^DJI) trails with a still-impressive 12% rebound. Small caps have joined the rally: the Russell 2000 (^RUT) notched a new record close for the first time since 2021, highlighting how Fed rate cuts are lifting risk appetite across the board.\nFederal Reserve Policy Sparks Bullish Momentum\nThe long-anticipated rate cut is finally reality. The Fed delivered a 25-basis point reduction, and the dot plot now signals at least two more cuts this year, with outliers like Governor Stephen Miran penciling in as many as six reductions in 2025. This is a decisive pivot from the “higher for longer” stance that weighed heavily on equities through 2023–2024. Fed Chair Jerome Powell did temper expectations by warning that “no risk-free paths” exist, but markets interpreted the shift as a green light. Lower borrowing costs are particularly bullish for tech and small-cap firms, while also easing credit stress across the consumer and housing sectors.\nTechnology Stocks Dominate the Rally\nThe sectoral story remains about concentration. Nvidia (NASDAQ:NVDA) gained 0.24% Friday, continuing a year where AI demand has kept earnings and valuation multiples climbing. Apple (NASDAQ:AAPL) surged 3.20%, while Tesla (NASDAQ:TSLA) added 2.21% as investors rotated back into megacaps that suffered in mid-summer. Microsoft (NASDAQ:MSFT) and Alphabet (NASDAQ:GOOGL) remain dominant in index weightings, together with NVDA forming over 20% of the SPDR S&P 500 ETF (NYSEARCA:SPY). The heavy tilt toward these firms explains why the S&P has outperformed more diversified benchmarks. Intel (NASDAQ:INTC) fell 3.24%, but the decline was offset by government-backed partnerships with NVDA that reassured investors about its strategic positioning.\nTariff Reversals and Trade Deals Revive Market Optimism\nOne reason the April crash has turned into a September melt-up is the unexpected reversal of tariffs. President Trump has rolled back some of the steepest levies, cutting costs for corporates and easing supply chain fears. The new U.S.–China trade agreement removed tit-for-tat duties, setting off a powerful rally as Wall Street banks abandoned forecasts of recession. The S&P’s 5% gain in the past month came even as U.S.–China tensions re-emerged and the Middle East conflict spiked briefly. Investors appear convinced that tariffs will not spiral into runaway inflation and that global growth can remain intact.\nGeopolitical Shocks Prove Fleeting\nOil initially jumped when conflict flared between Israel and Iran, dragging equities lower. But with a ceasefire in place and crude stabilizing, those losses evaporated. Analysts note that the S&P 500 and Dow rebounded swiftly, reflecting an investor base that is willing to discount geopolitical shocks as short-lived noise. Tigress Financial’s Ivan Feinseth summarized it bluntly: “The market doesn’t care about geopolitical events.” For now, that assessment is being validated by price action.\nInflation, Employment and the Economic Backdrop\nFresh inflation data showed only a mild uptick, with consumer prices still near their lowest since 2021. Hiring slowed in May, but the labor market remains firm enough to support consumption without sparki"
            },
            {
                "title": "Micron: I Am Loading Up Before Earnings (NASDAQ:MU) - Seeking Alpha",
                "source": "Seeking Alpha",
                "url": "https://seekingalpha.com/article/4824637-micron-i-am-loading-up-before-earnings",
                "body": "Investment thesis\nMy previous bullish thesis on Micron (NASDAQ:MU) aged extremely well as the stock price increased by more than 80% since early March. Despite such a massive rally, Micron's forward P/E ratios remain extremely\nMy previous bullish thesis on Micron (NASDAQ:MU) aged extremely well as the stock price increased by more than 80% since early March. Despite such a massive rally, Micron's forward P/E ratios remain extremely\nAnalyst’s Disclosure:I/we have a beneficial long position in the shares of MU either through stock ownership, options, or other derivatives. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.\nSeeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body."
            },
            {
                "title": "Do Univest Financial's (NASDAQ:UVSP) Earnings Warrant Your Attention? - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/univest-financials-nasdaq-uvsp-earnings-142422679.html",
                "body": "For beginners, it can seem like a good idea (and an exciting prospect) to buy a company that tells a good story to investors, even if it currently lacks a track record of revenue and profit. But as Peter Lynch said in One Up On Wall Street, 'Long shots almost never pay off.' Loss making companies can act like a sponge for capital - so investors should be cautious that they're not throwing good money after bad.\nSo if this idea of high risk and high reward doesn't suit, you might be more interested in profitable, growing companies, like Univest Financial (NASDAQ:UVSP). While this doesn't necessarily speak to whether it's undervalued, the profitability of the business is enough to warrant some appreciation - especially if its growing.\nHow Quickly Is Univest Financial Increasing Earnings Per Share?\nIf you believe that markets are even vaguely efficient, then over the long term you'd expect a company's share price to follow its earnings per share (EPS) outcomes. That makes EPS growth an attractive quality for any company. We can see that in the last three years Univest Financial grew its EPS by 4.4% per year. That might not be particularly high growth, but it does show that per-share earnings are moving steadily in the right direction.\nOne way to double-check a company's growth is to look at how its revenue, and earnings before interest and tax (EBIT) margins are changing. Not all of Univest Financial's revenue this year is revenue from operations, so keep in mind the revenue and margin numbers used in this article might not be the best representation of the underlying business. While we note Univest Financial achieved similar EBIT margins to last year, revenue grew by a solid 4.1% to US$298m. That's progress.\nYou can take a look at the company's revenue and earnings growth trend, in the chart below. Click on the chart to see the exact numbers.\nView our latest analysis for Univest Financial\nIn investing, as in life, the future matters more than the past. So why not check out this free interactive visualization of Univest Financial's forecast profits?\nAre Univest Financial Insiders Aligned With All Shareholders?\nIt's pleasing to see company leaders with putting their money on the line, so to speak, because it increases alignment of incentives between the people running the business, and its true owners. So it is good to see that Univest Financial insiders have a significant amount of capital invested in the stock. As a matter of fact, their holding is valued at US$18m. That's a lot of money, and no small incentive to work hard. Even though that's only about 2.0% of the company, it's enough money to indicate alignment between the leaders of the business and ordinary shareholders."
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "51.760",
            "open": "6,642.320",
            "close": "6,661.980",
            "high": "6,674.240",
            "low": "6,622.480"
        },
        "market_summary": "The provided articles do not contain any information relevant to the SPX500 (S&P 500) index. The content focuses exclusively on U.S. college football recruiting and changes to national vaccine policy under a hypothetical Health Secretary. There is no data on corporate earnings, economic indicators, Federal Reserve policy, or market performance from which to derive a financial market summary.\nSENTIMENT: Neutral\n\n**Overall Market Sentiment:** Neutral",
        "source_articles": [
            {
                "title": "OSU lands S Smith, brother of star Buckeyes WR - ESPN",
                "source": "ESPN",
                "url": "https://www.espn.com/college-football/story/_/id/46341779/ohio-state-lands-s-angelo-smith-brother-star-wr-jeremiah",
                "body": "Class of 2027 safety Angelo Smith, the brother of Ohio State star wide receiver Jeremiah Smith, has committed to the Buckeyes, a source confirmed to ESPN Sunday night.\nThe younger Smith is a 5-foot-10, 165-pound junior at Florida's Chaminade-Madonna College Preparatory School. In addition to Ohio State, he held offers from Miami, Oklahoma State, Georgia State and Toledo. News of Smith's pledge was first reported by Rivals.com.\nJeremiah was a three-time state champion at Chaminade-Madonna and landed with the Buckeyes in the 2024 class as one of the highest-ranked wide receiver prospects in the ESPN recruiting rankings era, which began in 2006.\nA second-team All-American last fall, Jeremiah shattered Ohio State's freshman receiving records with 76 catches for 1,315 yards and 15 touchdowns in a starring role on the Buckeyes' 2024 national title team. He has logged 20 receptions for 315 yards with three receiving scores over the initial three games of his sophomore campaign in 2025.\nAngelo followed in his brother's footsteps at Chaminade-Madonna, where he was credited with 40 tackles, 11 pass break ups and three interceptions as a sophomore last fall.\nHe now lands as the third member of Buckeyes coach Ryan Day's 2027 recruiting class. Five-star wide receiver Jamier Brown, the No. 2 prospect in the ESPN Junior 300, has been committed to Ohio State since November. Quarterback Brady Edmunds, who gave his pledge to the Buckeyes on Dec. 2, 2024, is ESPN's second-ranked pocket passer in the cycle.\nOhio State holds 13 ESPN 300 pledges in the program's 2026 recruiting class, which currently sits at No. 9 in ESPN's national class rankings for the cycle. After a bye week in Week 4, the Buckeyes remained at No. 1 in the latest AP Top 25 on Sunday ahead of a Week 5 visit to Washington on Saturday."
            },
            {
                "title": "RFK Jr.’s vaccine advisers leave his critics and supporters dazed, confused - Politico",
                "source": "Politico",
                "url": "https://www.politico.com/news/2025/09/19/rfk-vaccine-acip-covid-chickenpox-00574231",
                "body": "RFK Jr.’s vaccine advisers leave his critics and supporters dazed, confused\nThe health secretary’s CDC panel wants to stop recommending Covid vaccines but left bigger debates unresolved.\nHealth Secretary Robert F. Kennedy Jr. appointed skeptics of vaccine safety like himself to a government panel that recommends who should get the shots. | Brynn Anderson/AP Photo\nBoth public health advocates and vaccine skeptics have one thing in common after a much-anticipated meeting of Health Secretary Robert F. Kennedy Jr.’s vaccine advisers ended on Friday: Surprise.\nThe panel’s recommendations, to stop encouraging Covid vaccination while retaining access, and to stop offering one of two options for chickenpox shots, were neither as dire as the advocates feared, or as far-reaching as the skeptics expected. The advisers tabled for now a proposal to delay vaccination for hepatitis B.\nThe guidance left doctors and public health experts confused — it’s not clear whether it means younger, healthy people will need prescriptions for Covid shots — and seeking clarity. It left Kennedy’s anti-vaccine allies pledging to ramp up their lobbying to convince the government to go further. On Capitol Hill, it left the tense standoff between Democrats irate about Kennedy’s policies and Republicans divided over them in a holding pattern.\n“We must ensure that any vaccine recommendation protects patient choice and never takes away families’ access to safe, effective vaccines,” Senate Health Committee Chair Bill Cassidy (R-La.), Kennedy’s biggest GOP critic on Capitol Hill, said in a statement. Cassidy had called on Kennedy to cancel the meeting of the outside panel because he feared some of Kennedy’s appointees were unqualified and biased against vaccines. But he expressed relief that the panel hadn’t changed current guidance that newborns receive a hepatitis B vaccine on the first day of life.\nSpeaking to reporters after the panel’s last vote, President Donald Trump touted his Operation Warp Speed that helped develop the Covid vaccines in 2020 and said he was a proponent of Covid vaccination. “I had the vaccine. I was very happy with it,” he said, adding that he nonetheless trusted Kennedy: “I put him in there because I want to have opposite views.”\nThe Advisory Committee on Immunization Practices advises the director of the Centers for Disease Control and Prevention, who must sign off on its recommendations before they take effect.\nPublic health advocates warned that Kennedy’s firing of the panel’s advisers and appointment of new ones, many skeptical of vaccine safety and inexperienced in the workings of the committee, were likely increasing Americans’ reticence about the shots.\nSome of the panelists raised concerns about vaccine safety and disputed information presented by CDC staff about the safety and efficacy of the shots.\n“The reckless actions of this committee are causing damage in real time,” said Dr. Sean O’Leary, a professor of pediatrics and infectious diseases at the University of Colorado Denver Anschutz Medical Campus and Children’s Hospital Colorado who’s followed ACIP meetings for a decade.\nO’Leary, also a member of the American Academy of Pediatrics, said a primary care colleague of his had seen a parent refuse the measles, mumps and rubella vaccine because of what she heard “about this committee showing fear about an issue that was settled literally over 15 years ago,” O’Leary told reporters Friday. The committee took no action on that shot, but did recommend that patients no longer be offered a measles shot that also provides protection against chickenpox.\nIf the recommendation is adopted, children would have to get the chickenpox shot separately, as 85 percent of kids already do.\nIn a surprise move, the panel voted against recommending that states require patients get a prescription for Covid shots, after an initial deadlock. They also voted to remove a blanket recommendation for adults 65 and older to vaccinate against Covid.\nAbout 23 pe"
            },
            {
                "title": "How RFK Jr.’s hand-picked CDC advisory panel voted on COVID vaccines and more - PBS",
                "source": "PBS",
                "url": "https://www.pbs.org/newshour/health/how-rfk-jr-s-hand-picked-cdc-advisory-panel-voted-on-covid-vaccines-and-more",
                "body": "The committee that offers vaccine advice to the nation’s top public health agency voted Friday against recommending the updated COVID-19 vaccine to people aged 6 months or older, instead leaving the decision to individuals. The panel also decided against recommending that states and local authorities require a prescription for COVID-19 vaccines.\nOn many levels, people watching the two-day proceedings of the Advisory Committee on Immunization Practices (ACIP) did not know what to expect. Much of the week was uncharted, and a planned vote on the hepatitis B vaccine was tabled despite being on the agenda.\nThe unpredictable meeting followed a full shakeup by Health Secretary Robert F. Kennedy Jr. to rid the expert advisory panel of what he claims are the pharmaceutical industry’s corporate interests.\nKennedy made what he called “a clean sweep” in June when he fired the entire committee and replaced them with his handpicked selections. These new members included noted vaccine skeptics and conspiracy theorists. Some members joined the committee as recently as this week.\nThe advisory committee’s performance appeared “sloppy” and highlighted how “medicine is an art and a science,” said Dr. Georges Benjamin, executive director for the American Public Health Association.\n“You have a committee, and you bring one new person in, that changes the whole dynamics,” Benjamin said. “A lot of these folks are on a very steep learning curve because they’re not vaccine specialists – most of them.”\nHere are four takeaways from the meeting and how the panel’s decisions will affect health policy.\nThe committee tried to fight its image\nCommittee chair Martin Kulldorff opened the meeting by rejecting criticism that panel members were anti-vaccine and challenging previous directors of the Centers for Disease Control and Prevention to a debate about vaccine science. Other committee members pushed back at the characterizations they have faced.\nDr. Joseph Hibbeln, a psychiatrist and Omega-3 fatty acid researcher who serves on the committee, said the members did not enter the conversation with “pre-determined attitudes or pre-determined opinions,” but instead were respectful of others, even during disagreements: “We are not, as a committee, anti-vaxxers.”\nBut the manner in which the ACIP was reshaped in recent months, and Kennedy’s statements and actions on vaccines, has worked to undermine public health workers and institutions, said Jennifer Nuzzo, an epidemiologist who directs the Pandemic Center at the Brown University School of Public Health.\nNuzzo specifically pointed out how many of the committee members had criticized research about infectious diseases, including COVID-19, at the meeting and demanded more research. During the proceedings, their arguments often relied upon personal stories, such as their own experiences getting vaccine information at their local pharmacy, rather than data and evidence.\n“Water cooler conversations [do] not amount to epidemiology,” Nuzzo said. “There’s a lot of reasons why anecdotes may be misleading. Sometimes, they do suggest something else is going on, but you have to do rigorous studies to figure it out.”\nCOVID-19\nMuch of Friday’s discussion was consumed with a technical review of COVID-19 infection rates, and deliberations grew tense. During public comments, health experts said the committee’s proposed recommendations for COVID-19 vaccines created more confusion and erected more barriers at a time when people are losing health care coverage and communities are experiencing worsening health outcomes on multiple fronts.\nRetsef Levi, a professor at the MIT Sloan School of Management, chaired the committee’s COVID-19 working group. According to his presentation of the group’s findings, assessed levels of protection from COVID-19 vaccines against hospitalization, death and long COVID “are based on very low-quality data and analyses,” he said. “That is a major uncertainty we all have to acknowledge.”\n“We feel the vaccine"
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "1,425.000",
            "open": "45,845.090",
            "close": "45,279.380",
            "high": "45,900.090",
            "low": "44,475.090"
        },
        "market_summary": "The Nikkei 225 surged as initial investor panic over the BOJ's plan to unwind its ETF holdings subsided upon realizing the sell-down would be gradual, preventing a major market shock. This was complemented by a weak yen boosting exporters. However, political commentary from a PM contender highlighted that the weak yen is also contributing to cost-push inflation, with plans for a future economic package to address rising living costs.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Japan PM contender Hayashi says weak yen has contributed to inflation - investingLive",
                "source": "investingLive",
                "url": "https://investinglive.com/news/japan-pm-contender-hayashi-says-weak-yen-has-contributed-to-inflation-20250922/",
                "body": "Japanese PM contender and Chief Cabinet Secretary Hayashi:\n- BOJ is conducting monetary policy in way that does not deviate much from Govt thinking\n- Japan’s past aversion to strong yen has diminished, when asked about risk Fed rate cut prospects could push up yen vs dollar, hurt Japan’s export-reliant economy\n- Weak yen, coupled with rising oil costs from Ukraine war, has caused cost-push inflation\n- If chosen as premier, will compile economic package to cushion blow from rising living costs, spending for disaster relief\n- Size of spending package must take into account Japan’s ‘quite small’ output gap, avoid issuance of deficit-covering debt"
            },
            {
                "title": "Japan’s Nikkei Climbs As ETF Sale Worries Ease - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/japans-nikkei-climbs-as-etf-sale-worries-ease",
                "body": "Join the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nJapan’s Nikkei surged 1.4% to close at 45,675.92, recovering quickly as investors shook off nerves over the Bank of Japan's new, gradual approach to unwinding its massive exchange-traded fund (ETF) holdings.\nWhat does this mean?\nInvestors initially hit the panic button after the Bank of Japan revealed it would slowly sell around 330 billion yen ($2.23 billion) in ETFs per year, sinking the Nikkei by 2% before most losses were erased. Once the details became clear, markets decided the pace was gentle enough to sidestep a market shock, reigniting buying activity. Heavyweights like Advantest and Tokyo Electron soared 3.56% and 5% as tech stocks led gains, while Fast Retailing nudged the Topix up 0.9%. Not every name joined the rally—SoftBank dipped slightly—but the overall mood improved, helped by the yen hovering around 148.21 to the dollar, which gave exporters a bit of a boost.\nWhy should I care?\nFor markets: Confidence returns after a shaky start.\nThe Bank of Japan’s careful pacing reassured investors who feared a rapid selloff would rattle the market. Tech stocks led the rebound, highlighting how global appetite for Japan’s innovative companies remains strong. With both the Nikkei and Topix bouncing higher, sentiment looks upbeat, especially since exporters continue to benefit from a weak yen.\nThe bigger picture: Japan’s gradualist moves set a tone for stability.\nBy opting for a slow unwind, the Bank of Japan underscores its commitment to financial stability as it gradually exits crisis-mode policies. With Japan's stock market and advanced tech industry playing key roles in global investing, this steady approach could encourage more international capital to flow into Japanese equities if confidence holds.\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies.\nGet the two biggest stories in finance, and the reasons why you should care, delivered to your inbox every day."
            },
            {
                "title": "BOJ Removes Japan Stocks Overhang With Slow ETFs Sell-Down - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/articles/2025-09-21/boj-removes-japan-stocks-overhang-with-slow-sell-down-of-etfs",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            }
        ]
    }
]