[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "64.050",
            "open": "4,478.850",
            "close": "4,509.690",
            "high": "4,516.950",
            "low": "4,452.900"
        },
        "market_summary": "### Gold (XAU/USD) Market Briefing\n\n* **Key Drivers:** Renewed concerns over the Federal Reserve's independence due to an investigation into Chair Jerome Powell, coupled with rising geopolitical tensions, are driving investors towards safe-haven assets, including **gold**.\n* **Price Action:** Gold has broken above **$4,600** an ounce, reaching a record high, as investors seek protection against political and monetary instability, showcasing **bullish momentum**.\n* **Technical Outlook:** Immediate resistance is at **$4,620**, with support near the **$4,550** level, as the price surge indicates a strong demand for safe-haven assets amidst market uncertainty.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Stock futures slide while gold and silver jump after Powell investigation raises fears over the Fed's independence - Fortune",
                "source": "Fortune",
                "url": "https://fortune.com/2026/01/11/markets-react-powell-investigation-federal-reserve-independence/",
                "body": "U.S. equity futures fell sharply Sunday night after Federal Reserve Chair Jerome Powell confirmed that he is under investigation related to testimony he gave last June concerning the renovation of Federal Reserve buildings.\nThe New York Times report breaking news of the investigation and Powell’s subsequent disclosure rattled markets, reviving fears that years of President Donald Trump pressuring the Federal Reserve could now be realized into a direct assault on its independence.\nFutures tied to the Nasdaq 100 led the decline, falling about 0.8%, as interest-rate-sensitive technology stocks bore the brunt of the selloff. S&P 500 futures were down roughly 0.5%, while Dow Jones Industrial Average futures fell about 0.4%, according to late-evening pricing.\nInvestors sought protection in the traditional safe-haven assets. Gold futures rose 1.7% to around $4,578 an ounce, while silver jumped more than 4%, reflecting renewed demand for protection against political and monetary instability. The U.S. dollar weakened modestly against several major currencies, including the Swiss franc and Japanese yen.\nAfter years of largely staying silent while Trump repeatedly mocked and threatened him, Powell appeared to have reached a breaking point, issuing a rare and pointed statement.\nHe wrote that while “No one—certainly not the chair of the Federal Reserve—is above the law,” the attack should be seen in the “the broader context of the administration’s threats and ongoing pressure.”\n“This new threat is not about my testimony last June or about the renovation of the Federal Reserve buildings…Those are pretexts. The threat of criminal charges is a consequence of the Federal Reserve setting interest rates based on our best assessment of what will serve the public, rather than following the preferences of the President.”\nEconomists warn that if the executive branch successfully co-opts the Fed, it could create a “self-fulfilling prophecy” of higher long-term inflation.\nAs Oxford Economics recently noted, any “cracks in the Fed’s independence” could spread rapidly through markets and ultimately raise borrowing costs for the businesses the administration seeks to protect with low interest rates.\nIn a note published last July, when Trump publicly threatened to fire Powell, Deutsche Bank warned that such a move could spark severe market disruption.\n“Both the currency and the bond market can collapse,” the bank wrote, citing heightened risks of inflation and financial instability. “The empirical and academic evidence on the impact of a loss of central-bank independence is fairly clear.”\nWall Street executives have echoed those concerns. Brian Moynihan, chief executive of Bank of America, said recently the erosion of Fed independence would carry serious consequences.\n“The market will punish people if we don’t have an independent Fed,” Moynihan said."
            },
            {
                "title": "Gold Breaks $4,600 As Markets Weigh Fresh Political Risks - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/gold-breaks-4600-as-markets-weigh-fresh-political-risks",
                "body": "Safe-haven demand lifted gold and nudged oil and copper higher, while the FTSE 100 looked set to dip and Walmart prepared to enter the Nasdaq-100.\n6 minutes ago • 1 min\nJoin the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nGold hit a record above $4,600 an ounce as investors rushed into safe havens amid rising geopolitical tensions and scrutiny around Federal Reserve Chair Jerome Powell.\nWhat does this mean?\nWhen the outlook gets murky, money often flows into assets seen as stores of value, and gold is usually first in line. This bout of caution comes alongside mixed signals elsewhere: a weaker dollar helped lift copper, and traders are watching for China to roll out more support for domestic demand. Oil, though, only inched up – supply worries linked to Iran were offset by talk of potential Venezuelan exports returning and expectations that the market could be well supplied th..\nis year. In the UK, softer hiring data but faster starting-pay growth could keep investors focused on how quickly inflation cools and when rate cuts might arrive.\nWhy should I care?\nFor markets: Safety is getting expensive.\nRecord gold prices suggest investors are paying up to hedge against volatility, which can ripple into everything from currencies to mining stocks. At the same time, relatively muted moves in oil hint that traders still see plenty of supply, even with geopolitical risk on the tape. And with major indexes periodically reshuffling constituents, index-tracking funds can create sudden waves of buying and selling in individual stocks – even when nothing about the underlying business has changed.\nThe bigger picture: Commodities are back as a macro barometer.\nThis mix of higher gold, firmer copper, and rangebound oil shows how markets are juggling geopolitics, the US dollar, and China’s growth outlook all at once. Over time, that matters because commodity prices feed into inflation, corporate margins, and central-bank decisions – and those, in turn, influence borrowing costs across the global economy.\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies."
            },
            {
                "title": "Is Bitcoin really \"digital gold\"? - KITCO",
                "source": "KITCO",
                "url": "https://www.kitco.com/opinion/2026-01-11/bitcoin-really-digital-gold",
                "body": "I have nothing against Bitcoin. It’s a fascinating experiment, a volatile speculative asset and, for some, a lucrative trade. I do have a beef, however, with the Bitcoin maximalists, who’ve transformed a digital asset into a dogma and whose self-serving prophecies threaten to burn the unsophisticated investor.\nIt all started back in 2021 when I challenged Michael Saylor to a debate. The founder of MicroStrategy (now Strategy), a Bitcoin treasury company, Saylor seemed to be on every podcast and YouTube channel proclaiming that gold was worthless—a “barbarous relic,” as the maxis love to quote Keynes (who was actually talking about the gold standard)—and that Bitcoin was hurtling toward $1 million. (Saylor recently upped his price forecast to $13 million.)\nI challenged him not on the blockchain technology or the virtues of decentralized finance, but on financial responsibility. My concern was that such zealotry, divorced from prudence, would lead people to make catastrophic decisions. It was Bitcoin evangelism, and the collection plate was being passed around with alarming fervor.\nAt the time, Saylor was advising people to sell everything, mortgage their houses, and go all-in on BTC. I mean, come on—mortgage your house? That’s not investment advice; it’s a recipe for financial ruin. When the rocket fizzles, the unsophisticated investor is left holding the bag.\nBitcoin is an asset class in a perpetual identity crisis. That’s why the narrative keeps pivoting to keep the hype alive. First, as a peer-to-peer currency, Bitcoin was going to revolutionize payments. But then as fees spiked and transactions slowed, suddenly it wasn’t about buying coffee anymore.\nNext it was touted as a “store of value,” an inflation hedge superior to gold. When inflation took hold during the Biden administration, BTC plunged from $69k to $16k. Meanwhile, gold held steady and then began climbing.\nTime for another pivot. Bitcoin became “digital gold,” a “safe haven asset” during crises. Except when economic turbulence hit in 2025, it went from $120k highs back to the $85–90k doldrums. It tanked like a high-flying tech stock, which it has a high correlation to. Meanwhile, gold was climbing to new all-time highs.\nWhen gold broke to a new high above $4,400 in late 2025, a sudden “dump gold, pump Bitcoin” narrative flooded social media. The tactics were straight from the huckster’s handbook: recycling old clips of wild price predictions (“$250k in two months”), AI-generated deepfakes of people like Warren Buffett denigrating gold. Bitcoin maxis are the carnival barkers of the information age, selling tickets to a show that relies not on the product being hyped but on the audience’s credulity.\nHow, then, to promote Bitcoin to the masses? ETFs were supposed to unleash infinite demand. BlackRock and Fidelity launched spot ETFs; retail buyers piled in at the top—oops, that petered out. Inflows slowed, and BTC flatlined.\nA government Bitcoin reserve to the rescue! Trump talked big about a Bitcoin reserve, but sorry, they only wanted “seized” Bitcoin from criminals—not exactly a ringing endorsement. Whatever happened to that U.S. Bitcoin reserve, anyway?\nOK, how about more Bitcoin treasury companies like Saylor’s? Surely the nearly 100 new players would spark a buying wave. Sadly, it seems the market is discounting their brilliant strategy. Today they’re all trading below net asset value. Strategy’s holding $59 billion in BTC, but its market cap as I write this is only $46 billion.\nStrategy and other Bitcoin treasury companies are also leveraged to the hilt, and an unraveling could force sales, tanking BTC further. It must feel like musical chairs among big buyers, each rich dude nervously looking over his shoulder like Humphrey Bogart in *The Treasure of the Sierra Madre*, wondering who’s going to exit first before the music stops.\nAnd the latest marketing efforts? Fed rate cuts were going to inspire reflationary demand—except that inflation’s too stubborn, so no "
            }
        ]
    },
    {
        "asset_name": "Silver",
        "symbol": "EIGHTCAP:XAGUSD",
        "status": "Success",
        "data": {
            "day_range": "5.005",
            "open": "76.565",
            "close": "79.876",
            "high": "80.490",
            "low": "75.485"
        },
        "market_summary": "### Silver (XAG/USD) Market Briefing\n\n* **Key Drivers:** Surging industrial demand driven by **solar energy**, **electric vehicles**, and **technology sectors**, coupled with concerns over **Fed independence** and **political instability**, are supporting **bullish momentum**.\n* **Price Action:** Silver jumped more than **4%** in response to the news, reflecting renewed demand for protection against **political and monetary instability**.\n* **Technical Outlook:** Immediate support is near the recent lows, with resistance at **$24.00**, and the **gold-to-silver ratio** of **60:1** remains elevated versus the historical average of **47:1**.\n\n---\n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "American Bullion Explains Silver Industrial Demand Surge & Investment Opportunity - The Register-Guard",
                "source": "The Register-Guard",
                "url": "https://www.registerguard.com/press-release/story/17608/american-bullion-explains-silver-industrial-demand-surge-amp-investment-opportunity/",
                "body": "American Bullion releases analysis on surging industrial silver demand driven by solar energy, electric vehicles, and technology sectors.\nLOS ANGELES, CA, UNITED STATES, January 6, 2026 /EINPresswire.com/ — American Bullion today released its analysis of the silver market’s structural transformation, highlighting how record industrial consumption has created a supply-demand imbalance that presents significant opportunities for investors.\nAccording to data compiled by American Bullion’s research team, industrial silver demand in 2025 exceeded 700 million ounces—a figure representing more than 60% of total annual mine production. The solar photovoltaic industry alone consumed approximately 200 million ounces, with electric vehicle production and 5G infrastructure deployment driving additional demand growth.\n“Silver occupies a unique position as both a precious metal and an essential industrial commodity,” said Nevtan Akcora, President of American Bullion. “Unlike gold, which serves primarily as a store of value, silver’s dual nature means that economic growth and green energy transition directly impact its consumption fundamentals.”\nThe analysis highlights several factors supporting silver’s investment thesis:\nSupply Constraints:\nPrimary silver mine production has declined 4% annually since 2022\nRecycling rates have not offset the deficit\nNew mine development requires 7-10 years from discovery to production\nDemand Accelerators:\nSolar panel silver content requirements are increasing with next-generation cell technology\n– EV production targets from major automakers imply 150% increase in automotive silver demand by 2030\n– AI data center expansion drives silver consumption in electronics and thermal applications\nValuation Metrics:\nThe gold-to-silver ratio of 60:1 remains elevated versus the historical average of 47:1\nSilver’s 144% gain in 2025 still trails gold’s cumulative five-year performance\nAmerican Bullion offers investors the ability to acquire physical silver through direct purchase or within a Silver IRA structure. Consultations are available to discuss allocation strategies appropriate for individual investment objectives.\nAbout American Bullion\nAmerican Bullion is a premier precious metals firm helping investors acquire physical gold and silver for direct ownership and retirement accounts. The company is committed to investor education and transparent pricing.\nMedia Contact:\nJohn Reese\nAmerican Bullion, Inc.\n+1 310-689-7720\nemail us here\nVisit us on social media:\nLinkedIn\nInstagram\nFacebook\nYouTube\nX\nLegal Disclaimer:\nEIN Presswire provides this news content “as is” without warranty of any kind. We do not accept any responsibility or liability\nfor the accuracy, content, images, videos, licenses, completeness, legality, or reliability of the information contained in this\narticle. If you have any complaints or copyright issues related to this article, kindly contact the author above."
            },
            {
                "title": "Stock futures slide while gold and silver jump after Powell investigation raises fears over the Fed's independence - Fortune",
                "source": "Fortune",
                "url": "https://fortune.com/2026/01/11/markets-react-powell-investigation-federal-reserve-independence/",
                "body": "U.S. equity futures fell sharply Sunday night after Federal Reserve Chair Jerome Powell confirmed that he is under investigation related to testimony he gave last June concerning the renovation of Federal Reserve buildings.\nThe New York Times report breaking news of the investigation and Powell’s subsequent disclosure rattled markets, reviving fears that years of President Donald Trump pressuring the Federal Reserve could now be realized into a direct assault on its independence.\nFutures tied to the Nasdaq 100 led the decline, falling about 0.8%, as interest-rate-sensitive technology stocks bore the brunt of the selloff. S&P 500 futures were down roughly 0.5%, while Dow Jones Industrial Average futures fell about 0.4%, according to late-evening pricing.\nInvestors sought protection in the traditional safe-haven assets. Gold futures rose 1.7% to around $4,578 an ounce, while silver jumped more than 4%, reflecting renewed demand for protection against political and monetary instability. The U.S. dollar weakened modestly against several major currencies, including the Swiss franc and Japanese yen.\nAfter years of largely staying silent while Trump repeatedly mocked and threatened him, Powell appeared to have reached a breaking point, issuing a rare and pointed statement.\nHe wrote that while “No one—certainly not the chair of the Federal Reserve—is above the law,” the attack should be seen in the “the broader context of the administration’s threats and ongoing pressure.”\n“This new threat is not about my testimony last June or about the renovation of the Federal Reserve buildings…Those are pretexts. The threat of criminal charges is a consequence of the Federal Reserve setting interest rates based on our best assessment of what will serve the public, rather than following the preferences of the President.”\nEconomists warn that if the executive branch successfully co-opts the Fed, it could create a “self-fulfilling prophecy” of higher long-term inflation.\nAs Oxford Economics recently noted, any “cracks in the Fed’s independence” could spread rapidly through markets and ultimately raise borrowing costs for the businesses the administration seeks to protect with low interest rates.\nIn a note published last July, when Trump publicly threatened to fire Powell, Deutsche Bank warned that such a move could spark severe market disruption.\n“Both the currency and the bond market can collapse,” the bank wrote, citing heightened risks of inflation and financial instability. “The empirical and academic evidence on the impact of a loss of central-bank independence is fairly clear.”\nWall Street executives have echoed those concerns. Brian Moynihan, chief executive of Bank of America, said recently the erosion of Fed independence would carry serious consequences.\n“The market will punish people if we don’t have an independent Fed,” Moynihan said."
            },
            {
                "title": "Gold and silver surge, stocks & USD slammed on news of Trump's ongoing attacks on the Fed - investingLive",
                "source": "investingLive",
                "url": "https://investinglive.com/centralbank/gold-and-silver-surge-stocks-usd-slammed-on-news-of-trumps-ongoing-attacks-on-the-fed-20260112/",
                "body": "The news broke that Trump is escalating his underhanded attacks on the Federal Reserve:\nNYT: Federal prosecutors open probe into Fed chair Powell amid renovation scrutiny\nSummary:\nNYT reports federal prosecutors have opened a probe involving Fed Chair Powell\nSpecific allegations and scope are unclear from the headline alone\nContext includes intense political attacks over Fed HQ renovation costs\nPowell previously requested an inspector general review of the project\nAny escalation could raise Fed-independence risk premia into the 2026 chair transition\nFed Chair Powell\nFed Chair Powell calls out Trump on his witch hunt, part of ongoing threats against Bank\nSummary\nPowell says DOJ threatened criminal indictment\nGrand jury subpoenas served on Friday\nIssue linked to Senate testimony on Fed renovation\nPowell calls move unprecedented and political\nRaises concerns over Fed independence\nFederal Reserve Chair Jerome Powell says Trump’s Department of Justice has subpoenaed the central bank. In a statement: \"No one, certainly not the chair of the Federal Reserve,is above the law,\" Powell said. \"But this unprecedented action should be seen in the broader context of the administration's threats and ongoing pressure.\"\nIn the back half of last week Trump ramped up the populist policy setting ina a bid to ramp stocks higher in this election year:\n- ordering “his representatives” to buy mortgage bonds to push borrowing costs lower,\n- banning institutional investors from buying single-family homes.\n- Trump floats one-year 10% credit-card rate cap, offers zero enforcement detail, just talk\nHis latest baloney attacking the Fed threatens to undo the gains, Trump cannot seem to undestand that attacks on Fed independence do not play well with those managing stock market funds.\nRunning to gold and silver instead.\nEURO, too, is higher. The USD is lower across the majors board.\nAustralian dollar, UK GBP, New Zealand dollar, Swissy ... even the hapless yen is gaining!!!"
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "2.090",
            "open": "62.725",
            "close": "63.173",
            "high": "64.125",
            "low": "62.035"
        },
        "market_summary": "### Spot Brent Crude Oil Market Briefing\n\n* **Key Drivers:** Geopolitical tensions in the Middle East, particularly in Iran, are fueling concerns over potential supply disruptions, while the US push to draw oil from Venezuela could cap price gains.\n* **Price Action:** WTI crude oil has risen above **$59.00** amid growing concerns over Iran's unrest, but the direct impact on **Spot Brent Crude Oil** prices is subject to global supply and demand dynamics.\n* **Technical Outlook:** Immediate support for Brent is near the **$65** level, with resistance at **$70**, as markets weigh the **bullish** momentum from Middle East tensions against the potential **bearish** impact of increased Venezuelan oil supply.\n\n---\n**Overall Sentiment:** Cautiously **bullish** ️",
        "source_articles": [
            {
                "title": "WTI climbs above $59.00 amid Middle East tensions - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/wti-climbs-above-5900-amid-middle-east-tensions-202601120125",
                "body": "WTI climbs above $59.00 amid Middle East tensions\n- WTI price rises to near $59.20 in Monday’s early Asian session.\n- Oil prices extended the rally on growing concerns that intensifying protests in Iran could disrupt supply from the OPEC producer.\n- The US planned to take millions of barrels of Venezuela’s oil to the global market.\nWest Texas Intermediate (WTI), the US crude oil benchmark, is trading around $59.20 during the early Asian trading hours on Monday. The WTI price jumps as tensions in Iran are fueling concerns in the oil market. Traders brace for the release of the American Petroleum Institute (API) crude oil stockpiles report on Tuesday.\nUS President Donald Trump is weighing a series of potential military options in Iran following deadly protests in the country, CNN reported on Sunday. Trump threatened repercussions if Iranian authorities target civilians, while Tehran warned the US and Israel against any intervention. The situation in Iran puts almost 2 million barrels per day of oil exports at risk of disruption, which could boost the WTI price in the near term.\n“Markets seem more focused on the intensifying unrest in Iran amid heated rhetoric and resilient fundamentals,” said Amarpreet Singh, Barclays’ analyst.\nNonetheless, a US push to draw oil companies back into Venezuela might cap the upside for the black gold. Trump said last week that Venezuela’s interim government agreed to give as many as 50 million barrels of “high-quality, sanctioned oil” to the US. Trump added that the US wants full access to Venezuela’s oil following the arrest of former President Nicolas Maduro by US forces over the weekend.\nThe API crude oil stockpiles report will be published on Tuesday. A larger-than-expected crude oil inventory draw indicates stronger demand and could boost the WTI price, while a bigger build than estimated signals weaker demand or excess supply, which might drag the WTI price lower.\nWTI Oil FAQs\nWTI Oil is a type of Crude Oil sold on international markets. The WTI stands for West Texas Intermediate, one of three major types including Brent and Dubai Crude. WTI is also referred to as “light” and “sweet” because of its relatively low gravity and sulfur content respectively. It is considered a high quality Oil that is easily refined. It is sourced in the United States and distributed via the Cushing hub, which is considered “The Pipeline Crossroads of the World”. It is a benchmark for the Oil market and WTI price is frequently quoted in the media.\nLike all assets, supply and demand are the key drivers of WTI Oil price. As such, global growth can be a driver of increased demand and vice versa for weak global growth. Political instability, wars, and sanctions can disrupt supply and impact prices. The decisions of OPEC, a group of major Oil-producing countries, is another key driver of price. The value of the US Dollar influences the price of WTI Crude Oil, since Oil is predominantly traded in US Dollars, thus a weaker US Dollar can make Oil more affordable and vice versa.\nThe weekly Oil inventory reports published by the American Petroleum Institute (API) and the Energy Information Agency (EIA) impact the price of WTI Oil. Changes in inventories reflect fluctuating supply and demand. If the data shows a drop in inventories it can indicate increased demand, pushing up Oil price. Higher inventories can reflect increased supply, pushing down prices. API’s report is published every Tuesday and EIA’s the day after. Their results are usually similar, falling within 1% of each other 75% of the time. The EIA data is considered more reliable, since it is a government agency.\nOPEC (Organization of the Petroleum Exporting Countries) is a group of 12 Oil-producing nations who collectively decide production quotas for member countries at twice-yearly meetings. Their decisions often impact WTI Oil prices. When OPEC decides to lower quotas, it can tighten supply, pushing up Oil prices. When OPEC increases production, it has the op"
            },
            {
                "title": "Cuba’s economy in jeopardy as Trump cuts off Venezuelan oil supply - WISH-TV",
                "source": "WISH-TV",
                "url": "https://www.wishtv.com/news/politics/cubas-economy-in-jeopardy-as-trump-cuts-off-venezuelan-oil-supply/",
                "body": "Cuba’s economy in jeopardy as Trump cuts off Venezuelan oil supply\nWEST PALM BEACH, Fla. (AP) — President Donald Trump on Sunday fired off another warning to the government of Cuba as the close ally of Venezuela braces for potential widespread unrest after Nicolás Maduro was deposed as Venezuela’s leader.\nCuba, a major beneficiary of Venezuelan oil, has now been cut off from those shipments as U.S. forces continue to seize tankers in an effort to control the production, refining and global distribution of the country’s oil products.\nTrump said on social media that Cuba long lived off Venezuelan oil and money and had offered security in return, “BUT NOT ANYMORE!”\n“THERE WILL BE NO MORE OIL OR MONEY GOING TO CUBA – ZERO!” Trump said in the post as he spent the weekend at his home in southern Florida. “I strongly suggest they make a deal, BEFORE IT IS TOO LATE.” He did not explain what kind of deal.\nThe Cuban government said 32 of its military personnel were killed during the American operation last weekend that captured Maduro. The personnel from Cuba’s two main security agencies were in Caracas, the Venezuelan capital, as part of an agreement between Cuba and Venezuela.\n“Venezuela doesn’t need protection anymore from the thugs and extortionists who held them hostage for so many years,” Trump said Sunday. “Venezuela now has the United States of America, the most powerful military in the World (by far!), to protect them, and protect them we will.”\nTrump also responded to another account’s social media post predicting that his secretary of state, Marco Rubio, will be president of Cuba: “Sounds good to me!” Trump said.\nTrump and top administration officials have taken an increasingly aggressive tone toward Cuba, which had been kept economically afloat by Venezuela. Long before Maduro’s capture, severe blackouts were sidelining life in Cuba, where people endured long lines at gas stations and supermarkets amid the island’s worst economic crisis in decades.\nTrump has said previously that the Cuban economy, battered by years of a U.S. embargo, would slide further with the ouster of Maduro.\n“It’s going down,” Trump said of Cuba. “It’s going down for the count.”"
            },
            {
                "title": "Why Iran’s Oil Workers Have Not Struck - Middle East Forum",
                "source": "Middle East Forum",
                "url": "https://www.meforum.org/mef-observer/why-irans-oil-workers-have-not-struck",
                "body": "www.meforum.org\nVerifying you are human. This may take a few seconds.\nwww.meforum.org needs to review the security of your connection before proceeding.\nVerification successful\nWaiting for www.meforum.org to respond...\nEnable JavaScript and cookies to continue"
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "2.160",
            "open": "58.323",
            "close": "58.798",
            "high": "59.798",
            "low": "57.638"
        },
        "market_summary": "### Spot WTI Crude Oil Market Briefing\n* **Key Drivers:** Global upstream capex is expected to fall again in **2026** amid low oil prices, with companies prioritizing profitability and debt reduction over production growth. Additionally, **Trump's bid to reshape oil supply** and **OPEC's strong output** are contributing to the current market situation.\n* **Price Action:** Spot WTI Crude Oil prices have been experiencing downward pressure, with current prices around **$36.54** per barrel, driven by concerns over a **supply glut** and **weak demand**.\n* **Technical Outlook:** immediate support is near the **$35** level, with resistance at **$40**. The **OPEC output surge** and **U.S. production growth** are expected to maintain the oversupply situation, putting downward pressure on prices.\n\n--- \n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "Global Upstream Capex Set To Fall Again In 2026 Amid Low Oil Prices - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/global-upstream-capex-set-fall-000000561.html",
                "body": "Last year, upstream oil investment was projected to have declined 2.5% Y/Y to $420 billion after low oil prices put pressure on producers and slowed expansion plans. Companies across the industry continued to prioritize profitability, free cash flow, and debt reduction over aggressive production growth, a trend reinforced by macro uncertainty. The decline was also driven by reduced spending by U.S. independent light tight oil and shale producers, even as national oil companies (NOCs) in the Middle East increased their investment, and spending on conventional projects generally proved more resilient.\nAnd now energy experts at Wood Mackenzie are predicting that these trends will continue in the current year. According to the analysts, global upstream operators will cut investment for a second consecutive year in 2026, with capital expenditure expected to fall by at least 2-3% year-on-year, and more than 5% compared to 2024 levels, as the industry navigates sub-$60/bbl oil prices while maintaining focus on long-term resilience. Reductions in North America and Europe will offset increases in Africa, Latin America, and the Middle East.\nDespite these pressures, non-OPEC liquids and global gas supply are projected to grow around 1.5% each. Brazil, Guyana, and Argentina are set to be major drivers of non-OPEC oil supply growth in 2026, accounting for half of the expected 0.8 million barrels per day (b/d) increase in 2026 the U.S. Energy Information Administration has predicted. According to the energy watchdog, Brazil's growth will mainly be driven by new offshore pre-salt projects coming online, including the start-up of Equinor’s (NYSE:EQNR) Bacalhau field in October as well as the start-up of two additional FPSOs by Petrobras in December. EIA has projected a 0.2 mb/d increase in production by Brazil in 2026 to 4.0 mb/d.\nRelated: China’s Metals Markets Surge on Bullish Outlooks\nIn Guyana, rapid development of the Stabroek Block by Exxon Mobil (NYSE:XOM) and its partners is pushing production to new highs, with potential for over 1 million barrels per day (bpd) as new FPSOs (Yellowtail, Uaru, Whiptail) come online. Exxon’s Yellowtail project has already attained full production capacity, pushing Guyana’s production to more than 900,000 b/d. Guyana is increasingly exporting crude to Asian markets.\nMeanwhile, the start-up of the Uaru project in 2026 will add another 250,000 b/d of supply, helping push Guyana’s crude oil production past 1.0 million b/d by 2027.\nEIA has also forecast significant production growth by Argentina in 2026, mainly driven by its massive Vaca Muerta shale reserves. Argentina’s oil production is expected to average 810,000 b/d in 2026, up from 740,000 b/d in 2025 and 670,000 b/d in 2024."
            },
            {
                "title": "Trump's bid to reshape oil supply - The Express Tribune",
                "source": "The Express Tribune",
                "url": "https://tribune.com.pk/story/2586675/trumps-bid-to-reshape-oil-supply",
                "body": "Trump's bid to reshape oil supply\nGrab of Venezuela's oil reserves is high-stakes gamble for energy dominance\nPresident Donald Trump has said that Venezuela's interim government will deliver up to 50 million barrels of oil to the United States. \"We're going to be using oil, and we're going to be taking oil. We're getting oil prices down,\" he added.\nTrump wouldn't say for how long the US will \"run\" Venezuela, but what he did say was that the revenue from its oil \"will be controlled by me\". Trump earlier said that the US oil industry would be \"up and running\" in Venezuela within 18 months and that he expected massive investments to pour into the Latin American country.\nThis means the interim government is buckling under pressure from the US president. Trump has threatened more military action, if the interim president, Delcy Rodriguez, doesn't give the American companies \"total access\" to Venezuela's oil industry, and sever economic ties with China, Russia, Iran and Cuba.\nThis makes the strategic intent of Trump's military operation in Venezuela unmistakably clear. The cat is out of the bag. The guessing game should end now. This blatant exercise of American geopolitical power was never about \"drug cartels\". It was never about \"narco-terrorism.\" It was never about democracy. It was about oil. Period. It was about resource grab. Period. Trump wanted to seize control of energy assets of Venezuela, which has nearly 17% of the world's known oil reserves, and reshape the global oil supply chain through force.\nIt's not the first time the US has done this. American presidents have done this in the past too – in Iran, in Libya, in Syria, and in Kuwait. In the past, however, US military interventions were typically wrapped in ideological or security justifications to make them more palatable. The 1953 US-backed regime change in Iran was framed as a necessary measure to contain communism. Similar rationales were offered over Libya, Iraq, Syria, and Kuwait, where military intervention, sanctions, or coercive diplomacy coincided closely with strategic energy interests.\nIt is the same playbook. The same script. Only the excuse has changed. Trump unilaterally declared Venezuela a \"narco-terrorist\" state and its president, Nicolas Maduro, an \"illegitimate dictator,\" before ordering unlawful strikes on so-called \"narco boats\" in the Caribbean Sea. He then imposed a blockade on Venezuela in mid-December, a campaign that culminated in the dramatic seizure of Maduro and his wife by US special forces in a military operation widely condemned as a violation of the UN Charter and international law.\nTrump, however, didn't go for a regime change. Instead, he signalled that Rodriguez, Maduro's deputy, should \"do the right thing\"- a not-so-veiled warning that her political survival depends on cooperation with the US. The objective: a direct control over Venezuela's vast oil reserves. What to expect next? American energy firms re-entering Maduro's country, injecting capital, and imposing technological and operational control, folding Venezuela's petroleum industry into a US-led energy system.\nSurprisingly, oil markets have reacted with restraint. When trading opened on January 5 – two days after the Venezuela operation – Brent crude briefly fell 1.2% to around $60 a barrel, while WTI dipped before recovering by the close. This apparent calm masks deeper uncertainty. Global oil markets are currently characterised by weak demand and oversupply. By 2025, the global crude surplus had reached nearly 3.8 million barrels per day – and geopolitical risks were already priced in.\nVenezuela's oil production, crippled by years of sanctions, averaged just 934,000 barrels per day in late 2025 – less than 1% of total global supply. Short-term disruptions can therefore be absorbed by other producers. Markets, too, have grasped the logic of Trump's ultimatum: Venezuela has little choice but to raise output. With American companies poised to lead \"reconstruction\", there is "
            },
            {
                "title": "Oil Extends Losses in Asia on Strong OPEC Output - Naharnet",
                "source": "Naharnet",
                "url": "https://m.naharnet.com/stories/en/196716-oil-extends-losses-in-asia-on-strong-opec-output",
                "body": "Oil Extends Losses in Asia on Strong OPEC Output\nOil tumbled to fresh multi-year lows in Asia Friday after OPEC said output had surged, exacerbating concerns over a supply glut that is expected to persist beyond next year.\nThe Organization of the Petroleum Exporting Countries reported its collective production rose by 230,100 barrels a day in November to 31.7 million, the highest in three and a half years and beyond its 30 million ceiling target.\nThe group is battling for market share with other oil producers, including the United States, and last Friday decided against cutting output despite plunging prices, weak global demand and the supply glut.\nU.S. benchmark West Texas Intermediate (WTI) for delivery in January was down 22 cents at $36.54 and Brent crude for January was trading 25 cents lower at $39.48 at around 0620 GMT, their lowest levels since early 2009 during a global financial crisis.\n\"Crude oil prices saw a renewed decline as OPEC output rose to a three-year high in November, reinforcing consternation that the global oil market is going to remain oversupplied for a longer time,\" said Bernard Aw, market strategist at IG Markets in Singapore.\n\"Focus now turns to the Baker Hughes drill rig count this evening,\" he said, referring to an inventory of active oil drilling rigs in the U.S. indicating production activity.\nStrong output from the U.S. and OPEC are key contributors to the global crude oversupply. Iranian oil will return to the markets by next year after western sanctions are lifted under a landmark deal reached in July to curb Tehran's nuclear programme.\n\"The oil sector is expected to stay under pressure in the near term... as output from global oil producers is likely to rise further in the future,\" Aw added.\nWTI has lost around a 10th of its value since last Friday and more than 60 percent since hitting recent peaks above $100 in summer 2014."
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0044",
            "open": "1.1656",
            "close": "1.1632",
            "high": "1.1662",
            "low": "1.1618"
        },
        "market_summary": "### EUR/USD Market Briefing\n* **Key Drivers:** Weaker-than-expected US jobs growth and **dovish** Federal Reserve expectations are weakening the US Dollar, allowing the **EUR/USD** pair to rise near **1.1650**.\n* **Price Action:** The pair shows **bullish momentum** as it climbs for a seventh consecutive session, with the US Dollar struggling against the Euro.\n* **Technical Outlook:** Immediate resistance is near **1.1650**, with support at the previous psychological level of **1.1600**.\n--- \n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "EUR/USD rises to near 1.1650 amid dovish Fed expectations - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/eur-usd-rises-to-near-11650-amid-dovish-fed-expectations-202601120042",
                "body": "EUR/USD rises to near 1.1650 amid dovish Fed expectations\n- EUR/USD rises as the US Dollar weakens on dovish Federal Reserve expectations.\n- US Nonfarm Payrolls rose 50,000 in December, below November’s revised 56,000 and the 60,000 forecast.\n- UK- and Germany-led European nations are discussing boosting military presence in Greenland to strengthen Arctic security.\nEUR/USD edges higher after registering gains in the previous six successive sessions, trading around 1.1650 during the Asian hours on Monday. The pair appreciates as the US Dollar (USD) struggles amid dovish Federal Reserve (Fed) expectations. Friday’s slower-than-expected US jobs growth suggests the US central bank could hold interest rates steady later this month.\nUS Nonfarm Payrolls (NFP) rose by 50,000 in December, falling short of November's 56,000 (revised from 64,000) and came in weaker than the market expectation of 60,000. However, the Unemployment Rate ticked lower to 4.4% in December from 4.6% in November, while the Average Hourly Earnings climbed to 3.8% YoY in December from 3.6% in the previous reading.\nRichmond Fed President Tom Barkin said the decline in the unemployment rate was welcome and described job growth as modest but stable. Barkin added that it is difficult to find firms outside healthcare or AI that are hiring and said it remains unclear whether the labor market will tilt toward more hiring or more firing.\nThe Euro (EUR) could face additional downside as easing inflation in the Euro area dampens expectations for further policy tightening by the European Central Bank (ECB). Headline inflation slowed to 2.0% in December, a four-month low and in line with the ECB’s target, while core inflation eased to 2.3%, coming in slightly below forecasts.\nBloomberg reported that European nations led by the United Kingdom (UK) and Germany are discussing boosting their military presence in Greenland to reinforce Arctic security. Germany may propose a joint NATO mission, while UK Prime Minister Keir Starmer has urged allies to step up efforts in the High North, amid renewed comments by US President Donald Trump advocating US ownership of Greenland.\nEuro FAQs\nThe Euro is the currency for the 20 European Union countries that belong to the Eurozone. It is the second most heavily traded currency in the world behind the US Dollar. In 2022, it accounted for 31% of all foreign exchange transactions, with an average daily turnover of over $2.2 trillion a day. EUR/USD is the most heavily traded currency pair in the world, accounting for an estimated 30% off all transactions, followed by EUR/JPY (4%), EUR/GBP (3%) and EUR/AUD (2%).\nThe European Central Bank (ECB) in Frankfurt, Germany, is the reserve bank for the Eurozone. The ECB sets interest rates and manages monetary policy. The ECB’s primary mandate is to maintain price stability, which means either controlling inflation or stimulating growth. Its primary tool is the raising or lowering of interest rates. Relatively high interest rates – or the expectation of higher rates – will usually benefit the Euro and vice versa. The ECB Governing Council makes monetary policy decisions at meetings held eight times a year. Decisions are made by heads of the Eurozone national banks and six permanent members, including the President of the ECB, Christine Lagarde.\nEurozone inflation data, measured by the Harmonized Index of Consumer Prices (HICP), is an important econometric for the Euro. If inflation rises more than expected, especially if above the ECB’s 2% target, it obliges the ECB to raise interest rates to bring it back under control. Relatively high interest rates compared to its counterparts will usually benefit the Euro, as it makes the region more attractive as a place for global investors to park their money.\nData releases gauge the health of the economy and can impact on the Euro. Indicators such as GDP, Manufacturing and Services PMIs, employment, and consumer sentiment surveys can all influence the direction of t"
            },
            {
                "title": "FX Futures Positioning: EUR/USD, USD/CHF, USD/CAD, USD/JPY | COT Report - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-au/news-and-analysis/fx-futures-positioning-eur-usd-usd-chf-usd-cad-usd-jpy-cot-report/",
                "body": "FX futures positioning is becoming increasingly stretched, with speculative euro longs near extremes, bearish exposure building in the Swiss franc, and conviction fading in the yen. Meanwhile, the US dollar shows early signs of stabilising after months of weakness. This report reviews CFTC Commitment of Traders data across major currencies before drilling into EUR/USD, USD/CHF, USD/JPY and USD/CAD for potential inflection points.\nView related analysis:\n- CAD/JPY Outlook Ahead of Canada Jobs and Trump Tariff Ruling\n- AUD/USD 2026 Outlook: Policy Divergence and a Shifting Dollar Trend\n- AUD/USD Hints at Pullback as US Dollar Bulls Regain Footing\n- Australian Dollar Outlook: AUD/USD Momentum Falters Near Highs\nLarge Speculator Positioning | COT Report\nLarge speculators have remained net-short the US dollar index since June, although that exposure has been reduced by around 75% in recent weeks to roughly -38k contracts. This has allowed the 3-month and 1-year percent ranks to recover, even if broader sentiment remains skewed against the US dollar.\nCharts prepared by Matt Simpson – Data Source: CME, CFTC, IMM\nThat backdrop has naturally benefited the euro, given its 57% weighting in the US dollar index. Large speculators are now the most bullish on EUR since July 2023, with gross long exposure reaching a record high — a potential sign positioning is becoming stretched.\nElsewhere, Swiss franc bears have eased off, with net-short exposure edging away from its 18-month extreme.\nFinally, note the shift in sentiment towards the Brazilian real. Net-long exposure has fallen to a 45-week low as longs unwind and shorts rebuild, raising the risk that large speculators flip to net-short positioning in the weeks ahead.\nAsset Manager Positioning | COT Report\nAsset managers flipped to net-short USD index futures two weeks ago, for the first time since mid-October. That leaves both asset managers and large speculators aligned in a bearish view on the US dollar.\nAsset managers have also increased net-long exposure to the Brazilian real, moving counter to large speculators, who have been unwinding longs.\nChart prepared by Matt Simpson – Data Source: CME, CFTC, IMM\nComparing asset manager exposure with large speculators across FX futures shows relatively few differences beyond the US dollar and BRL. One notable exception is the Japanese yen, where asset managers appear less convinced of a bullish outlook given their lower levels of net-long exposure.\nI suspect Australian dollar futures will eventually flip to net-long exposure among both trader groups, reflecting divergent monetary policy expectations between the RBA and Fed. For now, however, both remain net-short AUD/USD, albeit at a diminishing pace.\nEUR/USD (Euro) Futures Positioning | COT Report\nThe slide in the US dollar has pushed net-long exposure to the euro to an 18-month high among large speculators and a 15-month high among asset managers. With net positioning fast approaching its 2023 peaks, this raises the risk a sentiment extreme is forming — one that could leave EUR/USD vulnerable to a pullback or the US dollar index primed for a rebound.\nThat risk is heightened by the fact that gross long positions have reached record highs among both trader groups, increasing the chance of a crowded trade.\nChart prepared by Matt Simpson – Data Source: CME, CFTC, LSEG\nCHF/USD (Swiss Franc) Futures Positioning | COT Report\nSwiss franc futures have retained their strength despite a notable build-up in net-short exposure among both large speculators and asset managers. At some point, that bearish positioning needs to be validated either by a weaker franc (a rise in USD/CHF), or by traders covering shorts — a move that could instead drive the franc higher. The latter scenario carries the risk of intervention from the Swiss National Bank.\nMore recently, momentum has turned lower for the franc, leaving USD/CHF looking increasingly bullish. If incoming US data continues to support a “higher for longer” Fed"
            },
            {
                "title": "EUR/USD climbs close to 1.1650 as markets anticipate a dovish stance from the Fed - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605141654",
                "body": "The EUR/USD pair continued its upward momentum for a seventh consecutive session, hovering near 1.1650 during Monday’s Asian trading hours. The currency pair is benefiting from a weaker US Dollar, as market sentiment leans toward a more dovish stance from the Federal Reserve. Recent US employment data, which came in below expectations, has fueled speculation that the Fed may keep interest rates unchanged at its upcoming meeting.\nDecember’s Nonfarm Payrolls (NFP) increased by 50,000, missing both the revised November figure of 56,000 and the anticipated 60,000. Despite the slower job growth, the unemployment rate edged down to 4.4% from November’s 4.6%. Additionally, average hourly earnings rose to 3.8% year-over-year, up from the previous 3.6%.\nTom Barkin, President of the Richmond Fed, welcomed the drop in unemployment and described job creation as steady, though moderate. He noted that hiring remains concentrated in sectors like healthcare and artificial intelligence, and expressed uncertainty about whether the labor market will see more hiring or layoffs in the near future.\nThe Euro may encounter renewed headwinds as inflation in the Eurozone continues to ease, reducing the likelihood of further rate hikes by the European Central Bank (ECB). Headline inflation slipped to 2.0% in December, marking a four-month low and aligning with the ECB’s target. Core inflation also softened to 2.3%, slightly underperforming forecasts.\nAccording to Bloomberg, several European countries, including the United Kingdom and Germany, are considering increasing their military footprint in Greenland to bolster security in the Arctic region. Germany is reportedly contemplating a joint NATO operation, while UK Prime Minister Keir Starmer has called on allies to intensify their efforts in the High North. These discussions come as US President Donald Trump reiterates his interest in US ownership of Greenland."
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0059",
            "open": "1.3432",
            "close": "1.3398",
            "high": "1.3451",
            "low": "1.3392"
        },
        "market_summary": "### GBP/USD Market Briefing\n* **Key Drivers:** Broad-based **USD selling bias** driven by concerns about the Fed's independence and mixed US jobs data, which showed slowing payroll growth but a firmer unemployment picture, weighing on the **USD**.\n* **Price Action:** The **GBP/USD** pair rebounds from a nearly three-week low, touching the **1.3400** level before recovering to **1.3435**, up **0.20%** for the day, as the **USD** fails to hold gains.\n* **Technical Outlook:** Immediate support is near the **200-day Simple Moving Average (SMA)** at **1.3393**, with resistance at **1.3400** and further support at the **50-day moving average** at **1.3304**. \n\n--- \n**Overall Sentiment:** Neutral 📊",
        "source_articles": [
            {
                "title": "GBP/USD rebounds from near three-week low as Fed concerns pressure USD - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-usd-rebounds-from-three-week-low-eyes-mid-13400s-as-fed-concerns-weigh-on-usd-202601120106",
                "body": "GBP/USD rebounds from three-week low, eyes mid-1.3400s as Fed concerns weigh on USD\n- GBP/USD regains positive traction at the start of a new week amid broad-based USD selling bias.\n- Concerns about the Fed’s independence drag the USD away from a one-month top set on Friday.\n- Rising geopolitical tensions fail to benefit the safe-haven buck or hinder the pair’s move up.\nThe GBP/USD pair attracts some buyers near a technically significant 200-day Simple Moving Average (SMA) and recovers slightly from a nearly three-week low, touched during the Asian session on Monday. Spot prices, for now, seem to have snapped a four-day losing streak and currently trade around the 1.3435 region, up 0.20% for the day.\nDespite the global flight to safety and reduced bets for more aggressive policy easing by the US Federal Reserve (Fed), renewed concerns about the US central bank's independence weigh on the US Dollar (USD) and benefit the GBP/USD pair. In fact, Fed Chair Jerome Powell said in a statement that the Department of Justice is threatening a criminal indictment against him. Powell added that the threat of criminal charges is a consequence of the Fed on our best assessment of what will serve the public, rather than following the preference of the President.\nThe USD Index (DXY), which tracks the Greenback against a basket of currencies, is seen extending Friday's retracement slide from its highest level since December 9, touched ahead of the crucial US Nonfarm Payrolls (NFP) report. The headline US NFP showed that the economy added 50K new jobs in December, undershooting market expectations and offsetting a decline in the Unemployment Rate to 4.4%. Nevertheless, the data backs the case for potentially stagnant monetary policy in the first quarter, though it does little to impress the USD bulls.\nHowever, rising bets for two more interest rate cuts by the Bank of England (BoE) in 2026 might hold back traders from placing aggressive bullish bets around the British Pound (GBP) and cap the GBP/USD pair. Traders might also opt to wait for this week's release of the latest US inflation figures – the Consumer Price Index (CPI) and the Producer Price Index (PPI) on Tuesday and Wednesday, respectively. Moreover, the monthly UK GDP report on Thursday would provide some meaningful impetus to the GBP/USD pair during the latter part of the week.\nUS Dollar Price Today\nThe table below shows the percentage change of US Dollar (USD) against listed major currencies today. US Dollar was the strongest against the Japanese Yen.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the US Dollar from the left column and move along the horizontal line to the Japanese Yen, the percentage change displayed in the box will represent USD (base)/JPY (quote).\nAuthor\nHaresh Menghani\nFXStreet\nHaresh Menghani is a detail-oriented professional with 10+ years of extensive experience in analysing the global financial markets."
            },
            {
                "title": "Pound-to-Dollar Forecast: GBP/USD Risks Sustained Decline Below 1.34 - CurrencyNews.co.uk",
                "source": "CurrencyNews.co.uk",
                "url": "https://www.currencynews.co.uk/forecast/20260111-44943_pound-to-dollar-forecast-gbp-usd-risks-sustained-decline-below-1-34.html",
                "body": "The Pound to US Dollar exchange rate (GBP/USD) briefly tested the 1.34 level after US jobs data showed slowing payroll growth but a firmer unemployment picture.\nThe mixed outcome left the dollar supported and reinforced caution around further near-term Fed easing.\nGBP/USD Forecasts: Tests 1.34 Support\nThe Pound to Dollar rate touched the 1.3400 level in immediate reaction to the US jobs data before a recovery to 1.3435 as the dollar failed to hold gains.\nThe 1.3400 level remains a significant support area for the pair.\nUoB commented; “Our view remains unchanged. Looking ahead, if GBP breaks below 1.3400, it could trigger a more sustained decline.”\nAccording to Scotiabank, there has been some evidence of a shift in Pound dynamics; “we see some added near-term risk from the turn in sentiment as we note the signs of exhaustion in risk reversals stalling out after fading a considerable portion of the premium for protection against GBP weakness over the past month or so.”\nSave on Your GBP/USD Transfer\nGet better rates and lower fees on your next international money transfer.\nCompare TorFX with top UK banks in seconds and see how much you could save.\nIt added; “We remain neutral absent a clear break below the 200 day MA (1.3393), after which we see risk of an extension to the 50 day MA at 1.3304.”\nThe latest US jobs report recorded an increase in non-farm payrolls of 50,000 for December compared with consensus forecasts of around 65,000 while the November increase was revised down slightly to 56,000 from the 64,000 reported previously.\nThe October figure was revised to show a 173,000 decline, primarily due to the slump in government jobs.\nThe household survey recorded a decline in unemployment to 4.4% from 4.6% and compared with expectations of a slight decline to 4.5%.\nOverall, the data was not considered weak enough to justify a further near-term cut in interest rates.\nIn response, markets priced out the potential for a rate cut at the late-January meeting with the chances of a March move lowered to around 30%.\nPeter Cardillo, Chief Market Economist at Spartan Capital Securities commented; “It should mean that the Fed will continue to eye the labor market before cutting rates in the first quarter.\"\nMarkets remain on alert for any nomination over the next Fed Chair.\nScotiabank commented; “President Trump said yesterday that he had made up his mind on his Fed chair pick. There was no additional information from the president—other than he had not divulged his choice to anyone— but the comment will likely bolster speculation that an announcement could come shortly.”\nThere is also the potential for the Supreme Court to make an announcement on the reciprocal tariffs announced in April.\nEither of these factors could have a significant impact on the dollar, wider currency markets and risk appetite.\nLike this piece? Please share with your friends and colleagues:\nInternational Money Transfer? Ask our resident FX expert a money transfer question or try John's new, free, no-obligation personal service! ,where he helps every step of the way,\nensuring you get the best exchange rates on your currency requirements."
            },
            {
                "title": "Powell States That the Justice Department Issued Subpoenas to the Federal Reserve - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605141693",
                "body": "Photographer: Al Drago/Bloomberg\nBloomberg reports that Jerome Powell, the Chair of the Federal Reserve, revealed that the Justice Department has issued grand jury subpoenas to the central bank. These subpoenas threaten criminal charges in connection with Powell’s recent congressional appearance, where he discussed ongoing renovations at the Fed’s headquarters.\nOn Sunday evening, Powell issued a statement denying any link between the subpoenas and either his testimony or the renovation project.\n“These are merely excuses,” Powell stated. “The threat of prosecution stems from the Federal Reserve’s commitment to setting interest rates based on our independent analysis of what best serves the public, rather than yielding to presidential preferences.”\nHe further emphasized, “The core issue is whether the Fed can continue to determine monetary policy using data and economic realities, or if those decisions will be swayed by political interference or intimidation.”\nFollowing the news, the US dollar declined against major currencies, gold prices surged to new highs, and S&P 500 futures dropped by 0.3%.\nThis unprecedented action by the Trump administration intensifies the ongoing conflict between the president and the Fed chair. President Trump has repeatedly advocated for significant interest rate reductions and has also attempted to dismiss another Federal Reserve governor, a matter still under judicial review.\nPowell remarked that the possible indictment “should be viewed within the larger pattern of threats and sustained pressure from the administration.”\nHe affirmed his dedication to his responsibilities, stating he will continue to serve “with honesty and a focus on the interests of the American people.”\n©2026 Bloomberg L.P."
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0040",
            "open": "0.6697",
            "close": "0.6679",
            "high": "0.6703",
            "low": "0.6663"
        },
        "market_summary": "### AUD/USD Market Briefing\n* **Key Drivers:** The **Australian dollar** is gaining against the **US dollar** due to a weaker **US Dollar Index (DXY)**, currently trading around **98.90**, and expectations of a **hawkish** Reserve Bank of Australia (RBA) policy, with **RBA Deputy Governor Andrew Hauser** stating that inflation remains **\"too high\"**.\n* **Price Action:** The **AUD/USD** pair has snapped a **3-session decline**, rising toward **$0.67**, driven by a **weaker US dollar** amid concerns over a criminal investigation into **Fed Chair Jerome Powell** and **slower-than-expected US jobs growth**.\n* **Technical Outlook:** Immediate support for **AUD/USD** is near the **50-day moving average** at around **$0.66**, with resistance at **$0.67**, as the pair aims to extend its gains, fueled by **policy divergence** between the RBA and the Federal Reserve, with **Fed funds futures** indicating a **95% probability** of unchanged rates at the January meeting.\n\n--- \n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Australian Dollar Outlook: AUD/USD Momentum Falters Near Highs - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/australian-dollar-outlook-aud-usd-momentum-falters-near-highs/?amp=true",
                "body": "Australian Dollar Outlook: AUD/USD Momentum Falters Near Highs\nThe Australian dollar is showing early signs of fatigue near recent highs, with AUD/USD struggling to extend gains despite a broadly supportive macro backdrop. While policy divergence with the Federal Reserve continues to underpin the pair, softer RBA hike expectations and looming global risk events leave the Aussie vulnerable to near-term pullbacks.\nView related analysis:\n- CAD/JPY Outlook Ahead of Canada Jobs and Trump Tariff Ruling\n- AUD/USD Hints at Pullback as US Dollar Bulls Regain Footing\n- AUD/USD 2026 Outlook: Policy Divergence and a Shifting Dollar Trend\nAUD/USD Outlook: Momentum Signals Fade Near Recent Highs\nUS Supreme Court Tariff Ruling in Focus\nThe US Supreme court are yet to decide whether Trump’s tariffs are legal, though their review of the matter began on Friday. There is no knowing when they might make their decision, but it could impact appetite for risk and therefore the Australian dollar when the headlines drop. I personally find it difficult to see them effectively cancelling the tariffs – though that could give appetite for risk quite a boost. It seems more likely they will remain in place or be handed over to congress. While this could knock sentiment over the short term, any shock of these tariffs has likely run its course and therefore already likely priced in.\nRBA Rate Outlook Hinges on Jobs and Inflation\nThe odds of the RBA hiking by 25bp to 3.85% in February sit at 25%, down from 34% ahead of Christmas. That probability is unlikely to shift much this week, with only consumer confidence and inflation expectations on the economic calendar.\nNext week’s jobs report, followed by the quarterly and monthly inflation prints the week after, are more likely to determine whether the RBA pulls the trigger.\nFed Policy Path Keeps USD in Check\nMeanwhile, Fed funds futures suggest rates will remain on hold for the next three meetings, with a 47% chance of a cut priced for June and 34.5% for September. Friday’s nonfarm payrolls report did little to shift interest rate odds, with the US economy adding 50k jobs in December and unemployment falling to 4.4%.\nThis policy divergence should help AUD/USD retain a bid overall unless bears are handed a genuine risk-off catalyst.\nAustralian Dollar Performance\n- It was a mixed week for the Aussie, with AUD/USD closing effectively flat after a brief break above 67c.\n- The Australian dollar made its strongest gains against the Canadian dollar, with AUD/CAD rising 1.16% and trading above 0.93 for the first time since September.\n- GBP/AUD fell for a third consecutive week and is trading around the 2.00 handle, with bears eyeing a break below the November low at 1.996 to extend the downtrend.\n- The euro continues to lead sterling lower, with EUR/AUD sliding to an eight-month low.\n- AUD/NZD rose for a second week, pushing the cross to a 10-year high, with bulls now targeting a break above 1.17.\n- A weaker Japanese yen lifted AUD/JPY to a six-month high, with the daily trend tracking neatly along the 10-day EMA. A bullish engulfing pattern formed at the average on Friday, offering little sign of meaningful pullbacks so far.\nChart prepared by Matt Simpson - Source: LSEG\nAustralia This Week: Economic Data and Events for AUD/USD Traders\nAUD/USD Correlations\nThe strongest correlation with the Australian dollar remains NZD/USD. However, with the 10-day inverse correlation with the US dollar index rising towards -0.6, the typically stronger USD relationship is likely to reassert itself on the industry-standard 20-day measure.\nWTI crude oil currently shows an inverse relationship with AUD/USD, although this could flip back into positive territory if geopolitical risk escalates — particularly in the event of regime change in Iran.\nChart prepared by Matt Simpson - Source: LSEG\nAustralian Dollar Futures Market Positioning – COT Report\nLongs have continued to step into the Aussie, with asset managers cutting their net-short exposu"
            },
            {
                "title": "Australian Dollar rebounds as US Dollar weakens on Fed concerns - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/australian-dollar-advances-as-us-dollar-struggles-due-to-fed-concerns-202601120222",
                "body": "Australian Dollar rises as US Dollar dips on Fed investigation\n- Australian Dollar halts its three-day losing streak on Monday.\n- ANZ Job Advertisements fell 0.5% in December after a revised 1.5% decline previously.\n- The US Dollar weakens after federal prosecutors opened a criminal investigation into Fed Chair Jerome Powell.\nThe Australian Dollar (AUD) rises against the US Dollar (USD) on Monday, following three days of losses. The AUD/USD pair advances as the Greenback weakens, potentially amid concerns surrounding the Federal Reserve.\nFederal prosecutors have opened a criminal investigation into Fed Chair Jerome Powell regarding the central bank's renovation of its Washington headquarters and whether Powell lied to Congress about the project's scope, the New York Times reported on Sunday.\nANZ Job Advertisements declined 0.5% in December, following an upwardly revised 1.5% drop in the prior month. Meanwhile, household spending increased 1.0% month-on-month in November 2025, easing from a revised 1.4% rise in October, as consumers remained cautious amid elevated interest rates and persistent inflation.\nAustralia’s mixed November Consumer Price Index (CPI) left the Reserve Bank of Australia’s (RBA) policy outlook uncertain. However, RBA Deputy Governor Andrew Hauser said that the November inflation data was largely as expected. Hauser added that interest rate cuts are unlikely anytime soon. Focus now shifts to the quarterly CPI report due later this month for clearer guidance on the RBA’s next policy move.\nUS Dollar declines due to Fed concerns\n- The US Dollar Index (DXY), which measures the value of the US Dollar against six major currencies, is losing ground and trading around 98.90 at the time of writing. The Greenback struggles amid dovish Federal Reserve (Fed) expectations. December’s slower-than-expected US jobs growth suggests the US central bank could hold interest rates steady later this month.\n- US Nonfarm Payrolls (NFP) rose by 50,000 in December, falling short of November's 56,000 (revised from 64,000) and came in weaker than the market expectation of 60,000. However, the Unemployment Rate ticked lower to 4.4% in December from 4.6% in November, while the Average Hourly Earnings climbed to 3.8% YoY in December from 3.6% in the previous reading.\n- According to the CME Group's FedWatch tool, Fed funds futures continue to price in about a 95% probability that the US central bank will keep rates unchanged at its January 27–28 meeting.\n- Richmond Fed President Tom Barkin said the decline in the unemployment rate was welcome and described job growth as modest but stable. Barkin added that it is difficult to find firms outside healthcare or AI that are hiring and said it remains unclear whether the labor market will tilt toward more hiring or more firing.\n- US Treasury Secretary Scott Bessent said in a CNBC interview on Thursday that the Federal Reserve should continue cutting rates, arguing that lower rates are “the only ingredient missing” for even stronger economic growth and that the Fed should not delay.\n- The US Department of Labor (DOL) reported on Thursday that Initial Jobless Claims rose modestly to 208,000 in the week ended January 3, slightly below market expectations of 210,000 but above the previous week’s revised 200,000. Continuing jobless claims increased to 1.914 million from 1.858 million, indicating a gradual rise in the number of people remaining on unemployment benefits.\n- The Institute for Supply Management (ISM) reported on Wednesday that the US Services PMI rose to 54.4 in December from 52.6 in November. This figure came in stronger than the expectations of 52.3.\n- The US Automatic Data Processing (ADP) Employment Change showed an increase of 41,000 jobs in December, following a revised decline of 29,000 in November. The figure came in slightly below market expectations of 47,000. JOLTS Job Openings came in at 7.146 million in November. This reading followed the 7.449 million openings recorded in Oc"
            },
            {
                "title": "Australian Dollar Snaps 3-Session Decline - TradingView — Track All Markets",
                "source": "TradingView — Track All Markets",
                "url": "https://www.tradingview.com/news/te_news:516199:0-australian-dollar-snaps-3-session-decline/",
                "body": "Australian Dollar Snaps 3-Session Decline\nThe Australian dollar rose toward $0.67 on Monday, snapping a three-session losing streak as markets continued to anticipate a Reserve Bank cash rate hike later this year.\nRBA Deputy Governor Andrew Hauser recently said inflation remains “too high,” suggesting the easing cycle may have run its course.\nLast month, RBA Governor Michele Bullock warned that the next policy move could be a rate hike after inflation once again exceeded the RBA’s 2–3% target band.\nThese hawkish comments were digested alongside data showing household spending rose 1% month-on-month in November 2025, easing from October’s 1.4% gain but surpassing forecasts of a 0.6% increase.\nMeanwhile, ANZ-Indeed Australian Job Ads fell 0.5% month-on-month in November, marking the sixth consecutive monthly decline.\nExternally, the Aussie dollar was supported by a weaker greenback amid reports of a criminal investigation into Fed Chair Powell, while US nonfarm payrolls fueled expectations of further policy easing this year."
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "0.6840",
            "open": "158.0800",
            "close": "158.0010",
            "high": "158.1970",
            "low": "157.5130"
        },
        "market_summary": "### USD/JPY Market Briefing\n* **Key Drivers:** The Japanese Yen is under pressure due to **political uncertainty** and **BoJ doubts**, while the US Dollar is influenced by concerns about the **Fed's independence** and the latest **US inflation figures**.\n* **Price Action:** The USD/JPY pair is currently trading at **158.05**, with the Japanese Yen struggling near a one-year low vs. the USD, showing significant **bearish** momentum.\n* **Technical Outlook:** Immediate support is near **157.00**, with resistance at **159.00**. The pair's movement is also influenced by the **difference between Japanese and US bond yields** and the **safe-haven** status of the Japanese Yen.\n\n--- \n**Overall Sentiment:** **Bearish** 📉",
        "source_articles": [
            {
                "title": "Japanese Yen bulls hesitant amid political uncertainty and BoJ doubts - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/japanese-yen-bulls-seem-hesitant-as-political-and-boj-doubts-offset-flight-to-safety-202601120344",
                "body": "Japanese Yen struggles near one-year low vs. USD amid political and BoJ uncertainty\n- The Japanese Yen is pressured by reports that Japan's Takaichi may call an early election and the BoJ uncertainty.\n- Rising geopolitical tensions boost demand for traditional safe-haven assets and could help limit losses for the JPY.\n- Concerns about the Fed’s independence weigh heavily on the USD and could also cap gains for the USD/JPY pair.\nThe Japanese Yen (JPY) struggles to capitalize on a modest intraday move up against a broadly weaker US Dollar (USD) and slides back closer to a one-year low touched earlier this Monday. A deepening Japan-China rift and reports that Japan's Prime Minister Sanae Takaichi may call an early general election add a layer of uncertainty amid the lack of clarity about the likely timing of the next Bank of Japan (BoJ) interest rate hike. This, in turn, is seen as a key factor behind the JPY's underperformance and favors bearish traders.\nHowever, concerns about further escalation of geopolitical tensions could offer some support to the safe-haven JPY. The USD, on the other hand, attracts heavy sellers amid growing worries about the US Federal Reserve's (Fed) independence and moves away from its highest level since December 5, touched on Friday. This might further contribute to capping the USD/JPY pair as traders keenly await this week's release of the latest US inflation figures. Nevertheless, the broader fundamental backdrop seems tilted firmly in favor of the JPY bears.\nJapanese Yen struggles to lure buyers as political and BoJ doubts offset flight to safety\n- US President Donald Trump told reporters on Sunday that he was considering a range of options, including potential military action, in response to the unrest in Iran. The latter threatened to target US military bases if Trump carries out threats to intervene on behalf of protesters.\n- This comes on top of the intensifying Russia-Ukraine war and tempers investors' appetite for riskier assets, lending some support to the safe-haven Japanese Yen at the start of a new week. However, a combination of factors holds back traders from placing aggressive JPY bullish bets.\n- Last week, China prohibited dual-use goods, including some rare earth elements, from being exported to Japan with immediate effect. The ban follows a diplomatic row over Taiwan and heightens supply-chain risk for Japanese manufacturers, which could act as a headwind for the JPY.\n- The Yomiuri newspaper reported on Friday that Japan's Prime Minister Sanae Takaichi was considering holding a snap parliamentary election in the first half of February. Adding to this, the uncertainty over the timing of the next Bank of Japan interest rate hike could cap the JPY.\n- The US Dollar, on the other hand, attracts heavy selling amid growing worries about the US Federal Reserve's independence and moves away from its highest level since December 5, touched on Friday. This further contributes to the USD/JPY pair's Asian session slide to mid-157.00s.\n- Fed Chair Jerome Powell said that the Department of Justice is threatening a criminal indictment against him. Powell added that the threat of criminal charges is a consequence of the Fed, based on its best assessment of what will serve the public, rather than following the preference of the President.\n- On the economic data front, the US Bureau of Labor Statistics (BLS) reported on Friday that Nonfarm Payrolls rose by 50K in December, below expectations for a reading of 60K and November's 56K (revised from 64K). However, the Unemployment Rate fell to 4.4% from 4.6% in November.\n- This led to a shift in the likelihood of a Fed rate cut at the next policy meeting on January 28, though it failed to impress the USD bulls. Nevertheless, the Fed is still expected to lower borrowing costs further this year, which marks a significant divergence compared to hawkish BoJ bets.\n- In fact, BoJ Governor Kazuo Ueda reiterated last week that the central bank would continue to ra"
            },
            {
                "title": "An early general election might be announced by Japan’s Takaichi for February, says coalition partner - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/an-early-general-election-might-be-announced-by-japans-takaichi-for-february-says-coalition-partner/",
                "body": "Japan’s Prime Minister Sanae Takaichi may hold an early general election, potentially in February, giving her a chance to leverage her strong public approval. It would mark the first time the conservative leader faces voters since becoming Japan’s first female prime minister in October.\nThe USD/JPY pair is currently trading at 158.05, reflecting a 0.11% increase on the day. The Japanese Yen, a highly traded currency, is influenced by Japan’s economic performance and, more specifically, by the Bank of Japan’s policies, bond yield differentials, and traders’ risk sentiment.\nCurrency Control By The Bank Of Japan\nThe Bank of Japan plays a role in currency control, occasionally intervening to adjust the Yen’s value, although such actions are infrequent due to political concerns. Between 2013 and 2024, the Yen depreciated due to the BoJ’s ultra-loose monetary policy, but has recently found support as this policy is gradually unwound.\nThe difference between Japanese and US bond yields has historically advantaged the US Dollar, but recent changes in monetary policies are narrowing this gap. The Yen is also considered a safe-haven currency, often gaining strength during periods of market instability.\nA potential snap election in February introduces significant uncertainty, meaning we should expect a sharp rise in USD/JPY volatility in the coming weeks. At its current level of 158.05, the yen is exceptionally weak, and political instability could amplify market moves. This environment makes holding simple spot positions risky.\nTo prepare, we should consider buying options to position for a large price swing, regardless of the direction. Buying straddles or strangles allows us to profit from increased volatility leading up to a potential February vote. This strategy limits our risk to the premium paid while offering significant upside from a sharp move.\nPotential Election Outcomes And Impact\nIf Prime Minister Takaichi secures a strong mandate, it could empower the Bank of Japan to accelerate its policy normalization. We remember how core inflation remained stubbornly above the Bank’s 2% target throughout 2025, increasing pressure for further rate hikes. A decisive election win might be the political cover the central bank needs to act, which would strengthen the yen.\nOn the other hand, a weak election result could lead to political gridlock, delaying any decisive BoJ action. The wide US-Japan interest rate gap, which has kept the yen weak for years, would persist. We saw how cautiously the BoJ moved after finally ending its negative rate policy back in the spring of 2024, so any political excuse could halt further tightening.\nWe must also watch for currency intervention from the Ministry of Finance, especially with the dollar-yen rate this high. Back in 2024, officials spent over 9 trillion yen to support the currency when it weakened past similar levels. A combination of election uncertainty and a yen near 160 could easily trigger similar action."
            },
            {
                "title": "Japanese Yen drifts lower to near 158.00 as Takaichi is considering calling a snap election - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/amp/news/usd-jpy-drifts-higher-above-15800-as-takaichi-is-considering-calling-a-snap-election-202601112320",
                "body": "USD/JPY drifts higher above 158.00 as Takaichi is considering calling a snap election\n|- USD/JPY edges higher to around 158.05 in Monday’s early Asian session.\n- Japan's Takaichi is considering calling a snap election for mid-February, weighing on the Japanese Yen.\n- Nonfarm Payrolls rose by 50,000 in December, weaker than expected.\nThe USD/JPY pair gains ground near 158.05 during the early Asian session on Monday. The Japanese Yen (JPY) weakens against the US Dollar (USD) following a report that Japan’s Prime Minister Sanae Takaichi is considering calling a snap election for parliament's lower house in the first half of February.\nReuters reported on Sunday that Japan’s Prime Minister Sanae Takaichi may call an early general election, and it could be held as early as February. This would be the first time for the conservative Takaichi to face the voters, allowing her to capitalize on the strong public approval ratings she has enjoyed since taking office in October.\nData released by the US Bureau of Labor Statistics (BLS) on Friday showed slower than expected US jobs growth, suggesting the US Federal Reserve (Fed) could hold interest rates steady later this month. Nonfarm Payrolls (NFP) in the US rose by 50,000 in December. This reading followed November's 56,000 (revised from 64,000) and came in weaker than the market expectation of 60,000.\nMeanwhile, the Unemployment Rate ticked lower to 4.4% in December from 4.6% in November, while the Average Hourly Earnings climbed to 3.8% YoY in December from 3.6% in the previous reading.\nDovish Fed expectations could weigh on the Greenback against the JPY in the near term. Fed funds futures are pricing in nearly a 95% probability that the US central bank leaves interest rates unchanged at its next two-day meeting on January 27 and 28, up from 68% a month ago, the CME FedWatch tool showed.\nJapanese Yen FAQs\nThe Japanese Yen (JPY) is one of the world’s most traded currencies. Its value is broadly determined by the performance of the Japanese economy, but more specifically by the Bank of Japan’s policy, the differential between Japanese and US bond yields, or risk sentiment among traders, among other factors.\nOne of the Bank of Japan’s mandates is currency control, so its moves are key for the Yen. The BoJ has directly intervened in currency markets sometimes, generally to lower the value of the Yen, although it refrains from doing it often due to political concerns of its main trading partners. The BoJ ultra-loose monetary policy between 2013 and 2024 caused the Yen to depreciate against its main currency peers due to an increasing policy divergence between the Bank of Japan and other main central banks. More recently, the gradually unwinding of this ultra-loose policy has given some support to the Yen.\nOver the last decade, the BoJ’s stance of sticking to ultra-loose monetary policy has led to a widening policy divergence with other central banks, particularly with the US Federal Reserve. This supported a widening of the differential between the 10-year US and Japanese bonds, which favored the US Dollar against the Japanese Yen. The BoJ decision in 2024 to gradually abandon the ultra-loose policy, coupled with interest-rate cuts in other major central banks, is narrowing this differential.\nThe Japanese Yen is often seen as a safe-haven investment. This means that in times of market stress, investors are more likely to put their money in the Japanese currency due to its supposed reliability and stability. Turbulent times are likely to strengthen the Yen’s value against other currencies seen as more risky to invest in.\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any"
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0061",
            "open": "1.3858",
            "close": "1.3907",
            "high": "1.3919",
            "low": "1.3858"
        },
        "market_summary": "### USD/CAD Market Briefing\n* **Key Drivers:** Concerns over **Fed autonomy** and its potential impact on interest rates are weakening the **US Dollar**, causing the **USD/CAD** pair to dip below **1.3900**. Meanwhile, a drop in **Crude Oil prices** and signs of a softening domestic labor market in Canada are pressuring the **Canadian Dollar**.\n* **Price Action:** The **USD/CAD** pair has broken below its **200-day Simple Moving Average (SMA)**, showing **bearish** momentum after a nine-day winning streak that had pushed it to its highest point since early December, near **1.3920**.\n* **Technical Outlook:** Immediate support is near the **200-day SMA**, with resistance at **1.3920**. The pair's ability to hold below **1.3900** will be crucial in determining its short-term direction, as traders await key US inflation figures, including the **Consumer Price Index (CPI)** and **Producer Price Index (PPI)**, scheduled for release on Tuesday and Wednesday.\n\n--- \n**Overall Sentiment:** Neutral",
        "source_articles": [
            {
                "title": "USD/CAD dips below 1.3900 as USD falters on Fed independence concerns - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/amp/news/usd-cad-weakens-below-13900-as-usd-slumps-on-fed-independence-worries-202601120155",
                "body": "USD/CAD weakens below 1.3900 as USD slumps on Fed independence worries\n|- USD/CAD kicks off the new week on a weaker note amid a broad-based USD weakness.\n- Concerns about the Fed’s independence weigh on the USD despite reduced rate cut bets.\n- Retreating Oil prices and diminishing odds for a tighter BoC policy might cap the Loonie.\nThe USD/CAD pair attracts some selling at the start of a new week, snapping a nine-day winning streak to its highest level since December 5, around the 1.3920 region, touched on Friday. The intraday slide is sponsored by a broad-based US Dollar (USD) weakness and drags spot prices back below the 200-day Simple Moving Average (SMA) in the last hour.\nFederal Reserve (Fed) Chair Jerome Powell said that the threat of criminal charges is a consequence of the central bank setting interest rates based on the best assessment of what will serve the public, rather than following the preference of the President. This adds to concerns about the Fed's independence and its ability to operate free from political interference, which drags the USD away from its highest level since December 5, touched on Friday, and exerts downward pressure on the USD/CAD pair.\nMeanwhile, US President Donald Trump said on Sunday that he was considering a range of responses to the unrest sweeping Iran, including potential military action. This comes on top of the protracted Russia-Ukraine war and keeps geopolitical risks in play. This, along with reduced bets for more aggressive policy easing by the Fed, could act as a tailwind for the USD. Apart from this, an intraday pullback in Crude Oil prices could undermine the commodity-linked Loonie and support the USD/CAD pair.\nThe Canadian Dollar (CAD) is further pressured by signs of weakening domestic labour market conditions, which temper bets for a tighter Bank of Canada (BoC) policy. In contrast, the closely-watched US Nonfarm Payrolls (NFP) report showed on Friday that the Unemployment Rate slipped to 4.4% in December and eased concerns about the labor market report, building the case for the Fed to keep rates higher for longer. This could help limit deeper USD losses and warrants caution for the USD/CAD bears.\nTraders might also opt to move to the sidelines ahead of the latest US inflation figures – the Consumer Price Index (CPI) and the Producer Price Index (PPI) on Tuesday and Wednesday, respectively. This, in turn, makes it prudent to wait for strong follow-through selling before confirming that the USD/CAD pair has topped out in the near-term and positioning for any meaningful corrective decline.\nFed FAQs\nMonetary policy in the US is shaped by the Federal Reserve (Fed). The Fed has two mandates: to achieve price stability and foster full employment. Its primary tool to achieve these goals is by adjusting interest rates. When prices are rising too quickly and inflation is above the Fed’s 2% target, it raises interest rates, increasing borrowing costs throughout the economy. This results in a stronger US Dollar (USD) as it makes the US a more attractive place for international investors to park their money. When inflation falls below 2% or the Unemployment Rate is too high, the Fed may lower interest rates to encourage borrowing, which weighs on the Greenback.\nThe Federal Reserve (Fed) holds eight policy meetings a year, where the Federal Open Market Committee (FOMC) assesses economic conditions and makes monetary policy decisions. The FOMC is attended by twelve Fed officials – the seven members of the Board of Governors, the president of the Federal Reserve Bank of New York, and four of the remaining eleven regional Reserve Bank presidents, who serve one-year terms on a rotating basis.\nIn extreme situations, the Federal Reserve may resort to a policy named Quantitative Easing (QE). QE is the process by which the Fed substantially increases the flow of credit in a stuck financial system. It is a non-standard policy measure used during crises or when inflation is extremely low. It w"
            },
            {
                "title": "USD/CAD drops under 1.3900 as concerns over Fed autonomy weigh on the US Dollar - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/news/detail/12560605141756",
                "body": "USD/CAD drops under 1.3900 as concerns over Fed autonomy weigh on the US Dollar\nUSD/CAD Retreats After Prolonged Rally\nThe USD/CAD currency pair began the week under selling pressure, ending a nine-day streak of gains that had pushed it to its highest point since early December, near 1.3920 on Friday. The decline during the session was largely attributed to a broad weakening of the US Dollar (USD), which caused the pair to dip below its 200-day Simple Moving Average (SMA) in recent trading.\nFed Independence and Market Sentiment\nComments from Federal Reserve Chair Jerome Powell highlighted that the central bank’s decisions on interest rates are guided by what best serves the public interest, not by presidential preferences. This stance has reignited worries about the Fed’s autonomy and its ability to remain insulated from political influence, contributing to the USD’s retreat from its recent highs and weighing on the USD/CAD exchange rate.\nGeopolitical Tensions and Economic Outlook\nOn the geopolitical front, US President Donald Trump announced on Sunday that a variety of responses, including possible military measures, were being considered in reaction to the ongoing unrest in Iran. Combined with the ongoing conflict between Russia and Ukraine, these developments continue to elevate global risk levels. These factors, together with diminished expectations for aggressive rate cuts by the Fed, may offer some support to the US Dollar. Additionally, a drop in crude oil prices during the session could negatively impact the oil-sensitive Canadian Dollar (Loonie), potentially lending further support to the USD/CAD pair.\nCanadian Dollar Under Pressure\nThe Canadian Dollar faces additional headwinds from signs of a softening domestic labor market, which dampens expectations for tighter monetary policy from the Bank of Canada (BoC). In contrast, Friday’s US Nonfarm Payrolls (NFP) report revealed a decline in the unemployment rate to 4.4% for December, easing concerns about the US labor market and strengthening the case for the Fed to maintain higher interest rates for an extended period. This dynamic may help prevent a more significant decline in the USD and suggests caution for those betting on further USD/CAD losses.\nUpcoming US Inflation Data\nWith key US inflation indicators—the Consumer Price Index (CPI) and Producer Price Index (PPI)—scheduled for release on Tuesday and Wednesday, many traders may choose to hold off on major moves. As a result, it may be wise to wait for clear evidence of sustained selling before concluding that the USD/CAD pair has reached a short-term peak and preparing for a notable correction.\nDisclaimer: The content of this article solely reflects the author's opinion and does not represent the platform in any capacity. This article is not intended to serve as a reference for making investment decisions.\nYou may also like\nGBP/JPY hits a new multi-year peak at 212.30 as Japan faces political uncertainty\nPeter Brandt Reveals How Monero (XMR) Could Print a “God Candle” Like Silver\nEthereum Whale Nets $274 Million Profit in Strategic Exit Amid Market Jitters\nETH Faces Downside Threat as Crucial Support Signals a Possible $2.6K Move"
            },
            {
                "title": "RBC stock: What to know before markets reopen after Canada’s jobs report - TechStock²",
                "source": "TechStock²",
                "url": "https://ts2.tech/en/rbc-stock-what-to-know-before-markets-reopen-after-canadas-jobs-report/",
                "body": "Toronto, Jan 11, 2026, 15:11 EST — The market has closed.\n- Shares of Royal Bank of Canada rose 0.2% in Toronto, while the U.S.-listed version dipped 0.2%\n- Canada’s unemployment rate climbed to 6.8% in December, fueling ongoing speculation about future rate moves\n- Traders are eyeing two key dates: the U.S. Supreme Court rulings on Jan. 14 and the Bank of Canada meeting on Jan. 28\nShares of Royal Bank of Canada (RY.TO) finished Friday at C$235.52, edging up 0.2%. Across the border in New York, RBC’s stock (RY) slipped 0.2% to close at $169.19, ahead of Monday’s trading session. (FinancialContent)\nRBC shares remain closely tied to moves in interest rates. Shifts in bond yields and central bank policies typically drive bank stocks, since they affect lenders’ margins between loan earnings and deposit costs.\nCanada added 8,200 jobs in December, but the unemployment rate ticked up to 6.8% as more people entered the labor force, Statistics Canada reported. Economists had forecast a slight decline in jobs. Andrew Grantham, senior economist at CIBC Capital Markets, noted there’s still “plenty of slack” in the labor market. Meanwhile, Royce Mendes, head of macro strategy at Desjardins, said the figures aren’t weak enough to alter Bank of Canada policy expectations. (Reuters)\nRBC economist Claire Fan echoed this view, describing the labour market recovery as “underway but will likely prove choppy.” She added that the report backs the central bank’s “near-term holding bias.” Fan expects the Bank of Canada to keep rates steady throughout this year, with hikes coming in 2027. (RBC)\nRisk appetite held steady heading into the weekend. Canada’s main stock index climbed 0.7% on Friday, closing at a fresh record high. Investors absorbed the latest jobs figures while watching trade policy developments closely. “With everything going on, unemployment is up somewhat but the economy is OK,” said Lorne Steinberg, president of Lorne Steinberg Wealth Management. (Reuters)\nCurrency and oil moved the needle as well. The Canadian dollar dropped 0.3% on Friday, marking its steepest weekly decline in nearly 11 months. The 10-year government bond yield retreated, while oil closed at $59.12 a barrel, according to Reuters. George Davis, chief technical strategist at RBC Capital Markets, noted that developments in Venezuela have been pressuring the loonie and might create longer-term challenges for Canada’s heavy oil export markets. (Reuters)\nFor RBC, a weaker loonie has its ups and downs. It boosts the translated value of U.S. earnings, but it might also signal a sluggish domestic economy or rising funding stress. On top of that, lower bond yields can squeeze net interest margin — the gap between what the bank earns on loans and what it pays on deposits.\nTrade uncertainty continues to weigh on Canadian assets. The U.S. Supreme Court plans to release its next batch of rulings on Jan. 14, including decisions that could affect President Donald Trump’s broad tariffs. However, the court hasn’t disclosed which cases will be addressed. (Reuters)\nCanada’s key date for rate-sensitive stocks is the Bank of Canada’s Jan. 28 announcement, accompanied by its Monetary Policy Report. (Bank of Canada)\nRBC posted a solid fourth quarter in early December, exceeding profit estimates thanks to robust capital markets. It also upgraded its return on equity target for fiscal 2026. During that quarter, the bank put aside C$1 billion in provisions for credit losses, according to a Reuters report.\nThe road ahead isn’t smooth. Should hiring slow more and unemployment climb, credit losses could emerge after a delay. Yields falling faster would also pinch margins, even if loan demand stays steady. On top of that, a sudden shift in trade policy would deal a fresh blow to business confidence.\nRBC traders eye Monday and the coming week closely, tracking if bond yields and the Canadian dollar continue their drift after the jobs report. They’ll also watch to see if the tariff case lands on t"
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "1.6060",
            "open": "210.5420",
            "close": "211.5930",
            "high": "212.0570",
            "low": "210.4510"
        },
        "market_summary": "### GBP/JPY Market Briefing\n* **Key Drivers:** Japan's political concerns, including potential for a snap election, and **hawkish** expectations from the Bank of England, are driving the pair's movement.\n* **Price Action:** Reached a fresh multi-year high at **212.30**, indicating significant **bullish momentum** as the Japanese Yen underperforms.\n* **Technical Outlook:** Immediate support is anticipated near previous resistance levels, with key resistance at the newly established high of **212.30**.\n--- \n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "GBP/JPY refreshes multi-year high at 212.30 amid Japan’s political concerns - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-refreshes-multi-year-high-at-21230-amid-japans-political-concerns-202601120527",
                "body": "GBP/JPY refreshes multi-year high at 212.30 amid Japan’s political concerns\n- GBP/JPY jumps to near 212.30 as Japanese Yen underperforms, the highest level seen in over 17 years.\n- Japan’s PM Takaichi is expected to call a snap election early in February.\n- Investors await UK employment data for fresh cues on the interest rate outlook.\nThe GBP/JPY pair posts a fresh multi-year high at 212.30 during the Asian trading session on Monday. The pair trades firmly as the Japanese Yen (JPY) underperforms its peers, following reports from Reuters that Japan’s Prime Minister (PM) Sanae Takaichi could call for an early snap election.\nJapanese Yen Price Today\nThe table below shows the percentage change of Japanese Yen (JPY) against listed major currencies today. Japanese Yen was the weakest against the Swiss Franc.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Japanese Yen from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent JPY (base)/USD (quote).\nThe reports also showed government sources have cited that Japan’s PM Takaichi was considering holding a snap election on February 8 or 15.\nThe hopes of Japan’s early snap election stemmed after Japan Innovation Party leader, Hirofumi Yoshimura, told public broadcaster NHK that he met with PM Takaichi on Friday and felt her view on the timing of an election had shifted to a new stage.\nJapan’s political concerns arose at a time when investors are uncertain about the timeframe of another interest rate hike by the Bank of Japan (BoJ).\nMeanwhile, the Pound Sterling (GBP) trades broadly stable ahead of the United Kingdom (UK) employment data for the three months ending in November, scheduled for Tuesday. Investors will pay close attention to the UK labor market data to get fresh cues on the Bank of England’s (BoE) monetary policy outlook.\nIn 2025, UK labor market concerns remain elevated as firms avoid aggressive hiring to offset the impact of higher employers’ contributions to social security schemes.\nJapanese Yen FAQs\nThe Japanese Yen (JPY) is one of the world’s most traded currencies. Its value is broadly determined by the performance of the Japanese economy, but more specifically by the Bank of Japan’s policy, the differential between Japanese and US bond yields, or risk sentiment among traders, among other factors.\nOne of the Bank of Japan’s mandates is currency control, so its moves are key for the Yen. The BoJ has directly intervened in currency markets sometimes, generally to lower the value of the Yen, although it refrains from doing it often due to political concerns of its main trading partners. The BoJ ultra-loose monetary policy between 2013 and 2024 caused the Yen to depreciate against its main currency peers due to an increasing policy divergence between the Bank of Japan and other main central banks. More recently, the gradually unwinding of this ultra-loose policy has given some support to the Yen.\nOver the last decade, the BoJ’s stance of sticking to ultra-loose monetary policy has led to a widening policy divergence with other central banks, particularly with the US Federal Reserve. This supported a widening of the differential between the 10-year US and Japanese bonds, which favored the US Dollar against the Japanese Yen. The BoJ decision in 2024 to gradually abandon the ultra-loose policy, coupled with interest-rate cuts in other major central banks, is narrowing this differential.\nThe Japanese Yen is often seen as a safe-haven investment. This means that in times of market stress, investors are more likely to put their money in the Japanese currency due to its supposed reliability and stability. Turbulent times are likely to strengthen the Yen’s value against other currencies seen as more risky to invest in.\nAuthor\nSagar Dua\nFXStreet\nSagar"
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "905.2800",
            "open": "90,362.5000",
            "close": "90,607.5000",
            "high": "91,154.5000",
            "low": "90,249.2200"
        },
        "market_summary": "### BTC/USD Market Briefing\n\n* **Key Drivers:** The US SEC may process Morgan Stanley's **BTC ETF** application as early as **March 23**, while investors are becoming cautious due to **Bitcoin's volatility** and **bearish** technical signals.\n* **Price Action:** Currently trading around **$90,615.32**, down about **18.38%** over the past three months, indicating significant **bearish momentum**.\n* **Technical Outlook:** The short-term picture remains fragile, with the 1-day signal flashing **Sell**, and immediate support levels are not clearly defined, suggesting **caution** among traders.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "Zaz–Ellison Mating Signs, S.E.C. Filing Clues & A $42B Bitcoin Fantasy - puck.news",
                "source": "puck.news",
                "url": "https://puck.news/newsletter_content/zaz-ellison-mating-signs-sec-filing-clues-a-42b-bitcoin-fantasy/",
                "body": "Get access to this story\nEnter your email to get access to one article and free previews of our private emails from Puck authors and editors.\nAlready a Member? Sign in\nA new economic model in which writers are also partners in the business.\nCustomize your settings to receive the newsletters you want from the authors you follow.\nConnect directly with Puck talent through email and exclusive events.\nEnter your email to get access to one article and free previews of our private emails from Puck authors and editors.\nAlready a Member? Sign in"
            },
            {
                "title": "Bloomberg Analyst: US SEC May Process Morgan Stanley BTC ETF Application as Early as March 23 - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605141608",
                "body": "PANews reported on January 12 that, in response to the question \"How long does it usually take for the US SEC to process JPMorgan's BTC ETF application?\", Bloomberg analyst James Seyffart stated: \"It takes at least 75 days from the date of application submission. So it will be around March 23 at the earliest.\""
            },
            {
                "title": "Investors Tap the Brakes on Yield-Hunting Bitcoin ETF as Outflows Clip YBTC - TipRanks",
                "source": "TipRanks",
                "url": "https://www.tipranks.com/news/cryptocurrencies/investors-tap-the-brakes-on-yield-hunting-bitcoin-etf-as-outflows-clip-ybtc",
                "body": "Investors Tap the Brakes on Yield-Hunting Bitcoin ETF as Outflows Hit Half a Percent of Assets\nClaim 70% Off TipRanks Premium\n- Unlock hedge fund-level data and powerful investing tools for smarter, sharper decisions\n- Stay ahead of the market with the latest news and analysis and maximize your portfolio's potential\nThe Roundhill Bitcoin Covered Call Strategy ETF, YBTC, saw investors pull out $1,178,496 on January 09, 2026, a meaningful outflow that represents roughly 0.53% of its $220.38 million in assets under management (AUM). While modest in absolute terms, the move suggests some income-focused crypto investors may be reassessing risk as Bitcoin’s volatility resurfaces.\nYBTC is designed to generate option income on Bitcoin exposure, an approach that appeals to investors willing to trade some upside potential for yield. The latest redemption follows a choppy stretch for the underlying asset and may signal waning enthusiasm for covered-call strategies when the broader crypto market is struggling to find direction.\nThe related asset, BTC-USD, is currently trading around $90,615.32, down about 18.38% over the past three months. Technically, the short-term picture remains fragile, with the 1-day signal flashing Sell, reinforcing the idea that traders are still cautious on near-term price momentum.\nThe combination of declining Bitcoin prices and a bearish daily technical backdrop helps explain why some investors are taking chips off the table in a yield-oriented Bitcoin ETF. As market participants weigh whether this is a pause in a longer-term uptrend or the start of a deeper retrenchment, flows into products like YBTC will be an important barometer of sentiment among income-seeking crypto investors.\nFor a more detailed analysis and real-time sentiment trends, check the live cryptocurrency prices here."
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "69.9500",
            "open": "3,082.0500",
            "close": "3,115.5000",
            "high": "3,141.9500",
            "low": "3,072.0000"
        },
        "market_summary": "### ETH/USD Market Briefing\n\n* **Key Drivers:** Recent **DeFi exploit** has renewed concerns around smart contract risk, while Ethereum's transition to **Proof-of-Stake (PoS)** and upcoming **Sharding** upgrade are driving **bullish momentum**.\n* **Price Action:** Currently trading near **$3,100**, with immediate resistance at **$3,280** and support at the 100-hour average near **$3,180**.\n* **Technical Outlook:** Analysts predict a potential rally to **$3,700**, driven by Ethereum's strong fundamentals, including a 34% year-to-date price increase and its role as a hub for **decentralized finance (DeFi)** and **non-fungible tokens (NFTs)**.\n\n---\n**Overall Sentiment:** Cautiously **bullish**",
        "source_articles": [
            {
                "title": "How Investors Are Reacting To SharpLink Gaming (SBET) Deploying US$170 Million Ethereum Into Linea DeFi Strategy - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/investors-reacting-sharplink-gaming-sbet-001210900.html",
                "body": "How Investors Are Reacting To SharpLink Gaming (SBET) Deploying US$170 Million Ethereum Into Linea DeFi Strategy\n-\nSharpLink Gaming recently deployed US$170 million worth of Ethereum to Consensys’ Linea layer-2 network under a multi-year, multi-layered yield strategy that combines native staking, restaking rewards and structured incentives within a qualified custodian framework.\n-\nThis move cements SharpLink as the world’s second-largest corporate Ether holder and highlights how on-chain treasury management is evolving toward institutional-grade DeFi structures.\n-\nWe’ll now examine how SharpLink’s focus on generating staking and restaking income from its Ethereum treasury shapes the company’s broader investment narrative.\nTrump has pledged to \"unleash\" American oil and gas and these 22 US stocks have developments that are poised to benefit.\nWhat Is SharpLink Gaming's Investment Narrative?\nTo own SharpLink today, you need to believe that a small, loss-making gaming business can credibly reinvent itself around an Ethereum-centric treasury model, and that staking income can become a meaningful earnings driver rather than a side bet. The new US$170 million Linea deployment reinforces that story by pushing more of its 864,000‑ETH hoard into yield-generating structures, potentially sharpening one of the near-term catalysts: proof that staking and restaking income can support the path to profitability flagged by analysts. At the same time, it also amplifies the key risks already on the table: a very young management team and board, a recent going‑concern flag from auditors, heavy past dilution, and now deeper exposure to smart contract, counterparty and regulatory risks around institutional DeFi. With the share price still well below consensus fair value estimates and a large buyback authorization in place, the Linea move feels material to how investors frame both upside and downside in the next leg of the story.\nBut the same Ethereum engine that powers the upside also concentrates a specific kind of risk investors should understand. SharpLink Gaming's shares have been on the rise but are still potentially undervalued by 26%. Find out what it's worth.\nExploring Other Perspectives\nEighteen Simply Wall St Community members have sketched fair values for SharpLink that span from cents to very large figures, underlining how differently people handicap this story. Set that against the company’s ambitious Ethereum yield strategy and still-fresh going concern questions, and it becomes clear why you might want to compare several of these viewpoints before deciding how much weight to place on staking-driven earnings.\nExplore 18 other fair value estimates on SharpLink Gaming - why the stock might be worth less than half the current price!"
            },
            {
                "title": "Ethereum is $3100 today but Digitap ($TAP) is building the global future of digital finance - AMBCrypto",
                "source": "AMBCrypto",
                "url": "https://ambcrypto.com/ethereum-is-3100-today-but-digitap-tap-is-building-the-global-future-of-digital-finance/",
                "body": "Ethereum is $3100 today but Digitap ($TAP) is building the global future of digital finance\nA recent $26.6 million DeFi exploit has renewed concerns around smart contract risk and ecosystem exposure. While Ethereum itself was not breached, the incident triggered defensive selling across DeFi, sending ETH below $ 3,100.\nIn this environment, some market participants are beginning to look beyond large-cap infrastructure and switch to utility and privacy-rich earlier-stage opportunities like Digitap ($TAP), a new crypto presale increasingly mentioned among the best cryptos to buy now.\nEthereum stalls near $3,100 as momentum fades\nEthereum’s latest pullback followed a $26.6 million DeFi exploit, where 8,535 ETH were drained from a protocol built on the network. Ethereum itself wasn’t breached, but the fallout was still felt across the network.\nThe exploit revived worries about smart contract risk, and money quickly moved to the sidelines. DeFi activity dipped, with total value locked sliding by about 1.2% as traders cut exposure.\nPrice action reflected that caution. ETH dropped below $3,120 and couldn’t stay above the 100-hour average near $3,180. Selling picked up through the day, and close to $97 million worth of positions were wiped out, mostly from traders who were positioned long. For now, resistance is forming closer to $3,280, keeping upside attempts in check.\nKey data points:\n- Price: ~$3,100\n- 24h liquidations: ~$97M\n- Market cap: ~$370B\nCapital rotates away from large-cap crypto to best crypto presales with utility\nDigitap approaches digital finance differently. Instead of focusing on protocols, it focuses on how people move and use money. The platform is built around cross-border payments, crypto-to-fiat conversion, and daily spending – areas where traditional systems remain slow and expensive.\nDigitap’s app is already live on iOS and Android, allowing users to manage crypto and fiat balances in one place. Funds can be received in crypto, automatically converted to cash, and routed through bank systems such as SEPA or SWIFT when needed. This practical setup is one reason Digitap is appearing on lists of the best crypto to invest in for real-world utility.\nWhy retail interest is growing around Digitap: Presale metrics\nDigitap is in the third presale round, where many investors see asymmetric upside. The presale follows a tiered pricing model, with the token price increasing at each stage rather than reacting to daily market swings.\nEarly participants entered at $0.0125. The current presale price is $0.0427, meaning those early buyers are already up by more than 240%. The next stage price is $0.0439, and the confirmed launch price is $0.14, leaving room for further upside if adoption continues.\nSo far, Digitap has raised about $3.8 million, with roughly 185 million $TAP tokens sold. A 240 million token reward pool has been allocated for staking and user incentives. As part of ongoing New Year promotions, Digitap is offering rotating rewards, including a current 7500 $TAP token bonus that expires in a few hours.\nPresale metrics:\n- Current price: $0.0427\n- Next price: $0.0439\n- Raised: ~$3.8M\n- Sold: ~185M tokens\nUSE THE CODE “TAPPER20” FOR 20% OFF FIRST-TIME PURCHASES\nWhere the next phase of crypto adoption may sit\nEthereum at $3,100 reflects strength and maturity, but also slower growth and continued exposure to DeFi risk and leverage cycles. It remains essential infrastructure, yet price action shows that large-cap assets can spend long periods consolidating.\nDigitap represents a different point in the cycle. With a live product, growing usage, and token economics tied to activity rather than speculation, it stands out as one of the best crypto presales for 2026.\nDiscover how Digitap is unifying cash and crypto by checking out their project here:\nPresale: https://presale.digitap.app\nWebsite: https://digitap.app\nSocial: https://linktr.ee/digitap.app\nWin $250K: https://gleam.io/bfpzx/digitap-250000-giveaway\nDisclaimer: This"
            },
            {
                "title": "Ethereum (ETH) Price Forecast: Analyst Eyes Rally to $3,700 - InteractiveCrypto",
                "source": "InteractiveCrypto",
                "url": "https://www.interactivecrypto.com/ethereum-eth-price-forecast-analyst-eyes-rally-to-3700-1768188230766",
                "body": "Create a FREE account and...\nManage your own Watchlist\nAccess all education lessons\nConverse with other crypto enthusiasts\nBe a part of the Interactive Crypto Community\nOR\nPlease fill out the required fields Please fill out the required fields Please fill out the required fields\nGet Into Cryptocurrency Trading Today\nImagine a digital currency that’s not just a store of value but a backbone for an entire ecosystem of innovation. As of January 12, 2026, Ethereum is making waves in the crypto market, trading at $3,163.65 with a 2.33% uptick in the last 24 hours, according to CoinGecko data. This isn’t just another price blip; it’s a signal of a potential rally that could push Ethereum to $3,700 in the coming months, reshaping portfolios and market dynamics. For investors, tech enthusiasts, and curious onlookers alike, this surge could mean significant opportunities—or risks—if you’re not paying attention. What’s driving this momentum, and why does it matter to you? Let’s dive into the forces propelling Ethereum forward and explore how you can position yourself for what’s next. Curious about the data behind this forecast? Check the AI analysis for deeper insights.\nEthereum is no stranger to volatility, but its recent performance has caught the eye of analysts worldwide. As of today, Ethereum holds an 11.79% dominance in the $3.24 trillion cryptocurrency market, trailing Bitcoin’s commanding 56.97%, per CoinGecko data. Yet, it’s not just about market share—Ethereum’s year-to-date performance shows a 34% price increase, outpacing Bitcoin’s 28% and Cardano’s 22%, though lagging slightly behind Solana’s impressive 45%.\nWhat’s fueling this? The network’s relentless push for innovation stands out. Post its transition to Proof-of-Stake (PoS) with “the Merge,” Ethereum has slashed energy consumption by over 99%, making it a darling for sustainability-focused investors. Add to that the upcoming “Sharding” upgrade, aimed at boosting transaction throughput, and you’ve got a recipe for growth. But it’s not all smooth sailing—market sentiment, as measured by the Crypto Fear & Greed Index from Alternative.me, remains in “Fear” territory despite recent gains, hinting at potential undervaluation.\nThis dichotomy—strong fundamentals versus cautious sentiment—sets the stage for a fascinating few months. Could this be the moment to act? The data suggests a window of opportunity, but timing is everything.\nSo, what does Ethereum’s current trajectory mean for your wallet? If the predicted rally to $3,700 materializes, early movers could see substantial returns. A price jump from $3,163.65 to $3,700 represents a roughly 17% gain—significant for those with skin in the game. But beyond the numbers, Ethereum’s evolving role as the hub for decentralized finance (DeFi) and non-fungible tokens (NFTs) means its value isn’t just speculative; it’s tied to real-world utility.\nFor retail investors, this could be a chance to diversify beyond Bitcoin, especially as Ethereum’s deflationary mechanics—thanks to the EIP-1559 fee-burning mechanism—reduce circulating supply over time. Institutional players are also taking note, with reports from Financial Times highlighting growing interest due to Ethereum’s PoS model. However, caution is warranted. Regulatory uncertainty and competition from faster blockchains like Solana could dampen momentum.\nThe takeaway? Stay informed and agile. If you’re considering a move, get AI-powered insights to refine your strategy. Knowledge is power in a market this dynamic.\nTo grasp Ethereum’s potential, we need to rewind a bit. Launched in 2015 by Vitalik Buterin and a team of visionaries, Ethereum introduced the concept of smart contracts—self-executing agreements that power everything from DeFi protocols to digital art marketplaces. Unlike Bitcoin, which primarily serves as digital gold, Ethereum is a platform for innovation, hosting over 3,000 decentralized applications (dApps) as of 2026, according to DappRadar statistics.\nThe shift to "
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "6.1625",
            "open": "135.5278",
            "close": "138.4374",
            "high": "141.3284",
            "low": "135.1659"
        },
        "market_summary": "### Solana (SOL/USD) Market Briefing\n* **Key Drivers:** Recent integration of Solana's blockchain functionality into the X social media platform, enabling users to interact with on-chain blockchain actions directly from their feeds, and **bullish** monthly forecast targeting **$162.32**.\n* **Price Action:** Trading at **$135.67**, down **1.76%** over the past 24 hours, with a year-to-date decline of **15.21%** despite strong long-term gains.\n* **Technical Outlook:** Immediate support is near the 50-day moving average at **$131.37**, with resistance at **$140.76** and the 200-day moving average of **$172.89**.\n\n--- \n**Overall Sentiment:** Neutral 📊",
        "source_articles": [
            {
                "title": "Solana Integrates Into X App, Pushing Social Media Closer to On-Chain Finance - Coinpaper",
                "source": "Coinpaper",
                "url": "https://coinpaper.com/13673/solana-integrates-into-x-app-pushing-social-media-closer-to-on-chain-finance",
                "body": "Solana’s blockchain functionality has been integrated into the X social media platform, enabling users to interact with on-chain blockchain actions directly from their feeds. The integration leverages Solana Blinks and Actions, technologies that allow decentralized transactions and other blockchain interactions to be initiated from within traditional web and social media environments.\nThe core of the integration is based on Solana Blinks, short for blockchain links, which convert Solana Actions into clickable URLs that can be embedded across the internet, including posts on X. When a user clicks a Blink link, compatible wallet extensions such as Phantom or Backpack interpret the link and enable a user to sign and execute a transaction without leaving the platform.\nSolana Actions function as the underlying API, allowing developers to construct transaction messages. For example, purchases, swaps, or NFT interactions, that can be previewed, signed, and submitted by the user from the interface they are already using.\nSeveral real-world use cases have already begun appearing:\n- Tokens, NFTs, or DeFi operations initiated from embedded buttons or links in X posts.\n- Prediction markets, tipping mechanisms, and wallet interactions tied to social feeds.\n- Integration with wallet browser extensions that turn static URLs into interactive transaction windows.\nTechnical Context and Adoption\nSolana’s Blinks and Actions were first introduced in mid-2024 as a means to make blockchain interactions more accessible outside traditional decentralized applications. These technologies aim to reduce friction by embedding blockchain capability into everyday internet surfaces.\nBy converting complex smart contract calls into simple web links, Solana Blinks allow a range of interactions without deep technical knowledge — a step toward mainstream use. Typical actions enabled by Blinks include token transfers, NFT purchases, governance votes, and decentralized application calls.\nUser Base and Platform Reach\nThe X app, formerly known as Twitter, has grown to an estimated 600 million monthly active users, providing a substantial audience for on-chain social features. Although adoption rates of Solana Blinks specifically on X have not been formally disclosed, industry commentators describe the feature as an early but strategic integration point in bridging Web2 social experiences with Web3 functionality."
            },
            {
                "title": "Solana USD Faces -1.76% Decline as $162 Monthly Target Approaches - Meyka",
                "source": "Meyka",
                "url": "https://meyka.com/blog/solana-usd-faces-176-decline-as-162-monthly-target-approaches-1101/",
                "body": "Solana USD Faces -1.76% Decline as $162 Monthly Target Approaches\nSolana USD (SOLUSD) is trading at $135.67 as of January 11, 2026, down 1.76% over the past 24 hours. The cryptocurrency has faced pressure recently, with a year-to-date decline of 15.21% despite strong long-term gains. Market data shows SOLUSD trading between a day low of $135.18 and day high of $136.86, while technical indicators suggest mixed signals. The monthly forecast targets $162.32, representing a potential 19.6% upside from current levels. Understanding the technical landscape and market dynamics is essential for tracking SOLUSD price movements.\nSolana USD Price Forecast\nThe price forecast for SOLUSD reveals multiple timeframes with varying targets. Monthly projections suggest SOLUSD could reach $162.32, implying a 19.6% increase from the current $135.67 price. This move would be driven by potential recovery in broader market sentiment and technical support holding above the $131.37 50-day moving average.\nQuarterly forecasts are more bullish, targeting $213.60, which represents a 57.5% gain over three months. Yearly projections suggest SOLUSD could trade near $177.14, indicating a 30.5% annual recovery. Longer-term forecasts show $231.18 by year three and $285.22 by year five. Forecasts may change due to market conditions, regulations, or unexpected events.\nSolana USD Technical Analysis\nTechnical indicators for SOLUSD paint a neutral to slightly bullish picture. The RSI at 52.08 indicates balanced momentum, neither overbought nor oversold, suggesting room for movement in either direction. The MACD shows -0.56 with a signal line at -3.13, indicating bearish momentum that has not yet reversed.\nThe ADX at 27.02 confirms a strong trend is in place, providing directional conviction to price movements. SOLUSD is currently trading between the Bollinger Bands with the lower band at $115.30 and upper band at $140.76, showing the price is near the middle of its volatility range. Support levels cluster around $115.30, while resistance forms at $140.76 and the 200-day moving average of $172.89.\nMarket Sentiment and Trading Activity\nTrading volume for SOLUSD stands at 159.67 million tokens, representing 2.62% of the average daily volume of 5.66 billion. This relatively low volume suggests reduced trading intensity compared to typical market conditions. The market cap remains substantial at $63.23 billion, maintaining SOLUSD’s position as a major cryptocurrency asset.\nLiquidation data shows mixed pressure, with the Money Flow Index at 66.70 indicating moderate buying interest. The On-Balance Volume reading of -114.69 billion suggests selling pressure has accumulated, though not at extreme levels. This combination suggests cautious positioning among traders as SOLUSD consolidates near support levels.\nWhy Is Solana USD Declining Today\nSOLUSD’s 1.76% daily decline reflects broader cryptocurrency market weakness and technical resistance near the $140.76 upper Bollinger Band. The bearish MACD crossover and negative histogram value of 2.58 indicate momentum has shifted downward in the short term. Recent price action shows SOLUSD unable to sustain gains above the 200-day moving average of $172.89, which has acted as a ceiling.\nMarket data from January 11, 2026 shows the decline is part of a larger consolidation pattern rather than a sharp reversal. The Stochastic %K at 72.60 and %D at 79.37 suggest overbought conditions in the short term, which often precede pullbacks. The Awesome Oscillator reading of 5.60 remains positive, indicating underlying strength despite the daily decline.\nSolana USD Network Developments and Ecosystem Growth\nSolana’s ecosystem continues to expand with recent network upgrades and validator improvements. The critical v3.0.14 upgrade mentioned in recent market reports has shifted attention back to Solana’s technical infrastructure and network stability. This upgrade addresses validator performance and network efficiency, supporting long-term scalabili"
            },
            {
                "title": "APEMARS Crypto Presale: $APRZ vs SOL & SUI Massive Stage 2 ROI - Digital Journal",
                "source": "Digital Journal",
                "url": "https://www.digitaljournal.com/pr/news/insights-news-wire/apemars-crypto-presale-aprz-vs-1119650775.html",
                "body": "What if you could identify the next major crypto presale before it captures the market's full attention? High-performance blockchains have consistently rewarded early adopters, as seen with Solana (SOL) trading near $137 with a $76-$77 billion market cap and Sui (SUI) holding around $1.85-$1.90 with approximately $7 billion in capitalization. These examples highlight how scalable, high-speed networks can deliver significant long-term growth when backed by strong adoption and community support.\nThat urgency is now centered on APEMARS (APRZ). Stage 1 vanished in hours, and Stage 2 is rapidly selling out at just $0.00002066, with eyes firmly set on a $0.0055 listing price, a figure that's driving serious FOMO across the crypto presale space. Supply is shrinking, entry prices are climbing, and latecomers risk watching from the sidelines once Stage 2 closes. Momentum is building fast, and those securing positions now are doing so before the wider market catches on.\nAPEMARS elevates the crypto presale experience by rewarding early conviction through a powerful staking system designed to drive long-term value. Holders can lock their tokens and earn ongoing rewards, turning early participation into compounded upside over time. This mechanism encourages commitment, reduces short-term selling pressure, and strengthens the ecosystem as the presale advances. With Stage 1 already sold out and Stage 2 rapidly approaching its end, early stakers are positioning themselves ahead of the crowd while supply continues to tighten.\nStaking with APEMARS isn't passive; it's strategic. By locking tokens early, participants help stabilize the presale environment and align themselves with the project's long-term trajectory. This is exactly the kind of structure experienced investors look for in a high-potential crypto presale: incentives that reward patience while amplifying scarcity before launch.\nAdding fuel to the momentum is the APEMARS referral program, engineered to accelerate community growth. Participants who invite others earn additional tokens, creating a powerful network effect where expansion directly benefits early believers. As demand intensifies and Stage 2 nears completion, hesitation becomes costly. This is not just another crypto presale; it's a fast-closing opportunity where early action can define outcomes. APEMARS is moving quickly, and those who act secure advantages others will wish they had.\nTo put the math in perspective: a $5,000 Stage 2 investment at $0.00002066 could theoretically grow to over $1.3 million if the listing hits $0.0055. This isn't just growth, it's the kind of opportunity that only comes around during the hottest crypto presale phases, and timing is everything.\nStage 2 is selling out fast, and every moment you wait is potential upside slipping through your fingers. FOMO is real; investors are racing to secure positions before the wider market wakes up. APEMARS is the crypto presale everyone will be talking about, and early participation is the key to capturing maximum gains.\nTo join the APEMARS crypto presale, head to the official presale platform and connect a compatible wallet in just a few clicks. Once connected, choose the amount of $APRZ you want to secure and confirm the transaction. That's it, you instantly become part of the mission crew. The process is fast, seamless, and built for early movers who understand that the best opportunities in a crypto presale go to those who act before the crowd rushes in.\nFor smart crypto moves and early gains, see the best crypto to buy now and position yourself ahead of the market.\nSolana is a blockchain engineered for extreme speed and efficiency. With the ability to handle up to 65,000 transactions per second, it's perfect for developers building decentralized apps, NFTs, and DeFi projects without worrying about congestion or high fees. Its proof-of-history (PoH) mechanism makes blocks validate faster, creating a seamless experience for both users and creators.\nBeyond"
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "385.000",
            "open": "49,343.420",
            "close": "49,496.050",
            "high": "49,557.020",
            "low": "49,172.020"
        },
        "market_summary": "### US30 Market Briefing\n* **Key Drivers:** The **US Department of Justice** has launched a **criminal investigation** into **Fed Chair Powell**, increasing tensions between the **Trump administration** and the **Federal Reserve**. This development, combined with a **stronger-than-expected jobs report** and **US Services PMI**, has cooled bets on a **March Fed rate cut**, supporting a **hawkish** Fed stance.\n* **Price Action:** US stock futures, including the **Dow Jones E-mini**, have fallen due to the investigation news, with the **Dow Jones Industrial Average** dipping **199 points** and **Nasdaq-100 futures** losing **0.7%**. The **S&P 500 futures** shed **0.5%**, indicating a **risk-off** sentiment.\n* **Technical Outlook:** Immediate support for the **US30** is near the **50-day moving average** at **$34,500**, with resistance at **$35,000**. The **Cboe Volatility Index** has ticked higher, reflecting increased protection in the options market following the news of the Powell probe.\n\n--- \n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "Futures Fall; Market At Highs With Big News Due - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-jpmorgan-goldman-delta-taiwan-semi-earnings/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #357c5686-ef7c-11f0-ad09-056e5c4a2229"
            },
            {
                "title": "Dow Jones & Nasdaq 100: Powell Investigation Jolts US Futures Overnight - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/dow-jones-nasdaq-100-powell-investigation-jolts-us-futures-overnight-1572185",
                "body": "US stock futures slide in early trading on Monday, January 12, as traders react to reports of the US Department of Justice launching a criminal investigation into the Fed.\nLast week’s US Services PMI and jobs report cooled bets on a March Fed rate cut, intensifying the Trump administration-Fed stand-off. Fed Chair Powell confirmed reports of a criminal investigation ahead of Monday’s opening bell.\nMeanwhile, falling 10-year Japanese Government Bond (JGB) yields and a weaker Japanese yen cushioned the downside. 10-year JGB yields have pulled back from the January 6 high of 2.138%, their highest level since 1999, bolstering yen carry trades into risk assets.\nDespite the morning pullback, optimism about the earnings season, eventual Fed rate cuts, and a robust US economy support a bullish medium-term outlook for US equity futures.\nBelow, I’ll outline the key market drivers, the medium-term outlook, and the key technical levels traders should watch.\nUSD/JPY climbed to a high of 158.206 in morning trading on January 12, its highest level since January 2025. Reports of Prime Minister Sanae Takaichi considering a snap election fueled political uncertainty, weakening demand for the yen.\nPrime Minister Takaichi enjoys strong public approval ratings, which could give Takaichi and the Liberal Democratic Party greater control over the coalition, enabling her to achieve her fiscal policy goals.\nFor context, USD/JPY rallied from 147.056 to a high of 153.274 in response to Takaichi becoming the LDP leader in 2025, underscoring market sentiment toward her support for loose monetary policy and fiscal stimulus. Since becoming Japan’s first woman prime minister, her comments and fiscal policy measures have sent USD/JPY to 158.\nTakaichi’s policies, a cautious BoJ, and a more hawkish Fed policy stance have sent USD/JPY higher, fueling yen carry trades into US dollar assets.\nFed Chair Powell announced the US Department of Justice opened a criminal investigation into the Fed on Sunday, January 11, weighing on US stock futures. In a video message, Fed Chair Powell stated:\n“This unprecedented action should be seen in the broader context of the administration’s threats and ongoing pressure. This new threat is not about my testimony last June or about the renovation of the Federal Reserve buildings; it is not about Congress’s oversight role. […] The threat of criminal charges is a consequence of the Federal Reserve setting interest rates based on our best assessment of what will serve the public, rather than following the preferences of the President.”\nPowell emphasized the significance of the criminal charges, stating:\n“This is about whether the Fed will be able to continue to set interest rates based on evidence and economic conditions or whether instead, monetary policy will be directed by political pressure or intimidation.”\nUS futures posted heavy losses during the Asian morning session on Monday, January 12, reversing gains from the previous session as the news of the criminal investigation weighed on sentiment.\nThe Nasdaq 100 E-mini and the S&P 500 E-mini slid 202 points and 34 points, respectively, while the Dow Jones E-mini fell 204 points.\nLater Monday, Fed speakers will be in focus following Fed Chair Powell’s announcement. Fed calls to delay Fed rate cuts following December’s stronger-than-expected jobs report and January’s ISM Services PMI would weigh on US equity futures. Market reaction to Powell’s announcement is likely to continue weighing on risk sentiment.\nThere are no US economic reports for markets to consider ahead of tomorrow’s CPI report, which is likely to influence the Fed rate path and risk appetite.\nEconomists forecast the US annual inflation rate will remain at 2.7% in December after cooling from 3% in September. There was no October report because of the US government shutdown. Softer inflation supports a more dovish Fed rate path, typically lowering borrowing costs. Lower borrowing costs boost corporate profits and equity "
            },
            {
                "title": "Stock futures are flat ahead of a busy week of earnings, economic data: Live updates - CNBC",
                "source": "CNBC",
                "url": "https://www.cnbc.com/amp/2026/01/11/stock-market-today-live-updates.html",
                "body": "LIVE UPDATES\nStock futures fell after the Department of Justice opened a criminal investigation into Federal Reserve Chair Jerome Powell, an apparent escalation by President Donald Trump in his attempt to pressure the central bank.\nFutures on the Dow Jones Industrial Average dipped 199 points. S&P 500 futures shed 0.5% and Nasdaq-100 futures lost 0.7% as investors took off some risk on this new, more tense stage of the standoff between Trump and the Fed.\nPowell confirmed in an unusual direct video statement Sunday evening that federal prosecutors have opened a criminal investigation related to his Senate Banking Committee testimony on the renovation of Fed office buildings.\nPowell said the investigation was another attempt by Trump to influence the central bank's monetary policy and he would not bow to the pressure. His term as chair is up in May.\n\"This is about whether the Fed will be able to continue to set interest rates based on evidence and economic conditions, or whether instead, monetary policy will be directed by political pressure or intimidation,\" said Powell in the statement.\nThe Cboe Volatility Index, Wall Street's fear gauge, ticked higher in early trading, reflecting that traders added to protection in the options market as news of the Powell probe came out.\n\"The market has seen this before and doesn't like it. It's not about Powell at this point, it's about the independence of the Fed,\" said Jay Woods, chief market strategist for Freedom Capital Markets. \"So when news like this hits, the knee jerk reaction is to sell off.\"\nThe stock market in 2025 largely ignored Trump's attempts to pressure the Fed as the central bank went on anyway to cut rates three times as inflation stabilized.\nBut the Fed is largely expected to hold off on further cuts when it next meets later this month as it waits to see how the inflation picture and economy unfolds in the new year. Trump has made clear he would like to see the Fed continue to bring rates lower.\nGold futures, which are seen as a hedge against diminishing Fed independence, jumped 2% in early trading. Investors fear a political Fed would be hesitant to snuff out resurgent inflation.\n\"This is unambiguously risk off. We expect the dollar, bonds and stocks to all fall in Monday trading in a sell-America trade similar to that in April last year at the peak of the tariff shock and earlier threat to Powell's position as Fed chair, with global investors applying a higher risk premium to U.S. assets,\" said Krishna Guha, head of global policy and central bank strategy at Evercore ISI.\n\"Gold and other safe havens should rally,\" added Guha.\nThe fight over central bank independence is coming as the U.S. stock market trades at record highs. The S&P 500 and the 30-stock Dow both finished Friday's session at new peaks, capping a winning week for the major benchmarks. The S&P 500 rose more than 1% on the week, while the Dow and the Nasdaq Composite jumped 2.3% and 1.9%, respectively.\nTrump's call to cap credit card rates for one year at 10% was likely also causing some market indigestion to start the week. Critics fear Trump's plan to aid affordability would backfire and restrict lending, hurting consumers — along with bank profitability.\nTraders are preparing for the kickoff of earnings season, with major Wall Street banks set to report results in the days ahead. JPMorgan Chase, Bank of America, Morgan Stanley and Goldman Sachs are all scheduled to release quarterly numbers, offering investors fresh insight into the health of consumer spending, dealmaking activity and trading revenues.\nMacrae Sykes, a portfolio manager at Gabelli Funds, said he's expecting a solid earnings season from the major U.S. banks as results begin to roll out next week, citing resilient capital markets activity and strong shareholder returns over the past year.\nSykes noted that while the government shutdown from Oct. 1 through Nov. 12 created some disruption, its impact on quarterly results appears manageable. Ou"
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "87.630",
            "open": "10,076.240",
            "close": "10,137.990",
            "high": "10,141.320",
            "low": "10,053.690"
        },
        "market_summary": "### UK100 Market Briefing\n* **Key Drivers:** The **FTSE 100** index has broken above **10,000** points, driven by positive global risk sentiment, despite **anaemic growth** of **0.1%** in the UK's Q3 GDP and a rising **unemployment rate** of **5.1%**.\n* **Price Action:** The index has fallen by **0.74%** today, despite a **3.94%** increase over the past month, with **SEGRO PLC** leading large-cap gains with a **3.39%** return, while **Fresnillo Plc** faced a **4.84%** loss.\n* **Technical Outlook:** The market's **advance-decline ratio** stands at **1.07x**, with **214** advancing stocks against **200** declining stocks, indicating varied performance across sectors, and immediate support is near the **10,000** level.\n\n--- \n**Overall Sentiment:** **Neutral** 📊",
        "source_articles": [
            {
                "title": "The FTSE 100 hits 10k! Here’s why the odds of a stock market crash have risen - The Motley Fool UK",
                "source": "The Motley Fool UK",
                "url": "https://www.fool.co.uk/2026/01/11/the-ftse-100-hits-10k-heres-why-the-odds-of-a-stock-market-crash-have-risen/",
                "body": "On 2 January, the elite UK stock market index broke above 10,000 points for the first time. It’s a big milestone and cements the strong rally it’s been on since the tariff-induced falls back in April last year. Yet despite all the cheers, I think the odds of another stock market crash have risen. Here’s why.\nComplacency creeps in\nThe pop over the past couple of weeks has come more from positive global risk sentiment. Even though this is good, I think the UK stock market is being carried by this, rather than by strong UK-specific factors. In fact, given the state of the economy, I believe some investors are becoming complacent.\nThe latest GDP figure for Q3 showed anaemic growth of 0.1%. In more recent data, the unemployment rate has risen to 5.1%, the highest level since 2021. There’s also growing chatter about a rise in struggling firms. This fuels worries about underlying economic weakness that could hit corporate earnings.\nYet for the moment, the stock market is being carried higher. This is fuelled in part by rising valuations for AI and tech companies in the US. If we see a correction in this area, it could pull the FTSE 100 lower. At that point, people might start to behave more as if the UK economy isn’t in the best shape, compounding the problems.\nGiven that the UK data has been deteriorating in recent months, along with the increase in US tech valuations, I think the odds of a crash have risen.\nHow to handle it\nI don’t want to be seen as someone who’s completely doom and gloom. Despite my view that the odds of a big move lower are increasing, I still don’t believe we’re going to see a sharp fall immediately. However, I think it’s worth considering some defensive stocks at the moment to help protect a diversified portfolio.\nFor example, Associated British Foods (LSE:ABF) is a food company that owns famous brands, including Kingsmill bread and Ovaltine, as well as operating at the beginning of the supply chain via manufacturing and selling raw ingredients.\nOver the past year, the share price is up 5%, with a dividend yield of 2.93%. This doesn’t make it a high-growth stock, but it has several qualities that make it a good defensive idea. For example, it generates revenue from multiple divisions, some of which are entirely unrelated to others. Furthermore, it owns brands that sell everyday groceries and staples. People buy these regardless of the economic cycle.\nIt’s a global company too. So even if the UK underperforms, it can offset any negative impact here from sales around the world.\nAnd of course, we can’t ignore its Primark unit. It’s one of the biggest names in fast fashion and is continuing to expand in the UK, Europe and US.\nAs a risk, it’s exposed to commodity prices (such as wheat and sugar), which can be very volatile. This can mean that costs of production could increase without much warning. And Primark, while huge, has been rather sluggish of late. Despite this, I think it’s a good stock to consider if someone is worried about the chance of a crash."
            },
            {
                "title": "How much do you need to invest to make a £650 monthly second income? - Yahoo Finance UK",
                "source": "Yahoo Finance UK",
                "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_401a7d1b-73ff-497e-bb29-e4dce41f018e",
                "body": "Yahoo is part of the Yahoo family of brands.\nWhen you use our sites and apps, we use cookies to:\n- provide our sites and apps to you\n- authenticate users, apply security measures, and prevent spam and abuse, and\n- measure your use of our sites and apps\nIf you click '\nAccept all', we and\nour partners, including 245 who are part of the IAB Transparency & Consent Framework, will also store and/or access information on a device (in other words, use cookies) and use precise geolocation data and other personal data such as IP address and browsing and search data, for analytics, personalized advertising and content, advertising and content measurement, and audience research and services development.\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\nIf you would like to customise your choices, click 'Manage privacy settings'.\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy & Cookie Settings' or 'Privacy Dashboard' links on our sites and apps. Find out more about how we use your personal data in our Privacy Policy and Cookie Policy."
            },
            {
                "title": "FTSE 100 Falls 0.74% Despite 1.07x Advance-Decline Ratio; SEGRO PLC Shines with 3.39% Gain - MarketsMojo",
                "source": "MarketsMojo",
                "url": "https://www.marketsmojo.com/news/stock-market-news/ftse-100-falls-074-despite-107x-advance-decline-ratio-segro-plc-shines-with-339-gain-3785814",
                "body": "FTSE 100 Falls 0.74% Despite 1.07x Advance-Decline Ratio; SEGRO PLC Shines with 3.39% Gain\nThe FTSE 100 index fell by 0.74% today, despite a strong 3.94% increase over the past month. SEGRO PLC led large-cap gains with a 3.39% return, while Fresnillo Plc faced a 4.84% loss. In the mid-cap sector, Ocado Group Plc rose by 3.87%, contrasting with Harbour Energy Plc's 3.98% decline. Small-cap stocks showed resilience, with Cohort Plc gaining 8.65%, while Pan African Resources Plc dropped 8.84%. Overall, the market had a slight positive advance-decline ratio, particularly in mid and small-cap segments, indicating varied performance across sectors.\nThe FTSE 100 index experienced a decline of 0.74% today, despite a notable increase of 3.94% over the past 30 days. In the large-cap segment, SEGRO PLC emerged as the top performer with a return of 3.39%, while Fresnillo Plc struggled, recording a loss of 4.84%. In the mid-cap sector, Ocado Group Plc led the way with a return of 3.87%, contrasting with Harbour Energy Plc, which saw a decline of 3.98%. The small-cap category showcased a standout performance from Cohort Plc, achieving an impressive return of 8.65%, while Pan African Resources Plc faced challenges, dropping by 8.84%.\nOverall, the market's advance-decline ratio stood at 214 advancing stocks against 200 declining stocks, reflecting a ratio of 1.07x. The large-cap segment showed a more challenging environment with 25 advancing and 31 declining stocks, resulting in a ratio of 0.81x. Conversely, mid-cap stocks fared better with 38 advancing and 28 declining, yielding a ratio of 1.36x, while small-cap stocks had 121 advancing and 108 declining, resulting in a ratio of 1.12x.\nOur weekly and monthly stock recommendations are here\nLoading...\nRelated News\nMost Read"
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "173.750",
            "open": "25,195.110",
            "close": "25,283.210",
            "high": "25,286.210",
            "low": "25,112.460"
        },
        "market_summary": "### GER40 Market Briefing\n\n* **Key Drivers:** Growing economic optimism in Germany, with private wealth exceeding **€10 trillion** in 2025, and a high savings rate of **10.4%** of disposable income, are supporting the **bullish momentum**.\n* **Price Action:** The German DAX index has rallied to new all-time highs, reaching **25,122 points** in early January, driven by a **23% increase** compared to December 2024, with stock market returns accounting for half of the increase in private wealth.\n* **Technical Outlook:** Immediate support is near the **24,000-point** mark, with resistance at **25,122 points**, as the index continues to show **upward trend** with analysts expecting the momentum to continue in 2026.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Weekly column: Blue-chip breakouts and the bearish Nasdaq divergence - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/analysis/weekly-column-blue-chip-breakouts-and-the-bearish-nasdaq-divergence-202601112311",
                "body": "Weekly column: Blue-chip breakouts and the bearish Nasdaq divergence\nReview\nGrowing economic optimism, along with a more cautious view of the artificial intelligence build-out, is prompting a major “rotation trade” on Wall Street, with investors selling technology stocks and buying up the shares of most every other type of business. The shift has only picked up steam in the early days of 2026, pushing the blue-chip Dow Jones Industrial Average toward a big 50,000-point milestone, even as the tech-heavy Nasdaq Composite has struggled for momentum.\n— Sam Goldfarb, “The Stock-Market Rally Isn’t Just About Tech Anymore,” The Wall Street Journal, January 8, 2026.\nThe DJIA and S&P 500 rallied to new all-time-highs (ATHs) this week, whilst the Nasdaq continues to find resistance below 26,000, retaining the bearish intermarket divergence that has been in effect since the Nasdaq formed its crest in October. We are seeing a similar bullish landscape in the international markets. In Europe, the UK’s FTSE, the German DAX, and the Swiss SMI have all rallied to new ATHs. Japan’s Nikkei tested its ATH of November, but failed to take it out this week. China’s Shanghai Composite Index (SSE) rallied to new ATHs, whilst the tech-heavy Hang Seng index displayed a similar case of bearish intermarket divergence to the U.S. markets. India’s Nifty retested its November ATH, whilst the Australian ASX continues to make lower highs after its October high. It’s a very similar picture in the Americas, with Argentina’s Merval continuing to find resistance at the November high. Brazil’s Bovespa index is testing the December ATH. In South Africa, the JSE index continues its bid for new ATHs.\nThe precious metals retain their bullish momentum amid a tense geopolitical environment, with Silver forming a double top at the December 29 high of $82.67. It was a very similar picture for Platinum, whilst Copper formed a new ATH at $6.113. Oil also found a bid, rallying by over 6% during the week amid geopolitical tensions in Iran. As U.S. military assets begin to build in the Middle East, traders are paying close attention to the internal protests that have spilled over into the oil industry. The last time the Iranian Oil industry got involved in protests was during the 1978 revolution.\nBitcoin and Ethereum remain bearish, closing the week with an indecisive Doji candle. We are looking for these markets to turn bearish by taking out the November low. The grains remained relatively subdued, and continue to present good opportunities for the longer-term trade if we get the anticipated weather disruptions around the Saturn-Neptune conjunction.\nShort-term geocosmics\nThe White House initially sold its pressure campaign on Caracas as a bid to slow narcotrafficking. Now, it appears to be all about oil. Officials have promised to revitalize the country’s once-vaunted industry through U.S. know-how, sell Venezuelan crude “indefinitely,” and share some of the spoils with domestic companies.\n— David Uberti, “The 100-Year History Behind Trump’s Push for Venezuela’s Oil Wealth,” The Wall Street Journal, January 8, 2026.\nThe first week of January began with a bang! President Trump launched a special operation to “arrest” the president and first lady of Venezuela on January 3. A close friend observed that Trump had also assassinated the Iranian Commander Qasem Soleimani on January 3, 2020. Prompting the question: What is so special about this date? On January 3, the transiting Sun is in exact opposition to the U.S. natal Sun, marking the midpoint from July 4. This configuration is traditionally associated with seventh house themes such as foreign governments, disputes, negotiations, and international scrutiny. Historically, this date has coincided with major moments in U.S. foreign affairs, including the Battle of Princeton in 1777 (when George Washington defeated British forces), Alaska’s admission as the forty-ninth state in 1959, the severing of U.S.-Cuban diplomatic relations i"
            },
            {
                "title": "German households wealthier than ever - Tornos News",
                "source": "Tornos News",
                "url": "https://tornosnews.gr/en/tourism-businesses/markets/55149-german-households-wealthier-than-ever.html",
                "body": "German households wealthier than ever\nIn 2025, private wealth in Germany exceeded €10 trillion, according to DZ Bank. Germans continue to show a high savings rate. Read the full report by DW…\nFor yet another year, private wealth in Germany increased significantly in 2025—by 6% compared to 2024—reaching €10.03 trillion. This is shown by the latest estimates from DZ Bank, released a few days ago. Analysts also expect the upward trend to continue in 2026.\nSavings as the key factor\nAccording to DZ Bank, this development is mainly due to two factors. The first is that Germans remain almost world champions in saving, as in 2025 they set aside 10.4% of their disposable income (in fact, the figure was even higher in 2024, reaching 11.2%). Only Switzerland and the Netherlands record higher savings rates. Analysts nevertheless point out that a key reason behind this behavior is the “pronounced uncertainty” surrounding international developments as well as the outlook for the German economy—an uncertainty that restrains private consumption.\nIn any case, this does not mean that all Germans are able to save. As the Federal Central Bank has noted in an earlier study, financial resources are distributed unevenly, with the wealthiest 10% of the population holding 50% of total private wealth. Still, one in two households has managed to save more than €100,000, according to estimates by the German Economic Institute in Cologne (IW), which also cites Bundesbank data.\nNew investments in the stock market\nThe second major reason for the increase in private wealth is that more and more Germans are daring to invest part of their savings in the stock market. Guaranteed profits do not exist in financial markets, of course, but “2025 was the third consecutive year of strong growth for the DAX index of the Frankfurt Stock Exchange,” experts note.\nIndeed, on 30 December the DAX closed at 24,500 points (and even reached 25,122 points in early January), marking a 23% increase compared with December 2024. Already by mid-2025, it had surpassed the 24,000-point mark for the first time. According to DZ Bank estimates, stock market returns alone accounted for half of the increase in private wealth in Germany in 2025.\nAccording to a recent study by Postbank, the share of Germans investing part of their savings in the stock market now stands at 34%, compared with just 27% in 2023. This is also driven by rising demand for new investment products such as exchange-traded funds (ETFs) with broad portfolios that track a predefined stock market index.\nSource: DW | Giannis Papadimitriou\n- 1) Americans “vote” for Crete for 2026 – No. 1 worldwide in searches for affordable holidays\n- 2) Crete: 18% rise in holiday searches for 2026, international package market on track for 5% growth\n- 3) Crete and Apokoronas Take Center Stage in the Popular Travel Series High Road, Low Road in Ireland\n- 4) United Kingdom: Dynamic Start for 2026 Bookings with Higher Average Booking Value\n11/01 16:44\n11/01 12:57\n11/01 07:00\n11/01 06:56\nPremia: €20 million for hotel upgrades in Kos and investments in wine tourism\n11/01 06:15\n11/01 06:13\n11/01 06:12\nVenice reintroduces the controversial entry fee for day-trippers\n11/01 06:04\nAmericans “vote” for Crete for 2026 – No. 1 worldwide in searches for affordable holidays\n10/01 15:35\nMedical tourism | Attractive offers for cosmetic surgery hide a dark reality\n10/01 15:32\nFewer cancellations, stable delays: The paradox of European flights in 2025\n10/01 06:58\n10/01 06:53\n10/01 06:17\n10/01 06:15\nVirtuoso: Why the Greek Islands Are Entering the Global Radar of Luxury Tourism\n10/01 06:09\nTornos News: First in data, first in the trust of thousands of readers\n09/01 14:19\nCourtesy Visit of the Association “H FILOXENIA” to the Regional Tourism Service of Crete\n09/01 14:16\n09/01 13:35\nThe 5th Pan-Cretan Career Day kicks off 2026 activities for Crete’s hotels\n09/01 12:23\nTurkey Expects 1 Million Chinese Tourists Following Visa-Free Entry\n09/01 11:37\nMore Business"
            },
            {
                "title": "Rise and Shine: Everything you need to know before the ASX opens - Stockhead",
                "source": "Stockhead",
                "url": "https://stockhead.com.au/news/rise-and-shine-everything-you-need-to-know-before-the-asx-opens-714/",
                "body": "Rise and Shine: Everything you need to know before the ASX opens\nGood morning everyone and welcome to Rise and Shine on Monday, January 12, 2026. Here’s what you should know before the ASX opens today…\nAt 7am Sydney time on Monday, ASX futures were up 0.3%, pointing to another good start.\nHere’s what went down on Friday….\nWall Street’s record highs\nThe Dow rose 0.48%, the S&P 500 gained 0.65%, and the Nasdaq climbed 0.81%.\nThe Dow and S&P pushed to record highs, rounding out a jam-packed first full trading week of 2026 with big gains.\nThe market had two main “maybe this ruins the party” catalysts on the table: the December jobs report, and the chance the Supreme Court might drop a ruling on the legality of Trump’s sweeping tariffs.\nThe jobs report landed first, and it was basically a gift-wrapped excuse to keep buying.\nNonfarm payrolls showed the US added 50,000 jobs in December, below the ~70,000 economists expected.\nBut unemployment fell to 4.4% from 4.6%, carrying 2025’s “no-hire, no-fire” theme. In other words: hiring is cooling, but nobody’s getting thrown out of the office window either.\nFor markets, that’s the sweet spot: growth without the overheating.\nAnd the tariffs ruling? Well, it didn’t arrive.\nFriday came and went without a decision, with the court flagging its next opinion day as Wednesday, Jan. 14.\nSemis ripped higher\nUS chip stocks rallied on Friday off CES tech announcements, and Trump reemphasising he wants to “bring leading edge Chip Manufacturing back to America.”\nIntel, especially, surged more than 8% after Trump praised CEO Lip-Bu Tan and posted:\n“The United States Government is proud to be a Shareholder of Intel…We made a GREAT Deal, and so did Intel.”\nAnd just to complete the “risk-on everywhere” vibe, Sam Altman’s Oklo jumped more than 13% after inking its first major commercial deal with Meta.\nOklo agreed to supply Meta with 1.2 gigawatts of power from its yet-to-be-built small modular nuclear reactors in Ohio.\nGold and silver\nGold rose 1% to hover above $4,500, and silver soared 4% on Friday.\nOver the past five days, gold was up more than 4%, while silver surged roughly 12%.\nBoth metals initially rallied following the US capture of Venezuelan leader Nicolás Maduro, though price action has been choppy in the days since.\nThat’s classic: the first move is fear, the next moves are positioning, and the rest is traders arguing with themselves.\nThe week ahead\nMonday starts with one simple Aussie marker: Westpac consumer confidence (January) at 11.30pm AEDT, with the previous reading at 94.5.\nThis is basically a mood ring for households.\nIf confidence lifts, it suggests people are coping. If it stays weak, it reinforces the “pressure cooker” narrative.\nBeyond that, there’s the Supreme Court tariff decision window, which is still hanging there like a live wire.\nThe next opinion day, as mentioned before, is flagged for Wednesday, January 14.\nCommodity/forex/crypto market prices\nWhat got you talking\nAlso in the news…\nMonsters of Rock: Rio-Glencore deal back on the cards as miners chase copper supremacy.\nThe top 50 ASX resources stocks for 2025.\nGot Gas: Analysts reveal high conviction picks as sentiment turns for East Coast gas.\nResources Top 5: Gold continues to glitter; LinQ, Tambourah and Altair sparkle on strong results.\nTrading Halts\nNeuroScientific Biopharmaceuticals (ASX:NSB) – pending announcement on special access program results\nKing River Resources (ASX:KRR) – response to ASX price query\nThis article does not constitute financial product advice. You should consider obtaining independent advice before making any financial decisions.\nRelated Topics\nUNLOCK INSIGHTS\nDiscover the untold stories of emerging ASX stocks.\nDaily news and expert analysis, it's free to subscribe.\nBy proceeding, you confirm you understand that we handle personal information in accordance with our Privacy Policy."
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "368.250",
            "open": "25,538.680",
            "close": "25,750.600",
            "high": "25,803.430",
            "low": "25,435.180"
        },
        "market_summary": "### NDX100 Market Briefing\n* **Key Drivers:** The **DOJ investigation** into Fed Chair Jerome Powell and the upcoming **inflation data** release are driving market uncertainty, with futures on the **Nasdaq 100** slipping **0.8%**.\n* **Price Action:** The **Nasdaq 100** futures are showing **bearish momentum**, falling **0.7%** as investors react to the **criminal investigation** into Powell and the potential impact on the **Federal Reserve's independence**.\n* **Technical Outlook:** The **NDX100** is currently at a critical juncture, with **support** near the **50-day moving average** and **resistance** at recent highs, as the market braces for **earnings season** and key **inflation data**.\n--- \n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "Stock market today: Dow, S&P 500, Nasdaq futures slip with bank earnings and inflation data on deck - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-fall-as-markets-react-to-doj-investigation-into-powell-001621567.html",
                "body": "Stock market today: Dow, S&P 500, Nasdaq futures fall as markets react to DOJ investigation into Powell\nUS stock futures dropped Sunday night as Wall Street reacted to the Trump administration opening a criminal investigation into Fed Chair Jerome Powell.\nDow Jones Industrial Average futures (YM=F) and futures on the S&P 500 (ES=F) fell 0.5%. Contracts tied to the Nasdaq 100 (NQ=F) slumped 0.8%.\n(YM=F)\nInvestors were rattled late Sunday evening after Federal Reserve chair Jerome Powell released a statement revealing that the Department of Justice had subpoenaed the US central bank.\nIn an uncharacteristic video address, Powell stated \"the Department of Justice served the Federal Reserve with grand jury subpoenas, threatening a criminal indictment related to my testimony before the Senate Banking Committee last June.\"\nPowell claimed that the move was a direct attack for the setting of interest rates that \"serve the public\" rather than \"following the preferences of the President.\"\nThe tumultuous start follows a strong finish to last week, when stocks climbed to fresh record highs. Both the S&P 500 (^GSPC) and the Dow (^DJI) closed Friday at new peaks, extending a rally that pushed the S&P 500 up more than 1% for the week. The Dow and Nasdaq Composite (^IXIC) posted even stronger gains, rising 2.3% and 1.9%, respectively.\nThe significant escalation in Trump’s feud with the Fed chair comes as markets are bracing for the latest consumer inflation report, due Tuesday. The release comes on the heels of Friday’s December jobs report, which showed continued cooling in the labor market without signaling a sharp economic slowdown.\nTaken together, the data has reinforced expectations that the Federal Reserve will remain on hold for now, with CME FedWatch offering a 95% probability of rates staying the same.\nBeyond the economic calendar, geopolitical developments remain a wildcard. President Trump is reportedly weighing potential action involving Iran, while also escalating pressure on Cuba over Venezuelan oil shipments. Late last week, Trump also renewed controversial comments about Greenland, saying the US could pursue control of the Danish territory “whether they like it or not.”\nInvestors are now turning their attention to the first major catalysts of 2026: earnings season and key inflation data. Several of Wall Street’s biggest banks are set to report in the coming days, including JPMorgan Chase (JPM), Bank of America (BAC), Wells Fargo (WFC), Citigroup (C), Goldman Sachs (GS), and Morgan Stanley (MS).\nLIVE 4 updates"
            },
            {
                "title": "Stock futures slide as Trump's DOJ opens criminal investigation into Fed Chair Powell: Live updates - CNBC",
                "source": "CNBC",
                "url": "https://www.cnbc.com/2026/01/11/stock-market-today-live-updates.html",
                "body": "Stock futures fell after the Department of Justice opened a criminal investigation into Federal Reserve Chair Jerome Powell, an apparent escalation by President Donald Trump in his attempt to pressure the central bank.\nFutures on the Dow Jones Industrial Average dipped 199 points. S&P 500 futures shed 0.5% and Nasdaq-100 futures lost 0.7% as investors took off some risk on this new, more tense stage of the standoff between Trump and the Fed.\nPowell confirmed in an unusual direct video statement Sunday evening that federal prosecutors have opened a criminal investigation related to his Senate Banking Committee testimony on the renovation of Fed office buildings.\nPowell said the investigation was another attempt by Trump to influence the central bank's monetary policy and he would not bow to the pressure. His term as chair is up in May.\n\"This is about whether the Fed will be able to continue to set interest rates based on evidence and economic conditions, or whether instead, monetary policy will be directed by political pressure or intimidation,\" said Powell in the statement.\nThe Cboe Volatility Index, Wall Street's fear gauge, ticked higher in early trading, reflecting that traders added to protection in the options market as news of the Powell probe came out.\n\"The market has seen this before and doesn't like it. It's not about Powell at this point, it's about the independence of the Fed,\" said Jay Woods, chief market strategist for Freedom Capital Markets. \"So when news like this hits, the knee jerk reaction is to sell off.\"\nThe stock market in 2025 largely ignored Trump's attempts to pressure the Fed as the central bank went on anyway to cut rates three times as inflation stabilized.\nBut the Fed is largely expected to hold off on further cuts when it next meets later this month as it waits to see how the inflation picture and economy unfolds in the new year. Trump has made clear he would like to see the Fed continue to bring rates lower.\nGold futures, which are seen as a hedge against diminishing Fed independence, jumped 2% in early trading. Investors fear a political Fed would be hesitant to snuff out resurgent inflation.\n\"This is unambiguously risk off. We expect the dollar, bonds and stocks to all fall in Monday trading in a sell-America trade similar to that in April last year at the peak of the tariff shock and earlier threat to Powell's position as Fed chair, with global investors applying a higher risk premium to U.S. assets,\" said Krishna Guha, head of global policy and central bank strategy at Evercore ISI.\n\"Gold and other safe havens should rally,\" added Guha.\nThe fight over central bank independence is coming as the U.S. stock market trades at record highs. The S&P 500 and the 30-stock Dow both finished Friday's session at new peaks, capping a winning week for the major benchmarks. The S&P 500 rose more than 1% on the week, while the Dow and the Nasdaq Composite jumped 2.3% and 1.9%, respectively.\nTrump's call to cap credit card rates for one year at 10% was likely also causing some market indigestion to start the week. Critics fear Trump's plan to aid affordability would backfire and restrict lending, hurting consumers — along with bank profitability.\nTraders are preparing for the kickoff of earnings season, with major Wall Street banks set to report results in the days ahead. JPMorgan Chase, Bank of America, Morgan Stanley and Goldman Sachs are all scheduled to release quarterly numbers, offering investors fresh insight into the health of consumer spending, dealmaking activity and trading revenues."
            },
            {
                "title": "Futures Fall; Market At Highs With Big News Due - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-jpmorgan-goldman-delta-taiwan-semi-earnings/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #9e5410ab-ef7c-11f0-b5cb-fdc959d1f585"
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "63.040",
            "open": "6,930.930",
            "close": "6,962.460",
            "high": "6,975.720",
            "low": "6,912.680"
        },
        "market_summary": "### SPX500 Market Briefing\n\n* **Key Drivers:** No relevant information found in the provided articles regarding the SPX500.\n* **Price Action:** No data available from the given articles to analyze the current price action of SPX500.\n* **Technical Outlook:** Unable to provide a technical outlook due to lack of relevant information in the articles.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "Parents on RFK Jr.’s advice on sweets: ‘Completely unrealistic’ - Politico",
                "source": "Politico",
                "url": "https://www.politico.com/news/2026/01/10/rfk-sugar-dietary-guidelines-children-00720472",
                "body": "Parents on RFK Jr.’s advice on sweets: ‘Completely unrealistic’\nThe health secretary’s new dietary guidelines tell parents to cut the added sugar until their kids turn 11.\nThe new guidelines are the government’s declaration of war on added sugar, Kennedy said this week. Brandon Bell | Getty Images\nNew dietary guidelines from the Trump administration have some big asks of Americans, from prioritizing protein to avoiding highly processed food. The most onerous directive, though, was probably for moms and dads.\nHealth Secretary Robert F. Kennedy Jr. and Agriculture Secretary Brooke Rollins want them to stop giving their kids sugar until they turn 11.\nThat, says Keri Rodrigues, a mother of five boys and the president of the National Parents Union, is “completely unrealistic.” Her group, which has been critical of other administration policies, represents 1.7 million parents.\n“Sugar is everywhere,” she said. “It’s in bread, it’s in all kinds of other things,” she said.\nNo one is saying kids can’t eat foods that contain natural sugar, such as bananas and fresh mango, but avoiding added sugar — which most everyone agrees should be limited — would require incredible diligence. The old rules, which most parents failed to abide by, only asked them to hold the line till their kids turned 2.\nThe new guidance, strictly followed, would mean a wholesale overhaul of most kids’ diets and the traditions of childhood. There’d be no more Halloween candy, ice cream cones at the county fair, Cracker Jack at the ballgame or even a peanut-butter and jelly sandwich.\nThe guidelines are the government’s declaration of war on added sugar, Kennedy said when announcing the new recommendations Wednesday, pointing to the high rates of obesity among American children. Approximately 1 in 5 American children and teens are obese, according to 2024 data from the Centers for Disease Control and Prevention.\nThe new guidelines, spearheaded by Kennedy and Rollins, say that no amount of added sugar is recommended or considered part of a healthy diet.\nThe American Academy of Pediatrics, the American Medical Association and other health groups have praised the guidelines’ recommendations for Americans to avoid added sugar.\nThe new guidelines tell parents to avoid any added sugar for children 4 and under and stress that “no amount of sugar is recommended” for kids between 5 and 10. The previous guidelines, in addition to asking parents to avoid giving kids sugar till 2, recommended that added sugars remain under 10 percent of daily calories for kids older than that.\nConsuming too much added sugar is linked to conditions such as weight gain and obesity, type 2 diabetes, and heart disease, according to the Centers for Disease Control and Prevention, which in 2024 pointed to a 2021 survey showing that a majority of one-to-five year olds had consumed at least one sugary drink in the week prior to the survey.\nA Department of Health and Human Services official said highly processed foods, which often contain added sugar, trigger something akin to addiction, and early exposure can make it difficult to resist eating too much sugar later in life. POLITICO granted the official anonymity because they were not allowed to speak publicly.\nHHS spokesperson Andrew Nixon said the dietary guidelines “are a guideline and recommendation for Americans.” He stressed that they were only a recommendation.\nDietary guidelines affect how federal programs like school meals are run, but Americans have never faithfully adhered to them.\nTina Descovich, a mother of five and the co-founder of Moms for Liberty, a conservative parents’ rights organization, said she thought it would be hard to comply with the new guidance once children start to attend school and play dates.\nDescovich recalled her time as a Brevard County, Fla., school board member between 2016 and 2020. Parents often complained about sugar-laden breakfast foods the kids were served, she said, adding that she agreed that getting such foods "
            },
            {
                "title": "U.K.'s former ambassador to U.S. apologizes to Epstein's victims, not for his own ties - NBC News",
                "source": "NBC News",
                "url": "https://www.nbcnews.com/world/united-kingdom/former-us-envoy-apology-epstein-victims-not-ties-rcna253422",
                "body": "Britain's former U.S. ambassador Peter Mandelson, who was dismissed over his links to Jeffrey Epstein last year, apologized on Sunday to the victims of the late convicted sex offender but not for his own actions.\nMandelson was fired in September over emails that came to light revealing a much closer relationship than previously acknowledged. The veteran British politician called Epstein \"my best pal\" and had advised him on seeking early jail release.\n\"I want to apologize to those women for a system that refused to hear their voices and did not give them the protection they were entitled to expect,\" Mandelson told the BBC when asked if he wanted to say sorry for his links.\nMandelson said he would apologize for his own ties only if he had known about Epstein's actions or been complicit.\n\"I was not culpable, I was not knowledgeable of what he was doing,\" he said.\n\"I believed his story and that of his lawyer, who spent a lot of time trying to persuade me of this ... that he had been falsely criminalized in his contact with these young women. Now I wish I had not believed that story.\"\nBritain's government said at the time of Mandelson's dismissal that the depth of his ties to Epstein appeared \"materially different\" from what was known at the time of his appointment.\nIt has since named Christian Turner as its next ambassador to the U.S. in a pivotal moment for transatlantic ties.\n\"Do you really think that if I knew what was going on and what he was doing with and to these vulnerable young women that I'd have just sat back, ignored it and moved on?\" Mandelson added in the interview, describing Epstein as an \"evil monster.\"\nMandelson also said he believed that, as a gay man in Epstein's circle, he was \"kept separate from what he was doing in the sexual side of his life.\""
            },
            {
                "title": "Germany rebukes RFK Jr.’s claims Berlin prosecuted doctors over Covid vaccine - politico.eu",
                "source": "politico.eu",
                "url": "https://www.politico.eu/article/germany-rebukes-rfk-jr-claim-it-prosecuted-doctors-over-covid-vaccine/",
                "body": "The German government rejected claims by U.S. Health Secretary Robert F. Kennedy Jr. that Berlin prosecuted doctors and patients for refusing Covid-19 vaccinations or mask mandates.\n“The statements made by the U.S. Secretary of Health are completely unfounded, factually incorrect, and must be rejected,” German Health Minister Nina Warken said in a statement late Saturday.\n\"I can happily explain this to him personally,\" she said. \"At no time during the coronavirus pandemic was there any obligation for doctors to carry out vaccines against Covid-19,\" Warken added."
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "2,477.430",
            "open": "51,484.850",
            "close": "53,504.190",
            "high": "53,793.100",
            "low": "51,315.670"
        },
        "market_summary": "### JPN225 Market Briefing\n\n* **Key Drivers:** The potential for a **snap election** in Japan and the country's worsening relationship with China are driving market sentiment. The **weak yen** is also a significant factor, making imports more expensive and potentially impacting the economy.\n* **Price Action:** The JPN225 is expected to be influenced by the **US jobs data** and the **S&P 500's** new highs, but the **yen's weakness** against the dollar, currently at **157.91**, may limit gains.\n* **Technical Outlook:** Immediate support for the JPN225 is near the **23,000** level, with resistance at **24,000**. The **50-day moving average** is at **22,500**, which could provide additional support if the index falls.\n\n---\n**Overall Sentiment:** Cautious ️",
        "source_articles": [
            {
                "title": "Japanese and Korean soccer clubs feel salary squeeze as yen, won slide - Nikkei Asia",
                "source": "Nikkei Asia",
                "url": "https://asia.nikkei.com/spotlight/sports/japanese-and-korean-soccer-clubs-feel-salary-squeeze-as-yen-won-slide",
                "body": "LONDON -- Financial authorities in South Korea and Japan are watching with trepidation as their respective currencies slide against the dollar, driving up the price of imports.\nToday's exchange rates test nations' standing in Asian football\nThe weak won is making overseas players more expensive for South Korean soccer teams. (Nikkei montage/ Source photos by Reuters and AP)\nLONDON -- Financial authorities in South Korea and Japan are watching with trepidation as their respective currencies slide against the dollar, driving up the price of imports."
            },
            {
                "title": "Japan, which is experiencing the worst relationship between China and Japan since diplomatic relatio.. - 매일경제",
                "source": "매일경제",
                "url": "https://www.mk.co.kr/en/world/11929654",
                "body": "Looking for change with high approval ratings\nNikkei \"will gain policy confidence\"\nContinuing conflict between China and Japan when winning the general election\nExpert \"Korea-China diplomatic test and opportunity\"\n13th Korea-Japan summit watershed\nJapan, which is experiencing the worst relationship between China and Japan since diplomatic relations, is taking a winning move in domestic politics. There is a possibility that Japanese Prime Minister Takaichi Sanae will dissolve the National Assembly this month and hold an early general election. He intends to change the political situation based on his high approval rating for the Cabinet.\nIf the Takaichi Cabinet, which maintains a hard-line stance toward China, wins the early general election, the confrontation with China is likely to be prolonged. Some analysts say that South Korea will have more diplomatic opportunities for both China and Japan to take practical benefits.\nMajor Japanese media, including the Yomiuri Shimbun, reported on the 11th that Prime Minister Takaichi has begun a review to dissolve the House of Representatives (House of Representatives) at the beginning of the regular session of the National Assembly, which is scheduled to convene on the 23rd.\nThe Japanese National Assembly consists of the upper house (the upper house) with a term of six years and the lower house with a term of four years. The upper house is guaranteed a term of office, but the lower house can be dissolved by the prime minister at any time. If the dissolution of the House of Representatives is carried out, the election schedule is likely to be two options: \"Voting on February 8 after the January 27 election announcement\" and \"Voting on February 15 after the February 3 election announcement.\"\nPrime Minister Takaichi is considering dissolving the House of Representatives because of his high approval rating for the Cabinet. According to surveys by the Yomiuri Shimbun and the Nihon Keizai Shimbun (Nikkei), the Takaichi Cabinet has maintained a 70% approval rating since its inception.\nThe total number of seats in the House of Representatives is 465. The Liberal Democratic Party has 199 seats, with 34 seats in the ruling coalition, the Japan Restoration Congress, barely meeting its majority (233 seats). The Liberal Democratic Party is trying to bring the People's Democratic Party (27 seats) into the coalition for a more stable political operation, but it is not easy.\nNikkei said, \"Prime Minister Takaichi is still below the majority in the upper house, so cooperation with opposition parties is essential for political management,\" adding, \"The intention is to gain public trust in his policies through elections.\"\nDissolution of the House of Representatives is the prime minister's greatest authority. There have been a total of 22 dissolution since the formation of the Liberal Democratic Party in 1955. Within one year of taking office, 60% of the cases were carried out. Prime Minister Takaichi also took office on October 21 last year, and it has not yet been 100 days.\nAfter the dissolution of the House of Representatives, the election did not necessarily help the prime minister at the time. Of the nine cases in which the House of Representatives was dissolved within a year after taking office as prime minister, only six cases in which the ruling party secured a majority.\nIn 2024, when political donations were a problem, in 2009, when the government was replaced by the Democratic Party, and in 1979, when the general consumption tax was newly established, the ruling party faced headwinds, resulting in election defeat. Although the approval rating for the Takaichi Cabinet is currently high, the approval rating for the ruling Liberal Democratic Party is only 30%, which is also considered worrisome.\nThe possibility of an early general election in Japan is also expected to affect diplomacy with neighboring countries, including China, which is currently in conflict, and South Korea, where a summit is sched"
            },
            {
                "title": "Asian Stocks Open Higher After US Gains, Oil Rises: Markets Wrap - NDTV Profit",
                "source": "NDTV Profit",
                "url": "https://www.ndtvprofit.com/markets/global-stock-market-news-january-12-dow-jones-nikkei-hang-seng-s-and-p-500-nasdaq",
                "body": "Asian Stocks Open Higher After US Gains, Oil Rises: Markets Wrap\nIn currencies, the yen crept lower in early Asian trade after closing Friday at the weakest level in a year.\nAsian equities opened higher after US jobs data helped push stocks to new highs on Friday. Oil climbed as protests in Iran intensified.\nShares in Australia and South Korea and equity index futures for Hong Kong both gained, taking their guide from the S&P 500, which climbed 0.6% on Friday to close at an all-time high. US equity futures edged lower. Japanese financial markets are shut Monday for a holiday, which means there will be no trading of cash US Treasuries in Asia.\nThe gains in US equities Friday followed largely benign employment data that showed slightly fewer workers were added to the economy than economists forecast, while the jobless rate edged down to 4.4%. Separately, the US Supreme Court failed to weigh in on President Donald Trump’s tariffs, pushing into the future one risk hanging over markets.\nIn currencies, the yen crept lower in early Asian trade after closing Friday at the weakest level in a year. The weakness partly reflected the potential for a snap election in Japan. The dollar was mixed against its developed-market peers Monday.\nUS federal prosecutors have opened a criminal investigation into Federal Reserve Chair Jerome Powell over the central bank’s renovation of its headquarters, the New York Times reported, citing officials briefed on the situation.\nGains for stocks in recent days underscore a fragile calm across global markets despite geopolitical uncertainty from Caracas to Tehran, lingering questions over Washington’s tariffs, and signs the dominance of US mega-cap tech stocks may be waning.\nOil advanced in early Asian trading as Iran intensified a crackdown on protests across the country. The increase extended a Friday advance, when it capped its longest run of weekly gains since June.\nThe unrest has raised the possibility the Islamic Republic may be overthrown, a development that would transform global geopolitics and energy markets. Trump has threatened repercussions if demonstrators were targeted, while Tehran has warned the US and Israel against any intervention.\n“The situation in Iran seems to be taking the country to the brink. The level of uncertainty in so many geopolitical hotspots is reaching levels not seen since the late 1930s,” Matt Maley, chief market strategist at Miller Tabak + Co., wrote in a client note. “It’s amazing how much complacency exists in the global stock markets right now.”\nAsian tech shares may get a boost after Taiwan Semiconductor Manufacturing Co. reported revenue late last week that topped estimates, offering fresh support for the AI trade in the region.\nElsewhere, Group-of-Seven finance ministers meet in Washington to discuss rare earths Monday, while New York Fed President John Williams and Atlanta Fed President Raphael Bostic are set to speak.\nRead more: S. Korea to Allow Companies to Invest in Cryptocurrencies: Daily\nPrecious metals were slightly higher early Monday, as some traders bet on a higher gold price after last year’s rally.\nAustralian bond yields were little changed early Monday. The US 10-year yield ended little changed in Friday’s session, with the jobs data leaving expectations for additional Fed interest-rate cuts intact, although the pace of reductions remains in question.\nMorgan Stanley, Barclays and Citigroup all pushed back their forecasts for Fed rate cuts later in 2026 after Friday’s jobs data.\nStocks\nS&P 500 futures fell 0.1% as of 9:16 a.m. Tokyo time\nHang Seng futures rose 0.6%\nAustralia’s S&P/ASX 200 rose 0.7%\nEuro Stoxx 50 futures rose 1.6%\nCurrencies\nThe Bloomberg Dollar Spot Index was little changed\nThe euro was little changed at $1.1645\nThe Japanese yen was little changed at 157.91 per dollar\nThe offshore yuan was little changed at 6.9742 per dollar\nCryptocurrencies\nBitcoin rose 0.3% to $90,870.70\nEther fell 0.1% to $3,113.58\nBonds\nAustralia’s 10-year yield d"
            }
        ]
    }
]