[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "78.060",
            "open": "3,756.000",
            "close": "3,833.050",
            "high": "3,834.060",
            "low": "3,756.000"
        },
        "market_summary": "Gold has surged to new all-time highs, driven by a combination of factors including expectations of Federal Reserve rate cuts, a weakening U.S. dollar, and safe-haven demand due to the looming U.S. government shutdown. The metal's extraordinary year-to-date gains of over 40% mark its strongest performance in decades. However, some technical analysis suggests the rally could be nearing a near-term top, contingent on a potential rebound in the U.S. Dollar Index.\nSENTIMENT: Positive\n\n**Overall Market Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Gold reaches new all-time high as rally extends on multiple tailwinds - KITCO",
                "source": "KITCO",
                "url": "https://www.kitco.com/opinion/2025-09-29/gold-reaches-new-all-time-high-rally-extends-multiple-tailwinds",
                "body": "(Kitco Commentary) - Gold extended its impressive rally today, with the precious metal surging to a fresh intraday record and achieving an unprecedented closing price. The current upward momentum has been driven by a confluence of factors: mounting concerns over a looming U.S. government shutdown, optimistic investor sentiment surrounding anticipated Federal Reserve rate cuts, and persistent weakness in the U.S. dollar.\nThe most actively traded December 2025 gold futures contract climbed $73.10 in today's session, settling at $3,862.90 per troy ounce—breaking through the psychologically significant $3,800 threshold to establish a new all-time settlement record. Intraday trading pushed even higher, with gold briefly touching $3,863.70.\nGold's 2025 performance has been extraordinary, posting year-to-date gains exceeding 45%. This marks the strongest annual performance since 1979, when the precious metal soared amid inflation rates surpassing 10%.\nKey Drivers Behind the Rally\nMarket participants have increasingly sought refuge in gold's traditional safe-haven status as the threat of a U.S. government shutdown looms. Without passage of budget legislation to fund federal programs, government operations are set to cease on October 1, prompting investors to hedge against potential economic disruption.\nSignificant dollar weakness has provided substantial support for gold prices. The U.S. Dollar Index—which measures the greenback's value against a basket of six major currencies (Euro, Swiss franc, Japanese yen, Canadian dollar, British pound, and Swedish krona) established by the Federal Reserve in 1973—has declined sharply from its January 6 high of 109 to its current level of 97.956. This represents a depreciation of approximately 11%, making dollar-denominated gold more attractive to international buyers.\nAdditional bullish sentiment stems from market expectations of further interest rate reductions by the Federal Reserve before year-end. Lower interest rates typically diminish the opportunity cost of holding non-yielding assets like gold, enhancing the metal's appeal.\nOngoing geopolitical tensions continue to fuel global uncertainty, while central banks worldwide are believed to have maintained robust gold purchasing programs throughout the year, providing fundamental support for prices.\nFor those that would like more information about our services, click here\nWishing you as always good trading,"
            },
            {
                "title": "Inflation data, Gold, Oil: 3 Things - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/video/inflation-data-gold-oil-3-125930286.html",
                "body": "Global markets got a lift after inflation data out on Friday showed that core inflation in the U.S. was little changed. Futures (YM=F, ES=F, NQ=F) are pointing to a positive start to the trading week on Wall Street too. Gold (GC=F) prices surged to a new record high as rate cut hopes grew, sending the dollar lower. The looming government shutdown also increased investor appetite for the safe haven asset. Meanwhile, oil (CL=F, BZ=F) prices fell as traders expect another production hike announcement from OPEC+. For more live coverage of markets watch the full episode of Market Sunrise and head to Yahoo Finance.\nWell, the first thing you need to know is that markets look set to open higher this morning.\nWhy? Well, on Friday, we learned that core inflation was little changed in August. That's according to the PCE price index, the Fed's preferred inflation gauge.\nNow, the monthly number came in at 0.3% and the annual headline number 2.7%.\nThat means that the central bank is on pace for interest rate reductions ahead.\nThe next thing you need to know is that gold has hit another record high this morning. In fact, prices surged past $3,800 an ounce.\nThey were driven by rising bets on Fed rate cuts that are weakening the dollar, but also concerns over that possible government shutdown, making the safe haven asset even more attractive.\nNow gold, which benefits from lower interest rates and thrives during geopolitical and economic uncertainty, has gained more than 40% year to date.\nAnd the final thing to know is that all prices, well, they're declining. Why? Well, it's expected that OPEC Plus will likely hike oil production again in November.\nRecent price rises seem to have encouraged the cartel to try to regain market share. OPEC Plus, which includes Russia and pumps around half the world's oil has reversed its strategy of output cuts from April amid growing pressure from President Trump to lower all oil prices.\nNow OPEC Plus will actually meet on October the 5th."
            },
            {
                "title": "Gold Strength Reflects Political Theater, but US Dollar Holds the Key - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/analysis/gold-strength-reflects-political-theater-but-us-dollar-holds-the-key-200667684",
                "body": "Asia stocks muted after mixed Chinese PMIs, Australia flat as RBA holds rates\nThe government shutdown is once again in the news, and gold is apparently capitalizing from it.\nShutdown Drama Fuels Gold\nIt’s all smoke and mirrors as those making the decisions will not cut funding for themselves. It’s just the politicians pretending that they care about the fiscal discipline – which I completely don’t believe in.\nBut the market appears to be moving on this political theater, and gold is up. Silver not so much (today – it could rally more in the upcoming days as it’s so close to its all-time highs).\nGold rallied once again, and it’s now moving closer to the Fibonacci-extension-based target of $3,900.\nWill it top here?\nIt seems to me that it will top when it’s clear that the USD Index is indeed rallying. But when will that be? Given USD Index’s technical picture, it can happen any day or hour now. Taking only the gold’s technical picture into account, it looks like the $3,900 level provides a nearest realistic target level.\nThe USDX pulled back after its short-term breakout, which changes nothing. It seems more than likely that the USD Index will finally soar in the following weeks.\nHistory Repeats: Metals React Late\nLet’s keep in mind that gold, silver, and miners used to decline only once the rally in the USD Index was clear. Right now, the USDX seems to be moving back and forth, even though its short- and medium-term breakouts are clear.\nWhich stocks should you consider in your very next trade?\nThe best opportunities often hide in plain sight—buried among thousands of stocks you'd never have time to research individually.\nThat's why smart investors use our Stock Screener with 50+ predefined screens and 160+ customizable filters to surface hidden gems instantly.\nFor example, the Piotroski's Picks method averages 23% annual returns by focusing on financial strength, and you can get it as a standalone screen. Momentum Masters catches stocks gaining serious traction, while Blue-Chip Bargains finds undervalued giants.\nWith screens for dividends, growth, value, and more, you'll discover opportunities others miss. Our current favorite screen is Under $10/share, which is great for discovering stocks trading under $10 with recent price momentum showing some very impressive returns!"
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "2.260",
            "open": "69.002",
            "close": "67.145",
            "high": "69.367",
            "low": "67.107"
        },
        "market_summary": "Oil prices are declining due to concerns over a looming supply surplus, driven by OPEC+'s anticipated production increase and the resumption of exports from Iraq's Kurdistan region. This bearish outlook is tempered by long-term projections of robust global demand growth, particularly from non-OECD countries like those in Africa. However, immediate market sentiment is weighed down by these supply increases and additional risks, including potential US economic disruptions.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "Total Sees Limited Oil Supply Growth Outside OPEC+ After 2026 - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/articles/2025-09-29/total-sees-limited-oil-supply-growth-outside-opec-after-2026",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            },
            {
                "title": "Oil dips as OPEC Plus plan stokes supply-surplus concerns - Dunya News",
                "source": "Dunya News",
                "url": "https://dunyanews.tv/en/Business/909229-oil-dips-as-opec-plus-plan-stokes-supplysurplus-concerns",
                "body": "Oil dips as OPEC Plus plan stokes supply-surplus concerns\nBusiness\nBrent crude futures for November delivery fell 54 cents, or 0.8%, to $67.43 a barrel\n(Reuters) - Oil prices fell on Tuesday as another anticipated production increase by OPEC+ and the resumption of oil exports from Iraq's Kurdistan region via Turkey reinforced the outlook for a looming supply surplus.\nBrent crude futures for November delivery , expiring on Tuesday, fell 54 cents, or 0.8%, to $67.43 a barrel by 0320 GMT. The more active contract for December was down 53 cents, or 0.8%, at $66.56 per barrel.\nU.S. West Texas Intermediate crude was trading at $62.95 a barrel, down 50 cents, or 0.8%.\nThe drops extend Monday's falls when both Brent and WTI settled more than 3% lower after logging their sharpest daily declines since August 1, 2025.\nOil's falls came as Iraq's Kurdistan region resumed crude oil exports over the weekend and amid reports that OPEC+ is likely to approve an increase in production for November at its meeting this weekend, IG analyst Tony Sycamore wrote in a note to clients.\nIn a meeting scheduled for Sunday, the Organization of the Petroleum Exporting Countries and allies including Russia, together known as OPEC+, will likely approve another oil production increase of at least 137,000 barrels per day, three sources familiar with the talks said.\n\"Although (OPEC+ is) under their quota anyway, the market still does not seem to like the fact that more oil is coming in,\" Marex analyst Ed Meir said.\nMeanwhile, crude oil flowed on Saturday through a pipeline from the semi-autonomous Kurdistan region in northern Iraq to Turkey for the first time in 2-1/2 years, after an interim deal broke a deadlock, Iraq's oil ministry said.\nThe market has remained cautious in recent weeks, balancing supply risks, mainly arising from Ukraine's drone attacks on Russian refineries, with concerns of oversupply and weak demand.\nAdding to the bearish sentiment, the potential risk of a U.S. government shutdown has raised demand concerns, said ANZ analysts in a note on Tuesday.\nA U.S. government shutdown could disrupt a wide range of services and delay economic data releases, including the Friday-scheduled payrolls report, which is crucial for decision-making by policymakers at the Federal Reserve.\nElsewhere, U.S. President Donald Trump won Israeli Prime Minister Netanyahu's support for a U.S.-backed Gaza peace proposal, but Hamas's stance remained uncertain."
            },
            {
                "title": "AEW: OPEC Highlights Africa’s Rising Oil Demand, Calls for Realistic Energy Pathways - Energy Capital & Power",
                "source": "Energy Capital & Power",
                "url": "https://energycapitalpower.com/aew-opec-highlights-africas-rising-oil-demand-calls-for-realistic-energy-pathways/",
                "body": "AEW: OPEC Highlights Africa’s Rising Oil Demand, Calls for Realistic Energy Pathways\nShare This Article\nOPEC officials highlighted Africa’s growing role in global energy demand and refining during a workshop at African Energy Week (AEW): Invest in African Energies in Cape Town on Monday, stressing that investment and realistic energy pathways will be essential for the continent’s development.\nPresenting findings from the organization’s 2025 World Oil Outlook, Dr. Abderrezak Benyoucef, Head of the Energy Study Department at OPEC, noted that global primary energy demand is set to increase by 23% by 2050, with non-OECD countries accounting for nearly three-quarters of that growth. Africa alone is projected to add 4.2 million barrels per day (bpd) in incremental oil demand, while contributing around 3 million bpd to long-term global refining capacity.\n“There are no signs of global oil demand peaking anytime soon in our outlook, and we need more investments and realistic future energy pathways,” he stated. “Africa will need more energy for economic development – not just electricity, but also to expand clean cooking access and improve health and education outcomes. LPG is one of the solutions.”\nAccording to OPEC, oil will retain the largest share of the global energy mix through 2050, while natural gas overtakes coal as the second-largest source. Developing countries are expected to account for 75% of incremental electricity demand, underscoring the need for targeted investment in Africa’s power and downstream sectors.\nDr. Benyoucef stressed that $18.2 trillion in cumulative investments will be needed globally over the period, including $14.9 trillion for upstream oil and gas projects. “We need all energy sources, but we also need emissions reductions,” he said, calling for the scale-up of technologies like carbon capture, utilization and storage.\nDr. Sulaiman Saad, Senior Oil Demand Analyst at OPEC, outlined the macroeconomic context underpinning the outlook. “The global economy is becoming more resilient – China, the U.S. and India are pushing this momentum of growth,” he said. He warned, however, of challenges including rising sovereign debt, supply chain fragmentation and uneven industrial recovery.\nOn the downstream front, OPEC sees refining growth shifting toward developing economies. “The largest share of refining additions are to take place in the developing regions,” said Mohammed Attaba, Senior Downstream Oil Industry Analyst at OPEC. “The migration of refining capacities will continue from developed to developing countries – we have been observing this trend for several years now.”"
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "2.400",
            "open": "65.288",
            "close": "63.413",
            "high": "65.653",
            "low": "63.253"
        },
        "market_summary": "Oil prices are declining due to concerns over a looming supply surplus, driven by OPEC+'s anticipated approval of another production increase and the resumption of exports from Iraq's Kurdistan region. These factors are outweighing ongoing supply risks from geopolitical events. The market is also cautious due to weak demand concerns, amplified by the potential for a U.S. government shutdown.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "Total Sees Limited Oil Supply Growth Outside OPEC+ After 2026 - Bloomberg.com",
                "source": "Bloomberg.com",
                "url": "https://www.bloomberg.com/news/articles/2025-09-29/total-sees-limited-oil-supply-growth-outside-opec-after-2026",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            },
            {
                "title": "Oil dips as OPEC Plus plan stokes supply-surplus concerns - Dunya News",
                "source": "Dunya News",
                "url": "https://dunyanews.tv/en/Business/909229-oil-dips-as-opec-plus-plan-stokes-supplysurplus-concerns",
                "body": "Oil dips as OPEC Plus plan stokes supply-surplus concerns\nBusiness\nBrent crude futures for November delivery fell 54 cents, or 0.8%, to $67.43 a barrel\n(Reuters) - Oil prices fell on Tuesday as another anticipated production increase by OPEC+ and the resumption of oil exports from Iraq's Kurdistan region via Turkey reinforced the outlook for a looming supply surplus.\nBrent crude futures for November delivery , expiring on Tuesday, fell 54 cents, or 0.8%, to $67.43 a barrel by 0320 GMT. The more active contract for December was down 53 cents, or 0.8%, at $66.56 per barrel.\nU.S. West Texas Intermediate crude was trading at $62.95 a barrel, down 50 cents, or 0.8%.\nThe drops extend Monday's falls when both Brent and WTI settled more than 3% lower after logging their sharpest daily declines since August 1, 2025.\nOil's falls came as Iraq's Kurdistan region resumed crude oil exports over the weekend and amid reports that OPEC+ is likely to approve an increase in production for November at its meeting this weekend, IG analyst Tony Sycamore wrote in a note to clients.\nIn a meeting scheduled for Sunday, the Organization of the Petroleum Exporting Countries and allies including Russia, together known as OPEC+, will likely approve another oil production increase of at least 137,000 barrels per day, three sources familiar with the talks said.\n\"Although (OPEC+ is) under their quota anyway, the market still does not seem to like the fact that more oil is coming in,\" Marex analyst Ed Meir said.\nMeanwhile, crude oil flowed on Saturday through a pipeline from the semi-autonomous Kurdistan region in northern Iraq to Turkey for the first time in 2-1/2 years, after an interim deal broke a deadlock, Iraq's oil ministry said.\nThe market has remained cautious in recent weeks, balancing supply risks, mainly arising from Ukraine's drone attacks on Russian refineries, with concerns of oversupply and weak demand.\nAdding to the bearish sentiment, the potential risk of a U.S. government shutdown has raised demand concerns, said ANZ analysts in a note on Tuesday.\nA U.S. government shutdown could disrupt a wide range of services and delay economic data releases, including the Friday-scheduled payrolls report, which is crucial for decision-making by policymakers at the Federal Reserve.\nElsewhere, U.S. President Donald Trump won Israeli Prime Minister Netanyahu's support for a U.S.-backed Gaza peace proposal, but Hamas's stance remained uncertain."
            },
            {
                "title": "OPEC Plus Poised to Agree Fresh Output Hike - Rigzone",
                "source": "Rigzone",
                "url": "https://www.rigzone.com/news/wire/opec_plus_poised_to_agree_fresh_output_hike-29-sep-2025-181933-article/",
                "body": "OPEC Plus Poised to Agree Fresh Output Hike\nOPEC+ will likely raise oil output again in November as the group continues its strategy to reclaim global market share, according to people familiar with its plans.\nThe alliance led by Saudi Arabia will consider adding at least as much as the 137,000 barrel-a-day hike scheduled for October when it meets online Oct. 5, the people said. They asked not to be identified as the talks are private.\nThe Organization of the Petroleum Exporting Countries and its allies have started to revive a new layer of halted output, amounting to 1.66 million barrels a day, in monthly stages despite warnings from across the oil industry of an impending surplus.\nSo far, the oil market has absorbed additional barrels from the group without significant ructions, and Brent futures have risen 3 percent this month.\nStill, the planned October hike is sharply lower than the increments that the group announced in the two prior months, and delegates emphasized at the time that the actual supply boost would be even smaller because some countries lack the ability to increase.\nThe upcoming meeting also takes place against the backdrop of a planned trip by Saudi Crown Prince Mohammed bin Salman to Washington in November. He will meet President Donald Trump, who has repeatedly called for lower fuel prices while he seeks to tame inflation and reduce interest rates.\nNo final decision has been made yet, and deliberations could still evolve ahead of Sunday’s meeting, the people said. The expectation for the meeting was first reported by Reuters.\nWhat do you think? We’d love to hear from you, join the conversation on the\nRigzone Energy Network.\nThe Rigzone Energy Network is a new social experience created for you and all energy professionals to Speak Up about our industry, share knowledge, connect with peers and industry insiders and engage in a professional community that will empower your career in energy."
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0057",
            "open": "1.1698",
            "close": "1.1726",
            "high": "1.1754",
            "low": "1.1698"
        },
        "market_summary": "The EUR/USD is experiencing a period of consolidation and technical tension after a bearish Q3. The pair is being supported by a weaker US Dollar, driven by market expectations of imminent Fed rate cuts and fears of a US government shutdown. However, gains are being capped by key technical resistance near 1.1740 and mixed fundamental data from both the Eurozone and the US, including sticky inflation readings.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "EUR/USD: The Key for FX Trends in Q4 - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/eur-usd-euro-the-key-for-fx-forex-trends-in-q4/?amp=true",
                "body": "EUR/USD: The Key for FX Trends in Q4\nEUR/USD, Euro Talking Points:\n- EUR/USD rallied in the first-half of the year but started Q3 with an aggressive pullback in July. August and September led to recovery but at this point with a little under two days until quarter-end, it’s been a red quarter for the pair.\n- Last year’s Q3 saw strength in EUR/USD as markets warmed up for FOMC rate cuts but even as the Fed cut rates in Q4, EUR/USD sold off hard, plummeting towards a parity handle that never ended up printing in early-2025 trade.\n- I’ll be looking into EUR/USD in the weekly webinar, and you’re welcome to join the next. Click here to register.\nEUR/USD set a fresh four-year high right as the Fed announced their September rate cut – and then started to sell-off. It’s been a bearish sequence on the daily and four-hour chart since then and this highlights the fact that FOMC rate cuts aren’t necessarily a direct push into a weaker USD and, in turn, a stronger EUR/USD.\nNonetheless, it is too early to count EUR/USD bulls out just yet and as I said in the video, I think ECB stance and Euro data will be a big determinant as to whether both trends can take-over in Q4.\nFrom the monthly chart, it’s been a red quarter for EUR/USD so far following a strong first-half of the year. The pair has tried to leave behind a big spot on the chart around the 1.1748 level but bulls haven’t completely given up yet. This is the expanse between the 76.4 and 78.6% Fibonacci retracements of the 2021-2022 major move. This is a big analytical item as I had highlighted this back in February in the Fibonacci article. This series saw the 61.8% retracement catch the high in 2023, the 38.2 and 50% retracements define the range that traded for a good portion of 2024, and more recently, the 23.6% retracement is what ultimately helped to catch the low earlier this year, before the reversal took over in March.\nNow, it’s the 76.4 and 78.6 expanse that has been holding bulls at bay.\nEUR/USD Monthly Chart\nChart prepared by James Stanley; data derived from Tradingview\nEUR/USD Weekly\nThe weekly chart highlights just how choppy this quarter has been. It started off with a notable pullback in July, alongside a USD that put in its strongest month in more than three years. This was driven by both strong inflation and the July FOMC meeting, when Powell said that policy didn’t seem overly restrictive given that rising inflation and a labor market that remained near full employment.\nBut then less than two days later the NFP report sent shockwaves across markets when the prior two months saw massive revisions on the headline number, even with the unemployment rate coming in right at the expected 4.2%, which Powell had said less than two days earlier was ‘near full employment.’\nThat elicited a strong pullback in USD and bounce in EUR/USD as the pair jumped from the 1.1400 level, and while bulls did continue to push after that, they continued to show passiveness near resistance or highs, even though they did jump in to support pullbacks at higher lows.\nThat ran all the way until the Fed’s rate cut two weeks ago which produced a wide upper wick, and that’s what led in to a bearish sequence on the daily chart.\nEUR/USD Weekly Chart\nChart prepared by James Stanley; data derived from Tradingview\nEUR/USD Daily\nThe daily chart is where the bearish sequence has shown so far following the reversal bar that printed at the FOMC meeting two weeks ago. There’s still considerable interplay with the Fibonacci retracement looked at in the first image, as the initial pullback pushed down to 1.1748, which led to a bounce in early trade last week. But sellers came back on Wednesday and Thursday to force a fresh lower-low, and the bounce from that has since held a lower-high right at the same 1.1748 level.\nAs shown in the video, it’s the prior lower-high from last week, at 1.1820 which spans up to 1.1830, that bulls need to take-out to wrestle back control. A hold at 1.1748 would be ideal for sellers as "
            },
            {
                "title": "EUR/USD Price Forecast - EURO to Dollar Climbs to 1.1725 as Dollar Index Slips to 97.95; Fed Cuts Priced, Shutdown Risk Pressures - TradingNEWS",
                "source": "TradingNEWS",
                "url": "https://www.tradingnews.com/news/eur-usd-price-forecast-euro-to-dollar-holds-11725-as-dollar-index-drops",
                "body": "EUR/USD Price Forecast - EURO to Dollar Holds 1.1725 as Dollar Index Drops to 97.95, Fed Cuts Loom, Shutdown Risk Surges\nThe euro gains traction with resistance at 1.1740 as traders brace for U.S. fiscal gridlock and key jobs data. Markets bet on October and December rate cuts despite sticky PCE inflation at 2.7% headline and 2.9% core | That's TradingNEWS\nEUR/USD Price Forecast - EURO to Dollar Advances to 1.1725 as DXY Eases to 97.95, Markets Price Fed Cuts Amid Shutdown Fears\nEUR/USD Gains Ground as Dollar Weakens Under Shutdown Pressure\nThe EUR/USD pair traded near 1.1725 in the European session, marking its second straight advance as the U.S. Dollar Index stalled around 97.95. The move came as markets priced in heightened risk of a U.S. government shutdown, with funding set to expire midweek. Historical context is weighing on sentiment: the Congressional Budget Office estimated the 2018–2019 shutdown erased $11 billion from GDP, and traders see similar fallout if gridlock continues. Dollar weakness has provided the euro with breathing room, with buyers stepping back in after the pair briefly tested 1.1645 support last week.\nSticky Inflation Keeps Fed on the Hook for Policy Easing\nAugust’s Personal Consumption Expenditures (PCE) data underscored how persistent inflation remains. Headline PCE rose 2.7% year-over-year, up from 2.6% in July, while core PCE stayed elevated at 2.9%. On a monthly basis, headline gained 0.3% and core 0.2%. These figures remain above the Fed’s 2% target, yet markets are firmly betting on more accommodation. Futures markets now assign a 90% chance of a cut in October and nearly 65% odds of a second in December, pushing Treasury yields lower and weakening the dollar’s appeal. That dovish tilt is acting as a tailwind for the euro despite lingering concerns about Europe’s growth outlook.\nECB Caution Provides a Base for the Euro\nThe European Central Bank has opted to hold rates steady for two consecutive meetings, signaling that its easing cycle may be nearing an end. Eurozone data remain mixed—services PMI shows resilience while manufacturing continues to contract. Still, the ECB’s restraint has helped anchor the euro, with investors concluding that Frankfurt is unlikely to unleash fresh stimulus just as the Fed is preparing to ease further. This divergence has offered the EUR/USD pair a relative advantage, allowing it to stabilize despite structural challenges in the bloc’s industrial sector.\nTechnical Crossroads at $1.1740\nFrom a charting perspective, EUR/USD is hovering just under heavy resistance at $1.1740, with the 50-SMA at $1.1734 and the 100-SMA at $1.1737 forming a confluence zone. The pair has already rebounded from the $1.1650 area, with price action showing a bullish “three white soldiers” pattern, a traditional signal of strong momentum. However, repeated upper wicks in recent candles reflect selling interest at higher levels. If buyers clear $1.1740 decisively, the path opens toward $1.1780 and potentially $1.1820. Failure at this zone risks a retreat back to $1.1690, and deeper losses could revisit $1.1650.\nInvestor Positioning and Market Psychology\nSentiment indicators confirm a market at a tipping point. The RSI sits near 57, suggesting further upside room without being overbought, but the balance remains delicate. Traders are cautious heading into Friday’s nonfarm payrolls release, especially since a government shutdown could delay or disrupt economic data. The labor report is pivotal: stronger-than-expected hiring would weaken the case for imminent cuts and bolster the dollar, while a soft report would confirm dovish expectations and send EUR/USD higher.\nRead More\n-\nQQQ ETF Holds $486 as Nasdaq-100 Rallies to 22,631 — Tech Mega-Caps Power 38% Yearly Gains\n29.09.2025 · TradingNEWS ArchiveStocks\n-\nXRP ETFs on Nasdaq Rally — XRPR at $24.33, XRPI $17.55 as SEC Reforms Fuel Inflows\n29.09.2025 · TradingNEWS ArchiveCrypto\n-\nNatural Gas Price Forecast (NG=F) Drops to $2.88 as Oversupply, R"
            },
            {
                "title": "EUR/USD edges higher as US shutdown fears weigh on the Dollar - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/eur-usd-edges-higher-as-us-shutdown-fears-weigh-on-the-dollar-202509292243",
                "body": "- Euro holds above 1.1720 as Democrats reject Republican bill, fueling concerns over US government shutdown.\n- Fed’s Musalem and Hammack stress inflation risks, Williams notes gradual labor market cooling.\n- Eurozone Consumer Sentiment improves but remains below average, limiting momentum despite broad US Dollar weakness.\nEUR/USD registers gains of over 0.20% on Monday amid worries of a possible government shutdown in the US, while data in the Eurozone, showed that sentiment improved but failed to propel the shared currency higher. At the time of writing, the pair trades at 1.1726 after hitting a daily low of 1.1701.\nShared currency gains modestly as political gridlock in Washington undermines sentiment\nThe Greenback is on the backfoot against most G10 FX currencies as US President Donald Trump met with the two leaders of the Democrats of the House of Representatives and the Senate.\nUS Senate Democrat leaders Schumer met with Trump, said “We have large differences.” Democratic House of Representatives leader Jefferies said that they would not support a partisan republican bill that hurts healthcare.\nIn the meantime, Vice President Vance said that the US headed for shutdown after talks with democrats, revealed a Bloomberg headline.\nUS housing data was upbeat earlier, while Federal Reserve officials delivered mixed remarks. St. Louis Fed President Alberto Musalem was hawkish, said that inflation expectations are “somewhat high” and recognized the labor market softened. Cleveland’s Fed Beth Hammack said that inflation is too high and that the trend is in the wrong direction.\nNew York Fed John Williams said that policy is restrictive, but in a position to put downward pressure on inflation, and that the resilient labor market is gradually softening.\nin the European session, Consumer Sentiment improved in the Eurozone but remained below the historical average.\nAhead this week, the docket will feature ADP National Employment Change, the ISM Manufacturing PMI, Initial Jobless Claims and Nonfarm Payrolls for September.\nDaily market movers: EUR/USD climbs despite solid US housing data\n- US Pending Home Sales rebounded strongly in August, rising 4% MoM after July’s upwardly revised -0.3% contraction, handily beating expectations for a 0.3% gain. Last week’s core PCE data came in line with estimates, reinforcing expectations for further Fed easing.\n- Fed funds rate futures point to an 89% probability of a 25-basis-point cut in October, with just an 11% chance priced for a larger 50-bps move, according to Prime Market Terminal’s rate probability tool.\n- In the Eurozone, September Consumer Confidence improved modestly to -14.9 from -15.5, while Industrial Confidence slipped slightly to -10.3 from -10.2, though still better than forecasts of -10.9. Services Sentiment weakened to 3.6 from 3.8, missing consensus at 3.7.\nTechnical outlook: EUR/USD recovers and hovers 1.1740\nEUR/USD post back-to-back bullish days, yet it is poised to consolidate at around current levels, near the 20-day Simple Moving Average (SMA) at 1.1740 The Relative Strength Index (RSI) turned flat around neutral levels, suggesting that the pair might consolidate at around current levels.\nIf EUR/USD clears 1.1740, the next resistance would be 1.1800 ahead of the yearly high of 1.1918. Conversely, a drop below 1.1700 will expose 1.1650, before challenging the 100-day SMA At 1.1599.\nEuro FAQs\nThe Euro is the currency for the 19 European Union countries that belong to the Eurozone. It is the second most heavily traded currency in the world behind the US Dollar. In 2022, it accounted for 31% of all foreign exchange transactions, with an average daily turnover of over $2.2 trillion a day. EUR/USD is the most heavily traded currency pair in the world, accounting for an estimated 30% off all transactions, followed by EUR/JPY (4%), EUR/GBP (3%) and EUR/AUD (2%).\nThe European Central Bank (ECB) in Frankfurt, Germany, is the reserve bank for the Eurozone. The ECB sets interest rates "
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0074",
            "open": "1.3382",
            "close": "1.3429",
            "high": "1.3456",
            "low": "1.3382"
        },
        "market_summary": "The GBP/USD is experiencing volatility, trading near $1.3430 after a significant 2.8% drop from recent highs. The pair is caught between growing bets on Federal Reserve rate cuts and a looming US government shutdown, which is dampening risk appetite and creating dollar volatility. This is contrasted with the Bank of England's firmly hawkish hold on rates, creating a central bank policy divergence that offers Sterling medium-term support but keeps near-term momentum fragile.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "GBP/USD Price Forecast - Pound to Dollar Tumbles 2.8% to $1.3430 as Fed Cut Bets Clash with BoE Hold, Shutdown Risk Looms - TradingNEWS",
                "source": "TradingNEWS",
                "url": "https://www.tradingnews.com/news/gbp-usd-price-forecast-sterling-sinks-to-13430-usd-as-fed-cut-odds-hit-88-percent",
                "body": "GBP/USD Price Forecast - Sterling Sinks to $1.3430 as Fed Cut Odds Hit 88% and Shutdown Fears Pressure Sterling\nThe pound erases post-FOMC gains, sliding 2.8% from $1.3726 highs as U.S. inflation sticks at 2.7% PCE, Fed easing bets grow, and BoE holds firm at 4.0% | That's TradingNEWS\nGBP/USD Price Forecast – Pound Slides to $1.3430 as Markets Price 88% Chance of Fed Cut Amid U.S. Shutdown Jitters\nGBP/USD Slides as Sterling Loses Post-Fed Momentum\nThe pound extended losses against the U.S. dollar with GBP/USD trading near 1.3430, down nearly 2.8% from last week’s peak at 1.3726. The reversal followed the Federal Reserve’s latest policy move, which triggered a short-lived rally before sellers reasserted control. Traders are also factoring in a looming 70% probability of a U.S. government shutdown, which has dented risk appetite and created added volatility for the pair. While the Dollar Index (DXY) eased to 97.95, Sterling failed to sustain upside traction, highlighting the fragility of the recent rebound.\nSterling’s Technical Landscape: Support and Resistance Levels\nGBP/USD is holding just above the critical 1.3267–1.3280 support, which represents the 78.6% retracement of the August advance and aligns with the August low-week close. A break below this region would expose 1.3140–1.3144, an area overlapping with the 38.2% retracement of the yearly range, the May 2023 low, and the 52-week moving average. Should bearish pressure persist, the next key floor rests near 1.3056–1.3080, defined by the 100% extension of the June decline. On the topside, resistance is seen first at 1.3434–1.3469, while a more decisive barrier remains near 1.3648–1.3650. A sustained breakout above that range would revive bullish momentum toward 1.3749 and potentially the 1.40 handle.\nFed Dovishness vs. BoE Restraint Defines the Macro Picture\nThe divergence between U.S. and UK monetary policy is sharpening. The CME FedWatch tool signals 88% odds of another rate cut in October and a 65% probability of a further cut in December, despite inflation data showing headline PCE at 2.7% and core PCE steady at 2.9%. Meanwhile, the Bank of England is expected to keep its policy rate at 4.0%, with Deputy Governor Dave Ramsden stressing the need to maintain a restrictive stance until inflation returns to target. This divergence offers medium-term support for Sterling but keeps near-term momentum tilted toward the dollar, particularly with shutdown fears driving safe-haven flows.\nRead More\n-\nQQQ ETF Holds $486 as Nasdaq-100 Rallies to 22,631 — Tech Mega-Caps Power 38% Yearly Gains\n29.09.2025 · TradingNEWS ArchiveStocks\n-\nXRP ETFs on Nasdaq Rally — XRPR at $24.33, XRPI $17.55 as SEC Reforms Fuel Inflows\n29.09.2025 · TradingNEWS ArchiveCrypto\n-\nNatural Gas Price Forecast (NG=F) Drops to $2.88 as Oversupply, Record U.S. Storage, and EU Sanctions Pressure Prices\n29.09.2025 · TradingNEWS ArchiveCommodities\n-\nEUR/USD Price Forecast - EURO to Dollar Holds 1.1725 as Dollar Index Drops to 97.95, Fed Cuts Loom, Shutdown Risk Surges\n29.09.2025 · TradingNEWS ArchiveForex\nEconomic Data Risks Could Steer GBP/USD\nSterling’s path will be shaped by incoming U.S. releases. The Bureau of Labor Statistics has warned that if the shutdown occurs, major data releases—including Nonfarm Payrolls—may be delayed, leaving investors without critical guidance. For now, traders are focused on the Core PCE Price Index, which rose 0.3% MoM in August, as well as Fed commentary from officials including John Williams and Christopher Waller. Stronger data could pressure GBP/USD toward 1.3267, while a weak read may spark relief rallies back toward 1.3467 and higher.\nMarket Positioning and Momentum Indicators\nTechnical studies show mixed signals. The 50-day SMA at 1.3435 and the 200-day SMA at 1.3493 form a resistance cluster that has capped Sterling’s upside throughout September. The RSI sits near 59–60, suggesting room for more gains if resistance breaks, but highlighting that momentum remains fragile. Tra"
            },
            {
                "title": "GBP/USD rises as Fed rate cut bets grow, US shutdown risks loom - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-usd-rises-as-fed-rate-cut-bets-grow-us-shutdown-risks-loom-202509291549",
                "body": "- Sterling gains as the Fed is seen delivering two cuts, while the BoE is expected to hold rates steady despite stalled disinflation.\n- BoE’s Ramsden is confident restrictive policy will tame inflation, while Cleveland Fed’s Hammack warns inflation remains stubbornly high.\n- US shutdown risks mount as BLS signals data blackout, overshadowing upbeat Pending Home Sales and upcoming Fed speakers.\nThe GBP/USD pair advances on Monday as the US Dollar (USD) trims some of last week’s gains as a busy economic docket in the US approaches. The pair trades at 1.3430, up 0.24%.\nGBP/USD rises despite UK fiscal concerns, boosted by central bank divergence and political focus at Labor conference\nFears of a potential government shutdown in the US weigh on the US Dollar despite remaining concerns about the UK's finances. On Monday, the Labor Party conference began in Liverpool, and it will be the focus for investors, according to Chris Turner, head of forex strategy at ING.\nAside from this, the central bank divergence favors further upside for the GBP/USD pair. The Bank of England (BoE) is expected to hold rates unchanged at the next meeting, while market participants have priced in almost two rate cuts by the Federal Reserve (Fed).\nBoE Deputy Governor Dave Ramsden was hawkish, as he said the UK’s disinflationary trend had stalled. He said that he remains “confident we will get inflation back to target with current restrictive rates and market expectations.”\nAcross the pond, Cleveland Fed Beth Hammack reiterated her hawkish stance, saying that inflation is too high and the trend is in the wrong direction. She added that tariffs are a big part of the pause in the disinflation process.\nSecond-tier data in the US revealed that Pending Home Sales improved in August, rising by 4% MoM, up from an upwardly revised -0.3% contraction in July and above forecasts of a 0.3% expansion.\nMeanwhile, breaking news revealed that the US Bureau of Labor Statistics reportedly plans not to release economic data during the Government shutdown, according to Bloomberg. The BLS will suspend all operations in the case of a Government shutdown.\nUp next, the US economic docket will feature further Fed speakers, with Regional Fed Presidents Alberto Musalem, John Williams and Raphael Bostic, crossing the wires.\nGBP/USD Price Forecast: To consolidate, unless spot prices fall below 1.34\nThe technical picture shows back-to-back bullish days, but GBP/USD remains shy of reversing the drop from around the 1.3480-1.3500 area, which would keep Sterling with a downward bias momentum.\nThe Relative Strength Index (RSI) shows that sellers are in charge. If GBP/USD remains below 1.3466, the September 25 high, expect further downside, with the next area of interest being the 1,3400 figure. A breach of the latter would expose the September 25 swing low of 1.3324.\nPound Sterling Price This Month\nThe table below shows the percentage change of British Pound (GBP) against listed major currencies this month. British Pound was the strongest against the New Zealand Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the British Pound from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent GBP (base)/USD (quote).\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Op"
            },
            {
                "title": "GBP/USD rises as Fed rate cut bets grow, US shutdown risks loom - Mitrade",
                "source": "Mitrade",
                "url": "https://www.mitrade.com/au/insights/news/live-news/article-1-1158107-20250929",
                "body": "The GBP/USD advances on Monday as the Greenback trims some of the last week’s gains as a busy economic docket in the US approaches. The pair trades at 1.3430, up 0.24%.\nFears of a potential government shutdown in the US, weighs on the Dollar despite remaining concerns of UK finances. On Monday, the Labor Party conference began in Liverpool this week, and it would be the focus for investors, revealed Chris Turner head of forex strategy at ING.\nAside from this, the central bank divergence favors further GBP/USD upside. The Bank of England is expected to hold rates unchanged at the next meeting, while market participants priced in almost two rate cuts by the Federal Reserve.\nBoE Deputy Governor Dave Ramsden was hawkish, as he said the UK’s disinflationary trend stalled. He said that he remains “confident we will get inflation back to target with current restrictive rates and market expectations.”\nAcross the pond, Cleveland Fed Beth Hammack reiterated her hawkish stance, saying that inflation is too high and the trend is in the wrong direction. She added that tariffs are a big part of the pause of the disinflation process.\nSecond tier data in the US revealed that Pending Home Sales improved in August rose by 4% MoM, up from an upward revised -0.3% contraction in July and above forecasts of a 0.3% expansion.\nMeanwhile, breaking news revealed that the US Bureau of Labor Statistics reportedly plans not to release economic data during Government shutdown, according to Bloomberg. The BLS to suspend all operations in case of Government shutdown.\nUp next, the US economic docket will feature further Fed speakers, with Regional Fed Presidents Alberto Musalem, John Williams and Raphael Bostic, crossing the wires.\nThe technical picture shows back-to-back bullish days, but the GBP/USD remains shy of reversing the drop from around the 1.3480-1.3500 area, which would keep Sterling with a downward bias momentum.\nThe Relative Strength Index (RSI) shows that sellers are in charge. If GBP/USD remains below 1.3466, the September 25, expect further downside with the next area of interest being the 1,3400 figure. A breach of the latter will expose September 25 swing low of 1.3323.\nThe table below shows the percentage change of British Pound (GBP) against listed major currencies this month. British Pound was the strongest against the New Zealand Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the British Pound from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent GBP (base)/USD (quote)."
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0038",
            "open": "0.6543",
            "close": "0.6575",
            "high": "0.6581",
            "low": "0.6542"
        },
        "market_summary": "The Australian Dollar is gaining against a weaker US Dollar, which is under pressure due to concerns over a potential US government shutdown. While the RBA's upcoming meeting is expected to result in a hold of rates, it is largely anticipated and considered a secondary driver compared to US-centric risks and data. Key near-term influences for AUD/USD will be US political developments and upcoming labour market data, with technical indicators hinting at potential short-term strength.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Australian Dollar Outlook: RBA likely a sideshow as AUD/USD traders eye US labour risk - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/australian-dollar-outlook-rba-likely-a-sideshow-as-aud-usd-traders-eye-us-labour-risk/?amp=true",
                "body": "Australian Dollar Outlook: RBA likely a sideshow as AUD/USD traders eye US labour risk\n- RBA expected to hold rates at 3.6%\n- Market focus on US shutdown, jobs data\n- China’s yuan a key influence before holidays\n- AUD/USD morning star hints at near-term gains\nAUD/USD Outlook Summary\nThere is a real risk the Reserve Bank of Australia’s (RBA) September monetary policy decision may not be the key event for the Australian dollar on Tuesday, although it does carry the potential to spark short-term volatility in the hours following its release. Realistically, unless you’re trading AUD against the crosses, it’s the USD side of the ledger that is dictating directional shifts, putting headlines relating to a potential U.S. government shutdown and the first batch of U.S. labour market data front-and-centre for those trading AUD/USD.\nRBA: More Bark than Bite\nLet’s discuss the elephant in the room immediately so we can move to focusing on event risk that could truly impact the AUD/USD on Tuesday: the RBA interest rate decision looms as a likely nothingburger. As seen in the Bloomberg graphic below showing implied probabilities of rate movements based on swaps markets, almost zero risk is seen of the cash rate shifting from 3.6%.\nSource: Bloomberg\nWhere there will be some interest in what the bank communicates in regard to the rates outlook, with pricing for a 25-point cut in November essentially an even money bet. But this meeting has no updated forecast—they’ll arrive in six weeks’ time. Nor does the RBA have access to the ABS quarterly trimmed mean inflation measure, the key piece of information it uses to assess policy settings on the inflation side of its dual mandate—that arrives late next month. And recent economic data has printed stronger than what both markets collectively and RBA were forecasting, including household consumption which is by far the largest and most important part of the Australian economy. That’s seen a hawkish repricing take place across the Australian swaps curve since the board last met and increases the risk that it will upgrade its assessment of the domestic economy. But that too is widely expected.\nAugust Statement Cheat Sheet\nRegardless, the paragraphs below outline what the RBA said relating to inflation, the domestic economy and labour market when it last met in mid-August, providing traders with a reference point when looking for any changes in the September statement.\nOn inflation, the Bank said it had “continued to moderate” and had “fallen substantially since the peak in 2022,” with trimmed mean outcomes “broadly as expected.” It projected inflation would “continue to moderate to around the midpoint of the 2–3 per cent range,” while cautioning about “uncertainties regarding the lags in the effect of recent monetary policy easing and how firms’ pricing decisions and wages will respond.”\nFor the domestic economy, it judged that “private demand appears to have been recovering gradually,” with “real household incomes have picked up” and “some measures of financial conditions have eased.” Even so, it flagged “uncertainties about the outlook for domestic economic activity and inflation,” warning that “consumption growth is a little slower than expected,” though households might also “consume more and save less than expected.” Businesses in some areas reported “weakness in demand is making it difficult to pass on cost increases.”\nOn the labour market, it said conditions “remain a little tight, although have eased further in recent months.” The “unemployment rate rose…in line with the May forecasts,” while “labour underutilisation nevertheless remain at low rates.” It added that “availability of labour is still a constraint,” while “wages growth has eased from its peak,” “productivity growth has not picked up” and “unit labour costs remains high.”\nUnless the RBA makes meaningfully hawkish or dovish changes to those prior views, which seems extremely unlikely, it leaves little room for the type of surprise t"
            },
            {
                "title": "AUD/USD edges higher ahead of RBA meeting amid softer Greenback - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/aud-usd-edges-higher-before-rba-meeting-amid-softer-greenback-202509291857",
                "body": "- The Australian Dollar extends gains for a second day, with AUD/USD up 0.50%.\n- The US Dollar remains on the back foot amid uncertainty over the looming US government funding deadline.\n- Investors are focused on the RBA’s interest rate decision due on Tuesday at 04:30 GMT.\nThe Australian Dollar (AUD) ticks higher against the US Dollar (USD) on Monday, with AUD/USD extending gains for a second straight day as the Greenback remains under pressure. The US Dollar’s weakness stems from investor caution over the looming US government funding deadline, with market participants weighing the risk of a potential shutdown if no agreement is reached by October 1.\nPolitical leaders are set to meet at the White House on Monday for last-minute negotiations, after US President Donald Trump called the meeting to strike a deal and avert a lapse in government funding.\nAt the time of writing, AUD/USD is trading near 0.6580 during the American session, up almost 0.50% on the day. Meanwhile, the US Dollar Index (DXY), which tracks the Greenback's value against a basket of six major currencies, is struggling just below the 98.00 psychological mark.\nThe spotlight now shifts to the Reserve Bank of Australia’s (RBA) interest rate decision on Tuesday at 04:30 GMT, where the central bank is widely expected to hold its cash rate steady at 3.60%. The RBA has eased policy by 75 basis points so far this year. Investors will focus on the tone of the accompanying monetary policy statement for guidance on the policy path into the final quarter of the year.\nRecent domestic data paint a mixed picture. Australia’s Gross Domestic Product (GDP) grew 0.6% QoQ in Q2, beating expectations of 0.5% and accelerating from 0.3% in Q1, while annual growth rose to 1.8% from 1.4%. At the same time, the ABS Monthly Consumer Price Index (CPI) rose to 3.0% YoY in August from 2.8% in July, and the underlying measure excluding volatile items climbed to 3.4% YoY, indicating some stickiness in near-term price pressure even as the quarterly trimmed-mean gauge eased to 2.7% in Q2 from 2.9% in Q1.\nLabour-market indicators show signs of cooling. Total Employment unexpectedly fell by 5.4K in August, against forecasts for a 22K increase, with a sharp 40.9K drop in Full-time jobs, while the Unemployment Rate held steady at 4.2%. The combination of resilient growth, sticky inflation, and a cooling labour market reinforces the RBA’s case for holding policy steady for now.\nA recent Reuters poll of 39 economists showed all respondents expect the RBA to keep the cash rate steady on Tuesday. Looking ahead, ANZ, Commonwealth Bank, and Westpac all expect the next rate cut in November, while NAB has ruled out further cuts this year and now projects the next move in May 2026.\nEconomic Indicator\nRBA Interest Rate Decision\nThe Reserve Bank of Australia (RBA) announces its interest rate decision at the end of its eight scheduled meetings per year. If the RBA is hawkish about the inflationary outlook of the economy and raises interest rates it is usually bullish for the Australian Dollar (AUD). Likewise, if the RBA has a dovish view on the Australian economy and keeps interest rates unchanged, or cuts them, it is seen as bearish for AUD.\nRead more.Next release: Tue Sep 30, 2025 04:30\nFrequency: Irregular\nConsensus: 3.6%\nPrevious: 3.6%\nSource: Reserve Bank of Australia\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of you"
            },
            {
                "title": "Australian Dollar Outlook: RBA likely a sideshow as AUD/USD traders eye US labour risk - Forex Factory",
                "source": "Forex Factory",
                "url": "https://www.forexfactory.com/news/1363660-australian-dollar-outlook-rba-likely-a-sideshow-as",
                "body": "-\nAustralian Dollar Outlook: RBA likely a sideshow as AUD/USD traders eye US labour risk\nThere is a real risk the Reserve Bank of Australia’s (RBA) September monetary policy decision may not be the key event for the Australian dollar on Tuesday, although it does carry the potential to spark short-term volatility in the hours following its release. Realistically, unless you’re trading AUD against the crosses, it’s the USD side of the ledger that is dictating directional shifts, putting headlines relating to a potential U.S. government shutdown and the first batch of U.S. labour market data front-and-centre for those trading AUD/USD. Let’s discuss the elephant in the room immediately so we can move ... (full story)"
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "1.0420",
            "open": "149.3800",
            "close": "148.5750",
            "high": "149.5100",
            "low": "148.4680"
        },
        "market_summary": "The Japanese Yen is strengthening against the US Dollar, driven by hawkish commentary from the Bank of Japan (BoJ) that is firming expectations for an October rate hike. This is creating a divergence with the Federal Reserve, which is expected to cut rates, capping the USD's strength. However, this BoJ hawkishness and the potential for a surprise rate move are also creating global market jitters, as it raises the risk of a repeat Yen carry trade unwind that could negatively impact risk assets.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Japanese Yen edges lower amid BoJ division and weak economic data - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/japanese-yen-edges-lower-on-the-back-of-boj-division-and-weak-economic-data-202509300311",
                "body": "- The Japanese Yen attracts some dip-buyers despite a divided BoJ Summary of Opinions.\n- Disappointing macro data and a positive risk tone also do little to undermine the JPY.\n- The divergent BoJ-Fed policy expectations also act as a headwind for the USD/JPY pair.\nThe Japanese Yen (JPY) turns higher against a broadly weaker US Dollar (USD) for the third consecutive day on Tuesday and keeps the USD/JPY pair depressed near the 200-day Simple Moving Average (SMA). The initial market reaction to a divided Bank of Japan’s (BoJ) Summary of Opinions and the disappointing macro data from Japan turns out to be short-lived amid bets that the Japanese central bank will stick to its policy normalization path. Apart from this, rising geopolitical tensions, looming US government shutdown, and trade-related uncertainties lend some support to the safe-haven JPY.\nMeanwhile, hawkish BoJ expectations mark a significant divergence in comparison to the growing acceptance that the US Federal Reserve (Fed) will lower borrowing costs twice by the end of this year. The latter fails to assist the USD in attracting any meaningful buyers and turns out to be another factor benefiting the lower-yielding JPY. That said, a generally positive risk tone might hold back the JPY bulls from placing aggressive bets and act as a tailwind for the USD/JPY pair. Nevertheless, the fundamental backdrop suggests that the path of least resistance for the JPY remains to the upside.\nJapanese Yen is pressured by BoJ rate hike uncertainty and weaker domestic data\n- The Bank of Japan's Summary of Opinions from the September meeting, released earlier this Tuesday, showed increasing pressure from hawks to normalise policy. That said, dovish policymakers highlighted uncertainty over inflation dynamics and global grade uncertainties.\n- On the economic data front, Retail Sales in Japan fell 1.1% year-on-year in August, marking their first decline since Feb 2022 and the biggest fall since August 2021. Moreover, the reading was well below market expectations of a 1% rise and a 0.4% rise recorded in the previous month.\n- A separate government report showed that Japan's Industrial Production declined for the second consecutive month, by 1.2% in August compared to consensus estimates for a 0.7% contraction. The data suggested that businesses remained cautious amid persistent concerns about US tariffs.\n- In the latest trade-related developments, the White House announced early Tuesday that US President Donald Trump signed a proclamation adjusting imports of timber, lumber, and derivative products into the US. Meanwhile, imports from the European Union and Japan were capped at 15%.\n- Adding to this, domestic political uncertainty continues to fuel speculations that the BoJ will delay raising interest rates further, which fails to assist the Japanese Yen to build on a two-day-old move up against the US Dollar. Any meaningful depreciating move for the JPY, however, seems elusive.\n- Traders are still pricing in the possibility of a 25-basis-point rate hike by the BoJ in October. In contrast, the Federal Reserve is expected to cut rates twice by the year-end. The latter should cap the USD amid the looming US government shutdown and offer support to the lower-yielding JPY.\nUSD/JPY bulls have the upper hand while above the 200-day SMA near 148.40\nThe USD/JPY pair finds some support and defends a technically significant 200-day Simple Moving Average (SMA). Adding to this, oscillators on the daily chart – though they have been losing traction – are holding in positive territory. This, in turn, favors bullish traders and backs the case for additional gains. Any further move up, however, is likely to confront a hurdle near the 149.00 mark. A sustained strength beyond will reaffirm the positive outlook and allow spot prices to make a fresh attempt to conquer the 150.00 psychological mark with some intermediate resistance near the 149.40-149.45 region.\nOn the flip side, weakness below the 200-day SMA"
            },
            {
                "title": "Dow Jones & Nasdaq 100 Dip on China Margin Pressures, BoJ Jitters - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/dow-jones-nasdaq-100-dip-on-china-margin-pressures-boj-jitters-1551698",
                "body": "The Bank of Japan was in the spotlight amid shifting bets on an October interest rate hike. The BoJ’s Summary of Opinions revealed that board members discussed a near-term rate hike, weighing on sentiment.\nNotably, the number of policymakers tilting toward a near-term rate hike was higher than the two board members who dissented from the September decision to maintain interest rates at 0.5%.\nAlthough four board members leaned hawkish, a majority remained cautious. One policymaker, notably, warned of market disruption, stating:\n“A policy interest rate hike at this point, which would come as a surprise to the market, should be avoided.”\nNevertheless, the more hawkish tone dented sentiment, with the Nikkei slipping in tandem with US futures—a reminder that BoJ rhetoric quickly ripples through global markets.\nThe reference to surprising the markets was telling. In July 2024, the BoJ reduced its purchases of Japanese Government Bonds (JGBs) and unexpectedly raised interest rates, triggering a yen Carry Trade unwind.\nUSD/JPY plunged from 153.889 on July 31, 2024, to 139.576 on September 16, 2024. The USD/JPY pair’s slump triggered margin calls, forcing traders to exit risk assets to repay Japanese yen-denominated debt. The Nasdaq Composite Index slid 11.2% from July 31, 2024, to August 5, 2024.\nThe potential threat of a repeat market event could weigh on risk appetite. Traders should closely monitor USD/JPY and Nikkei 225 trends to assess the risk of another yen carry trade unwind.\nWhile the Bank of Japan’s monetary policy stance remains a focal point, Chinese economic data also influenced demand for risk assets.\nThe RatingDog Manufacturing PMI increased to 51.2 in September, up from 50.5 in August. A pickup in new orders lifted production. However, rising input price inflation and falling average selling prices signaled renewed margin pressures, leading to further job cuts. Rising unemployment may further weaken consumer spending, challenging Beijing’s 5% GDP growth target.\nWeakness in the Hang Seng underlined investor nerves. Combined with BoJ jitters, China’s renewed margin pressures dragged on US futures.\nUS stock futures posted modest losses in morning trading on Tuesday, September 30. The Dow Jones E-mini fell 20 points, the Nasdaq 100 E-mini dropped 13 points, and the S&P 500 E-mini declined 3 points.\nAttention now shifts to US labor data. A sharper drop in JOLTs openings could feed bets on an October cut, while a stronger print may stall the rally.\nEconomists forecast JOLTs job openings to drop from 7.181 million in July to 7.1 million in August.\nA sharper drop in job openings would indicate weaker demand for labor, supporting a more dovish Fed rate path. A weakening labor market may soften wage growth and curb consumer spending, cooling inflation. Rising bets on October and December Fed rate cuts could lift sentiment. However, a higher reading could weigh on US stock futures ahead of Friday’s US Jobs Report.\nDespite the morning losses, US stock futures trade above the 50-day and 200-day Exponential Moving Averages (EMAs), reaffirming a short-term bullish bias.\nHowever, the near-term outlook hinges on tariff headlines, the Bank of Japan’s policy outlook, FOMC members’ commentary, and US labor market data. Key levels traders are monitoring include:\nDow Jones\nNasdaq 100\nS&P 500\nMarkets enter Q4 at a crossroads—whether Fed cuts or a yen shock defines sentiment may hinge on this week’s data.\nTraders should consider BoJ rhetoric and USD/JPY trends. Hawkish BoJ chatter and dovish Fed cues could raise the risk of a yen carry trade unwind, impacting risk sentiment. Meanwhile, trade developments and US labor market data will also affect risk assets.\nProgress toward a US-China trade deal and dovish Fed signals could lift sentiment. However, rising US recession risks and increasing trade friction could test buyer demand for US stock futures early in the final quarter.\nFollow our live coverage and consult our economic calendar.\nWith ove"
            },
            {
                "title": "JPY outperforming on BoJ – Scotiabank - Mitrade",
                "source": "Mitrade",
                "url": "https://www.mitrade.com/insights/news/live-news/article-1-1157594-20250929",
                "body": "The Japanese Yen (JPY) is strong, up 0.6% against the US Dollar (USD) and outperforming all of the G10 currencies on the back of hawkish comments from a noted BoJ dove, Scotiabank's Chief FX Strategists Shaun Osborne and Eric Theoret report.\n\"BoJ board member Noguchi’s latest speech suggested that upside risks required ‘a new policy perspective’. These comments have been interpreted as an endorsement of rate hikes, firming expectations for tightening at the next meeting on October 30.\"\n\"Yield spreads are narrowing, offering renewed support for the yen as the options market hints to a rise in demand for protection against JPY strength. We look to near-term USD/JPY weakness through the 50 day MA (147.77) toward the September lows around 146.00\""
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0044",
            "open": "1.3925",
            "close": "1.3911",
            "high": "1.3947",
            "low": "1.3903"
        },
        "market_summary": "The USD/CAD is consolidating above 1.3900 after the Canadian dollar saw a slight rebound from a four-month low. This minor CAD strength is attributed to profit-taking on USD longs and exporter hedging, but it is being capped by a significant drop in oil prices and persistent market caution. Caution is driven by risks of a US government shutdown, potential delays to key economic data like the jobs report, and mixed signals from Canadian economic data, which showed flat growth in August.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Canadian dollar gains as exporters lock in rates at favorable levels - Yahoo",
                "source": "Yahoo",
                "url": "https://ca.finance.yahoo.com/news/canadian-dollar-gains-exporters-lock-185247401.html",
                "body": "By Fergal Smith\nTORONTO (Reuters) -The Canadian dollar strengthened against its U.S. counterpart on Monday as the greenback gave back some of its recent broad-based gains, but the loonie's move was limited as oil prices tumbled.\nThe loonie was trading 0.2% higher at 1.3912 per U.S. dollar, or 71.88 U.S. cents, after trading in a range of 1.3904 to 1.3947. On Friday, it touched a four-month intraday low of 1.3958.\n\"It looks like we're seeing a bit of profit-taking\" by speculators that were short the Canadian dollar, said Darren Richardson, chief operating officer at Richardson International Currency Exchange Inc.\nCanadian exporters taking advantage of recent gains in the U.S. dollar to lock in currency rates at favorable levels has added to support for the loonie, Richardson said.\nThe U.S. dollar fell against a basket of major currencies following a rally last week that was driven by stronger-than-expected U.S. economic data. The U.S. nonfarm payrolls report, due on Friday, could offer further clues on the state of the U.S. economy and prospects for additional Federal Reserve interest rate cuts.\nInvestors have raised bearish bets on the Canadian dollar to the highest level since April, data from the U.S. Commodity Futures Trading Commission showed on Friday. The net short position in the currency was at 114,806 contracts as of September 23, up from 107,177.\nThe price of oil settled 3.45% lower at $63.45 a barrel on Monday on expectations that OPEC+ will approve another increase to crude oil production at its meeting on Sunday.\nCanadian government bond yields moved lower across a flatter curve, tracking moves for U.S. Treasuries. The 10-year was down 4.3 basis points at 3.185%.\n(Reporting by Fergal Smith; Editing by Leslie Adler)"
            },
            {
                "title": "USD/CAD remains above 1.3900 as traders adopt caution amid US government shutdown risks - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-cad-remains-above-13900-as-traders-adopt-caution-amid-us-government-shutdown-risks-202509300130",
                "body": "- USD/CAD stays muted as the US government is nearing a funding freeze and possible shutdown.\n- President Trump warned of widespread federal job losses if Congress does not pass a funding bill.\n- Statistics Canada revised July GDP growth to 0.2% and reported no change in August, helping ease concerns of an economic slowdown.\nUSD/CAD moves little after registering losses in the previous session, trading around 1.3920 during the Asian hours on Tuesday. The pair holds steady as traders tread cautiously amid concerns that the upcoming US jobs report may not be released this week, with the government nearing a funding freeze and possible shutdown.\nUS President Donald Trump has warned of mass federal job cuts if Congress fails to pass a funding bill, effectively putting his own government at risk and threatening further disruptions to federal operations.\nMarket uncertainty increases as President Trump shared plans to impose a 100% tariff on imports of branded or patented pharmaceutical products from October 1, unless a pharmaceutical company is building a manufacturing plant in the US. Trump also unveiled tariffs of 50% on kitchen cabinets and bathroom vanities and 25% on trucks.\nStatistics Canada revised July GDP growth up to 0.2% and reported flat activity in August, easing fears of an economic downturn and shifting market attention back to growth indicators.\nThe commodity-linked Canadian Dollar (CAD) faced challenges as the crude Oil prices fell more than 3% in the previous session after Iraq’s Kurdistan region restarted Oil exports after a 2.5-year suspension, boosting supplies in an already oversupplied market. According to the new deal, Baghdad, the Kurdistan Regional Government, and international oil companies, initial flows of 180,000–190,000 barrels per day will be shipped to Turkey’s Ceyhan port.\nCanadian Dollar FAQs\nThe key factors driving the Canadian Dollar (CAD) are the level of interest rates set by the Bank of Canada (BoC), the price of Oil, Canada’s largest export, the health of its economy, inflation and the Trade Balance, which is the difference between the value of Canada’s exports versus its imports. Other factors include market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – with risk-on being CAD-positive. As its largest trading partner, the health of the US economy is also a key factor influencing the Canadian Dollar.\nThe Bank of Canada (BoC) has a significant influence on the Canadian Dollar by setting the level of interest rates that banks can lend to one another. This influences the level of interest rates for everyone. The main goal of the BoC is to maintain inflation at 1-3% by adjusting interest rates up or down. Relatively higher interest rates tend to be positive for the CAD. The Bank of Canada can also use quantitative easing and tightening to influence credit conditions, with the former CAD-negative and the latter CAD-positive.\nThe price of Oil is a key factor impacting the value of the Canadian Dollar. Petroleum is Canada’s biggest export, so Oil price tends to have an immediate impact on the CAD value. Generally, if Oil price rises CAD also goes up, as aggregate demand for the currency increases. The opposite is the case if the price of Oil falls. Higher Oil prices also tend to result in a greater likelihood of a positive Trade Balance, which is also supportive of the CAD.\nWhile inflation had always traditionally been thought of as a negative factor for a currency since it lowers the value of money, the opposite has actually been the case in modern times with the relaxation of cross-border capital controls. Higher inflation tends to lead central banks to put up interest rates which attracts more capital inflows from global investors seeking a lucrative place to keep their money. This increases demand for the local currency, which in Canada’s case is the Canadian Dollar.\nMacroeconomic data releases gauge the health of the economy and can h"
            },
            {
                "title": "Rosenberg Says Canada Economy Subpar, Calls for BoC to Move From Data to Forecast Dependence - MarketScreener",
                "source": "MarketScreener",
                "url": "https://www.marketscreener.com/news/rosenberg-says-canada-economy-subpar-calls-for-boc-to-move-from-data-to-forecast-dependence-ce7d5bdbda8bf624",
                "body": "Access Denied\nYou don't have permission to access \"http://www.marketscreener.com/news/rosenberg-says-canada-economy-subpar-calls-for-boc-to-move-from-data-to-forecast-dependence-ce7d5bdbda8bf624\" on this server.\nReference #18.7510de17.1759211094.1c2bf42d\nhttps://errors.edgesuite.net/18.7510de17.1759211094.1c2bf42d"
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "0.5960",
            "open": "199.4470",
            "close": "199.1780",
            "high": "199.7650",
            "low": "199.1690"
        },
        "market_summary": "The GBP/JPY pair is experiencing a sharp decline as the Japanese Yen strengthens due to safe-haven demand amid US government shutdown risks. The Yen's strength is broad-based, outperforming other major currencies. Meanwhile, dovish commentary from a BoE official, supporting quick rate cuts due to a deteriorating labor market, is adding downward pressure on the Pound.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "GBP/JPY slumps to near 199.50 as Japanese Yen outperforms across the board - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-slumps-to-near-19950-as-japanese-yen-outperforms-across-the-board-202509291053",
                "body": "- GBP/JPY falls sharply to near 199.50 as the safe-haven demand of the Japanese Yen has increased.\n- Investors await the BoJ’s Summary of Opinions release on Tuesday.\n- BoE’s Dhingra supports quick interest rate cuts to support job demand.\nThe GBP/JPY pair trades 0.4% down to near 199.50 during the European trading session on Monday. The pair falls sharply as weakness in the US Dollar (USD) due to mounting United States (US) government shutdown risks has increased the safe-haven appeal of the Japanese Yen (JPY).\nJapanese Yen Price Today\nThe table below shows the percentage change of Japanese Yen (JPY) against listed major currencies today. Japanese Yen was the strongest against the Euro.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Japanese Yen from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent JPY (base)/USD (quote).\nThis week, the major trigger for the Japanese Yen will be the Bank of Japan (BoJ) Summary of Opinions (SOP), which will be published on Tuesday.\nIn the policy meeting this month, the BoJ held interest rates steady at 0.5%, as expected, and kept the door open for more interest rate hikes in the near term.\nOn the political front, the ruling Liberal Democratic Party (LDP) is scheduled to elect a new leader to replace outgoing Prime Minister Shigeru Ishiba on October 4.\nIn the United Kingdom (UK), traders remain increasingly confident that the Bank of England (BoE) will cut interest rates in the November policy meeting as price pressures are proving to be persistent. Last week, BoE Monetary Policy Committee (MPC) member Megan Greene warned of inflation risks and expressed confidence that the economy will rebound.\nOn the contrary, BoE MPC member Swati Dhingra wrote in a column published by The Times on Friday that inflation risks will fade and there is need for quick interest rate cuts to support deteriorating labor market conditions.\nPound Sterling FAQs\nThe Pound Sterling (GBP) is the oldest currency in the world (886 AD) and the official currency of the United Kingdom. It is the fourth most traded unit for foreign exchange (FX) in the world, accounting for 12% of all transactions, averaging $630 billion a day, according to 2022 data. Its key trading pairs are GBP/USD, also known as ‘Cable’, which accounts for 11% of FX, GBP/JPY, or the ‘Dragon’ as it is known by traders (3%), and EUR/GBP (2%). The Pound Sterling is issued by the Bank of England (BoE).\nThe single most important factor influencing the value of the Pound Sterling is monetary policy decided by the Bank of England. The BoE bases its decisions on whether it has achieved its primary goal of “price stability” – a steady inflation rate of around 2%. Its primary tool for achieving this is the adjustment of interest rates. When inflation is too high, the BoE will try to rein it in by raising interest rates, making it more expensive for people and businesses to access credit. This is generally positive for GBP, as higher interest rates make the UK a more attractive place for global investors to park their money. When inflation falls too low it is a sign economic growth is slowing. In this scenario, the BoE will consider lowering interest rates to cheapen credit so businesses will borrow more to invest in growth-generating projects.\nData releases gauge the health of the economy and can impact the value of the Pound Sterling. Indicators such as GDP, Manufacturing and Services PMIs, and employment can all influence the direction of the GBP. A strong economy is good for Sterling. Not only does it attract more foreign investment but it may encourage the BoE to put up interest rates, which will directly strengthen GBP. Otherwise, if economic data is weak, the Pound Sterling is likely to fall.\nAnother significant data release "
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "898.5000",
            "open": "114,245.7900",
            "close": "114,006.5000",
            "high": "114,867.0000",
            "low": "113,968.5000"
        },
        "market_summary": "Regulatory scrutiny is intensifying around crypto-linked equities, as evidenced by the SEC halting trading of QMMM Holdings due to potential manipulation following its crypto treasury announcement. Simultaneously, the SEC Chairman's comments on tokenized securities suggest a future with more oversight, potentially impacting wallet privacy. While the fundamental Bitcoin halving cycle continues to promise long-term scarcity, its future impact may be tempered by a larger circulating supply and greater influence from institutional adoption and macro factors.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "SEC Halts Trading of Bitcoin, Ethereum Treasury Firm QMMM After 2,000% Stock Surge - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/sec-halts-trading-bitcoin-ethereum-192325946.html",
                "body": "The Securities and Exchange Commission has halted trading of a company after its stock boomed by over 2,000% following a recently announced crypto treasury pivot.\nDigital advertising firm QMMM Holdings earlier this month announced a plan to buy Bitcoin, Ethereum, and Solana—causing an explosion in the price of its stock. In September alone, its price has risen by more than 2,100%, according to Yahoo Finance data, finishing Friday at a price of $119.40.\nBut Wall Street's biggest regulator said Monday that it was suspending trading of the security until October 10 as it investigates \"potential manipulation\" of the stock.\n\"The Commission temporarily suspended trading in the securities of QMMM because of potential manipulation in the securities of QMMM effectuated through recommendations, made to investors by unknown persons via social media to purchase the securities of QMMM, which appear to be designed to artificially inflate the price and volume of the securities of QMMM,\" the statement from the SEC read.\nDecrypt reached out to the SEC and QMMM Holdings for comment, but did not immediately receive a response from either party.\nRegulators Eye Stock Jumps Before Corporate Crypto Buys: WSJ\nHong Kong-based QMMM Holdings said at the start of the month that its treasury will initially start with $100 million worth of cryptocurrency.\nThe SEC's announcement comes as regulators pay closer attention to digital asset treasuries—companies that buy cryptocurrency with spare cash. Last week, the Wall Street Journal reported that the SEC and the Financial Industry Regulatory Authority, or FINRA, had contacted companies after identifying unusual trading activity.\nA number of companies have bought cryptocurrencies like Bitcoin, Ethereum, and Solana to get better returns for shareholders. Such firms have often seen their share prices soar—albeit sometimes briefly—after announcing crypto treasury pivots."
            },
            {
                "title": "SEC Chair Excited To See Securities Traded On-Chain — But What Does It Mean For Your Bitcoin Wallet? - Bitcoin Magazine",
                "source": "Bitcoin Magazine",
                "url": "https://bitcoinmagazine.com/politics/sec-crypto-policy-chairman-atkins-vague-on-wallet-rules",
                "body": "Today, in a media scrum after his opening remarks at the SEC-CFTC Roundtable on Regulatory Harmonization Efforts, U.S. Securities and Exchange Commission (SEC) chairman Paul Atkins expressed his excitement in regard to bringing tokenized securities on-chain, though he didn’t offer any insight into what platforms or protocols these assets might trade on.\nThe latter may be particularly important to Bitcoin enthusiasts, because the wallets that you use to trade tokenized securities on-chain will likely require identifying information, and such a rule could spill over to bitcoin wallets.\nSo, I asked the chairman what securities coming on-chain looked like to him: Would it look like gated platforms like Fidelity and Charles Schwab employing blockchain to settle transactions on the back end or would it look more like tokenized stocks trading on decentralized exchanges?\nHe did not respond to my questions directly.\nHe instead first shared how securities trading on blockchains can reduce settlement time.\n“The great thing about tokens [is that] you can have payment and exchange of the actual asset online at the same time — it’s T zero, basically instantaneous clearance,” Chairman Atkins told me.\nAnd he followed up this statement with some mildly concerning language.\n“So, maybe we’ll have to even build in like a speed bump to make sure that we don’t have any mistakes or wire money to the wrong place,” the chairman added. “We will be working realistically for the next year or two to try to get where we have good guardrails around the system.”\nWords like “speed bump” and “guardrails” triggered alarm bells, as they indicate some form of control, and where there’s control, there’s often KYC.\nIf tokenized securities end up trading within the walled gardens of traditional brokerages, then the issue of KYC isn’t so concerning, as these platforms already KYC their customers.\nThe issue becomes more critical if tokenized securities can be traded through protocols like Uniswap via wallets like MetaMask and Trust Wallet, which would then likely be required to KYC their users.\nIf this happens, it begs the following questions: Will this lead to all crypto wallets having to KYC their users? Will this rule eventually bleed over to bitcoin-only wallets?\nBased on my interaction with the chairman, I got the impression that he doesn’t currently have the answers to these questions. That is, he wasn’t being evasive as much as he genuinely didn’t seem to know exactly what the broader picture around tokenized securities looks like right now, as he’s waiting for Congress to act.\nMuch regarding crypto market regulation hangs in the balance as the Senate discusses and revises the CLARITY Act (CLARITY), the digital asset market structure bill. The chairman stated that he’s paying attention to CLARITY as it works its way through the legislative process.\n“There’s the market structure act that cleared the House and is now [being discussed] in the Senate,” he told me. “We’ll see what happens.”\nBitcoin Magazine will follow up with Chairman Atkins on this issue when and if CLARITY passes.\nIn the meantime, if you want to protect your right to use you bitcoin wallet privately and permissionlessly, be sure to contact your elected officials as part of the Satoshi Needs You campaign."
            },
            {
                "title": "What Is the Future of Bitcoin Halving (Next Cycle)? - Blockchain Council",
                "source": "Blockchain Council",
                "url": "https://www.blockchain-council.org/bitcoin/future-of-bitcoin-halving/",
                "body": "- Michael Willson\n- September 29, 2025\nBitcoin halving is one of the most important events in the crypto world. It reduces the number of new bitcoins entering circulation and shapes how miners, investors, and institutions behave. The last halving happened on April 20, 2024, when the reward dropped from 6.25 BTC to 3.125 BTC per block. The next halving is expected in 2028, cutting rewards again to 1.5625 BTC. If you’re interested in how such milestones connect with modern investing strategies, the AI powered investing certification helps explain how events like halving influence market cycles and long-term planning.\nWhat Is Bitcoin Halving\nBitcoin halving occurs every 210,000 blocks, which is about every four years. It reduces the block reward that miners receive for validating transactions. This design ensures that Bitcoin supply grows at a predictable pace and gradually slows over time. The maximum supply is capped at 21 million coins, and halving events are the mechanism that gets us there.\nWhy Halving Matters\nHalving events make Bitcoin scarcer by cutting the pace of new supply. If demand stays steady or increases, this can create upward pressure on price. In the past, halvings have often been followed by long bull runs, though the timing and intensity vary.\nBut halving doesn’t just affect investors. Miners also feel the impact. Since rewards are cut, their profitability depends heavily on Bitcoin’s price and their ability to run efficient operations.\nLooking Ahead to the Next Cycle\nSupply and Demand\nBy 2028, the reward will be just 1.5625 BTC. The supply side effect will still matter, but less than in earlier cycles because the total circulating supply is much larger now. That means macroeconomic factors and demand from institutions may play an even bigger role than before.\nInstitutional Adoption\nThe rise of spot Bitcoin ETFs and growing interest from traditional finance could shape the market more than the halving itself. Some analysts believe the next bull cycle may stretch into 2026 or 2027, instead of peaking right after halving as earlier patterns suggested.\nMiner Economics\nMining will become harder for smaller players. With lower rewards, miners with high energy costs may shut down. Larger, more efficient mining operations, often using renewable or surplus energy, are more likely to survive. This could lead to industry consolidation.\nNetwork Security\nAs rewards decline, transaction fees and layer-2 solutions will become more important to sustain miner incentives. If fees don’t grow fast enough, there could be short-term dips in hash rate, though historically the network has recovered.\nRisks and Challenges\nBitcoin halving does not guarantee price increases. Its impact may be weaker in the future as the reduction in new supply becomes a smaller fraction of total supply. Market behavior could be influenced more by regulation, monetary policy, and global economic shifts.\nMiner capitulation is another risk. If rewards drop sharply without matching price growth, weaker miners may be forced out. While this has happened before, it usually results in a stronger, more efficient mining sector.\nFor those who want to understand the data behind cycles and risk, a Data Science Certification can provide the analytical skills needed to evaluate trends and market signals.\nThe Bigger Picture\nBitcoin halving highlights the connection between scarcity and value. For long-term investors, it is a reminder of Bitcoin’s design as a deflationary asset. For businesses and marketers exploring how such events shape user behavior and market adoption, the Marketing and Business Certification provides the tools to connect technological milestones with strategy. And for those eager to understand blockchain at its core, blockchain technology courses are a strong starting point.\nIf you want to trade cycles or position yourself around major events like halvings, practical skills from the Crypto certification can give you the structure to do so more con"
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "194.4600",
            "open": "4,050.1500",
            "close": "4,227.5900",
            "high": "4,236.4700",
            "low": "4,042.0100"
        },
        "market_summary": "Regulatory scrutiny is intensifying around companies announcing crypto treasury purchases, as evidenced by the SEC halting trading for QMMM Holdings due to potential market manipulation. Concurrently, Ethereum is facing technical pressure, struggling to maintain its crucial $4,000 support level amidst broader market weakness. This has driven investor interest toward diversification into newer DeFi projects like Mutuum Finance, which is seeing robust presale participation as an alternative for portfolio growth.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "SEC Halts Trading of Bitcoin, Ethereum Treasury Firm QMMM After 2,000% Stock Surge - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/sec-halts-trading-bitcoin-ethereum-192325946.html",
                "body": "The Securities and Exchange Commission has halted trading of a company after its stock boomed by over 2,000% following a recently announced crypto treasury pivot.\nDigital advertising firm QMMM Holdings earlier this month announced a plan to buy Bitcoin, Ethereum, and Solana—causing an explosion in the price of its stock. In September alone, its price has risen by more than 2,100%, according to Yahoo Finance data, finishing Friday at a price of $119.40.\nBut Wall Street's biggest regulator said Monday that it was suspending trading of the security until October 10 as it investigates \"potential manipulation\" of the stock.\n\"The Commission temporarily suspended trading in the securities of QMMM because of potential manipulation in the securities of QMMM effectuated through recommendations, made to investors by unknown persons via social media to purchase the securities of QMMM, which appear to be designed to artificially inflate the price and volume of the securities of QMMM,\" the statement from the SEC read.\nDecrypt reached out to the SEC and QMMM Holdings for comment, but did not immediately receive a response from either party.\nRegulators Eye Stock Jumps Before Corporate Crypto Buys: WSJ\nHong Kong-based QMMM Holdings said at the start of the month that its treasury will initially start with $100 million worth of cryptocurrency.\nThe SEC's announcement comes as regulators pay closer attention to digital asset treasuries—companies that buy cryptocurrency with spare cash. Last week, the Wall Street Journal reported that the SEC and the Financial Industry Regulatory Authority, or FINRA, had contacted companies after identifying unusual trading activity.\nA number of companies have bought cryptocurrencies like Bitcoin, Ethereum, and Solana to get better returns for shareholders. Such firms have often seen their share prices soar—albeit sometimes briefly—after announcing crypto treasury pivots."
            },
            {
                "title": "Can Ethereum (ETH) Bulls Defend $4,000? Market Weakness Targets ETH, But 1 DeFi Altcoin Could Save Portfolios - Mitrade",
                "source": "Mitrade",
                "url": "https://www.mitrade.com/insights/news/live-news/article-3-1158908-20250930",
                "body": "With Ethereum (ETH) facing pressure at the $4,000 level, investors are holding their breath to see if bulls can keep holding on against mounting market vulnerability. While ETH remains the pillar of the crypto market, shrewd traders are looking at alternatives to save and build up their portfolios. One top choice is Mutuum Finance (MUTM), a fast-rising DeFi altcoin that costs only $0.035. The project is still in presale phase 6 which is over 50% sold out.\nIt has already raised over $16.52 million in presale, with over 16,640 holders. With its dual lending system, staking rewards that can be adjusted, and real-world utility of decentralized borrowing and lending, Mutuum Finance offers both stability and the opportunity for high growth, which makes it a strategic holding asset for diversification and consolidation of crypto assets during turbulent times.\nEthereum (ETH) fell below $4,060, with fear of the bulls being able to maintain the crucial $4,000 support. A bear cross is bright warning lights, the analysts eyeing $3,750 as the next important support, and a potential fall to $3,350 should that be broken. But with the asset appearing oversold, a strong bounce can be in the cards if buying momentum is re-established. While investors weigh the pro and con of the next ETH move, others are also starting to explore newer possibilities in decentralized finance that can add to their strategies, with one such newer project, Mutuum Finance, gaining increasing interest.\nMUTM tokens are currently valued at $0.035 in presale phase 6, a 16.17% raise from the previous round. Interest among investors remains remarkably robust with more than 16,640 investors pumping in more than $16.52 million of invested capital thus far.\nTo enhance the security of the platform even more, Mutuum Finance has introduced a $50,000 USDT Bug Bounty Program where they invite white-hat researchers and developers to identify bugs. These will be categorized into four levels of severity, i.e., critical, major, minor, and low, for sensitive identification and immediate patching of possible vulnerabilities.\nMutuum protocol is founded on good collateral management as a measure to protect the users and the ecosystem. Some of the most important safety features include infinite collateral ratios, loan limits, and deposit limits. Undercollateralized positions are quickly closed, and penalties and remediation fees stabilize the platform and minimize systemic risk.\nThe most important concept at Mutuum Finance is efficiency. Through the optimization of Loan-to-Value (LTV) ratios and, in particular, overcollateralized positions, the protocol makes the most out of capital while providing great protection. Reserve requirements act as a market shock absorber, and excess reserves can be invested profitably in riskier assets to hedge volatility.\nMutuum Finance seeks to redefine DeFi in three dimensions: long-term viability, trustworthiness, and usability. Through a scalable and secure borrowing and lending platform, the platform is democratizing decentralized finance for retail and institutional customers.\nAs an appreciation for its growing community, the team has also started a $100,000 giveaway where 10 winners will receive $10,000 worth of MUTM tokens. The action is one of the means of showing that Mutuum values rewarding the project’s first adopters and raising awareness about the cause.\nEthereum’s inability to hold above the $4,000 level is an indication of the angst which has the broader crypto universe in its thrall but also the rising trend towards diversification into high-growth DeFi plays. Mutuum Finance (MUTM) is fast emerging as one of the most promising alternatives, with strong security, good collateral management, and real-world practical utility to provide impressive growth potential. At over $16.52 million raised, with over 16,640 investors participating, and tokens yet available for purchase at a cheap rate of $0.035, momentum is clearly building. The moment to in"
            },
            {
                "title": "Ethereum-Based DeFi Crypto Mutuum Finance (MUTM) Reaches 50% Completion in Phase 6 - markets.businessinsider.com",
                "source": "markets.businessinsider.com",
                "url": "https://markets.businessinsider.com/news/currencies/ethereum-based-defi-crypto-mutuum-finance-mutm-reaches-50-completion-in-phase-6-1035230554",
                "body": "Dubai, UAE, September 29th, 2025, FinanceWire\nMutuum Finance (MUTM), a DeFi project built on Ethereum, has hit a notable milestone in its presale journey. Phase 6 is now halfway complete, with more than 50% of the tokens allocated at this stage already taken up by investors. Despite the uncertainty hanging over the broader crypto market, the steady progress highlights the project and its vision to bring new options for decentralized lending and borrowing.\nThe Future of Lending and Borrowing in Crypto\nAt the heart of Mutuum Finance is a dual-market system that gives users two different ways to lend and borrow. The first is the Peer-to-Contract (P2C) model, where people can deposit assets into shared liquidity pools and earn interest in return. For example, someone who supplies BNB would receive mtBNB, a token issued one-to-one with their deposit that grows in value as interest builds.\nAlongside this, Mutuum also offers a Peer-to-Peer (P2P) marketplace, where borrowers and lenders can connect directly and set custom terms. A borrower could, for instance, post BTC as collateral and borrow USDT, allowing them to unlock liquidity while still holding onto their BTC in case its price rises. This flexibility makes it easier for borrowers to access funds and gives lenders multiple ways to generate yield.\nPresale Progression and Investor Interest\nMutuum Finance’s presale has been structured to reward early participation. The token began at $0.01 in Phase 1 and has already risen to $0.035 in the current Phase 6, a 250% increase. With the launch price set at $0.06, buyers entering today could still see close to a 2x gain by the time of listing.\nSo far, over $16.6 million has been raised, more than 730 million tokens have been sold, and the project has onboarded more than 16,650 holders. The approaching Phase 7 will potentially lift the price to $0.04, nearly 20% higher than current levels, continuing the step-based structure that has underpinned the project’s momentum.\nTo drive engagement beyond the presale, Mutuum Finance has launched several community-focused initiatives. A dashboard allows investors to monitor their token holdings and calculate potential ROI, while a Top 50 leaderboard rewards the largest contributors with additional MUTM tokens at launch.\nIn addition, a $100,000 giveaway remains active, giving all investors a chance to win one of ten $10,000 prizes in MUTM tokens. These initiatives add further incentives for participation while strengthening the project’s early community base.\nUpcoming Updates and Security Measures\nThe team behind Mutuum Finance recently hinted at an update on X (formerly Twitter), suggesting new roadmap details and development milestones will be shared soon. According to the roadmap, the platform is set to launch simultaneously with the token’s exchange listing, a move that could improve liquidity and visibility from day one.\nSecurity has also been a priority. Mutuum Finance successfully completed a CertiK audit, achieving a Token Scan score of 90/100, placing it among the better-rated DeFi projects reviewed by the firm. A $50,000 bug bounty program further encourages developers to test the code and strengthen the system before launch.\nWith Phase 6 now half completed, Mutuum Finance (MUTM) is closing in on its next price increase. From its $0.01 starting point to today’s $0.035, the token’s presale has already shown strong appreciation. As Phase 7 approaches with a nearly 20% price rise on the horizon, the combination of fundraising success, audited security, and a clear roadmap continues to drive the project.\nAbout Mutuum Finance (MUTM)\nMutuum Finance is a DeFi project focused on creating flexible markets for lending and borrowing. The platform uses pooled markets and a peer-to-peer layer, giving users multiple ways to earn yield or access liquidity. Its native token, MUTM, is in an ongoing presale that has already raised over $16.6 million, with Phase 6 now 50% complete at $0.035.\nFor more informat"
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "9.8500",
            "open": "206.7000",
            "close": "214.3100",
            "high": "214.4000",
            "low": "204.5500"
        },
        "market_summary": "Solana is experiencing a significant influx of institutional capital and development, highlighted by the $2.5 billion Keel protocol launch from the Sky ecosystem to boost DeFi and RWAs. This is complemented by strong on-chain activity, with DEXs like HumidiFi achieving record-breaking volumes. However, these positive fundamentals are currently being offset by a sharp price correction, weakening ecosystem metrics, and investor rotation into newer, high-yield assets, creating a complex short-term outlook.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Keel Debuts as Sky's Solana-Focused 'Star' With a $2.5B Roadmap to Boost RWAs and DeFi - CoinDesk",
                "source": "CoinDesk",
                "url": "https://www.coindesk.com/business/2025/09/29/keel-debuts-as-sky-s-solana-focused-star-with-a-usd2-5b-roadmap-to-boost-rwas-and-defi",
                "body": "- Back to menuPrices\n- Back to menuResearch\n- Back to menu\n- Back to menu\n- Back to menu\n- Back to menuWebinars\nKeel Debuts as Sky's Solana-Focused 'Star' With a $2.5B Roadmap to Boost RWAs and DeFi\nThe new protocol will channel USDS stablecoin reserves into Solana-based lending markets and real-world asset strategies.\nWhat to know:\n- Keel debuts on Solana with a roadmap to deploy as much as $2.5 billion into DeFi and RWA markets.\n- The new protocol will receive an allocation from Sky’s USDS stablecoin reserves to deploy to Solana-based DeFi apps such as Kamino, Jupiter and Raydium.\n- Keel joins Spark and Grove as the third autonomous unit, or \"star,\" of the Sky ecosystem, formerly known as MakerDAO.\nKeel, a new Solana-native capital allocator, debuted on Tuesday with a roadmap to channel up to $2.5 billion across decentralized finance (DeFi) and tokenized asset markets in the\nKeel is structured as being part of the Sky ecosystem, the long-running DeFi protocol formerly known as MakerDAO, as one of its autonomous units called \"stars.\" That's part of Sky's major overhaul dubbed Endgame that includes creating smaller units, each of which is responsible for its own governance and innovation at the edge of the ecosystem. Sky is centered around issuing the USDS (USDS) and\nSpark, the first of Sky's stars, has grown to more than $10 billion in total value locked (TVL) on Ethereum while allocating funds to over $1 billion in tokenized assets. Grove, the second unit launched earlier this year, is focused on collateralized loan obligations.\nKeel's mandate is acting as an on-chain capital allocator that sits between Solana DeFi protocols and the broader stablecoin economy. It receives a dedicated balance sheet from the USDS stablecoin reserves to deploy and support Solana-native protocols to generate yield. Early integrations include Kamino, Jupiter and Raydium, Solana-hosted marketplaces where liquidity can serve as a foundation for lending markets, routing and liquidity pools.\n\"Keel was founded on the belief that the next phase of on-chain finance growth needs more than new assets alone; it needs liquidity that can be accessed at speed and scale,\" said Cian Breathnach, CEO of Matariki Labs and a contributor to Keel. \"Keel is the first to provide these enablers on Solana, delivering the capital and catalyzing force for the next stage of growth in on-chain lending, borrowing, tokenization and more.\"\nKeel's plan could also help attract more tokenized real-world assets (RWA) to the Solana space, a fast-growing sector that aims to use blockchain rails to move and settle traditional financial assets like bonds, commodities and stocks.\nLily Liu, president of the Solana Foundation, called Keel \"a key step\" in positioning the blockchain as a leading marketplace for internet-scale capital markets. Rune Christensen, co-founder of Sky, added that Keel is set to become the largest capital allocator on Solana and will play a key role in shaping the DeFi and RWA landscape.\nRead more: Blockchain-Based RWA Specialists Bring $50M to Apollo's Tokenized Credit Strategy\nMore For You\nCrypto Compliance Firm Notabene Introduces Platform for Stablecoin Payments\nNotabene Flow introduces pull payments and recurring subscriptions for cross-border stablecoin transactions.\nWhat to know:\n- The platform builds on Notabene’s network of 2,000+ regulated entities processing $1.5 trillion annually.\n- Notabene Flow introduces pull payments, recurring billing and standardized coordination between verified participants.\n- Founding partners include Zodia Custody, Bitso, Gnosis and Borderless."
            },
            {
                "title": "Humidifi on Solana: How This DEX is Redefining DeFi with Dark Pools - OKX",
                "source": "OKX",
                "url": "https://www.okx.com/en-us/learn/humidifi-solana-dex-dark-pools",
                "body": "Humidifi on Solana: How This DEX is Redefining DeFi with Dark Pools\nIntroduction to Humidifi, Solana, and the Rise of Dark Pools\nThe decentralized finance (DeFi) ecosystem on Solana is undergoing a transformative evolution, with HumidiFi emerging as a pivotal player. As a dark pool decentralized exchange (DEX), HumidiFi is redefining trading by leveraging Solana's high-performance blockchain. With record-breaking trading volumes and innovative features, HumidiFi is challenging traditional automated market makers (AMMs) and reshaping the Solana DEX landscape. This article delves into HumidiFi's impact, the advantages of dark pools, and the broader implications for the DeFi ecosystem.\nHumidifi's Record-Breaking Growth and Market Momentum\nHumidiFi has rapidly established itself as a dominant force in the Solana DeFi ecosystem. The platform recently achieved a remarkable $8.55 billion in weekly trading volume, surpassing established DEXs like Meteora and Raydium. Additionally, it set a daily trading volume record of $1.91 billion, underscoring its rapid growth and increasing market momentum.\nThis explosive growth highlights the platform's innovative approach and the rising demand for privacy-focused trading solutions. By catering to high-volume traders with unique features, HumidiFi is carving out a distinct niche in the competitive DEX market.\nWhat Are Dark Pools and Why Are They Transformative?\nDark pools are private trading venues that allow users to execute large orders without revealing their intentions to the broader market. This approach offers several key advantages:\nReduced Slippage: Large orders can be executed without significantly impacting market prices.\nFront-Running Protection: By keeping trade details private, dark pools shield traders from front-running attacks, where malicious actors exploit pending transactions for profit.\nHumidiFi leverages these benefits to attract high-volume traders, making it a preferred choice for those seeking efficient and secure trade execution. This privacy-focused model is particularly appealing in the fast-paced world of DeFi.\nHow Humidifi Stands Out Among Solana DEXs\nTraditional Solana DEXs like Meteora and Raydium rely on passive liquidity models, where liquidity providers earn fees by supplying assets to pools. While effective, these models are prone to challenges such as impermanent loss and arbitrage bot exploitation.\nHumidiFi, on the other hand, employs an active liquidity model. This dynamic approach optimizes trade execution, reduces losses from arbitrage, and offers better pricing for traders. As a result, HumidiFi is steadily capturing market share from traditional AMMs, signaling a paradigm shift in the Solana DeFi ecosystem.\nThe Role of Aggregators Like Jupiter in Boosting Humidifi\nTrade aggregators like Jupiter play a crucial role in driving volume to platforms like HumidiFi. By analyzing pricing efficiency across multiple exchanges, these aggregators ensure users receive the best possible rates. For HumidiFi, this means increased visibility and trading volume, as Jupiter routes high-value trades to its dark pool for optimal execution.\nThis symbiotic relationship underscores the importance of technical infrastructure in the success of dark pools and their ability to compete with traditional DEXs.\nSolana's Technical Edge: A Catalyst for Humidifi's Success\nHumidiFi's success is deeply tied to the technical capabilities of the Solana blockchain. Key advantages include:\nHigh Throughput: Solana processes thousands of transactions per second, ensuring fast and efficient trade execution.\nLow Transaction Fees: Minimal fees make it cost-effective for traders to execute large orders.\nThese features position Solana as an ideal platform for advanced trading models like dark pools, enabling platforms like HumidiFi to thrive in a competitive market.\nChallenges and Regulatory Concerns for Dark Pools\nWhile dark pools offer numerous benefits, they also face challenges and potential regul"
            },
            {
                "title": "Solana (SOL-USD) Under Pressure as Bears Test $197 and Investors Rotate Into High-ROI Tokens - TradingNEWS",
                "source": "TradingNEWS",
                "url": "https://www.tradingnews.com/news/solana-price-forecast-sol-usd-dips-20-percent-to-197-usd-as-ecosystem-activity-wekens",
                "body": "Solana Price Forecast - SOL-USD Dips 20% to $197 as Ecosystem Activity Weakens, ETF Decision Becomes Key Catalyst\nWith $11.4B in daily volume and $17.1B futures open interest, SOL faces a critical test at $197 support — will ETF inflows drive a return to $250, or will bears drag it down to $165? | That's TradingNEWS\nSolana (SOL-USD) Under Pressure as Bears Test $197 and Investors Rotate Into High-ROI Tokens\nMacro Forces Driving the Latest Solana Slide\nSolana (SOL-USD) has come under heavy selling pressure in the final week of September, slipping to $197.20, down more than 20% week-on-week. The drop mirrors the broader crypto pullback, with over $150 billion erased from global market cap as Bitcoin slid under $110,000. Macroeconomic stress—U.S. shutdown risks, looming inflation data, and a massive options expiry—created a risk-off tone that amplified liquidations across major altcoins, Solana included.\nSOL Token Activity Weakens With Ecosystem Data Flashing Red\nBeyond the macro backdrop, Solana’s internal ecosystem is showing cracks. Weekly token launches have plunged to their lowest level since October 2024, undermining the speculative energy that historically drove SOL higher. The sharp slowdown in new token creation translates to reduced demand for Solana as gas and staking collateral, pulling utility-driven buying power out of the market.\nAccording to DeFiLlama, Solana’s total value locked slipped from $13 billion to $10.77 billion in just one week, while daily transaction volumes slid another 11%, underscoring waning momentum.\nDerivatives Market Highlights Investor Jitters\nAt the same time, Solana’s derivatives market has been volatile. Open interest in futures reached a record $17.1 billion as of September 20, only to face a wave of forced liquidations when the spot price broke below $200. Hundreds of millions in leveraged long positions were wiped out, sparking a chain of stop-loss triggers. Yet open interest levels remain elevated, meaning speculative capital is still parked in SOL futures despite the downside flush.\nFunding rates flipping positive at +0.0043% signal leveraged traders are again leaning bullish, though momentum remains fragile with the Relative Strength Index hovering below 40 and MACD still tilted bearish.\nInstitutional Flows Provide a Contradictory Signal\nEven with price weakness, institutional flows into Solana-linked products remain notable. Europe’s Bitwise Solana ETF drew $60 million shortly after launch, while REX-Osprey’s Solana staking ETF added $12 million in inflows. In the U.S., multiple heavyweight asset managers including Fidelity, Franklin Templeton, and Grayscale have filed for Solana staking ETFs, with decisions expected in mid-October. Approval could act as a major catalyst, unlocking new sources of demand and potentially driving SOL back toward the $230–$250 band.\nPantera Capital has already highlighted Solana as “next in line” for an institutional moment after Ethereum’s ETF success.\nInvestor Rotation Into Bitcoin Hyper and New Presales\nAs Solana fights to defend the $185–$190 support band, speculative traders have started rotating capital toward newer high-ROI narratives. Bitcoin Hyper, still in presale at $0.012975, has raised over $18.3 million and offers staking yields of 64% APY. Its pitch as Bitcoin’s first Layer-2 with smart contract functionality has drawn whale accumulation and diverted attention from Solana’s recent slump. With projected upside of 2,300% toward $0.32, HYPER has become a clear competitor for speculative capital once funneled into Solana-based meme tokens.\nRead More\n-\nQQQ ETF Holds $486 as Nasdaq-100 Rallies to 22,631 — Tech Mega-Caps Power 38% Yearly Gains\n29.09.2025 · TradingNEWS ArchiveStocks\n-\nXRP ETFs on Nasdaq Rally — XRPR at $24.33, XRPI $17.55 as SEC Reforms Fuel Inflows\n29.09.2025 · TradingNEWS ArchiveCrypto\n-\nNatural Gas Price Forecast (NG=F) Drops to $2.88 as Oversupply, Record U.S. Storage, and EU Sanctions Pressure Prices\n29.09.2025 · TradingNEWS "
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "343.250",
            "open": "46,295.440",
            "close": "46,309.570",
            "high": "46,509.040",
            "low": "46,165.790"
        },
        "market_summary": "The Dow Jones Industrial Average (US30) showed mixed performance, with the index edging down slightly despite broader market gains led by a surge in tech stocks, particularly AI-focused companies like Nvidia and Oracle. Investor sentiment is being tempered by near-term uncertainties, including the threat of a U.S. government shutdown and the impending jobs report, which could influence Fed policy. However, strong sector performances and positive monthly gains suggest underlying confidence remains.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "Stock Market Today: Dow Up Despite Shutdown Worries; These Stocks Fall On Trump Tariff Threat - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-sp500-nasdaq-jobs-report-tesla-tsla-stock-deliveries/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #fc6dd55b-9dc0-11f0-a8e8-9b36c81ccf66"
            },
            {
                "title": "U.S. stock markets opened the week mostly higher: Dow, S&P 500, and Nasdaq surged today as tech stocks led - The Economic Times",
                "source": "The Economic Times",
                "url": "https://m.economictimes.com/news/international/us/u-s-stock-markets-opened-the-week-mostly-higher-dow-sp-500-and-nasdaq-surged-today-as-tech-stocks-led-gains-investors-closely-watch-september-jobs-report-and-looming-government-shutdown/amp_articleshow/124215745.cms",
                "body": "U.S. stock market today: Dow, S&P 500, and Nasdaq surged today as tech stocks led gains\nSynopsis\nU.S. stock markets started the week mostly higher. The S&P 500 rose about 0.4%, closing near 6,672 points. The Nasdaq Composite led with a 0.8% gain, fueled largely by strong performances in artificial intelligence (AI) and tech companies like Nvidia and Oracle. The Dow Jones Industrial Average edged down slightly by 0.07%, reflecting mixed sector-by-sector sentiment.\nTechnology stocks, particularly those related to artificial intelligence, were the main drivers of today’s market momentum. Companies like Nvidia and Oracle saw noticeable gains as investors bet on continued growth in AI and cloud computing services.\nInvestors are also keeping a close eye on the government shutdown looming if Congress doesn’t approve funding by the Tuesday deadline. A shutdown could halt some federal operations and delay key economic data releases, adding an extra layer of caution to trading decisions.\nAnother focus for traders is the upcoming jobs report. Economists expect moderate growth with about 43,000 new jobs added and an unemployment rate around 4.3%. The report’s outcome could influence interest rate expectations and overall market sentiment.\nOther sectors, such as healthcare, energy, and consumer goods, showed steady performance today. Energy stocks, in particular, benefited from rising oil and gas prices, while healthcare and consumer goods provided stability amidst uncertainty.\nDespite the short-term uncertainty, September has been a positive month for markets. The S&P 500 is up approximately 2.8%, the Dow Jones has gained 1.5%, and the Nasdaq is ahead around 2.9%, suggesting that investor confidence remains intact for now.\nThe three main U.S. stock indexes showed mixed performance today.\n- S&P 500: Rose by 0.42% and closed near 6,672 points.\n- Nasdaq Composite: Led the gains, climbing about 0.8%, boosted by strong tech stock performance.\n- Dow Jones Industrial Average: Opened higher but slipped slightly, down 0.07% to 46,217 points.\nTech companies, especially those in artificial intelligence (AI) and software, are leading today’s gains. Stocks like Nvidia and Oracle saw notable increases.\nInvestors see AI and cloud technology as long-term growth drivers. Strong earnings reports or positive forecasts from these companies can quickly lift indexes, especially the Nasdaq.\nTop U.S. stocks showing strong performance today include major tech and AI-related names leading gains:\n- Nvidia (NVDA) continues to rally with a 29.7% gain year-to-date, fueled by AI growth.\n- Oracle, another key tech stock, saw noticeable gains as cloud computing demand remains strong.\n- Palantir Technologies (PLTR) leads among the best-performing stocks in 2025, with over 107% gains year-to-date.\n- Newmont Corp. (NEM), Seagate Technology (STX), and GE Vernova (GEV) are also among top performers with significant gains of around 86% to nearly 100% year-to-date.\n- Energy stocks like Phillips 66 (PSX) show strength with improving earnings estimates.\n- On the income stock front, CION Investment Corporation with a 14.9% dividend yield and Grupo CIBEST (CIB) with strong earnings growth are notable.\nHow Does the Government Shutdown Affect Investors?\nThe U.S. government is on the brink of a shutdown if Congress doesn’t approve funding by midnight Tuesday. This uncertainty is making investors nervous.A shutdown could temporarily halt some government services and delay economic data releases. That includes the September jobs report, which many traders are watching closely.\nEven though a shutdown might not last long, it can increase short-term market volatility. Investors often adjust their positions to avoid sudden losses.\nWhat Should We Expect From the Jobs Report?\nThe upcoming jobs report is highly anticipated. Economists expect around 43,000 new jobs in September, with the unemployment rate holding steady near 4.3%.A balanced report—neither too strong nor too weak—can reassure in"
            },
            {
                "title": "US Stock Markets Today: Nasdaq Edges Higher As AI Stocks Nvidia, Oracle Jump In Early Trade - NDTV Profit",
                "source": "NDTV Profit",
                "url": "https://www.ndtvprofit.com/markets/us-stock-markets-today-sp-500-dow-jones-extend-gains-as-ai-stocks-oracle-nvidia-recover",
                "body": "US Stock Markets Today: Nasdaq Edges Higher As AI Stocks Nvidia, Oracle Jump In Early Trade\nUS Stock Markets Today: Nvidia rose over 2%, and Oracle was up nearly 1% in early trade.\nThe Wall Street opened higher on Monday, with stocks of AI players like Oracle and Nvidia jumping in early trade. Minutes into the trade, the Dow Jones Industrial Average rose 80.64 points or 0.17%, S&P 500 also rose over 0.39%, and Nasdaq was up 0.66%. Nvidia rose over 2%, Oracle was up nearly 1%.\nUS stocks fell last week amid uncertainty surrounding the AI stocks. The S&P and Nasdaq posted its worst weekly performance since early August. Dow Jones also posted is first loss in over three weeks. However, the indices marked some recovery on Friday.\nGlobal stocks are poised to extend their rally through year-end, driven by a resilient US economy, supportive valuations and a more dovish Fed stance, Goldman Sachs Group Inc. strategists told Bloomberg.\n“Good earnings growth, Fed easing without a recession and global fiscal policy easing will continue to support equities,” a team led by Christian Mueller-Glissmann wrote in a note said Bloomberg. “With anchored recession risk, we would buy dips in equities into year-end.”\nIn the early minutes of trading, four of the 11 sectoral indices was trading in green. Energy sector led the decline, while information technology sector was in green.\nWalt Disney Corp., Microsoft Corp. and Walt Disney Co. were amongst the gainers for the day. On the other hand, Boeing Co., McDonald's Corp., Apple Inc., Intel Corp. were in the red.\nAs the US market opened, spot gold rose 1.6% to $3,821.73 an ounce after hitting record high. Crude oil prices rose, with the West Texas trading 2.6% lower at $64.04 per barrel.\nThe Bloomberg Dollar Index fell 0.3%, with the British Pound rising 0.3% at $1.3446 and the Japanese yen at 148.67 per dollar. Bitcoin, the largest traded cryptocurrency was up 1.2% at $112,217.39."
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "73.000",
            "open": "9,317.140",
            "close": "9,305.690",
            "high": "9,363.140",
            "low": "9,290.140"
        },
        "market_summary": "The FTSE 100 edged higher, supported by gains in the pharmaceutical sector from companies like GSK and AstraZeneca. However, the overall mood was cautious as investors parsed mixed economic data, including a stronger-than-expected money supply figure alongside a dip in mortgage approvals. Attention remains focused on upcoming fiscal policy signals and economic data for clearer direction.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "UK Stocks Edge Up As Policy Signals Keep Investors Guessing - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/uk-stocks-edge-up-as-policy-signals-keep-investors-guessing",
                "body": "FTSE 100 rose with attention on fiscal changes and fresh economic data, while pharma moves and credit numbers added more to the mix.\nabout 14 hours ago • 1 min\nJoin the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nUK stocks edged up on Monday, with the FTSE 100 rising 0.31% as investors watched for fiscal clues and reacted to headline moves in the pharma sector.\nWhat does this mean?\nThe FTSE 100’s uptick reflected investors parsing hints about upcoming tax and spending policies ahead of a key budget and a closely watched Chancellor speech. With even minor government tweaks able to steer inflation and growth expectations, market participants stayed alert. Bank of England data added another layer: UK M4 money supply outpaced forecasts with a 0.4% rise in August, suggesting more liquidity, while consumer credit climbed to £1.69 billion and mortgage approvals slowed but topped expectations. Pharma stocks like GSK, which jumped 2.25% on leadership news, and AstraZeneca, buoyed by cancer drug updates and potential listing changes, helped lift the market, showing how company news can offset broader uncertainty.\nWhy should I care?\nFor markets: Policy signals keep investors alert.\nStock and credit markets are in a watchful mood, with fiscal hints and central bank data shaping expectations on rates and growth. Resilience in the FTSE 100 and stronger consumer credit activity point to some underlying confidence, but the dip in mortgage approvals shows sensitivity to policy. Meanwhile, standout performances from pharma stocks highlight how company moves can offer some stability even as economic signals remain mixed.\nThe bigger picture: Economic shifts reshape the outlook.\nThis week’s fresh UK data—from GDP to housing—may set the tone for growth into the year’s end. Moves by global pharma companies like GSK and AstraZeneca underscore the UK’s pull for capital and innovation in a shifting landscape. These evolving fiscal, financial, and corporate trends influence not just short-term market moves, but where future investment and opportunity could land.\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nInsight\nStéphane Renevier, CFA • about 13 hours ago\nQuick Take\nAberdeen Group x Finimize • about 18 hours ago\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article is based on reporting by MT Newswires. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies."
            },
            {
                "title": "European Stocks Close On Positive Note After Cautious Session - RTTNews",
                "source": "RTTNews",
                "url": "https://www.rttnews.com/3578052/european-stocks-close-on-positive-note-after-cautious-session.aspx",
                "body": "European stocks closed slightly higher on Monday despite concerns over a potential U.S. government shutdown. A lack of positive triggers rendered the mood cautious and limited markets' upside.\nThe pan European Stoxx 600 gained 0.18%. The U.K.'s FTSE 100 and France's CAC 40 gained 0.16% and 0.13%, respectively. Germany's DAX edged up 0.02%, and Switzerland's SMI climbed 0.64%.\nAmong other markets in Europe, Belgium, Czech Republic, Denmark, Finland, Iceland, Netherlands, Portugal and Sweden closed on firm note. Austria and Greece edged up marginally.\nIreland, Norway, Russia and Turkiye ended weak, while Poland and Spain closed flat.\nIn the UK market, Antofagsta surged 5.3%. JD Sports Fashion closed 4.5% up. Admiral Grup and Berkeley Group Holdings gained 3.6% and 3.5%, respectively.\nMetlen Energy & Metals, Convatec Group, Persimmon, Babcock International, Anglo American Plc, GSK, Burberry Group, Croda International, WPP, Rio Tinto and Glencore moved up 2 to 2.5%.\nPharma stock GSK gained about 2.6%. The company has announced CEO Emma Walmsley will step down in January. Luke Miels is set to succeed him.\nAstraZeneca advanced 0.6%. The company has unveiled plans to upgrade its US listing by directly listing ordinary shares on the New York Stock Exchange.\nCoca-Cola HBC closed nearly 4% down. BP ended lower by about 2.5%. Rolls-Royce Holdings, Shell, BT Group and Weir Group also closed notably lower.\nIn the German market, Bayer, Rheinmetall, Vonovia, Volkswagen, Infineon and Mercedes-Benz gained 1 to 1.8%.\nHeidelberg Materials and Commerzbank lost more than 3%. Puma, Deutsche Bank, Gea Group, Siemens, Brenntag and Continental also closed notably lower.\nIn the French market, Kering climbed nearly 5%. Hermes International gained about 2.5%. Capgemini, Thales, LVMH, Unibail Rodamco, Stellantis and EssilorLuxottica also posted strong gains.\nTotalEnergies tumbled more than 2%. Societe Generale lost about 1.25%. Michelin, Veolia Environment, Legrand and Orange also closed weak.\nIn economic news, UK mortgage approvals declined in August and consumer credit remained flat, data from the Bank of England showed.\nThe number of mortgage approvals fell by 500 to 64,700 in August, below This was below the expected level of 65,000.\nSecured lending dropped by GBP 0.2 billion to GBP 4.3 billion in August after falling by GBP 0.9 billion in July.\nNet borrowing of consumer credit by individuals remained flat at GBP 1.7 billion in August.\nData showed that borrowing by large businesses increased at a faster pace of 8.6%, following an 8.1% rise in July.\nSimilarly, the annual growth rate of borrowing by small and medium-sized enterprises increased to 1.2%, which was the highest since August 2021.\na report from the European Commission showed the economic sentiment indicator in the Euro Area edged up to 95.5 in September from an upwardly revised 95.3 in August and slightly higher than market expectations of 95.2.\nEuro Area consumer confidence was at -14.9 in September, up from -15.5 in August and in line with the preliminary estimate.\nFor comments and feedback contact: editorial@rttnews.com\nMarket Analysis\nSeptember 26, 2025 14:42 ET Revised economic growth data for the second quarter and the Fed chief Jerome Powell’s speech were the highlights in the U.S. on a busy week for economic news. Housing market data also gained attention. Elsewhere, the Paris-based think tank OECD released its latest projection for the global economy that threw light on the impact of the U.S. trade tariffs. In Europe, the interest rate decision announcement by Switzerland’s central bank was in focus."
            },
            {
                "title": "LIVE: FTSE 100 and US stocks rise as Trump pledges tariffs on foreign movies and furniture - Yahoo",
                "source": "Yahoo",
                "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_12464597-c3d5-4108-a23d-5b846e8cb22e",
                "body": "Yahoo is part of the Yahoo family of brands.\nWhen you use our sites and apps, we use cookies to:\n- provide our sites and apps to you\n- authenticate users, apply security measures, and prevent spam and abuse, and\n- measure your use of our sites and apps\nIf you click '\nAccept all', we and\nour partners, including 238 who are part of the IAB Transparency & Consent Framework, will also store and/or access information on a device (in other words, use cookies) and use precise geolocation data and other personal data such as IP address and browsing and search data, for analytics, personalised advertising and content, advertising and content measurement, and audience research and services development.\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\nIf you would like to customise your choices, click 'Manage privacy settings'.\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy & cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our privacy policy and cookie policy."
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "213.250",
            "open": "23,806.260",
            "close": "23,774.260",
            "high": "23,886.260",
            "low": "23,673.010"
        },
        "market_summary": "The GER40 (DAX) is underperforming global peers, showing slight monthly and quarterly declines amid cautious trading ahead of key economic data. Markets are in a holding pattern, awaiting critical catalysts including Euro Area inflation data, ECB official speeches, and US non-farm payrolls. The index faces headwinds from Germany's economic stagnation, persistent inflation concerns, and geopolitical tensions.\nSENTIMENT: Neutral\n\n**Overall Market Sentiment:** Neutral",
        "source_articles": [
            {
                "title": "European stock indices cautious ahead of month end and inflation update as DAX underperforms - ig.com",
                "source": "ig.com",
                "url": "https://www.ig.com/en-ch/news-and-trade-ideas/European-indices-DAX-lags-as-European-markets-await-ECB-insights-250930",
                "body": "European indices\nEuropean stock indices cautious ahead of month end and inflation update as DAX underperforms\nAs the month-end nears, European stock indices tread carefully amidst upcoming inflation updates, with the DAX lagging behind other global markets.\nEuropean equity markets advance slightly ahead of ECB announcement\nEuropean equity markets finished cautiously higher overnight ahead of a busy week featuring key economic data and central bank speeches, including one from European Central Bank (ECB) President Christine Lagarde tonight.\nWith one trading session left, the Germany 40 (DAX 40) has underperformed its global peers this month and quarter.\n- In Germany, the DAX has fallen 0.26% month-to-date (MTD) and is down 0.64% quarter-to-date (QTD)\n- In the United Kingdom (UK), theFTSE 100 is up 1.22% MTD and 6.15% QTD\n- In the United States (US), the US 500 (S&P 500) is up 3.11% MTD and 7.35% QTD\n- In Japan, the Japan 225 (Nikkei 225) is up 5.44% MTD and 11.25% QTD.\nFactors affecting the DAX's performance\nThe DAX’s underperformance likely reflects a combination of seasonal weakness, as September is historically the DAX’s weakest month, and Germany’s economic stagnation, marked by sluggish manufacturing, consumer spending, and persistent inflation.\nAdditional headwinds include the ongoing war in Ukraine, which appears to be escalating, the end of ECB rate cuts, and a recent DAX rebalancing that saw key stocks like Porsche AG demoted, triggering selling pressure.\nWith these factors in mind, attention turns to tomorrow night's Euro Area (EA) inflation update previewed below.\nEuro Area: inflation\nDate: Wednesday, 1 October at 7.00pm AEST\nLast month, in August, headline inflation in the Euro Area remained at 2% for a third straight month. Core inflation, which strips out food and energy, also held steady at 2.3% for a fourth consecutive month.\nEarlier this month, the ECB kept its three key interest rates on hold as widely expected. This decision followed eight interest rate cuts by the ECB totalling 175 basis points (bp) between June 2024 and June 2025. With inflation at the ECB’s 2% medium-term target and the Eurozone economy showing resilience, no changes were made.\nThis month, the preliminary expectation is for headline inflation to rise to 2.2% year-on-year (YoY) in September and for the core measure to remain at 2.3%. Such an outcome would likely reinforce expectations for the ECB to remain on hold until the middle of 2026.\nThe European interest rate market is pricing in only a slim 10% chance of another ECB 25 bp rate cut before year-end and only a modest 33% chance of a 25 bp rate cut by the middle of 2026.\nEA headline inflation rate chart\nFTSE 100 technical analysis\nLate last month, in August, the FTSE 100 hit a fresh record high of 9357, which it retested again overnight, falling just 3 points short. A sustained break above the 9357 record high would indicate the correction is complete and the uptrend has resumed, with scope towards 9500.\nHowever, as long as the FTSE 100 remains below the 9357 record high, there is potential for a dip back to 9100 as part of a sideways correction. If the support at 9100 fails, it could pave the way for a deeper decline towards the psychologically important 9000 support level.\nFTSE 100 daily chart\nDAX 40 technical analysis\nAfter a strong rally from the April low of 18,489 to the July high of 24,639, the DAX has spent the past two and a half months consolidating those gains.\nIf the DAX achieves a sustained break above initial resistance at 24,000 and then above trendline resistance at around 24,425, it would suggest the correction is complete and the uptrend has resumed toward 25,000.\nUntil then, the expectation is for the DAX to continue consolidating the gains made between April and July. As part of this, a dip back to trendline support at 23,300 is possible.\nDAX 40 daily chart\n- Source: TradingView. The figures stated are as of 30 September 2025. Past performance is not a reliable indic"
            },
            {
                "title": "DAX Lacks Clear Direction - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/te_news:488725:0-dax-lacks-clear-direction/",
                "body": "DAX Lacks Clear Direction\nLess than 1 min read\nThe DAX in Frankfurt struggled for direction on Monday afternoon, as investors awaited a busy week of economic data and speeches from central bankers, including ECB President Lagarde on Tuesday.\nGeopolitical developments also drew attention, with Israeli Prime Minister Netanyahu meeting US President Trump, who is expected to outline his proposed Gaza peace plan.\nMeanwhile, traders remained cautious ahead of a potential US government shutdown, though optimism persists that a resolution will be reached, as has often been the case in the past.\nLogin or create a forever free account to read this news"
            },
            {
                "title": "Here’s what will move the CAC 40 and DAX Index this week - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/news/feed/92a56-heres-what-will-move-the-cac-40-and-dax-index-this-week",
                "body": "Here’s what will move the CAC 40 and DAX Index this week\nThe CAC 40 and DAX 40 indices have remained in a tight range in the past few months. CAC 40, which tracks the biggest companies in France, was trading at €7,870, up by 16% from its lowest level this year.\nSimilarly, the DAX Index was trading at €23,740, also much higher than the year-to-date low of €18,522. This article explores some of the top catalysts for these indices this week.\nECB officials statement\nOne of the top catalysts for the CAC 40 and DAX Index will be the upcoming speeches by some European Central Bank officials, who will provide investors with an estimate on what to expect in the next meetings.\nSome of the top ECB officials to watch will be Philip Lane, the bank’s main economist, and Georg Muller, Martins Kazaks, Piero Cipollone, Pedro Machado, Isabel Schnabel, and Christine Lagarde.\nIn recent statements, most of these officials have advocated for an interest rate pause, noting that European inflation has dropped to the desired 2% target. A dovish tone by most of these officials will be bullish for the German DAX and French CAC.\nEuropean consumer inflation data\nThe other notable catalyst for the CAC and DAX will be the upcoming flash European consumer inflation data.\nEconomists polled by Reuters showed that the average estimate is that the headline Consumer Price Index rose from 2% in August to 2.3% in September as it moved further away from the ECB target of 2.0%\nCore inflation rate, which excludes the volatile food and energy prices, is expected to remain unchanged at 2.3%.\nEuropean inflation has been lower than in the United States because of the stronger euro and the lower natural gas prices.\nRecent data shows that the EUR/USD exchange rate has jumped by over 12% from the year-to-date low and analysts anticipate more gains to 1.2000.\nThere will be other important European macro numbers to watch this week, including the manufacturing and services PMI data and German retail sales.\nUS non-farm payrolls data\nThe other notable catalyst for the DAX and the CAC 40 Index is the upcoming US non-farm payrolls data, which will come out on Friday this week.\nEconomists expect the report to show that the economy created 39,000 jobs in September as the unemployment rate remained unchanged at 4.3%.\nThe last jobs report showed that the economy added just 22,000 jobs in August, while a revision showed that the economy lost jobs in June.\nTherefore, in addition to the official report, these indices will react to the revisions for the previous NFP numbers.\nThese American numbers have an impact for European indices because of their impact on the Federal Reserve’s monetary policy. A weak jobs report will be bullish for these indices because it will raise the possibility that the Federal Reserve will cut interest rates in the coming meeting.\nThe other notable catalysts for the German DAX Index are the potential US government shutdown, an announcement of tariffs by Donald Trump, and macro data like the consumer confidence and the JOLTs job vacancies numbers.\nThe post Here’s what will move the CAC 40 and DAX Index this week appeared first on Invezz\nRead More\nTop catalysts for the Nikkei 225 Index in Q4’25\nHere’s what will move the CAC 40 and DAX Index this week\nThe CAC 40 and DAX 40 indices have remained in a tight range in the past few months. CAC 40, which tracks the biggest companies in France, was trading at €7,870, up by 16% from its lowest level this year.\nSimilarly, the DAX Index was trading at €23,740, also much higher than the year-to-date low of €18,522. This article explores some of the top catalysts for these indices this week.\nECB officials statement\nOne of the top catalysts for the CAC 40 and DAX Index will be the upcoming speeches by some European Central Bank officials, who will provide investors with an estimate on what to expect in the next meetings.\nSome of the top ECB officials to watch will be Philip Lane, the bank’s main economist, and Georg Muller, Mart"
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "248.370",
            "open": "24,519.440",
            "close": "24,599.360",
            "high": "24,761.690",
            "low": "24,513.320"
        },
        "market_summary": "The Nasdaq and S&P 500 rose, led by gains in heavyweight technology and semiconductor stocks, as investors focused on the potential for Federal Reserve rate cuts and AI-driven growth rather than near-term risks like a potential government shutdown. This optimism is underscored by significant M&A activity, including a record $55 billion deal to take Electronic Arts private. However, a flight to safe-haven assets like gold, which hit a record high, indicates underlying concerns over political and economic uncertainty.\nSENTIMENT: Mixed\n\n**Overall Market Sentiment:** Mixed",
        "source_articles": [
            {
                "title": "ESG News Recap: Wall Street Rises as Markets Eye Fed Cut - Impakter",
                "source": "Impakter",
                "url": "https://impakter.com/esg-news-sp500-nasdaq-rise-fed-shutdown/",
                "body": "Today’s ESG Updates\n- S&P 500 +0.38% and Nasdaq +0.79: Investors look past hawkish Fed talk and weigh shutdown risks.\n- Electronic Arts To Go Private In $55B Deal: Silver Lake, PIF, and Affinity Partners to acquire the gaming giant.\n- Jaguar Land Rover Restarts After Cyber Attack: UK carmaker begins phased recovery with £1.5B loan guarantee support.\n- Gold Prices Hit Record High: Gold rose above $3,850 per ounce as investors flee to safe havens amid US shutdown fears, Fed cuts, and global tensions.\nS&P 500 and Nasdaq Gain as Investors Brush Off Fed Hawkishness\nU.S. stocks rose on Monday, with the S&P 500 up 0.38% and the Nasdaq gaining 0.79%, while the Dow slipped 0.04%. Investors looked past hawkish comments from Cleveland Fed President Beth Hammack, who urged tighter policy to curb inflation. Markets still price in a 91% chance of a 25 bps rate cut at the next Fed meeting. Semiconductor stocks led gains, pushing the SOX index to a record high, while energy shares dragged. Attention now shifts to the looming U.S. government shutdown, set to begin Wednesday unless Congress reaches a deal. Analysts warn a shutdown could delay key data releases, including Friday’s jobs report.\n***\nFurther reading: S&P 500, Nasdaq rise as investors look past hawkish talk, await shutdown clarity\nElectronic Arts To Be Taken Private In Record $55B Buyout\nElectronic Arts, maker of The Sims and Madden NFL, will be taken private in a record $55 billion deal, the largest leveraged buyout ever attempted. The agreement, announced Monday, involves Silver Lake Partners, Saudi Arabia’s PIF, and Affinity Partners, run by Jared Kushner. Shareholders will receive $210 per share, ending EA’s 36 years as a public company. Going private gives EA more freedom to restructure without quarterly investor pressure, though buyouts often lead to cost cuts. The deal follows Microsoft’s $69B purchase of Activision in 2023 and highlights intensifying competition from mobile game makers like Epic Games. EA employs about 14,500 people worldwide.\n***\nFurther reading: Video game maker Electronic Arts to be taken private in record $55bn mega-deal\nKlimado – Navigating climate complexity just got easier. Klimado offers a user-friendly platform for tracking local and global environmental shifts, making it an essential tool for climate-aware individuals and organizations.\nJaguar Land Rover To Restart Output After Cyber Attack\nJaguar Land Rover will restart parts of its manufacturing after a cyber attack forced it to halt production and sales worldwide since August 31. The company said it is carrying out a “controlled, phased restart” with its Wolverhampton engine plant expected to be the first back online. The UK government has provided a £1.5B loan guarantee through UK Export Finance to support JLR’s supply chain, though the funds come from private banks. JLR, owned by India’s Tata Group, employs 33,000 people and makes some of Britain’s most expensive cars, including the £120,000 Range Rover. The attack has disrupted suppliers across the UK, but JLR stressed recovery is under way with cybersecurity experts and officials involved.\n***\nFurther reading: Jaguar Land Rover to restart some manufacturing after cyber-attack\nGold Prices Hit Record $3,850 Amid US Shutdown Fears\nGold prices climbed to a record high of more than $3,850 per ounce on Monday as investors turned to safe-haven assets amid fears of a possible US government shutdown. The precious metal has risen over 45% since January, supported by a weaker dollar, global tensions, and expectations of further Federal Reserve rate cuts. Earlier this month, the Fed lowered rates to 4–4.25% and signaled more reductions this year, making non-yielding assets like gold more attractive. Analysts say demand is also fueled by central bank purchases and reduced confidence in US bonds. Political uncertainty in Washington has further boosted gold’s appeal as a stable store of value.\n***\nFurther reading: Gold prices hit a record high as uncertain"
            },
            {
                "title": "S&P 500, Nasdaq climb as investors brush off shutdown woes, hawkish talk - The Mighty 790 KFGO",
                "source": "The Mighty 790 KFGO",
                "url": "https://kfgo.com/2025/09/29/sp-500-nasdaq-climb-as-investors-brush-off-shutdown-woes-hawkish-talk/",
                "body": "By Sinéad Carew and Niket Nishant\n(Reuters) -The Nasdaq composite and S&P 500 rose modestly on Monday and the Dow was close to flat, as investors bought heavyweight technology stocks and shrugged off the uncertainty of a potential U.S. government shutdown and hawkish remarks from a Federal Reserve official.\nThe technology sector provided the benchmark S&P’s biggest boost as investors bet on growth from artificial intelligence and expectations that the Fed will keep cutting interest rates as it grapples with persistent inflation concerns and labor market uncertainties.\nOne of this week’s major focus points for Wall Street is a standoff between Republicans and Democrats over funding that has raised the prospect of a government shutdown beginning Wednesday, the first day of the U.S. government’s fiscal 2026.\nEven as the Labor Department prepared for a potential delay of its September jobs report in the event of a shutdown, this did not seem to be the key market driver, said Lindsey Bell, chief strategist at 248 Ventures in Charlotte, North Carolina.\n“Investors are clinging to the positives,” Bell said, pointing to rate easing hopes and signs of economic resilience from recent releases including housing market and consumer spending data.\n“The market is not going to shoot to the moon, because this is a risk. But investors can look through the potential for a shutdown, because if it does occur it will likely be resolved quickly and the market can resume focusing on the things that do matter, like earnings, monetary policy and AI investments.”\nAn earlier Goldman Sachs research report noted that financial markets generally shrug off government shutdowns even as it cautioned that “prior shutdowns are not fully analogous to the potential shutdown this week.”\nInvestors are also monitoring commentary from several Fed policymakers for any signs of concern over the potential loss of economic visibility should a shutdown materialize.\nCleveland Fed President Beth Hammack, among the most hawkish Fed officials and not a voter on policy this year, said on Monday the central bank needed to maintain restrictive monetary policy to cool inflation. Traders, however, are pricing in a 91.4% chance of a 25-basis-point rate cut at the next Fed meeting.\nAs of 2:19 p.m., the Dow Jones Industrial Average rose 7.90 points, or 0.02%, to 46,255.19, the S&P 500 gained 14.98 points, or 0.23%, at 6,658.68 and the Nasdaq Composite added 120.10 points, or 0.53%, at 22,604.17.\nWith oil prices falling sharply, the energy sector was the biggest laggard among the S&P 500’s 11 major industry sectors.\nTechnology was the biggest gainer with big pushes from AI chip leader Nvidia along with Microsoft.\nElectronic Arts climbed 4.6% after the game publisher agreed to be taken private in a $55 billion deal, fueling hopes for broader deal prospects, said Bell of 248 Ventures, who saw the transaction as “confirmation that the M&A market is open.”\nLam Research advanced 2.6%, after Deutsche Bank upgraded the rating on the chip-making equipment firm to “buy” from “hold.”\nAppLovin set a new record and was last up 5.4%, also providing one of the biggest lifts for the S&P 500. Morgan Stanley raised the target price on the stock to $750 from $480.\nAfter U.S. President Donald Trump shared a video on Sunday promoting the health benefits of hemp-derived cannabidiol, U.S.-listed shares of cannabis-related companies rose. Canopy Growth was up 17% and Cronos Group climbed 15%, while Tilray Brands surged more than 48%.\nAdvancers outnumbered decliners by a 1.22-to-1 ratio on the NYSE where there were 295 new highs and 72 new lows. On the Nasdaq, 2,485 stocks rose and 2,101 fell as advancing issues outnumbered decliners by a 1.18-to-1 ratio.\nThe S&P 500 posted 34 new 52-week highs and six new lows while the Nasdaq Composite recorded 102 new highs and 66 new lows.\n(Reporting by Sinéad Carew in New York, Niket Nishant and Sukriti Gupta in Bengaluru; Editing by Sriraj Kalluvila, Shilpi Majumdar and"
            },
            {
                "title": "NetSol Technologies (NASDAQ:NTWK) Issues Earnings Results - MarketBeat",
                "source": "MarketBeat",
                "url": "https://www.marketbeat.com/instant-alerts/netsol-technologies-nasdaqntwk-issues-earnings-results-2025-09-29/",
                "body": "NetSol Technologies (NASDAQ:NTWK - Get Free Report ) posted its quarterly earnings data on Monday. The software maker reported $0.22 earnings per share (EPS) for the quarter, Zacks reports. NetSol Technologies had a net margin of 0.41% and a return on equity of 0.68%.\nGet NetSol Technologies alerts:\nSign Up\nNetSol Technologies Price Performance Shares of NTWK traded up $0.88 during trading hours on Monday, hitting $5.62. The company's stock had a trading volume of 161,364 shares, compared to its average volume of 43,481. The company has a market cap of $65.81 million, a price-to-earnings ratio of 281.14 and a beta of 1.06. The business has a 50 day simple moving average of $4.29 and a two-hundred day simple moving average of $3.28. NetSol Technologies has a 52-week low of $2.14 and a 52-week high of $5.75.\nInsider Buying and Selling at NetSol Technologies In other NetSol Technologies news, President Naeem Ghauri bought 18,279 shares of NetSol Technologies stock in a transaction dated Monday, July 14th. The stock was purchased at an average price of $3.85 per share, for a total transaction of $70,374.15. Following the completion of the purchase, the president directly owned 459,853 shares of the company's stock, valued at approximately $1,770,434.05. This trade represents a 4.14% increase in their ownership of the stock. The acquisition was disclosed in a legal filing with the SEC, which is accessible through this link . Insiders have bought a total of 28,304 shares of company stock valued at $105,766 in the last three months. 13.16% of the stock is owned by company insiders.\nHedge Funds Weigh In On NetSol Technologies An institutional investor recently raised its position in NetSol Technologies stock. Bridgeway Capital Management LLC increased its position in NetSol Technologies Inc. (NASDAQ:NTWK - Free Report ) by 9.9% in the second quarter, according to its most recent disclosure with the Securities and Exchange Commission. The firm owned 53,708 shares of the software maker's stock after acquiring an additional 4,816 shares during the quarter. Bridgeway Capital Management LLC owned about 0.46% of NetSol Technologies worth $167,000 at the end of the most recent quarter. Institutional investors own 16.02% of the company's stock.\nNetSol Technologies Company Profile (\nGet Free Report )\nNetSol Technologies, Inc designs, develops, markets, and exports enterprise software solutions to the automobile financing and leasing, banking, and financial services industries worldwide. The company offers NFS Ascent, a suite of financial applications for businesses in the finance and leasing industry.\nRead More\nThis instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com.\nBefore you consider NetSol Technologies, you'll want to hear this.\nMarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and NetSol Technologies wasn't on the list.\nWhile NetSol Technologies currently has a Hold rating among analysts, top-rated analysts believe these five stocks are better buys.\nView The Five Stocks Here\nWith the proliferation of data centers and electric vehicles, the electric grid will only get more strained. Download this report to learn how energy stocks can play a role in your portfolio as the global demand for energy continues to grow.\nGet This Free Report\nLike this article? Share it with a colleague.\nLink copied to clipboard."
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "39.240",
            "open": "6,649.180",
            "close": "6,658.840",
            "high": "6,686.340",
            "low": "6,647.100"
        },
        "market_summary": "The provided articles highlight significant economic and political headwinds impacting the U.S. market environment. A downturn in tourism to a major economic hub like Los Angeles, driven by geopolitical tensions and policy uncertainty, points to potential softness in consumer-facing sectors. Concurrently, the high-stakes government shutdown threat introduces immediate instability and risk of widespread federal disruption.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "‘They just don’t come’: What’s making L.A.’s tourism tumble - Los Angeles Times",
                "source": "Los Angeles Times",
                "url": "https://www.latimes.com/business/story/2025-09-29/with-less-tourism-in-la-international-visitors-proceed-with-caution",
                "body": "‘They just don’t come’: What’s making L.A.’s tourism tumble\n- Share via\n- Tourist arrivals to Los Angeles fell this summer, reversing years of growth and dealing a severe blow to the city’s economy.\n- January wildfires, June immigration raids and Trump’s tariff threats created a perfect storm that scared off international visitors, especially Canadians.\n- Hollywood Boulevard’s foot traffic dropped, and businesses struggled with higher wholesale costs for their souvenirs due to increased tariffs.\nMonths of negative news have triggered a tough summer for tourism in Los Angeles, deepening the economic woes for a city buffeted by natural disasters and immigration raids.\nInternational tourist arrivals fell by 8% in the three months through August, according to data released Monday from Visit California. That is more than 170,000 fewer global tourists than last year.\nIn August alone, arrivals slipped by 7.5% compared to 2024.\nThe region’s economy and image suffered significant setbacks this year. Shocking images of the destructive Eaton and Palisades fires in January, followed by the immigration crackdown in June, made global news and repelled visitors. Meanwhile, President Trump’s fickle tariff policies and other geopolitical posturing have convinced many international tourists to avoid America.\nOn Hollywood Boulevard, there are fewer tourists, and the ones who show up spend less, says Salim Osman. He works for Ride Like A Star, an exotic car company that rents to visitors looking to take a luxury vehicle for a spin and snap the quintessential L.A. selfie.\nLast year, crowds lined up to rent its Ferraris and Porches for around $200 an hour, Salim says. However, this summer, foot traffic dropped by nearly 50%.\n“It used to be shoulder to shoulder out here,” he said, looking along the boulevard. “It’s a lot harder for people to come here, or they’re afraid of what’s going on here, so they just don’t come.”\nBusiness has been slow around the TCL Chinese Theater, where visitors place their hands into the concrete handprints of celebrities like Kristen Stewart and Denzel Washington.\nThere were fewer people to hop onto sightseeing buses, stop inside Madame Tussauds wax museum and snap impromptu photos with patrolling characters such as Spider-Man and Mickey Mouse. Souvenir shops nearby say they have also had to increase the prices of many of their knick-knacks because of tariffs and a decline in sales.\nOf all the state’s international travelers, the most significant absence was from Canadian tourists. Arrivals from visitors from up north fell 32% in the three months of Summer.\nPresident Trump’s talk of making Canada the 51st state and his decision to hit Canada with tariffs have not endeared him to Canadian travelers. Meanwhile, media overseas have been bombarded with stories of capricious denials and detentions at U.S. border crossings.\nSummer in Palm Springs was OK this year, said its mayor, Ron deHarte, but only because domestic tourists offset the sharp decline in Canadians.\n“We’ve hurt our Canadian friends with actions that the administration has taken. It’s understandable,” he said. “We don’t know how long they won’t want to travel to the States, but we’re hopeful that it is short-term.”\nVisitors from China, India, Germany and Australia also avoided the state.\nSurprisingly, Mexican tourists didn’t stay away. There were around 5% more arrivals from our southern neighbor despite the ICE raids, which often targeted Latino people.\nThere was a dip in traffic to most Los Angeles airports. With the World Cup on the books for next year and the Summer Olympics gearing up in 2028, the growing decline in tourism is worrisome for many across all industries.\nCynthia Guidry, the director of the Long Beach Airport, says reduced airline schedules, economic pressures and rising costs also impacted airport traffic. She’s currently seeking out ways to best prepare for the Olympics, which don’t involve flight revenue, such as dining at the airport and so"
            },
            {
                "title": "Trump Posts AI Video Mocking Schumer, Jeffries: ‘Woke Pieces of S***’ - Newsweek",
                "source": "Newsweek",
                "url": "https://www.newsweek.com/trump-posts-ai-video-of-chuck-schumer-hakeem-jeffries-woke-10801744",
                "body": "U.S. President Donald Trump posted an artificial intelligence (AI) video on his social media page mocking Democrats and their popularity while also underscoring a Republican attack line that Democrats will shut down the government if they can’t secure free health care for illegal immigrants.\nWhy It Matters\nThe U.S. is on the brink of a government shutdown after high-stakes negotiations at the White House between Trump and congressional leaders ended in a stalemate.\nThe funding crisis, largely centered on health care policy disputes, threatens widespread disruption to federal operations and could put the income and benefits of thousands of government workers and services at risk.\nTo avoid a government shutdown, a deal would need to be struck by Wednesday.\nWhat To Know\nThe AI video that Trump posted shows Senate Democratic Minority Leader Chuck Schumer talking at a podium with House Minority Leader Hakeem Jeffries, shown wearing a sombrero, standing next to him.\n“Look guys, there’s no way to sugarcoat it, nobody likes Democrats anymore,” the digitally altered Schumer says. “We have no votes left because of all of our woke, trans bulls***. Not even Black people want to vote for us anymore, even Latinos hate us, so we need new voters, and if we give all these illegal aliens free health care, we might be able to get them on our side so they can vote for us.”\n“They can't even speak English so they won’t realize we’re just a bunch of woke pieces of s***, you know, at least for a while until they learn English and they realize they hate us too,” the fake Schumer says.\nThe funding crisis is largely centered on health care policy disputes but the Democrats say undocumented immigrants are not eligible to enroll in federally funded health coverage under existing law or under their Democrats’ funding proposals.\nThe real Schumer responded to Trump's post with his own social media comment, saying on X: \"If you think your shutdown is a joke, it just proves what we all know: You can’t negotiate. You can only throw tantrums.\"\nVice President JD Vance said Monday that he thinks the government is headed for a shutdown because \"Democrats won't do the right thing\" after Trump met Democratic Party leaders at the White House.\nSchumer said after the meeting: “There are still large differences between us.\"\nWhat People Are Saying\nVance, on X September 25: “Democrats are about to shutdown the government because they demand we fund healthcare for illegal aliens.”\nRepublican House Speaker Mike Johnson, in an interview with CNN on Monday: “Chuck Schumer … wants to reinstate free health care for illegal aliens paid by American taxpayers. We are not doing that. We can't do that.”\nU.S. Senator Patty Murray, top Democrat on the Appropriations Committee, said in a statement, as reported by The New York Times: “Undocumented immigrants are not eligible to enroll in federally funded health coverage under existing law or Democrats’ funding proposal — but millions of American citizens will see their health care premiums double next year if Republicans keep refusing to act.”\nWhat Happens Next\nTo avoid a government shutdown, a deal needs to be struck by Wednesday. A shutdown would bring widespread disruption to federal operations and could imperil the income and benefits of thousands of government workers, along with services."
            },
            {
                "title": "Seventeen’s S.Coups and Mingyu Talk About Their Cool, Chill New Mini Album - Rolling Stone",
                "source": "Rolling Stone",
                "url": "https://www.rollingstone.com/music/music-features/seventeen-s-coups-mingyu-debut-album-interview-1235424688/",
                "body": "Seventeen’s S.Coups and Mingyu Talk About Their Cool, Chill New Mini Album\nThe 13 members of Seventeen have been shuffling through new pairings and subunits beyond their official units of vocal, hip-hop, and performance over the past year, starting with Jeonghan and Wonwoo’s JxW and Hoshi and Woozi’s HxW. (And of course we can’t forget the beloved BSS, with DK, Hoshi, and Seungkwan, who debuted a few years earlier.) Now, get ready to meet the latest Seventeen spin-off: Leader S.Coups and Mingyu’s CxM, who have a new mini album called HYPE VIBES.\nThe way the members of Seventeen are so close-knit and truly like brothers is something their fans, known as Carats, adore. With each unit that the group reveals, they’re unveiling a deeper look at the chemistry and synergy between the members.\nS.Coups and Mingyu are both part of Seventeen’s hip-hop unit, so they’ve always been close collaborators, but CxM takes them to the next level as a duo. At the time of their chat with Rolling Stone, we’re still over two weeks out from the mini album’s Sept. 29 release. The two members have been building up anticipation by teasing photos from a shoot in Hawaii, which they say they approached with the goal of making the photos feel truly raw.\nThere’s been a handful of sub-units within Seventeen at this point. How would you describe CxM? What makes this unit feel like you?\nS.Coups: [Laughs.] I feel like if I say the wrong thing, it’ll sound like I’m saying something about the other units. But I think we put in a variety of genres into the album. And compared to the other units, rather than a put-together look, we aimed to be more effortless, thinking there could be a type of coolness that comes from being natural.\nMingyu: It might not be right to say we were “not flashy,” but I think that encapsulates how we tried to be more comfortable and natural? This is a hard question.\nS.Coups: It is hard. [Laughs.] I don’t want to put down the other units.\nMingyu: If we say “Our songs are chill and cool!” it may end up sounding like we’re saying the other members’ weren’t. [Laughs.]\nYou can all be cool, though! You went to Hawaii to do your shoot for this mini album– I heard that the collective goal for these photos was for it to feel like a trip with close friends. Can you share any fun stories from the shoots?\nMingyu: First off, it was so tiring. Instead of having a set time for the shoot to start and end, like how you said, we were trying to shoot while we’re comfortably hanging out. We shot from the second we opened our eyes in the morning to the moment we went to sleep. Once we were done I was so exhausted. I had so much fun all day, rested, and felt like I was relaxing, but physically it still took a toll on me. It was a hard shoot. We wore a lot of different outfits too.\nS.Coups: [Laughs.] I feel the same way. The shoot was certainly less tiring than if it was on a set, and we went into it thinking “We can just take photos of us hanging out.” But compared to any shoot we’ve done for Seventeen, suprisingly, it actually was more exhausting.\nAny specific things that you remember from the trip?\nS.Coups: For me, I haven’t travelled internationally much, but Mingyu kept telling me how nice Hawaii is. The nature left a big impression on me. To go somewhere like that with someone I’m so comfortable with — someone like Mingyu, who can guide me to try a variety of experiences…. I really enjoyed surfing. Being able to experience those things and also do a shoot was really great.\nWhat did you guys listen to while shooting to set the vibes?\nMingyu: When we were in Hawaii for the shoot, the early versions of our music were just starting to come in, guides were coming in, so we listened to the album a lot. Like the super early versions, versions we recorded in Hawaii. We really listened to the music as we were making it.\nYou’ve been together for many years now, and even though you are already so close, I’m sure you spent a lot of one-on-one time together to prepare f"
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "355.000",
            "open": "45,078.570",
            "close": "45,067.860",
            "high": "45,223.570",
            "low": "44,868.570"
        },
        "market_summary": "The Nikkei 225 (JPN225) experienced a third consecutive day of decline, with early gains reversing into losses due to selling pressure. A stronger yen made Japanese assets less attractive, weighing on export-sensitive sectors, while weakness in key commodities like rubber reflected subdued demand from China. Despite some positive momentum from gains in US markets, the overall session was characterized by broad sectoral declines and limited upside.\nSENTIMENT: Negative\n\n**Overall Market Sentiment:** Negative",
        "source_articles": [
            {
                "title": "The Nikkei average fell 20 yen, marking its third consecutive day of decline, but losses narrowed after the initial selling pressure subsided = Morning session on the 30th. - 富途牛牛",
                "source": "富途牛牛",
                "url": "https://news.futunn.com/en/post/62774295/the-nikkei-average-fell-20-yen-marking-its-third-consecutive",
                "body": "In the morning session 30 days ago, the Nikkei Stock Average fell by 20 yen 27 sen from the previous day to 45,023 yen 48 sen, marking a slight decline for the third consecutive day. Meanwhile, the TOPIX (Tokyo Stock Price Index) rebounded, rising by 2.83 points to 3,134.40 points. On the 29th in the U.S., expectations for an interest rate cut persisted, and both the NY Dow and Nasdaq Composite Index continued their upward trend. The Japanese stock market opened with a buying advantage due to gains in U.S. stocks and as a reaction to the previous declines. However, it later turned negative under selling pressure. With the upside of the dollar-yen exchange rate remaining heavy, at 10:06 a.m., the Nikkei dropped to 44,733 yen 60 sen, down 310 yen 15 sen. Thereafter, the market remained sluggish despite bargain hunting, concluding the morning session with limited downside.\nThe trading volume on the Tokyo Stock Exchange Prime Market was 914.97 million shares, with a total trading value of 2.1584 trillion yen. Among the listed issues, 525 stocks rose, 1,033 declined, and 55 remained unchanged.\nBy sector, 23 out of the 33 industries declined, 9 rose, and 1 remained almost unchanged. Mining stocks such as INPEX <1605.T> and Japan Petroleum Exploration Co. <1662.T>, along with shipping stocks like Nippon Yusen <9101.T> and Mitsui O.S.K. Lines <9104.T>, fell. Shares of oil and coal product companies such as Idemitsu Kosan <5019.T> and ENEOS Holdings <5020.T>, as well as rubber products companies like Bridgestone <5108.T> and Yokohama Rubber <5101.T>, were also weak. Electric power and gas stocks such as Kansai Electric Power <9503.T> and Tokyo Gas <9531.T>, along with pulp and paper stocks like Oji Holdings <3861.T> and Nippon Paper Industries <3863.T>, performed poorly. Fisheries and forestry stocks such as Nippon Suisan Kaisha <1332.T> and Maruha Nichiro <1333.T>, as well as steel stocks including Nippon Steel <5401.T> and JFE Holdings <5411.T>, were also weak. On the other hand, insurance stocks like MS&AD Insurance Group <8725.T> and Tokio Marine Holdings <8766.T>, as well as precision equipment stocks such as Terumo <4543.T> and Olympus <7733.T>, showed strength.\nElsewhere, Shimamura <8227.T>, Chiba Bank <8337.T>, Astria <3853.T>, Kewpie Corporation <2809.T>, and Dia-Life <3245.T> fell. Conversely, Toyama Daiichi Bank <7184.T>, Kioxia Holdings <285A.T>, Mitsui Matsushima Holdings <1518.T>, Orion Breweries <409A.T>, and Ebara Corporation <6361.T> rose.\nProvided by: Wealth Advisor Co."
            },
            {
                "title": "Rubber Prices Dip Across Asia As Economic Pressure Mounts - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/rubber-prices-dip-across-asia-as-economic-pressure-mounts",
                "body": "Asian rubber futures fell on weaker demand from China, competitive oil prices, and a stronger yen making Japanese assets less attractive to global buyers.\nabout 3 hours ago • 1 min\nJoin the newsletter that everyone in finance secretly reads. 1M+ subscribers, 100% free.\nWhat’s going on here?\nRubber prices dropped across Asia, with futures in Japan, China, and Singapore all sliding as subdued demand from China, cheaper oil, and a stronger yen pulled the market down.\nWhat does this mean?\nJapanese rubber futures dipped another 0.59% on the Osaka Exchange to 304 yen per kilogram, while China’s main contract slipped 1.4% to 15,125 yuan per ton in Shanghai. These moves point to ongoing economic stresses: although China’s purchasing managers’ index rose slightly to 49.8 in September, it’s still signaling contraction, prompting caution among rubber producers. Oil prices also played a part, with OPEC+ suggesting more supply and renewed oil exports from Iraqi Kurdistan making synthetic rubber cheaper compared to natural. The recent strengthening of the yen to 148.66 against the US dollar further dented Japanese rubber’s export appeal, and Singapore’s key contract fell 1.1% as well.\nWhy should I care?\nFor markets: Commodities markets ride out the turbulence.\nThe slide in rubber prices is rippling through the entire commodities sector, encouraging a more cautious stance among investors. Moves in other markets reflect the uncertainty: the Nikkei 225 slipped in early Tuesday trade, and a firmer yen plus ongoing US dollar jitters ahead of a possible government shutdown are keeping global flows unpredictable. While falling rubber and oil prices may lower manufacturing input costs, the downside is tighter margins for rubber-exporting countries.\nThe bigger picture: Industrial demand still stuck in low gear.\nRubber’s latest drop highlights ongoing global concerns around manufacturing and trade. China’s sluggish economic recovery is suppressing demand for goods from car tires to factory equipment, while swings in oil and currency markets add to the headwinds. Until global policy becomes clearer and demand trends stabilize, industrial commodities like rubber could struggle to find solid footing.\nDid you find this insightful?\nNope\nSort of\nAbsolutely\nInsight\nStéphane Renevier, CFA • about 13 hours ago\nQuick Take\nAberdeen Group x Finimize • about 18 hours ago\nDisclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. This article may contain AI-edited or enhanced content. While efforts have been made to ensure accuracy, AI may not capture the nuances of the subject matter resulting in errors or inconsistencies."
            },
            {
                "title": "The Nikkei average fell approximately 250 yen, turning lower after a morning rise to trade weaker as of the late morning session on the 29th. - 富途牛牛",
                "source": "富途牛牛",
                "url": "https://news.futunn.com/en/post/62768405/the-nikkei-average-fell-approximately-250-yen-turning-lower-after?level=1&data_ticket=1759211460187387",
                "body": "At around 10:07 a.m. on the 29th, the Nikkei Stock Average was trading approximately 250 yen lower than the previous day at around 44,790 yen. On the 29th in the U.S., continued expectations of an interest rate cut led to further gains in both the NY Dow and Nasdaq Composite indices. Japanese stocks opened with a buying advantage due to the rise in U.S. equities and a rebound from recent declines. However, they later turned negative under selling pressure. With the dollar-yen exchange rate showing limited upside, the Nikkei fell as much as 256.85 yen to 44,786.90 yen by 10:05 a.m., remaining weak. The yen-denominated settlement value of the Chicago Nikkei 225 futures rose 40 yen to 45,170 yen compared to the Osaka Exchange settlement value on the 29th.\nBy industry, 27 out of the 33 sectors declined, while six sectors rose. Shares of mining companies such as INPEX <1605.T> and Petroleum Resources <1662.T>, as well as petroleum and coal products companies like Idemitsu Kosan <5019.T> and ENEOS <5020.T>, declined. Shipping stocks including Nippon Yusen <9101.T> and Mitsui O.S.K. Lines <9104.T>, as well as electric power and gas stocks like Tokyo Electric Power HD <9501.T> and Kansai Electric <9503.T>, were also down. Airline stocks such as Japan Airlines <9201.T> and ANA Holdings <9202.T>, as well as steel stocks like Nippon Steel <5401.T> and JFE Holdings <5411.T>, remained weak. Rubber product shares including Bridgestone <5108.T> and Hama Gomu <5101.T>, as well as fisheries and agriculture stocks like Nissui <1332.T> and Maruha Nichiro <1333.T>, also showed weakness. Meanwhile, insurance stocks like MS&AD <8725.T> and Tokio Marine <8766.T>, as well as machinery shares such as Disco <6146.T> and SMC <6273.T>, posted gains.\nElsewhere, Migalo HD <5535.T>, Shimamura <8227.T>, NeedsWell <3992.T>, Copro HD <7059.T>, and As One <7476.T> declined. On the other hand, LinkUG <4446.T>, Toyama Daiichi Bank <7184.T>, Kioxia <285A.T>, Ebara <6361.T>, and IHI <7013.T> advanced.\nIn the Tokyo foreign exchange market at 10:07 a.m., the dollar-yen pair traded in the mid-148 yen range (148.56-58 yen per dollar on the 29th), while the euro-yen pair was in the low 174 yen range (174.22-26 yen per euro).\nProvided by: Wealth Advisor Co."
            }
        ]
    }
]