[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "156.840",
            "open": "4,871.110",
            "close": "4,977.290",
            "high": "5,010.990",
            "low": "4,854.150"
        },
        "market_summary": "### Gold (XAU/USD) Market Briefing  \n* **Key Drivers:** Lunar New Year liquidity squeeze, firm US dollar, PCE inflation data in focus.  \n* **Price Action:** Paused after 2% jump; prices under pressure as dollar firms.  \n* **Technical Outlook:** Support levels under watch; direction hinges on inflation data.  \n---  \n**Overall Sentiment:** Neutral ⚖️  \n\n**Near-Term Catalyst:** Friday’s PCE inflation report and jobless claims could reset Fed rate-cut expectations, influencing gold’s next move.",
        "source_articles": [
            {
                "title": "Gold Pauses After A Big Jump, With US Inflation Next - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/gold-pauses-after-a-big-jump-with-us-inflation-next",
                "body": "Thin Lunar New Year trading and a firm US dollar kept prices steady as investors waited for PCE data to gauge when the Fed might cut rates.\n1 min\nWhat’s going on here?\nGold prices steadied in thin Asian trading after a 2% jump, as investors waited for fresh US inflation data that could reset the Fed’s rate-cut timeline.\nWhat does this mean?\nLunar New Year closures across key Asian markets drained liquidity and muted moves. Meanwhile, the US dollar hovered near a one-week high, which can weigh on dollar-priced bullion by making it costlier abroad. Fed minutes showed broad agreement that rates should stay put for now, but less clarity on what comes next – some officials still see another hike as possible if inflation stays hot, while others think cuts are on the table if price pressures cool. Markets are still leaning toward..\na first cut around June, so attention is turning to jobless claims and Friday’s PCE inflation report, the Fed’s preferred gauge.\nWhy should I care?\nFor markets: Gold is trading the Fed more than fundamentals.\nGold often benefits when investors expect lower US rates, because it pays no interest and competes with yield-bearing assets. If PCE or labor data comes in cooler, rate-cut expectations could firm up and the dollar could ease – typically supportive for bullion. If inflation stays sticky, markets may push cuts out, keeping the dollar stronger and gold under pressure. Other metals can echo that rate-driven mood, especially silver.\nZooming out: Thin markets can blur the signal.\nHoliday-thinned trading can make price action look calmer than investor conviction really is. That’s why the next batch of US data may do more to set direction than this quiet session. The big driver for precious metals remains the same: where inflation is headed and how the Fed responds.\nThis content is free, but you must be logged in to continue reading.\nAlready have an account?"
            },
            {
                "title": "Gold dips as dollar firms ahead of inflation data - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZF033:0-gold-dips-as-dollar-firms-ahead-of-inflation-data/",
                "body": "News//Gold dips as dollar firms ahead of inflation dataGold dips as dollar firms ahead of inflation dataRefinitiv1 min readGOLDXAGUSD1!PL1!XPDUSD1!ConsumerEconomyLaborMoneyPricesReuters© Copyright Thomson Reuters 2026. Click For Restrictions - https://agency.reuters.com/en/copyright.htmlShow moreLogin or create a forever free account to read this newsLet's go"
            },
            {
                "title": "Gold edges down as dollar firms; inflation data in focus - marketscreener.com",
                "source": "marketscreener.com",
                "url": "https://www.marketscreener.com/news/gold-edges-down-as-dollar-firms-inflation-data-in-focus-ce7e5ddfdd88f121",
                "body": "Access Denied\nYou don't have permission to access \"http://www.marketscreener.com/news/gold-edges-down-as-dollar-firms-inflation-data-in-focus-ce7e5ddfdd88f121\" on this server.\nReference #18.3d05c617.1771482950.34c29d5a\nhttps://errors.edgesuite.net/18.3d05c617.1771482950.34c29d5a"
            }
        ]
    },
    {
        "asset_name": "Silver",
        "symbol": "EIGHTCAP:XAGUSD",
        "status": "Success",
        "data": {
            "day_range": "6.035",
            "open": "73.137",
            "close": "77.155",
            "high": "78.310",
            "low": "72.275"
        },
        "market_summary": "### Silver (XAG/USD) Market Briefing  \n* **Key Drivers:** Bargain buying, inflation data anticipation, Lunar New Year-driven thin trading.  \n* **Price Action:** Rose **0.44%** to **$77.96**, recovering from recent volatility.  \n* **Technical Outlook:** Two lower highs signal fading buyer conviction; still digesting correction.  \n---  \n**Overall Sentiment:** Mixed ⚖️  \n\n**Key Insights:**  \n- **Structural Deficit:** Silver Institute forecasts a **67 million ounce** deficit in 2026, down from **95 million** in 2025.  \n- **Industrial Demand:** Dual role in monetary demand and solar photovoltaic expansion supports long-term fundamentals.  \n- **Market Context:** Lunar New Year holidays in Asia amplified price moves amid thin trading; U.S. dollar strength added pressure.  \n- **Fed Policy Impact:** PCE inflation data and Fed rate expectations remain critical for short-term direction.  \n- **Year-to-Date Performance:** Surged **150%** over the past year, outpacing gold but facing technical resistance.  \n---  \n**Investment Takeaway:** Silver’s volatility and industrial demand make it a high-risk, high-reward hedge against inflation and portfolio diversification.",
        "source_articles": [
            {
                "title": "Gold, silver rally on bargain buying - KITCO",
                "source": "KITCO",
                "url": "https://www.kitco.com/news/article/2026-02-18/gold-silver-rally-bargain-buying",
                "body": "Jim Wyckoff\nJim Wyckoff has spent over 25 years involved with the stock, financial and commodity markets. He was a financial journalist with the FWN newswire service for many years, including stints as a reporter on the rough-and-tumble commodity futures trading floors in Chicago and New York. As a journalist, he has covered every futures market traded in the U.S., at one time or another.\nJim is the proprietor of the \"Jim Wyckoff on the Markets\" analytical, educational and trading advisory service. Jim also worked as a technical analyst for Dow Jones Newswires and as the senior market analyst with TraderPlanet.com. Jim is also a consultant with the highly respected \"Pro Farmer\" agricultural advisory service. Jim was also the head equities analyst at CapitalistEdge.com. He received his degree from Iowa State University in Ames, Iowa, where he studied journalism and economics.\nFollow Jim daily on Kitco.com as he provides both AM and PM roundups and a daily Technical Special. 1 877 963-NEWS jwyckoff at kitco.com"
            },
            {
                "title": "Gold prices trade near $5,000, silver rises to $77.99 as market awaits key U.S. inflation data - Economy Middle East",
                "source": "Economy Middle East",
                "url": "https://economymiddleeast.com/news/gold-prices-trade-near-5000-silver-rises-77-99-market-awaits-us-inflation-data/",
                "body": "Gold prices edged higher in subdued trading on Thursday, building on gains of more than 2 percent in the previous session, as investors awaited crucial U.S. inflation figures that could shape the Federal Reserve’s next moves on interest rates.\nAs of 5:59 GMT, spot gold rose 0.19 percent to $4,997.47 an ounce, while U.S. gold futures for April delivery advanced 0.10 percent to $5,014.10 per ounce. Meanwhile, spot silver gained 0.44 percent to $77.96.\nIn the UAE, gold rates posted marginal increases, with 24-carat gold gaining AED0.25 to AED600.75 and 22-carat gold holding steady at AED556.25. Additionally, 21-carat gold and 18-carat gold edged up AED0.25 to AED533.5 and AED457.25, respectively.\nMeanwhile, 14-carat gold increased AED0.25 to AED356.75.\nLunar New Year amplifies price moves amid thin trading\n“Gold, silver and copper have started the Lunar New Year week under pressure, with much of Asia — and crucially China — closed. The subdued trading environment has amplified price moves while underscoring how heavily the recent rally relied on Asian participation,” said Ole Hansen, Head of Commodity Strategy, Saxo Bank.\nGold prices remained under pressure as markets in mainland China, Hong Kong, Singapore, Taiwan and South Korea were closed for the Lunar New Year holidays, leading to thinner regional trading volumes. At the same time, the U.S. dollar hovered near a more than one-week peak, making gold that is priced in the greenback more expensive for holders of other currencies.\n“Despite short-term softness, the structural drivers supporting gold remain firmly in place in our opinion. Persistent central bank reserve diversification continues to underpin structural buying, while expanding fiscal deficits and elevated sovereign debt levels reinforce gold’s role as a store of value amid currency debasement concerns,” added Hansen.\nMarket awaits PCE report\nMinutes from the Federal Reserve’s January meeting showed policymakers were almost unanimously in favor of keeping rates unchanged, though opinions diverged on the next move. Several officials signaled they would consider further rate hikes if inflation remains sticky, while others indicated a willingness to back additional cuts should price pressures ease.\nAccording to CME’s FedWatch Tool, markets are currently pricing in June as the most likely timing for the first rate cut this year.\nInvestors are now turning their attention to weekly jobless claims data due later on Thursday, as well as Friday’s Personal Consumption Expenditures (PCE) report, the Federal Reserve’s preferred gauge of inflation. Gold prices, which do not offer a yield, typically perform better in a low-interest-rate environment.\n“At the same time, ongoing geopolitical fragmentation sustains long-term demand even when not immediately reflected in price, and continued portfolio diversification away from dollar-centric assets supports strategic allocations. Together, these forces suggest that, although corrections are inevitable after parabolic advances, the broader bull trend remains intact,” added Hansen.\nOther precious metals\nAs gold and silver prices rose, the broader precious metals market witnessed mixed movement. Spot platinum gained 0.16 percent to $2,074.38, while palladium dipped 0.41 percent to $1,708.5.\nHansen explained that silver’s long-term fundamentals remain supportive, particularly given its dual role in monetary demand and solar photovoltaic expansion.\n“For 2026, the Silver Institute forecasts a sixth consecutive annual structural deficit of around 67 million ounces, down from 95 million in 2025. Although total supply is rising toward decade‑high levels, it remains insufficient to fully meet the current surge in investment demand,” he added.\nFrom a technical perspective, the latest rebound has produced two lower highs, signalling fading conviction among buyers. After outperforming during the rally phase, silver bore the brunt of the correction and is still digesting that volatility shock."
            },
            {
                "title": "Current price of silver as of Wednesday, February 18, 2026 - Fortune",
                "source": "Fortune",
                "url": "https://fortune.com/article/current-price-of-silver-2-18-2026/",
                "body": "As of 8:15 a.m. Eastern Time, silver traded at $76.01 per ounce. That’s up $1.58 from yesterday at this hour—and represents a gain of more than $43 over the past 12 months.\nCheck Out Our Daily Rates Reports\n- Discover the highest high-yield savings rates, up to 5% for February 18, 2026.\n- Discover the highest CD rates, up to 4.15% for February 18, 2026.\n- Discover the current mortgage rates for February 18, 2026.\n- Discover current refi mortgage rates report for February 18, 2026.\n- Discover current ARM mortgage rates report for February 18, 2026.\n- Discover the current price of gold for February 18, 2026.\n- Discover the current price of silver for February 18, 2026.\n- Discover the current price of platinum for February 18, 2026.\nHistorical silver performance\nSilver is not typically a high-growth play. Historically, it trails other investment options, like stocks. From 1921 onward, silver has underperformed the S&P 500 by about 96%. That means an equal sum invested in silver and stocks back then would now be worth 96% less in silver holdings than stocks.\nInstead, silver is prized for its stability and its power to hedge against inflation. Often dubbed a “store of value,” it tends to sustain purchasing power when inflation climbs.\nCompared with gold, silver prices generally swing more sharply due to industrial demand—solar equipment, healthcare devices, and more—whereas gold is almost purely a safe-haven asset.\nWhat does “spot silver” mean?\n“Spot silver” refers to the live market rate at which silver can be bought or sold instantly. That said, real-world buyers usually pay a premium over spot for markups, shipping, insurance, and other fees.\nThe spot price serves as a gauge of immediate market demand: a higher spot price means stronger buying interest.\nWhat is “price spread” in silver trading?\nThe term “price spread” describes the difference between the buying (ask) and selling (bid) prices for silver. Here’s how those terms are defined.\n- Ask price: the cost to purchase silver.\n- Bid price: the amount you receive when you sell silver.\nA narrower spread indicates high demand.\nHow to invest in silver\nSilver exposure can be achieved through physical ownership or via silver-backed exchange-traded funds (ETFs). ETFs let you own a stake in a fund that holds silver, sparing you storage and insurance responsibilities.\nKey silver investment options include:\n- Bullion bars and rounds. These are sold by weight and purity\n- Government-minted silver coins. Iconic examples include American Silver Eagles and Canada’s Silver Maple Leafs, which often trade at premiums for their rarity and backing.\n- Silver jewelry. Custom pieces that fetch prices above equal-purity bullion.\n- Silver mining equities. Stocks in companies extracting silver, offering a sort of indirect investment in silver.\nOn exchanges, bullion and coins must meet a minimum 99.9% purity. Lower-purity silver generally falls into collectible or industrial categories. Our guide to the best silver IRA companies provide more information on how to shrewdly invest in silver (and other precious metals).\nIs it a good time to invest in silver?\nSilver has surged more than 150% over the past year, hitting its highest levels in over a decade.\nDeciding whether to invest now depends on your unique attitude toward the market. If inflation is top of mind, adding precious metals can be prudent. Or, if you foresee rising industrial applications—such as electronics—demand could potentially push prices even higher.\nCurrent precious metals prices as of 8:15 a.m. ET today\nGold remains the benchmark metal, while platinum and palladium exhibit volatility patterns similar to silver due to smaller market caps. Gold’s larger market makes it comparatively stable.\nThe takeaway\nWith economic volatility persistent in the current market, precious metals deserve at least a quick look. Silver’s recent performance has outshined gold’s, and many experts forecast the likelihood of seeing further upside, potentially p"
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "3.325",
            "open": "67.590",
            "close": "70.383",
            "high": "70.895",
            "low": "67.570"
        },
        "market_summary": "### Spot Brent Crude Oil Market Briefing\n* **Key Drivers:** U.S. crude inventories **plunged 609,000 barrels**, reversing prior massive build; production rose to **13.713 million bpd**; SPR inventories climbed to **415.4 million barrels**.\n* **Price Action:** Brent surged **+4.39% to $70.38**, up **$1.60** week-over-week; WTI gained **+4.68% to $65.25**.\n* **Market Context:** Gasoline inventories fell **312,000 barrels**; distillate stocks dropped **1.56 million barrels**; Cushing hub inventories declined **1.36 million barrels**.\n---\n**Overall Sentiment:** Positive 📈",
        "source_articles": [
            {
                "title": "U.S. Crude Oil Inventories Plunge Following Massive Build - Crude Oil Prices Today | OilPrice.com",
                "source": "Crude Oil Prices Today | OilPrice.com",
                "url": "https://oilprice.com/Latest-Energy-News/World-News/US-Crude-Oil-Inventories-Plunge-Following-Massive-Build.html",
                "body": "Crude oil production from the…\n\"It's most important 8 minute read of my week…\"\nThe American Petroleum Institute (API) estimated that crude oil inventories in the United States fell by 609,000 barrels in the week ending February 13, after increasing by 13.4 million barrels in the week prior.\nInventories in the US Strategic Petroleum Reserve (SPR) keep climbing week after week. The Department of Energy (DoE) reported that crude oil inventories rose by 200,000 barrels to 415.4 million barrels in the week ending February 13. This is 310.1 million barrels shy of maximum capacity.\nUS production stopped its fifth week in a row losing streak, with the average rising by 498,000 bpd during the week of February 6 to 13.713 million bpd, according to the latest EIA data. This is 219,000 bpd more than this same time last year.\nAt 2:13 pm ET, Brent crude was trading up on the day at $70.38 (+4.39%). Brent is now roughly $1.60 per barrel up from this time last week. WTI was also trading up on the day, by $2.92 (+4.68%) at $65.25.\nGasoline inventories also fell this week, shrinking by 312,000 barrels in the week ending February 13. In the week prior, gasoline inventories rose by 3.3 million barrels. As of last week, gasoline inventories were 4% above the five-year average for this time of year, according to the latest EIA data.\nDistillate inventories fell in the reporting period by 1.56 million barrels, after losing 2.0 million barrels in the week prior. Distillate inventories were 4% below the five-year average as of the week ending February 6, the latest EIA data shows.\nCushing inventory—the inventory kept at the delivery hub for the WTI Crude futures contract—fell by 1.36 million barrels, after increasing by 1.4 million barrels in the prior week.\nBy Julianne Geiger for Oilprice.com\nMore Top Reads From Oilprice.com\nADVERTISEMENT\nJulianne Geiger is a veteran editor, writer and researcher for Oilprice.com, and a member of the Creative Professionals Networking Group."
            },
            {
                "title": "US Crude Oil Inventories Drop - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/te_news:526819:0-us-crude-oil-inventories-drop/",
                "body": "US Crude Oil Inventories Drop\nLess than 1 min read\nUS crude oil inventories fell by 0.61 million barrels in the week ended February 13th, 2025, slighlty paring a 13.4 million-barrel surge in the prior week which marked the sharpest increase since January 2023.\nLogin or create a forever free account to read this news"
            },
            {
                "title": "Hungary will suspend diesel shipments to Ukraine over interruption to Russian oil supply - Los Angeles Times",
                "source": "Los Angeles Times",
                "url": "https://www.latimes.com/world-nation/story/2026-02-18/hungary-will-suspend-diesel-shipments-to-ukraine-over-interruption-to-russian-oil-supply",
                "body": "Hungary will suspend diesel shipments to Ukraine over interruption to Russian oil supply\n-\nClick here to listen to this article - Share via\n- Hungary suspends diesel exports to Ukraine, accusing Kyiv—without evidence—of deliberately blocking Russian oil via the Druzhba pipeline since late January.\n- Ukraine denies the allegations, blaming Russian attacks for the pipeline damage. Hungary insists it has adequate reserves and describes the halt as political.\n- The escalating energy dispute reflects PM Orbán’s defiance of EU sanctions on Russian fuel ahead of his most challenging election in April.\nBUDAPEST, Hungary — Hungary is suspending its shipments of diesel to neighboring Ukraine until interruptions to Russian oil supplies via a pipeline that crosses Ukrainian territory are resolved, Hungary’s foreign minister said Wednesday.\nRussian oil shipments to Hungary and Slovakia have been interrupted since Jan. 27 after what Ukrainian officials say were Russian attacks that damaged the Druzhba pipeline, which carries Russian crude into Central Europe.\nHungary and Slovakia, which have both received a temporary exemption from a European Union policy prohibiting imports of Russian oil, have accused Ukraine — without providing evidence — of deliberately holding up supplies.\nIn a video posted on social media Wednesday, Hungarian Foreign Minister Péter Szijjártó said the interruption to oil deliveries was “a political decision made by the Ukrainian president himself.”\nUkraine has denied such accusations.\nSzijjártó added that Hungary has enough oil reserves to last more than three months, and that its energy security was assured.\nAs nearly every country in Europe has significantly reduced or entirely ceased Russian energy imports, Hungary — an EU and NATO member — has maintained and even increased its supply of Russian oil and gas since Moscow launched its war in Ukraine in February 2022.\nHungary’s nationalist Prime Minister Viktor Orbán has long argued Russian fossil fuels are indispensable for its economy and that switching to energy sourced from elsewhere would cause an immediate economic collapse — an argument some experts dispute.\nWidely seen as the Kremlin’s biggest advocate in the EU, Orbán has vigorously opposed the bloc’s efforts to sanction Moscow over its invasion, and blasted attempts to hit Russia’s energy revenues that help finance the war.\nFacing what promises to be the most challenging election of his last 16 years in power in April, Orbán has launched an aggressive anti-Ukraine and anti-EU campaign, seeking to convince voters that the neighboring country poses an existential risk to Hungary and that he is the only guarantor of its safety.\nFollowing the interruption to Druzhba oil supplies at the end of January, Hungary’s government asked neighboring Croatia to allow Russian oil delivered by sea to be pumped to refineries in Hungary and Slovakia via the Adria pipeline.\nCroatia’s Economy Minister Ante Šušnjar has said his country would not allow energy supplies in Central Europe be threatened, but pushed back on Hungary’s request.\nWriting on social media site X on Monday, Šušnjar said there are “no technical excuses left for staying tied to Russian crude for any EU country.”\n“A barrel bought from Russia may appear cheaper to some countries, but helps fund war and attacks on Ukrainian people,” he wrote.\nSpike writes for the Associated Press."
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "3.420",
            "open": "62.143",
            "close": "65.033",
            "high": "65.553",
            "low": "62.133"
        },
        "market_summary": "### Spot WTI Crude Oil Market Briefing\n* **Key Drivers:** U.S. crude inventories fell by **609,000 barrels**, reversing prior build; production rose to **13.713 million bpd**.\n* **Price Action:** WTI traded at **$65.25**, up **4.68%** on the day; Brent at **$70.38**, up **4.39%**.\n* **Technical Outlook:** Cushing inventories dropped **1.36 million barrels**; gasoline and distillate stocks declined.\n---\n**Overall Sentiment:** Positive 📈",
        "source_articles": [
            {
                "title": "U.S. Crude Oil Inventories Plunge Following Massive Build - Crude Oil Prices Today | OilPrice.com",
                "source": "Crude Oil Prices Today | OilPrice.com",
                "url": "https://oilprice.com/Latest-Energy-News/World-News/US-Crude-Oil-Inventories-Plunge-Following-Massive-Build.html",
                "body": "Shares of BHP Group jumped…\n\"It's most important 8 minute read of my week…\"\nThe American Petroleum Institute (API) estimated that crude oil inventories in the United States fell by 609,000 barrels in the week ending February 13, after increasing by 13.4 million barrels in the week prior.\nInventories in the US Strategic Petroleum Reserve (SPR) keep climbing week after week. The Department of Energy (DoE) reported that crude oil inventories rose by 200,000 barrels to 415.4 million barrels in the week ending February 13. This is 310.1 million barrels shy of maximum capacity.\nUS production stopped its fifth week in a row losing streak, with the average rising by 498,000 bpd during the week of February 6 to 13.713 million bpd, according to the latest EIA data. This is 219,000 bpd more than this same time last year.\nAt 2:13 pm ET, Brent crude was trading up on the day at $70.38 (+4.39%). Brent is now roughly $1.60 per barrel up from this time last week. WTI was also trading up on the day, by $2.92 (+4.68%) at $65.25.\nGasoline inventories also fell this week, shrinking by 312,000 barrels in the week ending February 13. In the week prior, gasoline inventories rose by 3.3 million barrels. As of last week, gasoline inventories were 4% above the five-year average for this time of year, according to the latest EIA data.\nDistillate inventories fell in the reporting period by 1.56 million barrels, after losing 2.0 million barrels in the week prior. Distillate inventories were 4% below the five-year average as of the week ending February 6, the latest EIA data shows.\nCushing inventory—the inventory kept at the delivery hub for the WTI Crude futures contract—fell by 1.36 million barrels, after increasing by 1.4 million barrels in the prior week.\nBy Julianne Geiger for Oilprice.com\nMore Top Reads From Oilprice.com\nADVERTISEMENT\nJulianne Geiger is a veteran editor, writer and researcher for Oilprice.com, and a member of the Creative Professionals Networking Group."
            },
            {
                "title": "Why U.S. shale output is holding up in a $60 oil world - 10/12 Industry Report",
                "source": "10/12 Industry Report",
                "url": "https://www.1012industryreport.com/oil-gas/why-u-s-shale-output-is-holding-up-in-a-60-oil-world/",
                "body": "U.S. oil production is defying gravity—and expectations, The Wall Street Journal writes.\nDespite crude prices falling below $60 a barrel and rig counts shrinking, American producers pumped a record 13.6 million barrels a day last year, buoyed by remote monitoring, longer horizontal wells and drilling innovations that squeeze more output from fewer rigs.\nThat resilience has helped keep gasoline prices lower and inflation in check―a political and economic win for the Trump administration.\nConsolidation has also reshaped the industry, with oil majors such as Chevron and ExxonMobil wielding stronger balance sheets and driving efficiency gains across the Permian Basin.\nBut the surge may not last. Analysts warn production could plateau as prime drilling acreage dwindles and shale fields mature, potentially setting the stage for higher prices later this decade."
            },
            {
                "title": "US Crude Oil Inventories Drop - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/te_news:526819:0-us-crude-oil-inventories-drop/",
                "body": "US Crude Oil Inventories Drop\nLess than 1 min read\nUS crude oil inventories fell by 0.61 million barrels in the week ended February 13th, 2025, slighlty paring a 13.4 million-barrel surge in the prior week which marked the sharpest increase since January 2023.\nLogin or create a forever free account to read this news"
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0075",
            "open": "1.1850",
            "close": "1.1782",
            "high": "1.1857",
            "low": "1.1782"
        },
        "market_summary": "### EUR/USD Market Briefing  \n* **Key Drivers:** Fed Minutes signal potential **rate hikes** if inflation persists; ECB succession uncertainty weighs on Euro.  \n* **Price Action:** Broke below **1.1850**, now trading near **1.1785**; bearish momentum intact.  \n* **Technical Outlook:** Next support at **1.1780**, with resistance at **1.1850** (former support-turned-resistance).  \n\n---\n**Overall Sentiment:** Negative 📉  \n\n### Key Levels to Watch:  \n- **Resistance:** 1.1850 (immediate), 1.1920 (stronger)  \n- **Support:** 1.1780 (200-day SMA), 1.1700 (deeper)  \n\n### Catalysts:  \n- **Fed Policy:** Hawkish stance on inflation; potential for further tightening.  \n- **ECB Uncertainty:** Lagarde’s potential early exit adds to Euro weakness.  \n- **Upcoming Data:** German/Eurozone PMI readings on Friday could influence near-term direction.  \n\n### Technical Notes:  \n- RSI in oversold territory, suggesting short-term correction risk.  \n- EUR/USD remains below 1.1890–1.1900, keeping medium-term trend bearish.  \n\n**Bottom Line:** Dollar strength and Euro weakness persist, with focus on Fed Minutes and ECB succession.",
        "source_articles": [
            {
                "title": "EUR/USD Trades Heavy as Fed Path Keeps US Dollar Yield Advantage Intact - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/analysis/eurusd-trades-heavy-as-fed-path-keeps-us-dollar-yield-advantage-intact-200675254",
                "body": "Asia stocks rise as tech gains offset rate uncertainty; ASX, KOSPI hit record high\nEUR/USD is oscillating around 1.1840–1.1850 after a clean slide from last week’s highs. The pair has already tested the 1.1820–1.1830 demand pocket and bounced, but every recovery into 1.1860–1.1870 is being sold. Price action is a controlled grind lower inside a wider 1.1765–1.2000 range, with the market now sitting in the lower half of that band where sellers historically have the upper hand. Intraday, the tape is heavy: lower highs, shallow bounces and quick rejections as soon as the pair pokes its head above 1.1850.\nThe macro balance still tilts toward the USD. Markets are pricing roughly 62 basis points of Fed easing for 2026, equivalent to two 25 bp cuts and about a 50% chance of a third, with the first move pencilled in around June. Softer inflation data recently encouraged that path, but the labour report showing the strongest employment growth in more than a year and an unexpected fall in unemployment reminded everyone that the US economy can still absorb tighter policy without stalling.\nThat combination keeps US real yields elevated and limits how far the dollar can fall ahead of the FOMC minutes and the next PCE core inflation release. On the European side, Germany’s and the euro area’s ZEW indices eased in February, confirming a weak growth pulse and leaving the EUR without a strong domestic catalyst. The ECB is trapped between sluggish activity and restrictive real rates, while the Fed at least enjoys better growth, and that relative gap is exactly what you see reflected in EUR/USD holding heavy below 1.19.\nThe dollar index is sitting around 97.2–97.6, respecting support and leaning against resistance without breaking either side decisively. On the four-hour chart, DXY is holding above a 0.382 Fibonacci retracement near 96.82 and pushing toward the 0.5 retracement zone around 97.21, with a rising trendline from roughly 95.55 still intact. The 200-period EMA around 97.9–98.0 caps the topside and forms a clear ceiling for now. Candles with small bodies and long wicks near 97.6 show indecision at resistance rather than a clean reversal lower, even as sentiment surveys show USD bearishness at the most extreme levels since roughly 2012. For EUR/USD, that mix means rallies struggle to extend: the euro does not get the full benefit of dollar dips, and any dollar stabilization quickly pushes the pair back toward the 1.1830–1.1800 area.\nOn the daily chart, EUR/USD is sliding inside a downward-tilting channel carved out below the mid-range of 1.1890–1.1900. The broader structure is a 1.1765–1.2000 box, and price is now pressing the lower half of that box. The key reference levels are clear on the chart. The 1.2000 handle is the upper boundary and psychological ceiling that has repelled prior advances. The 1.1927 and 1.1997 zones cluster recent swing highs and act as a resistance shelf capping rebounds. The 1.1890–1.1900 band is the mid-range; a daily close back above it would neutralise the immediate bearish tone but would not flip the trend on its own.\nThe 1.1856 zone is a tactical pivot that has flipped between resistance and support over the past sessions. The 1.1835 level is intermediate daily support and effectively the first structural line in the sand inside the range. The 1.1820–1.1830 pocket marks short-term demand, where buyers have repeatedly stepped in. The 1.1810 and 1.1800 levels are round-number supports that map closely to signal levels used in intraday strategies. Finally, 1.1765–1.1766 is the key structural floor where the wider range bottom and the 200-period EMA on the four-hour chart meet. As long as the pair trades below 1.1890–1.1900 and keeps respecting these lower supports, the medium-term trend remains a controlled down-drift rather than a reversal.\nShort-term, EUR/USD order flow is clustering around three narrow bands that define the day’s battle lines. The 1.1831–1.1835 zone has behaved as an intraday fulcrum. When"
            },
            {
                "title": "EUR/USD Plunges Below Critical 1.1850 Support as Markets Brace for Crucial FOMC Minutes - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/news/feed/38875-eur-usd-falls-fomc-minutes",
                "body": "EUR/USD Plunges Below Critical 1.1850 Support as Markets Brace for Crucial FOMC Minutes\nShare:\nBitcoinWorld\nEUR/USD Plunges Below Critical 1.1850 Support as Markets Brace for Crucial FOMC Minutes\nIn a significant move for global currency markets, the EUR/USD pair has decisively broken below the psychologically important 1.1850 level. This decline comes as traders worldwide adopt a cautious stance ahead of the imminent release of the Federal Open Market Committee (FOMC) Minutes. Consequently, market participants are scrutinizing every data point for clues on the future path of US monetary policy and its stark divergence from the European Central Bank’s stance.\nEUR/USD Technical Breakdown Below 1.1850\nThe breach of the 1.1850 handle represents a major technical development for the Euro Dollar pair. This level had previously acted as a key support zone throughout the latter part of the previous quarter. Market analysts immediately noted increased selling volume accompanying the break. Furthermore, the move triggered a cascade of stop-loss orders, accelerating the downward momentum. Technical indicators like the Relative Strength Index (RSI) subsequently entered oversold territory, signaling potential for a short-term correction. However, the overall chart structure now suggests a bearish bias in the near term.\nSeveral key technical levels now come into focus for traders. The next significant support zone resides near the 1.1780 area, which aligns with the 200-day simple moving average. A break below this level could open the path toward 1.1700. On the upside, any recovery attempt will likely face immediate resistance at the former support-turned-resistance level of 1.1850. Additionally, stronger resistance sits near the 1.1920 region, which coincides with a confluence of Fibonacci retracement levels.\nMarket Anticipation Builds for FOMC Minutes\nThe primary catalyst for the current forex market volatility is the scheduled release of the FOMC Minutes from the Federal Reserve’s latest policy meeting. These minutes provide a detailed record of the discussions among Fed officials. Investors meticulously parse this document for nuances on inflation outlook, employment goals, and the potential timing of future interest rate adjustments. The previous meeting had already signaled a more hawkish tilt from the central bank, with discussions beginning around the pace of balance sheet reduction.\nMarket expectations are currently centered on the language concerning inflation persistence. Specifically, traders are looking for any shift in the committee’s assessment of whether current price pressures are “transitory” or more entrenched. Any hint of concern over sustained inflation could reinforce expectations for a more aggressive tightening cycle. Conversely, a dovish undertone regarding economic growth risks could temper those expectations. This binary outcome creates significant uncertainty, which typically leads to heightened volatility and a stronger US Dollar as a safe-haven currency.\nExpert Analysis on Policy Divergence\nFinancial institutions like JPMorgan Chase and Goldman Sachs have published research notes highlighting the growing monetary policy divergence. The Federal Reserve has clearly entered a tightening phase, initiating rate hikes and outlining quantitative tightening plans. Meanwhile, the European Central Bank maintains a decidedly more accommodative stance, citing fragmented economic recovery across the Eurozone and lower underlying inflation pressures. This fundamental divergence creates a powerful tailwind for the US Dollar against the Euro.\nAccording to data from the Commodity Futures Trading Commission (CFTC), speculative net long positions on the Euro have decreased for three consecutive weeks. This shift in market positioning indicates that large funds are already betting on further Euro weakness. Historical data also shows that the USD tends to strengthen in the 48-hour window preceding the release of major Fed communic"
            },
            {
                "title": "Euro slumps below 1.1800 on hawkish Fed Minutes, eyes on ECB succession - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/eur-usd-slumps-below-11800-on-hawkish-fed-minutes-eyes-on-ecb-succession-202602182355",
                "body": "EUR/USD slumps below 1.1800 on hawkish Fed Minutes, eyes on ECB succession\n- EUR/USD falls to near 1.1785 in Thursday’s early Asian session.\n- Several Fed officials said further tightening may be required if inflation stays sticky.\n- ECB’s Lagarde may leave her job before the end of her term.\nThe EUR/USD pair tumbles to a near two-week low around 1.1785 during the early Asian session on Thursday. The US Dollar (USD) strengthens against the Euro (EUR) on hawkish FOMC minutes that revived speculation about potential interest rate hikes if inflation remains elevated.\nAccording to the FOMC Minutes from its January policy meeting, almost all participants favored holding rates steady, with only a couple preferring a rate cut. However, policymakers did not close the door on further reduction if inflation declined in line with their expectations. At the same time, Fed officials said they would have supported describing future decisions in more two-sided terms. Several members suggested that interest rate hikes could be necessary if price pressures persist.\nAcross the pond, European Central Bank (ECB) President Christine Lagarde may step down from her position earlier than her planned retirement in October 2027, per the Financial Times. The source said Lagarde wants to enable French President Emmanuel Macron and German Chancellor Friedrich Merz to find her replacement, without indicating when she may exit.\nTraders will closely monitor the preliminary Purchasing Managers' Index (PMI) readings from Germany and the Eurozone, which are scheduled for publication on Friday. In case of stronger-than-expected outcomes, this might help limit the shared currency’s losses in the near term.\nEuro FAQs\nThe Euro is the currency for the 20 European Union countries that belong to the Eurozone. It is the second most heavily traded currency in the world behind the US Dollar. In 2022, it accounted for 31% of all foreign exchange transactions, with an average daily turnover of over $2.2 trillion a day. EUR/USD is the most heavily traded currency pair in the world, accounting for an estimated 30% off all transactions, followed by EUR/JPY (4%), EUR/GBP (3%) and EUR/AUD (2%).\nThe European Central Bank (ECB) in Frankfurt, Germany, is the reserve bank for the Eurozone. The ECB sets interest rates and manages monetary policy. The ECB’s primary mandate is to maintain price stability, which means either controlling inflation or stimulating growth. Its primary tool is the raising or lowering of interest rates. Relatively high interest rates – or the expectation of higher rates – will usually benefit the Euro and vice versa. The ECB Governing Council makes monetary policy decisions at meetings held eight times a year. Decisions are made by heads of the Eurozone national banks and six permanent members, including the President of the ECB, Christine Lagarde.\nEurozone inflation data, measured by the Harmonized Index of Consumer Prices (HICP), is an important econometric for the Euro. If inflation rises more than expected, especially if above the ECB’s 2% target, it obliges the ECB to raise interest rates to bring it back under control. Relatively high interest rates compared to its counterparts will usually benefit the Euro, as it makes the region more attractive as a place for global investors to park their money.\nData releases gauge the health of the economy and can impact on the Euro. Indicators such as GDP, Manufacturing and Services PMIs, employment, and consumer sentiment surveys can all influence the direction of the single currency. A strong economy is good for the Euro. Not only does it attract more foreign investment but it may encourage the ECB to put up interest rates, which will directly strengthen the Euro. Otherwise, if economic data is weak, the Euro is likely to fall. Economic data for the four largest economies in the euro area (Germany, France, Italy and Spain) are especially significant, as they account for 75% of the Eurozone’s economy.\nAnother sig"
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0091",
            "open": "1.3552",
            "close": "1.3492",
            "high": "1.3582",
            "low": "1.3491"
        },
        "market_summary": "### GBP/USD Market Briefing\n* **Key Drivers:** Weak UK jobs data pushes BoE rate cut bets to **100% probability** for March.\n* **Price Action:** Fell below **1.3500**, testing **1.3490** support.\n* **Technical Outlook:** Stochastic near oversold; 50-day EMA at **1.3529**, 200-day EMA at **1.3435**.\n\n---\n**Overall Sentiment:** Bearish 📉",
        "source_articles": [
            {
                "title": "GBP/USD extends decline as weak jobs data bolsters BoE rate cut bets - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-usd-extends-decline-as-weak-jobs-data-bolsters-boe-rate-cut-bets-202602182307",
                "body": "GBP/USD extends decline as weak jobs data bolsters BoE rate cut bets\n- Pound Sterling hit by worsening labour market data as markets fully price a Bank of England cut by April.\n- UK unemployment rose to 5.2% in Q4, average earnings slowed to 4.2%, and claimant count surged 28.6K in January, strengthening the case for a Bank of England (BoE) March rate cut.\n- US Initial Jobless Claims and the Philadelphia Fed Manufacturing Survey on Thursday, along with multiple Fed speakers, will drive the US Dollar side; UK Retail Sales and PMI data on Friday complete a heavy week for Sterling.\nThe Pound Sterling (GBP) continued to backslide under sustained pressure on Wednesday, following through after the UK employment report on Tuesday showed a labour market deteriorating faster than expected. The Bank of England's (BoE) preferred measure of regular private sector wage growth dropped to a five-year low of 3.4%, removing a key obstacle that has kept the more hawkish Monetary Policy Committee (MPC) members from backing rate cuts. Markets now fully expect a 25-basis-point reduction by April, with a 76% probability of a March move. Wednesday's UK Consumer Price Index (CPI) did little to ease the burden on Bank of England (BoE) policymakers, especially after Producer Price Index (PPI) inflation and Retail Price Index figures all missed expectations.\nSharp sell-off drives Stochastic toward oversold as price tests the 50-day EMA\nOn the daily chart, GBP/USD shed 0.5% on Wednesday, extending the decline from four-year highs posted in January. Price is now toying with chart regions below the 50-day Exponential Moving Average (EMA). The 200-day EMA sits nearby at 1.3435, providing a deeper support floor. The Stochastic Oscillator is approaching the oversold zone, suggesting selling momentum is becoming stretched, and the pair may find some stabilization near current levels. The sell-off from recent highs high has now retraced roughly half the rally from the December lows, placing the pair at a key decision point. A sustained break below 1.3490 would target 1.3400 and the 200-day EMA. Recovery above the 50-day EMA at 1.3529 is needed to ease the bearish pressure.\nGBP/USD daily chart\nPound Sterling FAQs\nThe Pound Sterling (GBP) is the oldest currency in the world (886 AD) and the official currency of the United Kingdom. It is the fourth most traded unit for foreign exchange (FX) in the world, accounting for 12% of all transactions, averaging $630 billion a day, according to 2022 data. Its key trading pairs are GBP/USD, also known as ‘Cable’, which accounts for 11% of FX, GBP/JPY, or the ‘Dragon’ as it is known by traders (3%), and EUR/GBP (2%). The Pound Sterling is issued by the Bank of England (BoE).\nThe single most important factor influencing the value of the Pound Sterling is monetary policy decided by the Bank of England. The BoE bases its decisions on whether it has achieved its primary goal of “price stability” – a steady inflation rate of around 2%. Its primary tool for achieving this is the adjustment of interest rates. When inflation is too high, the BoE will try to rein it in by raising interest rates, making it more expensive for people and businesses to access credit. This is generally positive for GBP, as higher interest rates make the UK a more attractive place for global investors to park their money. When inflation falls too low it is a sign economic growth is slowing. In this scenario, the BoE will consider lowering interest rates to cheapen credit so businesses will borrow more to invest in growth-generating projects.\nData releases gauge the health of the economy and can impact the value of the Pound Sterling. Indicators such as GDP, Manufacturing and Services PMIs, and employment can all influence the direction of the GBP. A strong economy is good for Sterling. Not only does it attract more foreign investment but it may encourage the BoE to put up interest rates, which will directly strengthen GBP. Otherwise, if economic data is we"
            },
            {
                "title": "GBP/USD Under Pressure as Markets Price Aggressive BoE Easing - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/analysis/gbpusd-under-pressure-as-markets-price-aggressive-boe-easing-200675220",
                "body": "Asia stocks rise as tech gains offset rate uncertainty; ASX, KOSPI hit record high\n- Weakness in the labour market forces the Bank of England to cut rates.\n- India’s near-record imports provide support for precious metals.\nThe partial rebound of US stock indices allowed the EUR/USD to gain ground. The main currency pair managed to stay above 1.18 and went on the counterattack thanks to lower demand for the US dollar as a safe-haven asset. Investors are eagerly awaiting the release of the minutes from the January FOMC meeting and the US third-quarter GDP statistics.\nAccording to FOMC member Michael Barr and Chicago Fed President Austan Goolsbee, more evidence is needed that inflation is heading towards 2%. Suppose we see that the easing cycle could resume. San Francisco Fed President Mary Daly supported Kevin Warsh’s view that rapid economic growth is possible without accelerating inflation, thanks to artificial intelligence.\nThis position will allow the Fed to ease monetary policy. According to 38% of asset managers surveyed by Bank of America, Kevin Warsh will achieve a weakening of the US dollar, while Treasury bond yields will rise. 21% believe that Treasury yields will fall along with the greenback under the new Fed chair.\nGBP/USD quotes plummeted to a four-week low amid British unemployment growth to a five-year high and cooling wage growth. The futures market raised the probability of two rate cuts this year to 3.25% to almost 100%. Back in early February, he estimated the chances of such an outcome at approximately 50%. BBVA believes the Bank of England may go further. If derivatives start to predict a third, the pound will continue to weaken.\nAccording to the IMF, the Bank of Japan will raise its overnight rate three times in 2026-2027 to a neutral level of 1.5%. Along with capital repatriation, this will support the bears on USDJPY.\nPrecious metals were boosted by information about India’s near-record demand. In January, the country imported $12 billion worth of gold and $2 billion worth of silver. Higher numbers were only seen in October, with $14.7 billion and $2.7 billion, respectively. At the same time, the main source of speculative demand, China, is absent from the market due to the Lunar New Year celebrations. This is holding back the growth of gold and silver prices.\nThe FxPro Analyst Team\nWhich stock should you buy in your very next trade?\nAI computing powers are changing the stock market. Investing.com's ProPicks AI includes dozens of winning stock portfolios chosen by our advanced AI.\nYear to date, 2 out of 3 global portfolios are beating their benchmark indexes, with 88% in the green. Our flagship Tech Titans strategy doubled the S&P 500 within 18 months, including notable winners like Super Micro Computer (+185%) and AppLovin (+157%).\nWhich stock will be the next to soar?"
            },
            {
                "title": "Pound sterling struggles below 1.3500 vs. USD amid BoE rate cut bets - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/pound-sterling-struggles-near-four-week-low-vs-usd-below-13500-amid-boe-rate-cut-bets-202602190256",
                "body": "Pound Sterling struggles near four-week low vs. USD, below 1.3500 amid BoE rate cut bets\n- GBP/USD struggles to register any recovery from a four-week low touched this Thursday.\n- Bets for a March BoE rate cut continue to undermine the GBP and favor bearish traders.\n- The less dovish FOMC Minutes support the USD and back the case for a further decline.\nThe GBP/USD pair is seen consolidating its weekly losses registered over the past three days and oscillating in a narrow range near a four-week trough, touched during the Asians session on Thursday. Spot prices currently trade just below the 1.3500 psychological mark and seem vulnerable to slide further.\nThe British Pound (GBP) continues with its relative underperformance on the back of rising bets that the Bank of England (BoE) will cut interest rates at its next policy meeting in March. The expectations were reaffirmed by the disappointing UK jobs report and a fall in the UK consumer inflation to its lowest level in nearly a year. This, along with a bullish US Dollar (USD), validates the near-term negative outlook for the GBP/USD pair.\nThe January FOMC meeting Minutes released on Wednesday showed that policymakers were deeply divided over the necessity and timing of further interest rate cuts amid concerns over still sticky inflation. In fact, several Federal Reserve (Fed) officials indicated that more rate cuts could be warranted if inflation declines as expected, while others cautioned that easing too early could compromise the central bank's 2% inflation target.\nMeanwhile, reports that the US military is prepared to strike Iran as early as this weekend keep geopolitical risks in play, assisting the safe-haven Greenback in preserving the overnight strong gains to over a one-week high. This further backs the case for an extension of the GBP/USD pair's weekly downtrend, suggesting that any attempted recovery might now be seen as a selling opportunity and runs the risk of fizzling out rather quickly.\nTraders now look to Thursday's US economic docket – featuring the release of Weekly Initial Jobless Claims, the Philly Fed Manufacturing Index, and Pending Home Sales data. Apart from this, speeches from influential FOMC members will drive the USD and the GBP/USD pair later during the North American session. The focus, however, will remain glued to the US Personal Consumption Expenditure (PCE) Price Index, due on Friday.\nPound Sterling FAQs\nThe Pound Sterling (GBP) is the oldest currency in the world (886 AD) and the official currency of the United Kingdom. It is the fourth most traded unit for foreign exchange (FX) in the world, accounting for 12% of all transactions, averaging $630 billion a day, according to 2022 data. Its key trading pairs are GBP/USD, also known as ‘Cable’, which accounts for 11% of FX, GBP/JPY, or the ‘Dragon’ as it is known by traders (3%), and EUR/GBP (2%). The Pound Sterling is issued by the Bank of England (BoE).\nThe single most important factor influencing the value of the Pound Sterling is monetary policy decided by the Bank of England. The BoE bases its decisions on whether it has achieved its primary goal of “price stability” – a steady inflation rate of around 2%. Its primary tool for achieving this is the adjustment of interest rates. When inflation is too high, the BoE will try to rein it in by raising interest rates, making it more expensive for people and businesses to access credit. This is generally positive for GBP, as higher interest rates make the UK a more attractive place for global investors to park their money. When inflation falls too low it is a sign economic growth is slowing. In this scenario, the BoE will consider lowering interest rates to cheapen credit so businesses will borrow more to invest in growth-generating projects.\nData releases gauge the health of the economy and can impact the value of the Pound Sterling. Indicators such as GDP, Manufacturing and Services PMIs, and employment can all influence the direction of the GBP. "
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0052",
            "open": "0.7080",
            "close": "0.7042",
            "high": "0.7087",
            "low": "0.7034"
        },
        "market_summary": "### AUD/USD Market Briefing\n* **Key Drivers:** RBA hawkish minutes, softening growth signals, commodity strength\n* **Price Action:** Trading at **0.7040**, holding above 0.7000 support\n* **Technical Outlook:** Stochastic rolling off overbought, resistance at 0.7147\n\n---\n**Overall Sentiment:** Mixed ⚖️\n\n**RBA Hawkish Stance:** February minutes confirm \"stronger case\" for 25bp hike to 3.85%, citing persistent inflation and tight labor market. Wage growth rose to **3.4% YoY** in Q4 2025.\n\n**Growth Concerns:** Westpac-Melbourne Institute Leading Index slowed to **0.02%** in January, with consumer sentiment and housing approvals dragging. Six-month annualized growth dropped to **+0.02%** from +0.44%.\n\n**Commodity Support:** Iron ore prices and broader commodity strength (+0.36 percentage points to the leading index) underpin AUD despite a **4% currency appreciation** dampening gains.\n\n**Technical Picture:** AUD/USD holds above key EMAs (50-day at 0.6860, 200-day at 0.6640) but shows near-term indecision. Immediate support at **0.7000**, resistance at **0.7147** (YTD high).\n\n**Market Context:** Trade-weighted index at five-year highs (~65), with AUD benefiting from Fed rate cuts widening the interest rate differential. Fair value estimated at **0.72**, though short-term overshoot to 0.75-0.80 possible.",
        "source_articles": [
            {
                "title": "AUD/USD drifts lower after RBA minutes as jobs data looms - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/aud-usd-drifts-lower-after-rba-minutes-as-jobs-data-looms-202602182215",
                "body": "AUD/USD drifts lower after RBA minutes as jobs data looms\n- RBA minutes confirmed a hawkish tilt; Thursday's Australian employment report is the next test for the Australian Dollar\n- Reserve Bank of Australia (RBA) February meeting minutes showed the Board saw a \"stronger case\" for a 25 basis point hike to 3.85%, citing materially higher inflation and tight labour market conditions.\n- Australian January employment data on Thursday is forecast at 20K (prior 65.2K), with the unemployment rate expected to edge up to 4.2% from 4.1%.\nThe RBA minutes released on Tuesday reinforced the hawkish tone set by Governor Bullock's post-decision press conference, noting that private demand is growing faster than expected and capacity pressures are greater than previously assessed. The Board signalled it is prepared to hike again if inflation proves persistent, and Wednesday's Wage Price Index (WPI) at 0.8% MoM only underscored that message. Attention now shifts to Thursday's January employment report, where a forecast of 20K new jobs (down sharply from December's 65.2K) and a small tick higher in the Unemployment Rate will test whether the labour market is cooling quickly enough to cap further tightening. On the US side, Initial Jobless Claims and the Philadelphia Fed Manufacturing Survey on Thursday will add or hinder further US Dollar momentum.\nShallow pullback holds above 0.7000 as Stochastic begins to roll off overbought\nOn the daily chart, AUD/USD drifted lower on Wednesday, closing near 0.7040 and shedding 0.56% in a session confined to a narrow range. The pair continues to hold well above the rising 50-day Exponential Moving Average (EMA) at 0.6860 and the 200-day EMA at 0.6640, keeping overall bullish momentum from the late-December rally off 0.6600 firmly in place. The Stochastic Oscillator has crossed bearish from the overbought zone, suggesting near-term momentum is fading, and the pair may consolidate further before its next directional move. Recent candles show a series of small-bodied sessions near the 0.7050 area, pointing to indecision ahead of Thursday's employment release. Immediate support sits at 0.7000, with resistance at the year-to-date high of 0.7147; a break above would target the 0.7200 handle.\nAUD/USD daily chart\nAustralian Dollar FAQs\nOne of the most significant factors for the Australian Dollar (AUD) is the level of interest rates set by the Reserve Bank of Australia (RBA). Because Australia is a resource-rich country another key driver is the price of its biggest export, Iron Ore. The health of the Chinese economy, its largest trading partner, is a factor, as well as inflation in Australia, its growth rate and Trade Balance. Market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – is also a factor, with risk-on positive for AUD.\nThe Reserve Bank of Australia (RBA) influences the Australian Dollar (AUD) by setting the level of interest rates that Australian banks can lend to each other. This influences the level of interest rates in the economy as a whole. The main goal of the RBA is to maintain a stable inflation rate of 2-3% by adjusting interest rates up or down. Relatively high interest rates compared to other major central banks support the AUD, and the opposite for relatively low. The RBA can also use quantitative easing and tightening to influence credit conditions, with the former AUD-negative and the latter AUD-positive.\nChina is Australia’s largest trading partner so the health of the Chinese economy is a major influence on the value of the Australian Dollar (AUD). When the Chinese economy is doing well it purchases more raw materials, goods and services from Australia, lifting demand for the AUD, and pushing up its value. The opposite is the case when the Chinese economy is not growing as fast as expected. Positive or negative surprises in Chinese growth data, therefore, often have a direct impact on the Australian Dollar and its pairs.\nIron Ore"
            },
            {
                "title": "AUD/USD: Growth signals soften as RBA bias stays hawkish – BNY - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/aud-usd-growth-signals-soften-as-rba-bias-stays-hawkish-bny-202602181440",
                "body": "AUD/USD: Growth signals soften as RBA bias stays hawkish – BNY\nBNY’s Head of Markets Macro Strategy Bob Savage highlights that Australia’s Westpac-Melbourne Institute Leading Index slowed sharply, suggesting stalled momentum even as commodity prices support the Australian Dollar. The Reserve Bank of Australia remains biased toward further rate hikes if data allow, while AUD/USD trades near a longer-term value of 0.75, where exchange rate effects on inflation and trade are seen as diminishing.\nLeading index stalls while AUD holds\n\"New Zealand’s policy outlook is still different from Australia’s, as the RBNZ sees a neutral bias with balanced inflation risks, while the RBA is biased toward further hiking should the data support it.\"\n\"Australia’s Westpac-Melbourne Institute Leading Index slowed to 0.02% in January 2026.Six-month annualized growth slowed to +0.02% in January from +0.44% in December, indicating that economic momentum has stalled.\"\n\"The slowdown was driven by weaker consumer sentiment and housing approvals, offset partially by rising commodity prices. Consumer expectations and dwelling approvals reduced the index by 0.16 percentage points and 0.23 percentage points, respectively, over six months.\"\n\"Commodity prices added 0.36 percentage points, but gains were dampened by 4% AUD appreciation. Further RBA interest rate hikes are expected to weigh on growth.\"\n\"Australia’s wage price index rose 0.8% q/q inQ4 2025, matching the Q3 2025 increase and up from 0.7% in Q4 2024. Annual wage growth reached 3.4% y/y, up from 3.3% in Q3 2025 and 3.2% in Q4 2024.\"\n(This article was created with the help of an Artificial Intelligence tool and reviewed by an editor.)\nAuthor\nFXStreet Insights Team\nFXStreet\nThe FXStreet Insights Team is a group of journalists that handpicks selected market observations published by renowned experts. The content includes notes by commercial as well as additional insights by internal and external analysts."
            },
            {
                "title": "The stronger Aussie dollar looks here to stay – and it's not just travellers who are set to benefit - 9News.com.au",
                "source": "9News.com.au",
                "url": "https://www.9news.com.au/finance/australian-dollar-why-is-it-higher-what-happens-next-impact-economy-inflation-explained/26f64631-31ed-47ec-a0e7-ecfb4ee49859",
                "body": "The good times for Australians enjoying more affordable travel because of the strong dollar are likely to keep rolling, and there could be some welcome repercussions for those stuck at home, too.\nCurrently buying a smidge under 71 US cents, the Aussie dollar has been sitting at around three-year highs against the greenback for much of 2026, and is at an even better level against other currencies as a whole.\nThat's a far cry from just 10 months ago, when it sank to about 60 US cents following US President Donald Trump's tariff announcements last April.\nSo what's the reason for the turnaround, and how long is it going to last?\nWhy is the Australian dollar on the rise?\nThere are a few reasons at play here.\n\"At the current level, the US dollar is around 15 per cent below its mid-2022 peak and circa 1.5 per cent under its 10-year average,\" Westpac head of international economics Elliot Clarke wrote on Monday.\nTrump himself is a factor here, as investors look to limit their exposure to his unpredictable, volatile presidency.\n\"Investors are concerned that the US is no longer a safe place to park money,\" AMP deputy chief economist Diana Mousina said.\n\"Given the US attack on allies like Europe, reframing of international agreements and norms, the erratic nature of policy making from the Trump administration and US sanctions or freezing of foreign-owned US assets, (it's) leading countries to wonder if they are next.\"\nAt the same time, the US Federal Reserve has been cutting interest rates while the RBA pulled the trigger on what may be the first of several hikes.\n\"Another 1-2 rate cuts from the US Fed is likely this year, so even if the RBA keeps rates unchanged, the gap between Australian and US interest rates is widening,\" Mousina wrote.\n\"Historically, this has led to the Australian dollar appreciating against the US dollar.\"\nBut it's not just against the greenback that the Aussie is performing strongly. The trade-weighted index (TWI), which measures our dollar against a suite of other currencies, is at five-year highs of around 65.\nThat's partly due to interest rates, which have a lower short-term outlook in other Western economies than at home, but also thanks to surging commodity prices, which have historically boosted the Australian dollar.\nIs the higher dollar here to stay?\nWithout a reliable crystal ball to turn to, it's impossible to say for certain, but the signs are good – certainly a retreat to 60-US-cent lows appears highly unlikely.\nEqually, don't bank on a return to the good old days of the early 2010s, when the Aussie was at and even above parity with the greenback.\n\"The fair value of the Australian dollar is around 0.72 US cents, relatively close to its current value,\" Mousina said.\n\"So, on this measure the Australian dollar may not have much more upside.\n\"However, (it) has a tendency to overshoot once momentum builds, meaning a short-term move towards 0.75-0.80 US dollars cannot be ruled out.\n\"That said, such high levels are unlikely to be sustained.\n\"Over the next few months, we expect the Australian dollar to average around $US0.70-0.75 with a trade-weighted index of around 69.\"\nWhat does that actually mean for the Australian economy?\nObviously a stronger dollar is fantastic for any Australians heading overseas, who get far better bang for their buck than when the currency is trading lower (although it's bad news for tourists arriving here, who'll have to contend with a more expensive holliday).\nThe same is true for Australian businesses that import goods, however the opposite applies to exporters, whose wares become more expensive to international buyers.\nOverall, higher exchange rates can be a slight handbrake on the overall economic growth.\nWhile that's not great news for an economy that is only growing gradually, there's a silver lining here for businesses and borrowers worried about the potential for more interest rate hikes this year: a stronger currency can take the sting out of inflation – which is, of course"
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "0.7250",
            "open": "154.7720",
            "close": "155.0400",
            "high": "155.3380",
            "low": "154.6130"
        },
        "market_summary": "### USD/JPY Market Briefing\n* **Key Drivers:** BOJ tightening expectations, fiscal expansion risks, yen intervention trigger near **160**.\n* **Price Action:** Bounced from oversold zone, stalled at **155.30** (50-day EMA).\n* **Technical Outlook:** Support at **152.60** (200-day EMA), resistance at **155.30**.\n---\n**Overall Sentiment:** Neutral ⚖️\n\n**Key Takeaways:**\n- BOJ rate hike expectations pushed forward to mid-2025 (now 1% by June consensus)\n- 69% of economists expect intervention if USD/JPY nears 160\n- Japanese GDP miss (0.1% vs 0.4% expected) countered by BoJ tightening bets\n- Fiscal concerns weigh on JPY amid potential consumption tax suspension\n- Technicals show pair consolidating between 200-day and 50-day EMAs",
        "source_articles": [
            {
                "title": "BOJ expected to reach 1% by mid-year as yen intervention risks rise near 160 USD/JPY - investingLive",
                "source": "investingLive",
                "url": "https://investinglive.com/centralbank/boj-expected-to-reach-1-by-mid-year-as-yen-intervention-risks-rise-near-160-usdjpy-20260219/",
                "body": "Economists bring forward BOJ hike expectations and see yen intervention risk near 160.\nSummary:\nAll 76 economists expect the BOJ to hold rates steady in March\nMajority now see policy rate at 1% by end-June, earlier than pre-election view\nGrowing concern about fiscal expansion and yen weakness\n69% expect currency intervention if USD/JPY nears 160\nInflation risks and wage growth keep tightening bias intact\nExpectations for the Bank of Japan have shifted meaningfully in the wake of Prime Minister Sanae Takaichi’s election victory, with economists bringing forward forecasts for the next rate hike and increasing bets on potential currency intervention.\nAccording to a Reuters poll conducted February 10–18, all 76 economists expect the BOJ to leave its policy rate unchanged at its March meeting. However, beyond March, the outlook has turned more hawkish. A majority, 58%, now see the policy rate reaching 1% by the end of June, compared with just 36% in the January survey. Among those specifying timing, June was the most popular call, though a notable minority see April as a live possibility, while others expect July.\nThe shift reflects mounting concern over upside inflation risks, a still-weak yen and the implications of expansionary fiscal policy. The BOJ raised rates to 0.75% in December, the highest level in three decades, and signalled readiness to continue tightening, diverging from many global peers nearing the end of their rate-cutting cycles.\nCurrency dynamics remain central to the policy outlook. After briefly approaching the psychologically important 160 per dollar level in January, the yen rebounded sharply, but volatility has kept markets on alert. In the poll, 69% of economists said they expect Japanese authorities to intervene again in currency markets if the yen weakens materially. Among those, 40% identified the 160 per dollar level as the most likely trigger for action.\nFiscal policy is also influencing expectations. More than half of respondents expressed concern that a proposed two-year suspension of the consumption tax on food could strain public finances, potentially complicating the BOJ’s inflation outlook and bond market stability.\nWage growth remains a key variable. While economists expect solid increases in this year’s wage negotiations, expectations have moderated slightly compared with late last year, though still consistent with inflation running above target.\nOverall, the consensus is clear: March is likely a pause, but tightening toward 1% by mid-year is now the base case, with intervention risks rising should yen weakness re-emerge.\n\"Bid 160? Go ahead, make my day!\""
            },
            {
                "title": "USD/JPY bounces back as weak GDP and BoJ rate hike bets collide - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-jpy-bounces-back-as-weak-japanese-gdp-and-boj-rate-hike-bets-collide-202602182243",
                "body": "USD/JPY bounces back as weak Japanese GDP and BoJ rate hike bets collide\n- Yen gives back gains after Q4 GDP miss, but BoJ April hike expectations and Thursday's CPI data cap the upside.\n- Japan's Q4 GDP grew just 0.1% QoQ, missing the 0.4% consensus and narrowly avoiding a technical recession, while the International Monetary Fund (IMF) called on the BoJ to continue raising rates.\n- Thursday's Japanese January national CPI is the key event, with core inflation (ex-fresh food) expected near 2.0%; US initial jobless claims, the Philadelphia Fed Survey, and speeches from Fed officials round out a heavy calendar.\nUSD/JPY bounced on Wednesday after the Japanese Yen's (JPY) recent rally finally ran out of steam, which has been its best weekly performance since November 2024. Despite a growth miss in Japanese Gross Domestic Product (GDP) figures earlier this week, Bank of Japan (BoJ) rate hike expectations remain firmly in place; former board member Adachi said an April move is likely, and the International Monetary Fund (IMF) reiterated that Japan should continue normalizing policy. Thursday's Japanese National Consumer Price Index (CPI) inflation data is critical: a firm core reading would reinforce the case for BoJ tightening and could push the Yen stronger again, while a soft print would give the pair room to extend Wednesday's bounce.\nBounce off oversold zone meets resistance at the 50-day EMA\nOn the daily chart, USD/JPY opened Wednesday near the 153.00 handle before rising around 1%. The bounce produced a solid bullish candle, but price has stalled just below the 50-day EMA at 155.30, which is acting as immediate resistance. The 200-day EMA sits lower near 152.60, and price is trading between the two averages, suggesting the pair is in a transitional phase after the sharp sell-off from the January high near 159.45. The Stochastic Oscillator is turning higher from the oversold zone, suggesting downward momentum is fading, and a near-term relief rally could develop. A break above the 50-day EMA at 155.30 would target 156.00 and the mid-January consolidation area. Failure to clear it would leave the pair vulnerable to a retest of the 153.00 support and the 152.10 year-to-date low.\nUSD/JPY daily chart\nJapanese Yen FAQs\nThe Japanese Yen (JPY) is one of the world’s most traded currencies. Its value is broadly determined by the performance of the Japanese economy, but more specifically by the Bank of Japan’s policy, the differential between Japanese and US bond yields, or risk sentiment among traders, among other factors.\nOne of the Bank of Japan’s mandates is currency control, so its moves are key for the Yen. The BoJ has directly intervened in currency markets sometimes, generally to lower the value of the Yen, although it refrains from doing it often due to political concerns of its main trading partners. The BoJ ultra-loose monetary policy between 2013 and 2024 caused the Yen to depreciate against its main currency peers due to an increasing policy divergence between the Bank of Japan and other main central banks. More recently, the gradually unwinding of this ultra-loose policy has given some support to the Yen.\nOver the last decade, the BoJ’s stance of sticking to ultra-loose monetary policy has led to a widening policy divergence with other central banks, particularly with the US Federal Reserve. This supported a widening of the differential between the 10-year US and Japanese bonds, which favored the US Dollar against the Japanese Yen. The BoJ decision in 2024 to gradually abandon the ultra-loose policy, coupled with interest-rate cuts in other major central banks, is narrowing this differential.\nThe Japanese Yen is often seen as a safe-haven investment. This means that in times of market stress, investors are more likely to put their money in the Japanese currency due to its supposed reliability and stability. Turbulent times are likely to strengthen the Yen’s value against other currencies seen as more risky to invest in.\nA"
            },
            {
                "title": "USD/JPY Forecast: Stands firm amid fiscal woes, ahead of FOMC Minutes - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/analysis/usd-jpy-forecast-stands-firm-as-fiscal-woes-counter-hawkish-boj-ahead-of-fomc-minutes-202602180909",
                "body": "USD/JPY Forecast: Stands firm as fiscal woes counter hawkish BoJ ahead of FOMC Minutes\n- USD/JPY regains some positive traction on Wednesday as renewed fiscal concerns weigh on the JPY.\n- A positive risk tone also weighs on the safe-haven JPY and supports spot prices amid a firmer USD.\n- The divergent BoJ-Fed policy expectations warrant caution for bulls ahead of the FOMC Minutes.\nThe USD/JPY pair attracts fresh buyers following the previous day's good two-way price swings and sticks to intraday gains near the 153.70 region through the first half of the European session on Wednesday. The Japanese Yen (JPY) is pressured by renewed concerns about Japan's fiscal health and fears that Japan's Prime Minister Sanae Takaich will push back against further interest rate hikes by the Bank of Japan (BoJ). Apart from this, the prevailing risk-on mood further undermines the JPY's safe-haven status, which, along with a modest US Dollar (USD) uptick, turns out to be a key factor acting as a tailwind for the currency pair.\nData released earlier this week showed that Japan's Gross domestic product (GDP) grew 0.1% during the October-December quarter, undershooting market forecasts of 0.4% rise. Adding to this, the previous quarter's reading was revised down to show a contraction of 0.7%, putting extra pressure on Japan's PM Takaichi to announce more stimulus. The International Monetary Fund (IMF), however, warned against cutting the consumption tax, saying that it would erode Japan's fiscal space and raise debt risks. This adds to market worries that Takaichi’s fiscal spending would balloon Japan’s elevated debt-to-GDP ratio and weighs on the JPY.\nMeanwhile, traders have been pricing in the possibility that the central bank could raise interest rates as soon as March or April. That said, Takaichi's historic election victory has heightened market attention to whether the dovish premier will renew her calls for the central bank to keep interest rates low. This, to a larger extent, overshadowed data showing that Japan's exports rose at the fastest pace since November 2022. Moreover, the Reuters Tankan poll revealed that Japanese manufacturers' confidence rose for the first time in three months in February. Furthermore, the IMF urged Japan to raise rates to keep inflation expectations well anchored.\nThis comes on top of hopes that Takaichi could be fiscally responsible and that her policies will boost the economy, which might prompt the BoJ to stick to its policy normalization path. This marks a significant divergence in comparison to dovish Federal Reserve (Fed) expectations and should hold back the USD bulls from placing aggressive bullish bets. Investors might also opt to wait for the release of the FOMC Minutes for more cues about the Fed's rate-cut path. Apart from this, Japan's National Consumer Price Index (CPI) and the US Personal Consumption Expenditure (PCE) Price Index, both due on Friday, will provide a fresh impetus to the USD/JPY pair.\nUSD/JPY daily chart\nTechnical Analysis:\nFrom a technical perspective, spot prices once again showed some resilience near the 200-day Exponential Moving Average (EMA) earlier this week, and the subsequent move up favors bullish traders. The SMA is trending higher, preserving a broader bullish bias and cushioning setbacks.\nMoreover, the Moving Average Convergence Divergence (MACD) sits below the zero line with its negative reading contracting, suggesting fading bearish pressure. Adding to this, the Relative Strength Index (RSI) at 42 (neutral) is edging higher, aligning with stabilization attempts.\nMeasured from the 140.13 low to the 159.28 high, the 38.2% Fibonacci retracement at 151.97 offers near-term support, and a rebound from that area could target the 23.6% retracement at 154.76. A daily close beneath the said support would open room for deeper consolidation, while a close back above the 23.6% threshold would strengthen recovery prospects.\n(The technical analysis of this story was written with the "
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0068",
            "open": "1.3635",
            "close": "1.3694",
            "high": "1.3700",
            "low": "1.3632"
        },
        "market_summary": "### USD/CAD Market Briefing\n* **Key Drivers:** FOMC minutes hint at potential rate hikes, Oil prices rise amid US-Iran tensions, softer Canadian inflation data.\n* **Price Action:** Trading near **1.3695**, consolidating after touching a two-week high above **1.3700**.\n* **Technical Outlook:** Bulls aim for a breakout above **1.3700**; support at the 100-period SMA around **1.3617**.\n\n---\n**Overall Sentiment:** Neutral ⚖️\n\n**Key Technical Levels:**\n- **Resistance:** 1.3700 (psychological), 1.3730 (prior high)\n- **Support:** 1.3617 (100-period SMA), 1.3600 (psychological)\n\n**Fundamental Catalysts:**\n- **FOMC Minutes:** Hawkish tone supports USD strength.\n- **Oil Prices:** Crude above $63.00 boosts CAD.\n- **Canadian CPI:** 2.3% YoY (below expectations), fuels BoC rate cut bets.\n- **US Data Focus:** Q4 GDP, PCE, and PMI due Friday.\n\n**Market Positioning:**\n- USD remains bid post-FOMC, but CAD underpinned by Oil.\n- Technicals suggest bullish bias if 1.3700 breaks; bearish if 1.3617 fails.",
        "source_articles": [
            {
                "title": "USD / CAD - Canadian dollar idling ahead of FOMC minutes - Baystreet.ca",
                "source": "Baystreet.ca",
                "url": "https://www.baystreet.ca/articles/forex_trader.aspx",
                "body": "- Trump announces launch of “Massive” Japan investment\n- FOMC minutes due this afternoon.\n- US dollar trading sideways but with modest bid\nUSDCAD open: 1.3656, overnight range 1.3632.-1.3668, close 1.3638, WTI 63.00, Gold 4914.88\nThe Canadian dollar shrugged off yesterday’s soft inflation report. Headline CPI was 0% month over month versus a 0.1 % forecast, while core CPI rose 2.3 % compared with expectations for 2.4 %. The results were consistent with Bank of Canada projections and are unlikely to alter the current policy stance.\nPrime Minister Mark Carney unveiled Canada’s new defence strategy, saying it positions domestic industry to benefit from $180 billion in defence procurement opportunities and $290 billion in related capital investment over the next decade, with an estimated 125 billion dollars in downstream economic benefits by 2035.\nWTI traded in a 62.12 to 63.99 range and recouped yesterday’s losses, sitting near the session high in early NY trading. The rebound reflects fresh media reports suggesting a US attack on Iran is imminent, raising concerns about potential supply disruptions if shipments through the Strait of Hormuz are affected.\nThe US dollar is marginally higher in early NY trading following another subdued overnight session. Markets will sift through the FOMC minutes from the January 28 meeting for guidance on the path of US interest rates.\nAsian equity markets were subdued due to extended holidays. Japan’s Topix rose 1.21 % and Australia’s ASX 200 gained 0.54 %, while Chinese markets were closed.\nAs of 7:20 am, European bourses are higher. The FTSE 100 is up 1.0 %, the DAX has gained 0.94 %, and the CAC 40 is ahead by 0.53 %. S&P 500 futures are up 0.52 %. The US Dollar Index is 97.24, the 10-year Treasury yield is 4.071 %, and gold has rallied from 4,853.86 to 4,926.91.\nEURUSD traded in a 1.1829 to 1.1858 range and is sitting near the session low in early NY trading. Reports suggest ECB President Christine Lagarde may step down before her term ends added a layer of political uncertainty to the euro.\nGBPUSD traded in a 1.3550 to 1.3583 range and lacked clear direction despite fresh inflation data. UK CPI rose 3.0 % year over year in January, matching expectations but easing from 3.4 % in December. Producer prices were mixed and retail sales undershot forecasts at 3.8 % year over year versus 3.9 % expected and 4.2 % previously. Even so, the Bank of England is still widely expected to cut rates next month.\nUSDJPY traded in a 153.07 to 153.86 range and strengthened after a social media post from the US president touted a massive trade deal with Japan tied to a 550 billion dollar investment commitment.\nAUDUSD traded in a 0.7064 to 0.7088 range in thin conditions due to Asian holidays. AUDNZD demand boosted prices after the Reserve Bank of New Zealand left rates unchanged at 2.25 % and delivered a relatively tame statement.\nToday’s US data includes December Durable Goods Orders, Building Permits, Housing Starts, and Capacity Utilization."
            },
            {
                "title": "USD/CAD Forecast: Consolidates near two-week high, eyes 1.3700 - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-cad-price-forecast-consolidates-near-two-week-high-as-bulls-await-move-beyond-13700-202602190437",
                "body": "USD/CAD Price Forecast: Consolidates near two-week high as bulls await move beyond 1.3700\n- USD/CAD consolidates its recent strong gains to a nearly two-week top, touched this Thursday.\n- The USD preserves hawkish FOMC Minutes-inspired gains and acts as a tailwind for spot prices.\n- Bullish Oil prices underpin the Loonie and might cap gains despite a constructive technical setup.\nThe USD/CAD pair touches a nearly two-week high during the Asian session on Thursday and looks to extend the recent move up witnessed over the past week or so. Meanwhile, bulls await a sustained strength and acceptance above the 1.3700 mark before placing fresh bets amid mixed fundamental cues.\nThe US Dollar (USD) preserves the previous day's strong gains and stands firm near its highest level in over a week on the back of less dovish FOMC Minutes, which, in turn, acts as a tailwind for the USD/CAD pair. Meanwhile, Crude Oil prices gain some follow-through positive traction amid renewed US-Iran tensions, underpinning the commodity-linked Loonie and capping gains for the currency pair.\nFrom a technical perspective, this week's breakout through the 100-period Simple Moving Average (SMA) on the 4-hour chart, for the first time since January 22, favors the USD/CAD bulls. The Moving Average Convergence Divergence (MACD) histogram remains positive and has turned marginally higher, suggesting strengthening bullish momentum. With the MACD line above the Signal line near the zero mark, the tone improves. The Relative Strength Index (RSI) prints 65, above the midline and supportive of buyers.\nMeanwhile, the 100-period SMA’s gentle downward slope tempers conviction, but price action above the average preserves an upside bias. The MACD line staying above the Signal line and a widening positive histogram would underpin continuation, whereas a fade back toward the zero line would flag waning momentum. RSI at 65 is not overbought and could allow further extension if buyers maintain control. The SMA stands at 1.3617 and offers nearby dynamic support, and a close below it would open a corrective phase.\n(The technical analysis of this story was written with the help of an AI tool.)\nUSD/CAD 1-hour chart\nCanadian Dollar FAQs\nThe key factors driving the Canadian Dollar (CAD) are the level of interest rates set by the Bank of Canada (BoC), the price of Oil, Canada’s largest export, the health of its economy, inflation and the Trade Balance, which is the difference between the value of Canada’s exports versus its imports. Other factors include market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – with risk-on being CAD-positive. As its largest trading partner, the health of the US economy is also a key factor influencing the Canadian Dollar.\nThe Bank of Canada (BoC) has a significant influence on the Canadian Dollar by setting the level of interest rates that banks can lend to one another. This influences the level of interest rates for everyone. The main goal of the BoC is to maintain inflation at 1-3% by adjusting interest rates up or down. Relatively higher interest rates tend to be positive for the CAD. The Bank of Canada can also use quantitative easing and tightening to influence credit conditions, with the former CAD-negative and the latter CAD-positive.\nThe price of Oil is a key factor impacting the value of the Canadian Dollar. Petroleum is Canada’s biggest export, so Oil price tends to have an immediate impact on the CAD value. Generally, if Oil price rises CAD also goes up, as aggregate demand for the currency increases. The opposite is the case if the price of Oil falls. Higher Oil prices also tend to result in a greater likelihood of a positive Trade Balance, which is also supportive of the CAD.\nWhile inflation had always traditionally been thought of as a negative factor for a currency since it lowers the value of money, the opposite has actually been the case in modern times with the relaxation of c"
            },
            {
                "title": "Canadian Dollar strengthens to near 1.3700 on higher crude oil prices - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/canadian-dollar-strengthens-to-near-13700-on-higher-crude-oil-prices-202602190149",
                "body": "Canadian Dollar strengthens to near 1.3700 on higher crude oil prices\n- USD/CAD softens to near 1.3695 in Thursday’s Asian session.\n- Cooler Canadian inflation boosts BoC rate cut bets.\n- FOMC minutes revived speculation about potential interest rate hikes if inflation remains elevated.\nThe USD/CAD pair loses ground to around 1.3695 during the Asian trading hours on Thursday, pressured by higher crude oil prices. Nonetheless, softer Canadian inflation data has raised prospects the Bank of Canada (BoC) would resume its interest rate cutting campaign, which could weigh on the Canadian Dollar (CAD) against the Greenback.\nCrude oil prices rebounds amid persistent tensions between the US and Iran. This, in turn, boost the commodity-linked Loonie. It is worth noting that Canada is a major oil-exporting country, and higher crude oil prices generally have a positive impact on the CAD.\nCanada’s Consumer Price Index (CPI) inflation eased to 2.3% YoY in January from 2.4% in December, according to Statistics Canada on Tuesday. This figure came in below the market consensus of 2.4%. This report reinforced the case that the BoC will cut the key interest rate again, which could drag the CAD lower and act as a tailwind for the pair.\nOn the other hand, hawkish FOMC minutes from its January policy meeting could provide some support to the US Dollar (USD) in the near term. Several policymakers said that the Federal Reserve (Fed) may need to raise rates if inflation remains stubbornly high.\nOn Friday, traders will take more cues from the preliminary reading of the US Gross Domestic Product (GDP) for the fourth quarter (Q4), along with the Personal Consumption Expenditures (PCE) Price Index and S&P Global Purchasing Managers Index (PMI) reports.\nCanadian Dollar FAQs\nThe key factors driving the Canadian Dollar (CAD) are the level of interest rates set by the Bank of Canada (BoC), the price of Oil, Canada’s largest export, the health of its economy, inflation and the Trade Balance, which is the difference between the value of Canada’s exports versus its imports. Other factors include market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – with risk-on being CAD-positive. As its largest trading partner, the health of the US economy is also a key factor influencing the Canadian Dollar.\nThe Bank of Canada (BoC) has a significant influence on the Canadian Dollar by setting the level of interest rates that banks can lend to one another. This influences the level of interest rates for everyone. The main goal of the BoC is to maintain inflation at 1-3% by adjusting interest rates up or down. Relatively higher interest rates tend to be positive for the CAD. The Bank of Canada can also use quantitative easing and tightening to influence credit conditions, with the former CAD-negative and the latter CAD-positive.\nThe price of Oil is a key factor impacting the value of the Canadian Dollar. Petroleum is Canada’s biggest export, so Oil price tends to have an immediate impact on the CAD value. Generally, if Oil price rises CAD also goes up, as aggregate demand for the currency increases. The opposite is the case if the price of Oil falls. Higher Oil prices also tend to result in a greater likelihood of a positive Trade Balance, which is also supportive of the CAD.\nWhile inflation had always traditionally been thought of as a negative factor for a currency since it lowers the value of money, the opposite has actually been the case in modern times with the relaxation of cross-border capital controls. Higher inflation tends to lead central banks to put up interest rates which attracts more capital inflows from global investors seeking a lucrative place to keep their money. This increases demand for the local currency, which in Canada’s case is the Canadian Dollar.\nMacroeconomic data releases gauge the health of the economy and can have an impact on the Canadian Dollar. Indicators such as GDP, Manufacturing a"
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "1.6670",
            "open": "207.6560",
            "close": "208.8670",
            "high": "209.2090",
            "low": "207.5420"
        },
        "market_summary": "### GBP/JPY Market Briefing  \n* **Key Drivers:** JPY weakness amid BoJ-BoE policy divergence; UK inflation contraction.  \n* **Price Action:** Rebounded from two-month low near 207.22, holding above 208.00.  \n* **Technical Outlook:** Bullish bias intact; resistance at 209.50, support at 206.80.  \n---  \n**Overall Sentiment:** Positive 📈  \n\n**Key Developments:**  \n- **JPY Underperformance:** Weak Japanese GDP and fiscal concerns offset BoJ tightening bets.  \n- **UK Inflation Data:** January CPI fell 0.5% MoM (3.0% YoY), easing BoE rate hike pressure.  \n- **Policy Divergence:** BoJ’s accommodative stance contrasts with BoE’s cautious approach.  \n- **Technical Breakout:** GBP/JPY surged above 208.00 after testing 205.50 support.  \n\n**Risk Events Ahead:**  \n- **Japan’s National CPI** (Friday): Could influence BoJ policy expectations.  \n- **Global PMIs:** May drive risk sentiment and JPY demand.  \n\n**Market Focus:** BoJ-BoE divergence and UK inflation trends remain pivotal for GBP/JPY direction.",
        "source_articles": [
            {
                "title": "GBP/JPY nears weekly high as JPY weakness offset BoJ-BoE divergence - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-eyes-weekly-top-on-jpy-weakness-remains-below-mid-20900s-amid-boj-boe-divergence-202602190520",
                "body": "GBP/JPY eyes weekly top on JPY weakness; remains below mid-209.00s amid BoJ-BoE divergence\n- GBP/JPY scales higher for the second straight day on Thursday amid a broadly weaker JPY.\n- The divergent BoJ-BoE policy expectations might keep a lid on any further appreciation.\n- Traders might also opt to wait for Friday’s release of Japan’s National CPI and global PMIs.\nThe GBP/JPY cross attracts buyers for the second consecutive day and climbs to the top end of its weekly range during the Asian session on Thursday. Spot prices, however, lack bullish conviction and remain below mid-209.00s, warranting caution before positioning for an extension of this week's bounce from the 207.30-207.25 region, or a nearly two-month low.\nThe Japanese Yen (JPY) continues with its relative underperformance amid concerns about Japan's fiscal health and turns out to be a key factor acting as a tailwind for the GBP/JPY cross. Japan's Prime Minister Sanae Takaichi is expected to roll out policies to help revive the economy after a landslide victory in a general election earlier this month. Moreover, Japan's weak GDP growth data puts extra pressure on Japan's PM Takaichi to announce more stimulus.\nMeanwhile, the International Monetary Fund (IMF) warned against cutting the consumption tax, saying that it would erode Japan's fiscal space and raise debt risks. This, along with the underlying bullish sentiment, undermines the JPY's safe-haven status and lends additional support to the GBP/JPY cross. Investors, however, seem convinced that Takaichi's policies will boost the economy and prompt the Bank of Japan (BoJ) to stick to its policy-tightening path.\nThe hawkish BoJ expectations mark a significant divergence in comparison to the growing acceptance that the Bank of England (BoE) will cut interest rates as early as the March meeting. The bets were reaffirmed by the disappointing UK jobs report and a fall in the UK consumer inflation to its lowest level in nearly a year. This, in turn, might hold back bullish traders from placing aggressive bets around the GBP/JPY cross and keep a lid on any meaningful appreciation.\nThe market focus now shifts to the release of Japan's National Consumer Price Index (CPI) on Friday. Furthermore, the flash global PMIs will influence the broader risk sentiment, which will drive demand for the JPY and provide some meaningful impetus to the GBP/JPY cross. From a technical perspective, bearish traders need to wait for a sustained break and acceptance below the 100-day Simple Moving Average (SMA) support before positioning for any further losses.\nJapanese Yen Price This week\nThe table below shows the percentage change of Japanese Yen (JPY) against listed major currencies this week. Japanese Yen was the strongest against the British Pound.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Japanese Yen from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent JPY (base)/USD (quote).\nAuthor\nHaresh Menghani\nFXStreet\nHaresh Menghani is a detail-oriented professional with 10+ years of extensive experience in analysing the global financial markets."
            },
            {
                "title": "GBP/JPY Surges: Dramatic Rebound from Two-Month Low as Weaker Yen Fuels Recovery Ahead of UK Inflation Data - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/news/feed/09fe6-gbp-jpy-rebound-weaker-yen",
                "body": "GBP/JPY Surges: Dramatic Rebound from Two-Month Low as Weaker Yen Fuels Recovery Ahead of UK Inflation Data\nShare:\nBitcoinWorld\nGBP/JPY Surges: Dramatic Rebound from Two-Month Low as Weaker Yen Fuels Recovery Ahead of UK Inflation Data\nLondon, April 2025 – The GBP/JPY currency pair staged a remarkable recovery this week, surging back above the critical 208.00 level after hitting its lowest point in two months. This dramatic rebound comes as the Japanese Yen shows unexpected weakness against major currencies, while traders position themselves ahead of Thursday’s crucial UK Consumer Price Index (CPI) announcement. Market analysts now watch closely as this currency cross demonstrates renewed volatility amid shifting global monetary policy expectations.\nGBP/JPY Technical Analysis: Understanding the Rebound Pattern\nThe GBP/JPY pair’s recovery represents a significant technical development in forex markets. After testing support near 205.50 earlier this month, the currency cross has gained approximately 1.2% in just three trading sessions. This movement reflects changing sentiment toward both currencies involved in this important financial instrument. Furthermore, the Bank of Japan’s continued accommodative stance contrasts with the Bank of England’s more hawkish positioning, creating fundamental divergence that traders actively monitor.\nSeveral technical indicators now suggest potential for further GBP/JPY gains. The pair recently broke above its 20-day moving average, typically considered a short-term bullish signal. Additionally, trading volume increased significantly during the recovery phase, indicating genuine institutional interest rather than temporary market noise. Market participants particularly note the 208.00 level’s psychological importance, as this round number often serves as both support and resistance in currency trading.\nKey Technical Levels for GBP/JPY Traders\nProfessional traders currently monitor several critical price zones for the GBP/JPY pair. The immediate resistance sits near 209.50, where previous price action created selling pressure in March. Conversely, support has established itself around 206.80, where buying interest emerged during last week’s decline. These technical levels gain additional significance when combined with fundamental developments, creating potential trading opportunities for both short-term and position traders in the forex market.\nJapanese Yen Weakness: Fundamental Drivers Behind the Movement\nThe Japanese Yen’s recent underperformance stems from multiple interconnected factors. Primarily, the Bank of Japan maintains its ultra-loose monetary policy despite global tightening trends. This policy divergence creates natural pressure on the Yen against currencies from central banks pursuing higher interest rates. Additionally, improving risk sentiment in global markets reduces demand for traditional safe-haven assets like the Japanese currency. Consequently, the Yen has weakened against most major counterparts this month, not just the British Pound.\nSeveral specific developments contributed to the Yen’s softness. First, Japanese inflation data surprised to the downside, reducing expectations for imminent policy normalization. Second, equity markets showed resilience despite earlier concerns, diminishing defensive currency flows. Third, commodity price stability reduced demand for the Yen as a hedge against volatility. These factors combined to create what analysts describe as a “perfect storm” of Yen weakness, providing tailwinds for the GBP/JPY recovery.\nBank of Japan Policy Outlook\nMarket participants increasingly believe the Bank of Japan will maintain its yield curve control framework through mid-2025. Governor Kazuo Ueda recently emphasized the need for continued monetary support until sustainable inflation reaches the 2% target. This commitment to accommodation contrasts sharply with other major central banks, creating what currency strategists call “policy divergence trades.” The "
            },
            {
                "title": "GBP/JPY clings to gains above 208.00 despite weak UK inflation data - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-clings-to-gains-above-20800-despite-weak-uk-inflation-data-202602180735",
                "body": "GBP/JPY clings to gains above 208.00 despite weak UK inflation data\n- GBP/JPY is trading at 208.00 with the two-month low at 207.22 at hand.\n- UK inflation contracted in January amid a significant decline in retail prices.\n- Yen recovery lost momentum earlier this week, following weak Japanese GDP figures.\nThe Pound (GBP) has been little moved following a string of UK inflation figures for January and remains trading right above 208.00 against the Japanese Yen (JPY), with the two-month lows of 207.22 at a short distance.\nUK Consumer Price Index (CPI) released earlier on Wednesday has shown a significant decline in inflation, providing some leeway for the Bank of England (BoE), to ease its monetary policy further. Headline inflation contracted 0.5% in January, reversing a 0.4% advance in December, while yearly inflation eased to 3.0% from 3.4% in the previous month, figures in line with the market consensus.\nUK retail prices dropped sharply in January\nThe soft inflation figures have been driven mostly by a sharp decline in retail prices. January’s Retail Price Index has dropped 0.5% on the month and slowed down to a 3.8% yearly growth after growing 0.7% and 4.2% respectively in December.\nProducer prices have been mixed, with the Input PPI bouncing up 0.4% after a 0.5% contraction last month and falling 0.2% from January last year. Output prices, however, have stalled in January and slowed down to a 2.5% yearly growth from 3.1% last month.\nIn Japan, data released on Wednesday revealed the Merchandise Trade Balance improved for the fifth consecutive month, although the weak Japanese Gross Domestic Product (GDP) figures released earlier in the week keep weighing on Yen rallies.\nEconomic Indicator\nConsumer Price Index (MoM)\nThe United Kingdom (UK) Consumer Price Index (CPI), released by the Office for National Statistics on a monthly basis, is a measure of consumer price inflation – the rate at which the prices of goods and services bought by households rise or fall – produced to international standards. It is also the inflation measure used in the government’s target. The MoM figure compares the prices of goods in the reference month to the previous month. Generally, a high reading is seen as bullish for the Pound Sterling (GBP), while a low reading is seen as bearish.\nRead more.Last release: Wed Feb 18, 2026 07:00\nFrequency: Monthly\nActual: -0.5%\nConsensus: -0.5%\nPrevious: 0.4%\nSource: Office for National Statistics\nEconomic Indicator\nConsumer Price Index (YoY)\nThe United Kingdom (UK) Consumer Price Index (CPI), released by the Office for National Statistics on a monthly basis, is a measure of consumer price inflation – the rate at which the prices of goods and services bought by households rise or fall – produced to international standards. It is the inflation measure used in the government’s target. The YoY reading compares prices in the reference month to a year earlier. Generally, a high reading is seen as bullish for the Pound Sterling (GBP), while a low reading is seen as bearish.\nRead more.Last release: Wed Feb 18, 2026 07:00\nFrequency: Monthly\nActual: 3%\nConsensus: 3%\nPrevious: 3.4%\nSource: Office for National Statistics\nThe Bank of England is tasked with keeping inflation, as measured by the headline Consumer Price Index (CPI) at around 2%, giving the monthly release its importance. An increase in inflation implies a quicker and sooner increase of interest rates or the reduction of bond-buying by the BOE, which means squeezing the supply of pounds. Conversely, a drop in the pace of price rises indicates looser monetary policy. A higher-than-expected result tends to be GBP bullish.\nAuthor\nGuillermo Alcala\nFXStreet\nGraduated in Communication Sciences at the Universidad del Pais Vasco and Universiteit van Amsterdam, Guillermo has been working as financial news editor and copywriter in diverse Forex-related firms, like FXStreet and Kantox."
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "2,624.0000",
            "open": "67,622.5000",
            "close": "66,288.5000",
            "high": "68,443.5000",
            "low": "65,819.5000"
        },
        "market_summary": "### BTC/USD Market Briefing  \n* **Key Drivers:** Bitcoin ETF outflows hit **$3.8 billion** over 4 weeks; institutional deleveraging accelerates.  \n* **Price Action:** Testing **$60,000** support; futures open interest dropped 20% to **$49 billion**.  \n* **Technical Outlook:** Extreme Fear (13/100) on Crypto Fear & Greed Index; potential for further selling if **$60K** breaks.  \n---  \n**Overall Sentiment:** Negative 📉  \n\n**Regional Dynamics:** While U.S. ETFs see outflows, Germany and Switzerland attracted **$230 million** in inflows, suggesting localized rather than global panic.  \n\n**Institutional Activity:** Brevan Howard reduced Bitcoin ETF holdings while expanding options positions, signaling hedging against further downside.  \n\n**Market Context:** Analysts view the sell-off as an \"orderly\" deleveraging cycle, with leveraged traders exiting and long-term HODLers remaining.",
        "source_articles": [
            {
                "title": "Bitcoin ETF Outflows Hit 4-Week Streak: Are Institutions Expecting Price at $60K? - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/bitcoin-etf-outflows-hit-4-181626850.html",
                "body": "If you have been checking your portfolio lately and feeling a knot in your stomach, you definitely aren’t alone. Bitcoin price has been relentless recently, and unfortunately, the direction has been down.\nThe latest numbers confirm what many of us feared: Bitcoin ETF outflows have hit a four-week streak, totaling roughly $3.8 billion in exits.\nIt looks like the big players are stepping back, with prices testing the mid-$60,000s. But does this mean the institutional run is over, or is this just a necessary pit stop before the next leg up? Let’s break down what is actually happening behind the scary red candles.\n(Source: Coinglass)\nThis matters because the $60,000 level is a massive psychological line in the sand. If we lose this support, it could trigger even more selling. However, it is important to remember that markets move in cycles.\nWhile the U.S. seems to be selling, investment products in Germany and Switzerland actually attracted $230 million recently, showing that this isn’t a global panic: it is largely a U.S.-centered shakeout.\nDISCOVER: Best New Cryptocurrencies to Invest in 2026\nWhat the Data Actually Shows About the Drop\nSo, why is everyone selling? According to a recent VanEck Bitcoin analysis, this isn’t a sign that Bitcoin is “broken.” Instead, it is a classic case of Institutional deleveraging.\nVanEck notes that futures “open interest” (the total value of active betting contracts) dropped from $61 billion to $49 billion in just a week. That is a massive 20% wipeout of leverage.\n(Source: Coinglass)\nWhile the drop feels violent, it is actually “orderly” compared to past crashes. However, the speed was intense. The move was so fast that it registered as a rare statistical event—something analysts call a “tail event.” Currently, the Crypto Fear and Greed Index is at “Extreme Fear” (13/100), a level we typically see only near market bottoms.\nEssentially, the “tourists” who borrowed too much money to bet on Bitcoin price are being washed out, leaving only the long-term holders called HODLers.\nDISCOVER: Top Solana Meme Coins to Buy in 2026\nFollow 99Bitcoins on X For the Latest Market Updates and Subscribe on YouTube For Daily Expert Market Analysis.\nRead original story Bitcoin ETF Outflows Hit 4-Week Streak: Are Institutions Expecting Price at $60K? by Alex Ioannou at 99bitcoins.com"
            },
            {
                "title": "Brevan Howard Cuts Bitcoin ETF Holding, Expands Options Position - Bloomberg",
                "source": "Bloomberg",
                "url": "https://www.bloomberg.com/news/articles/2026-02-18/brevan-howard-cuts-ibit-etf-holdings-86-expands-options-position",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            },
            {
                "title": "Bitcoin ETF Resilience Masks Harsh Reality as Price Crash Tests $60,000 Support - TipRanks",
                "source": "TipRanks",
                "url": "https://www.tipranks.com/news/bitcoin-etf-resilience-masks-harsh-reality-as-price-crash-tests-60000-support",
                "body": "www.tipranks.com\nPerforming security verification\nThis website uses a security service to protect against malicious bots. This page is displayed while the website verifies you are not a bot.\nThis website uses a security service to protect against malicious bots. This page is displayed while the website verifies you are not a bot."
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "115.9000",
            "open": "1,998.4800",
            "close": "1,939.3000",
            "high": "2,036.8500",
            "low": "1,920.9500"
        },
        "market_summary": "### ETH/USD Market Briefing  \n* **Key Drivers:** DeFi oracle failures trigger 2.7% decline; **$1.78M** Moonwell bad debt exposes smart contract risks.  \n* **Price Action:** Trading at **$1,945.31**, below key supports; RSI at **31.46** (oversold).  \n* **Technical Outlook:** Strong downtrend (ADX **46.04**); support at **$1,922**, next at **$1,800**.  \n---  \n**Overall Sentiment:** Negative 📉  \n* **Near-Term Risk:** Break below **$1,922** could accelerate losses to **$1,500**.  \n* **Bullish Catalyst:** Relief rally to **$2,200-$2,400** if RSI bounces from oversold levels.  \n* **Long-Term View:** Forecasts suggest recovery to **$2,571.46** (Q1 2026) if DeFi concerns ease.  \n---  \n**Trading Activity:** Volume elevated at **346.7M**; MFI at **29.76** confirms bearish momentum.  \n**Institutional Focus:** Oracle security upgrades and regulatory clarity critical for sentiment shift.",
        "source_articles": [
            {
                "title": "Ethereum USD Faces 2.7% Decline Amid DeFi Oracle Failures - Meyka",
                "source": "Meyka",
                "url": "https://meyka.com/blog/ethereum-usd-faces-27-decline-amid-defi-oracle-failures-1802/",
                "body": "Ethereum USD Faces 2.7% Decline Amid DeFi Oracle Failures\nEthereum USD is trading at $1,945.31 as of February 18, 2026, down 2.7% over the past day. The second-largest cryptocurrency by market cap faces headwinds from recent DeFi platform failures tied to misconfigured price oracles. These technical glitches have exposed vulnerabilities in the broader Ethereum ecosystem, raising questions about data integrity and smart contract security. Understanding why Ethereum USD is declining requires examining both the immediate market catalysts and the underlying technical signals that suggest further volatility ahead.\nWhy Is Ethereum USD Declining Today?\nEthereum USD’s 2.7% daily decline reflects broader concerns about DeFi protocol security. On February 15, 2026, Moonwell, a lending platform built on Ethereum’s Layer 2 networks, suffered a critical oracle misconfiguration that resulted in $1.78 million in bad debt. The error caused cbETH (Coinbase Wrapped ETH) to be valued at just $1 instead of its actual market price near $2,200, triggering automated liquidations and exploits.\nThis incident highlights systemic risks within Ethereum-based DeFi applications. When price feeds fail, liquidation cascades can wipe out collateral positions and create cascading losses across interconnected protocols. The Moonwell incident follows similar oracle failures at Ribbon Finance in December 2025, which cost $2.7 million. These recurring vulnerabilities suggest that Ethereum USD price movements are increasingly tied to smart contract risks, not just macroeconomic factors. Source\nEthereum USD Technical Analysis\nEthereum USD’s technical indicators reveal deeply oversold conditions with a strong downtrend in place. The RSI at 31.46 signals extreme selling pressure, with readings below 30 typically indicating oversold territory where bounces become possible. The MACD histogram at -23.47 shows bearish momentum, though the signal line at -257.26 suggests the selling pressure may be stabilizing.\nThe ADX at 46.04 confirms a strong downtrend with conviction, meaning lower prices are likely to persist without a reversal catalyst. Ethereum USD is trading well below its 50-day moving average of $2,724.41 and 200-day average of $3,529.08, indicating a sustained bearish structure. Support levels are critical: the Bollinger Band lower level at $1,518.97 and the day low of $1,922.59 represent key technical floors. If Ethereum USD breaks below $1,922, the next support zone sits near $1,800.\nEthereum USD Price Forecast\nMonthly Forecast: Ethereum USD could test $1,542.36 by end of February, representing a -20.7% decline from current levels if selling pressure intensifies. Quarterly Forecast: By end of Q1 2026, Ethereum USD may recover to $2,571.46, a +32.2% gain if DeFi concerns ease and technical oversold conditions trigger a relief rally. Yearly Forecast: By February 2027, Ethereum USD could reach $3,118.61, a +60.3% increase if regulatory clarity improves and oracle infrastructure upgrades restore confidence in smart contract platforms.\nThese forecasts assume that Ethereum USD stabilizes after the current technical washout. A sustained break below $1,900 could accelerate declines toward $1,500. Conversely, if the RSI bounces from oversold levels and the ADX weakens, a relief rally toward $2,200-$2,400 becomes probable within 2-4 weeks. Forecasts may change due to market conditions, regulations, or unexpected events.\nMarket Sentiment and Trading Activity\nTrading volume in Ethereum USD remains elevated at 346.7 million against a 30-day average of 311.3 million, indicating active participation during the decline. The relative volume of 1.03 shows slightly above-average activity, suggesting institutional and retail traders are actively positioning for further downside or accumulating at lower prices.\nLiquidation data reflects the stress in leveraged positions. The Money Flow Index at 29.76 signals that selling volume is outpacing buying volume, confirming bearish sentim"
            },
            {
                "title": "The Daily: Peter Thiel and Founders Fund exit ETHZilla, K33 says bitcoin is approaching 'late bear market territory,' and more - The Block",
                "source": "The Block",
                "url": "https://www.theblock.co/post/390379/the-daily-peter-thiel-and-founders-fund-exit-ethzilla-k33-says-bitcoin-is-approaching-late-bear-market-territory-and-more",
                "body": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data.\nYou can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page."
            },
            {
                "title": "Crypto Price Prediction Today 18 February – XRP, Bitcoin, Ethereum - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/news/feed/91085-crypto-price-prediction-today-18-february-xrp-bitcoin-ethereum",
                "body": "Crypto Price Prediction Today 18 February – XRP, Bitcoin, Ethereum\nShare:\nXRP could potentially triple to $5 with new regulatory approvals for ETFs, emphasizing its utility in global remittances. Bitcoin's demand remains strong amidst geopolitical tensions, while ETH may retest its ATH of $4,946 as DeFi continues to thrive. New project Bitcoin Hyper raised $31.5 million, combining Bitcoin's features with enhanced capabilities, indicating significant interest in crypto innovation.\nAlthough current prices sit well below recent peaks, ongoing industry developments and technical indicators suggest XRP, Bitcoin and Ethereum may be setting new all-time highs (ATHs) sooner than you think.\nBelow is a closer look at what could be happening in the news and on the price charts over the next fiscal quarter and a half.\nDiscover: The best meme coins in the world right now.\nXRP (XRP): Ripple’s On-Chain SWIFT Replacement Could Rally to $5\nWith a market cap of $88 billion, XRP ($XRP) remains the leading cryptocurrency in global remittance.\nRipple designed the XRP Ledger (XRPL) as a blockchain for the traditional SWIFT system, offering faster transaction settlement and significantly reduced costs for both institutions and individuals.\nRecently, Ripple has reaffirmed its vision, highlighting XRPL’s preparedness for stablecoins and real-world asset tokenization, while hghlighting XRP’s central role within the ecosystem.\nFurthermore, reports by United Nations Capital Development Fund and the White House emphasize XRP’s utility as a global solution.\nOn the regulatory front, U.S. authorities recently approved spot XRP exchange-traded funds (ETFs), opening the door for regulated exposure for more traditional investors.\nIf broader market sentiment flips bullish, XRP could rally 3x to $5 before the end of summer. Should bearish conditions persist, strong support is likely to keep XRP above $1.\nBitcoin (BTC): A New ATH by Summer?\nThe world’s first and largest cryptocurrency, Bitcoin ($BTC), recorded a ATH of $126,080 on October 6. before shedding 46% over the last five months to trade at.\nSince then, BTC has declined by about 46% and now trades below $70,000, following two sharp selloffs triggered by geopolitical concerns tied to possible U.S. military actions involving Iran and Greenland.\nOften compared to digital gold, Bitcoin continues to attract demand from both institutions and individual investors looking for protection against inflation and broader economic instability.\nRising institutional adoption, reduced post-halving supply and incoming US crypto legislation could have a catalytic effect, pushing Bitcoin to multiple new highs this year.\nAdditionally, if Trump delivers on his proposal for a Strategic Bitcoin Reserve, this OG crypto could remain the daddy for a long time yet.\nEthereum (ETH): DeFi’s Backbone May Retest Record Levels\nEthereum ($ETH) is the dominant force powering decentralized finance (DeFi) and Web3 applications, with a market capitalization of approximately $244 billion.\nWith nearly $55 billion locked across the network, Ethereum continues to be the most economically active blockchain.\nIn a bull market, ETH could push past the $5,000 resistance level as early as June, surpassing its previous ATH of $4,946 recorded last August.\nOver the longer term, Ethereum’s path toward five-figure prices will depend heavily on clearer regulatory frameworks in the United States and supportive macroeconomic trends.\nBoth factors are critical for accelerating institutional adoption, particularly in stablecoins and real-world asset tokenization.\nAt present, ETH is trading below its 30-day moving average, with the relative strength index hovering near oversold territory around 36. For bullish investors, this range may represent an attractive accumulation zone.\nNew Bitcoin Hyper Presale Turns Bitcoin into an Ethereum Challenger\nWhile established networks such as Bitcoin, Ethereum, and XRP offer relative stability in a volatile market, the largest ga"
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "5.5300",
            "open": "85.1300",
            "close": "81.1700",
            "high": "85.9500",
            "low": "80.4200"
        },
        "market_summary": "### SOL/USD Market Briefing\n* **Key Drivers:** $100M buyback program by DeFi Development, RWA strategies discussion with institutional partners.\n* **Price Action:** SOL underperformed peers, down 9% in past week amid deleveraging pressures.\n* **Market Sentiment:** Split 50-50 on new ATH by year-end; social dominance fell below 0.4%.\n---\n**Overall Sentiment:** Neutral ⚖️  \n**Key Support:** $2,280 (psychological level)  \n**Key Resistance:** $293.31 (previous ATH)  \n**Technical Outlook:** Bearish momentum with support at $2,280.",
        "source_articles": [
            {
                "title": "DeFi Development Boosts Solana Buyback Program to $100M - CoinMarketCap",
                "source": "CoinMarketCap",
                "url": "https://coinmarketcap.com/academy/article/defi-development-boosts-solana-buyback-program-to-dollar100m",
                "body": "DeFi Development currently holds around $452 million worth of Solana but trades at just a $395 million market cap.\nSolana News\nThe Solana treasury firm has increased its share repurchase authorization from $1 million to $100 million, causing DFDV shares to jump as high as 6% before retracing. The stock traded 4% higher at $15.73, maintaining its position as the second-largest publicly traded Solana treasury company.\nDeFi Development currently holds around $452 million worth of Solana but trades at just a $395 million market cap. This gives the company an mNAV ratio below 1, meaning its crypto holdings are more valuable than its trading market capitalization.\nWhite noted the increased repurchase program provides flexibility to conduct buybacks if the mNAV falls deeply below 1 for sustained periods. Other publicly traded digital asset companies like Ethereum treasury SharpLink Gaming have signaled similar strategies when net asset values exceed market caps.\nThe AI-powered real estate software firm launched its Solana treasury strategy in early April after changing its name from Janover to DeFi Development Corporation. The transformation reflected its commitment to digital asset operations and Solana ecosystem integration.\nSince April, the company has deepened its Solana involvement through multiple strategic initiatives. These include purchasing a Solana validator business for $3.5 million, partnering with popular meme coin BONK, launching its own liquid staking token, and establishing a $5 billion equity line of credit.\nThe firm now holds 2,095,748 Solana tokens on its balance sheet, making it a significant player in the digital asset treasury space. Solana has underperformed major peers recently, falling 9% over the past week due to priced-in corporate purchases and deleveraging pressures.\nMarket sentiment around Solana's prospects has shifted, with prediction market users now split 50-50 on whether the token will reach new all-time highs above $293.31 by year-end. This represents a 12% decline from Monday's 62% bullish odds for new highs in 2025."
            },
            {
                "title": "Deep Dive: Has Solana Lost Its Soul? - Sanbase",
                "source": "Sanbase",
                "url": "https://app.santiment.net/insights/read/deep-dive-has-solana-lost-its-soul-10570",
                "body": "Deep Dive: Has Solana Lost Its Soul?\nThe Solana crowd hype from 2025 has appeared to have all but vanished, along with its market cap (now -67% since its $249 price top on September 18, 2025). Social dominance toward SOL was well over 6% when vibes were high toward the #7 market cap asset, but now sit below 0.4% on a daily basis.\nBut how did we get here? Obviously all of cryptocurrency has taken a major beating since the retraces began at the beginning of Q4, 2025. But for Solana specifically, a big part of the recent frustration has come from the community's increased urgency for a validator security patch and the messy reality of getting everyone to install it fast. In January, Solana’s client maintainers urged validators to upgrade to Agave/Jito v3.0.14 after two critical vulnerabilities were disclosed, including one that could crash validator nodes and another tied to vote processing that raised concerns about consensus integrity. The fixes arrived quickly, but the bigger confidence issue was coordination: when updates are labeled urgent, markets pay attention to how smoothly a decentralized validator set can respond, because that response directly affects uptime, finality, and the safety of funds moving through DeFi.\nDevelopers and validators began discussing rollback options, patch releases, and how to diagnose node instability. Some advised users to check validator status pages and retry transactions once congestion eased. At the same time, Zora made headlines by migrating its new “attention markets” product from Base to Solana, charging around 1 SOL per creation. The move sparked debate. Some saw it as a vote of confidence in Solana’s speed and culture, while others questioned incentives and token implications. The contrast between new apps launching and the network facing performance issues left the community split.\nFor many long-time holders, the emotional rollercoaster is nothing new. Solana’s identity was shaped by viral, meme-driven moments that defined entire market cycles. Traders still reminisce about Madlads minting chaos, the Pengu and Trump memecoin launches, the FTX crash fallout, Solbears and Baloonsville experiments, and Jupuary 2025 airdrop fever. They remember the USDC depeg panic, the Melania token buzz, the celebrity meme craze, and even the painful September 2021 network outage.\nThere were explosive NFT runs like Okay Bears, Degenerate Ape Academy, and DeGods pumping to 1000 SOL. Bonk’s 500B DeGods allocation burn and later Bonk airdrops brought fresh waves of retail energy. Magic Eden’s rise, Solanart’s early days, Metaplex Candy Machine v1 launches, and meme launchpad wars made Solana feel like the wild west of crypto. Even oddities like the Saga phone Bonk airdrop, Solana Mobile’s harsh reviews, LA Vape Cabal rumors, Mango Markets drama, LIBRA controversy, Sahil’s memecoin promotions, and the Hawk Tuah rug all became part of Solana folklore. The highs were unforgettable, but so were the scars. And over time, the character and 'fun' of Solana's ecosystem has dissipated to the massive market cap losses accrued by the community.\nInfrastructure debates have also resurfaced surrounding Solana. After a February 4, 2026 network disruption, DoubleZero posted that connectivity across the continental US was temporarily rerouted through Europe and Asia due to infrastructure issues. In normal internet networking, fiber cuts and rerouting are not unusual. DoubleZero emphasized that its system incentivizes redundant metro-to-metro paths, claiming traffic continued to flow along the fastest available routes between New York and Los Angeles with fallback options in place. Still, for validators, infrastructure reliability is not just technical talk. It determines whether blocks are produced smoothly or rewards are missed. In a high-speed chain like Solana, milliseconds matter, and underlying hardware and routing can mean the difference between profits and losses.\nLooking at the TA outlook from the crowd, the forme"
            },
            {
                "title": "Solana (SOL) - RWA Strategies Talk - Date (19 February 2026) - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/coinmarketcal:d2a107d37094b:0-solana-sol-rwa-strategies-talk-date-19-february-2026/",
                "body": "Solana (SOL) - RWA Strategies Talk - Date (19 February 2026)\nSolana is hosting a discussion with OnRe Finance, Loopscale, and Exponent Finance on institutional-grade real-world asset strategies that offer reinsurance-backed, fixed-maturity yield, as outlined in Solana’s announcement on X (source). Mechanically, these products aim to tokenize yield-bearing real-world exposures on Solana, packaging them into predictable, fixed-term instruments that can appeal to funds and treasuries seeking onchain fixed income. If these RWA strategies gain adoption, they can drive sustained stablecoin and institutional capital inflows into the Solana DeFi stack, supporting higher base demand for SOL (for fees and staking) and reinforcing the “capital markets infrastructure” narrative that has historically correlated with higher protocol valuations when TVL and onchain volumes trend up.\nSolana@solanaFeb 18, 2026Building Capital Markets Infrastructure on Solana@OnReFinance x @Loopscale x @ExponentFinance are live with institutional-grade RWA strategies: reinsurance-backed yield with a fixed maturity structure.\nJoin us tomorrow to hear how it works pic.twitter.com/Qx1XixNEiu"
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "470.750",
            "open": "49,550.890",
            "close": "49,649.270",
            "high": "49,900.990",
            "low": "49,430.240"
        },
        "market_summary": "### US30 Market Briefing  \n* **Key Drivers:** Fed minutes reveal policy split; Walmart earnings in focus; AI sector volatility.  \n* **Price Action:** Dow futures down 0.1% to **49,685**; S&P 500 futures fall slightly to **6,892**.  \n* **Technical Outlook:** Tech rebound lifts Nasdaq, but caution over AI disruption weighs.  \n\n**Overall Sentiment:** Neutral ⚖️  \n\n**Market Movers:**  \n- **Fed Uncertainty:** Policymakers divided on inflation trajectory; rate hike risks persist.  \n- **Walmart (WMT):** Q4 earnings Thursday; consumer health barometer.  \n- **AI Sector:** Palo Alto Networks (-7.34%) cuts guidance; Tactile Systems (+23.53%) surges on upbeat outlook.  \n\n**Geopolitical Risks:** U.S. military buildup in Middle East amid Iran tensions.  \n\n**Analyst Take:** LPL Financial sees \"no recession in 2026\" with AI-driven productivity gains offsetting sector disruptions.  \n\n---",
        "source_articles": [
            {
                "title": "Dow Jones Futures: S&P 500 Rises To Resistance As Nvidia, ASML Lead; Carvana Dives Late, Walmart Due - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-sp-500-nvidia-asml-carvana-dives-walmart-earnings/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #d41a5c6b-0d5e-11f1-8de7-3bf4db3e075a"
            },
            {
                "title": "US stock futures muted as rate uncertainty persists; Walmart earnings on tap - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/news/stock-market-news/us-stock-futures-muted-as-rate-uncertainty-persists-walmart-earnings-on-tap-4512481",
                "body": "Asia stocks rise as tech gains offset rate uncertainty; ASX, KOSPI hit record high\nInvesting.com-- U.S. stock index futures moved little on Wednesday evening after mixed signals on interest rates from the minutes of the Federal Reserve’s January meeting spurred more uncertainty over long-term monetary policy.\nMarkets were now looking to upcoming earnings from retail giant Walmart Inc (NASDAQ:WMT) for more cues on the U.S. economy.\nCaution over heightened geopolitical tensions with Iran also weighed, as reports showed an increased U.S. military presence in the Middle East, despite ongoing dialogue between Tehran and Washington.\n.Find out Wall Street’s favorite stock picks for 2026 by upgrading to InvestingPro\nS&P 500 Futures fell slightly to 6,892.0 points by 20:00 ET (01:00 GMT). Nasdaq 100 Futures fell nearly 0.1% to 24,942.75 points, while Dow Jones Futures fell 0.1% to 49,685.0 points.\nFutures steadied after Wall Street indexes advanced during the main session, aided chiefly by a sustained rebound in technology shares, and as data reflected some resilience in the U.S. economy. But indexes were kept off intraday highs by caution over the Fed.\nFed minutes show officials split on inflation, rate hikes\nThe minutes of the Fed’s January meeting showed policymakers unanimously supported leaving interest rates unchanged at 3.50% to 3.75%.\nBut policymakers were largely split over the central bank’s next steps, with several members of the central bank cautioning that inflation may take even longer to come below the Fed’s 2% annual target.\n“Several” policymakers also indicated that an increase in interest rates could be warranted if inflation remained above target levels for prolonged periods. The messaging largely contrasted with general market consensus that inflation and interest rates will fall further this year.\nArtificial intelligence was a major point of uncertainty for the Fed, with policymakers split over whether the fast-growing industry will boost or dull inflation.\nWalmart to report Q4 earnings, outlook in focus\nWalmart Inc (NASDAQ:WMT) is set to report its fourth-quarter earnings on Thursday, with focus squarely on the retail giant’s outlook for 2026– which is likely to offer more cues on U.S. consumer spending and health.\nWalmart is expected to post earnings per share of $0.7269 on revenue of $190.4 billion, Investing.com data showed.\nThe company is the world’s largest retailer by valuation, and is widely regarded as a bellwether for the U.S. consumer. Its fourth quarter earnings come amid increasing signs of strain on U.S. retail spending from sticky inflation.\nBeyond Walmart, U.S. trade data for December, and weekly jobless claims, are also due on Thursday.\nWall St rises past rate uncertainty on tech gains\nWall Street indexes rose on Wednesday, with tech shares leading gains as the sector recovered further from recent losses.\nBut indexes ended off their intraday highs, while tech shares also remained tenuous amid heightened concerns over the impact of artificial intelligence on the sector.\nConcerns over AI were a major driver of recent tech losses, especially among software and logistics stocks. Fears of stretched AI-related spending also weighed on broader tech shares, especially those with exposure to data centres.\nThe S&P 500 rose 0.6% to 6,881.32 points. The NASDAQ Composite rose 0.8% to 22,753.64 points, while the Dow Jones Industrial Average rose 0.3% to 49,662.66 points.\nShould you be buying WMT right now?\nProPicks AI evaluates WMT alongside thousands of other companies every month using 100+ financial metrics.\nUsing powerful AI to generate exciting stock ideas, it looks beyond popularity to assess fundamentals, momentum, and valuation. The AI has no bias—it simply identifies which stocks offer the best risk-reward based on current data with notable past winners that include Super Micro Computer (+185%) and AppLovin (+157%).\nWant to know if WMT is currently featured in any ProPicks AI strategies, or if there are"
            },
            {
                "title": "Stock Market Today: Dow Jones, S&P 500 Futures Jump Ahead Of January FOMC Minutes—Palo Alto Networks, Tactile Systems, DoorDash In Focus - State Street SPDR S&P 500 ETF Trust (ARCA:SPY) - Benzinga",
                "source": "Benzinga",
                "url": "https://www.benzinga.com/markets/equities/26/02/50678867/stock-market-today-dow-jones-sp-500-futures-jump-ahead-of-january-fomc-minutes-palo-alto-networks-tactile-systems-doordash-in-focus",
                "body": "U.S. stock futures rose on Wednesday after closing slightly higher on Tuesday. Futures of all the major benchmark indices were positive.\nWednesday’s publication of the Federal Reserve's January meeting minutes will be closely watched by investors seeking further clarity on the perspectives of policymakers. However, the week’s primary macroeconomic focus shifts to Friday, when the Personal Consumption Expenditures index is scheduled for release.\nThe 10-year Treasury bond yielded 4.07%, and the two-year bond was at 3.45%. The CME Group's FedWatch tool‘s projections show markets pricing a 92.1% likelihood of the Federal Reserve leaving the current interest rates unchanged in March.\nThe SPDR S&P 500 ETF Trust (NYSE:SPY) and Invesco QQQ Trust ETF (NASDAQ:QQQ), which track the S&P 500 index and Nasdaq 100 index, respectively, were higher in premarket on Wednesday. The SPY was up 0.57% at $686.76, while the QQQ advanced 0.62% to $605.01.\nStocks In Focus\nCelanese\n- Celanese Corp. (NYSE:CE) soared 5.94% despite posting downbeat earnings for the fourth quarter. However, the outlook was positive as the company said it sees first-quarter adjusted earnings of 70 cents to 85 cents per share, versus market estimates of 89 cents per share.\n- CE maintains a stronger price trend over the long, short, and medium terms, as per Benzinga's Edge Stock Rankings.\nOvintiv\n- Ovintiv Inc. (NYSE:OVV) rose 4.17% after it announced a definitive agreement to sell its Anadarko assets in Oklahoma for $3 billion in cash.\n- OVV maintains a stronger price trend over the short, medium, and long terms, but ranks poorly in growth, per Benzinga's Edge Stock Rankings.\nTactile Systems Technology\n- Tactile Systems Technology Inc. (NASDAQ:TCMD) surged 23.53% after reporting the fourth-quarter earnings and forecasting revenue between $357 million and $365 million for 2026, reflecting an anticipated growth of 8% to 11%, despite potential challenges from Medicare’s new prior authorization requirements.\n- Benzinga’s Edge Stock Rankings indicate that TCMD maintains a weaker price trend over the short term but a strong trend in the medium and long terms, with a solid quality ranking.\nPalo Alto Networks\n- Palo Alto Networks Inc. (NASDAQ:PANW) tumbled 7.34% after the cybersecurity firm lowered its fiscal 2026 full-year profit guidance to a range of $3.65 to $3.70 per share, overshadowing a quarterly earnings beat and an upward revision to its annual revenue outlook.\n- Benzinga’s Edge Stock Rankings indicate that PANW maintains a weak price trend over the long, medium, and short terms, with a strong growth ranking.\nDoorDash\n- DoorDash Inc. (NASDAQ:DASH) was up 0.30% as analysts expected it to post quarterly earnings of 59 cents per share on revenue of $3.99 billion after the closing bell.\n- DASH maintains a weaker price trend over the long, short, and medium terms, with a poor value ranking, as per Benzinga's Edge Stock Rankings.\nCues From Last Session\nReal estate and financial stocks bucked the overall market trend on Tuesday, closing higher despite consumer staples, energy, and materials stocks recording the biggest losses.\nInsights From Analysts\nAdam Turnquist, Chief Technical Strategist at LPL Financial, expects the U.S. stock market and economy to remain resilient despite a significant shift in market narrative.\nHe notes that widespread anxiety over an artificial intelligence (AI) “bubble” has transitioned into fears of industry-level disruption, particularly within the software sector.\nTurnquist views the recent severe selling pressure—which saw software stocks reach “historically oversold levels”—as a potentially “overly punitive” re-rating given that broader fundamentals remain supportive.\nRegarding the economy, Turnquist points to an “ongoing cyclical strength” that is “generally consistent with an improving economy and rising risk appetite.”\nHe notes that LPL’s base case is “no recession for 2026,” bolstered by anticipated fiscal stimulus and productivity gains from AI "
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "158.250",
            "open": "10,567.860",
            "close": "10,702.360",
            "high": "10,716.560",
            "low": "10,558.310"
        },
        "market_summary": "### UK100 Market Briefing\n* **Key Drivers:** UK inflation cools to **3.0%**, boosting BoE rate cut expectations to **85%**.\n* **Price Action:** Surged **130.01 points (1.2%)** to **10,686.18**, hitting a record high.\n* **Sector Performance:** Mining stocks led gains—**Antofagasta (+11%)** on upgraded price targets, **Glencore (+4.8%)** after strong results.\n---\n**Overall Sentiment:** Positive 📈",
        "source_articles": [
            {
                "title": "FTSE 100 surges to record high as UK inflation cools - Yahoo Finance Singapore",
                "source": "Yahoo Finance Singapore",
                "url": "https://sg.finance.yahoo.com/news/ftse-100-surges-record-high-171518286.html",
                "body": "Stocks across Europe pushed higher on Wednesday, with the FTSE 100 spiking to a new record, as cooling consumer price inflation in the UK boosted Bank of England rate cut bets.\nThe FTSE 100 index closed up 130.01 points, 1.2%, at 10,686.18. The FTSE 250 ended up 130.62 points, 0.6%, at 23,686.44, and the AIM all-share closed up 5.13 points, 0.6%, at 811.74.\nIn European equities on Wednesday, the Cac 40 in Paris closed 0.8% higher, while the Dax 40 in Frankfurt ended up 1.1%.\nThe pound was higher at 1.3548 dollars on Wednesday afternoon from 1.3531 at the equities close on Tuesday.\nThe euro stood lower at 1.1813 dollars from 1.1830.\nUK consumer price inflation slowed last month, the Office for National Statistics reported.\nConsumer prices rose 3.0%, as expected, slowing from a 3.4% rise in December.\n“The latest inflation figures are encouraging, although they effectively turn the clock back to where we were a year ago, before the impact of Rachel Reeves’ first budget and Donald Trump’s trade skirmishes made their mark,” said AJ Bell analyst Danni Hewson.\n“For the Bank of England, the latest data could give a green light for an interest rate cut in March, with market expectation for a cut rounding off at 85% after today’s release.\n“The last time members of the [Monetary Policy Committee] met the vote was split 5-4 to hold rates steady versus a cut to 3.5%, and the plethora of recent data should be more than enough to give at least one member a good shove to the other side of the seesaw.”\nMs Hewson added: “There’s growing expectation that economic conditions might be in such a way that the bank can deliver not two but three rate cuts this year, although that’s far from nailed on.\n“The bank’s rate setters will be acutely aware that service sector inflation is still stubbornly high at 4.3% and January’s headline rate of 3% is slightly above the bank’s own forecast.”\nThe BoE has a 2% inflation target.\nDeutsche Bank analyst Sanjay Raja commented: “Perhaps in some comforting news, the disinflation path remains largely intact. Despite stronger services price momentum to start the year, we see CPI taking another big step down in spring, as some of the big administrative prices wash out of the annual rate calculation. We expect CPI to track nearer 2% by spring.”\nStocks in New York were higher. The Dow Jones Industrial Average was up 0.6%, the S&P 500 index gained 0.9%, and the Nasdaq Composite was 1.4% higher.\nThe yield on the US 10-year Treasury widened to 4.08% on Wednesday from 4.05% on Tuesday. The yield on the US 30-year Treasury widened slightly to 4.69% from 4.68%.\nIn London, Antofagasta led the FTSE 100 and jumped 11%. The stock rebounded after falling 5.7% on Tuesday.\nGoldman Sachs and Bank of America raised their price targets on the stock to 4,200 pence and 4,000p respectively, while both maintained a “buy” rating.\nMining peer Glencore added 4.8%.\nGlencore shareholders will earn a huge pay cheque after an attempted takeover of the commodity trading and mining company by Rio Tinto fell apart early this month.\nReleasing its 2025 financial year results that came in ahead of expectations, the Switzerland-based miner reported on Wednesday it will return two billion dollars to its shareholders.\nGlencore maintained the base distribution at 10 US cents each or 1.2 billion dollars, and recommended a “top-up cash distribution” of seven cents, amounting to 800 million dollars.\nIn 2025, net attributable income was 363 million dollars, flipped from a loss 1.63 billion dollars in 2024. Pretax income was 321 million dollars, swung from 998 million dollars.\nMeanwhile, BAE Systems rose 2.9% as it reported higher annual profit and outlined confident growth plans, thanks to a “heightened threat environment”.\nThe London-based defence contractor booked pretax profit of £2.57 billion in 2025, up from £2.69 billion in 2024, on revenue of £28.34 billion, up from £26.32 billion.\nThe company declared a final dividend of 22.8p per share, compared with 2"
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "317.750",
            "open": "25,011.170",
            "close": "25,213.170",
            "high": "25,316.520",
            "low": "24,998.770"
        },
        "market_summary": "### GER40 Market Briefing\n* **Key Drivers:** ECB policy uncertainty and potential dovish shift under Lagarde.\n* **Price Action:** Trading in a choppy range with no clear trend.\n* **Sector Dynamics:** German autos under pressure; SAP and Siemens providing stability.\n---\n**Overall Sentiment:** Neutral ⚖️",
        "source_articles": [
            {
                "title": "ECB after Lagarde: Knot or… maybe a dovish shift - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZE0K5:0-ecb-after-lagarde-knot-or-maybe-a-dovish-shift/",
                "body": "News//ECB after Lagarde: Knot or… maybe a dovish shiftECB after Lagarde: Knot or… maybe a dovish shiftRefinitiv1 min readPX1SXXPSX5EDAXFrench stocksGerman stocksItalian stocksReutersSpanish stocksUK stocks© Copyright Thomson Reuters 2026. Click For Restrictions - https://agency.reuters.com/en/copyright.htmlShow moreLogin or create a forever free account to read this newsLet's go"
            },
            {
                "title": "DAX 40: Is Germany’s Flagship Index Quietly Setting Up the Next Big Opportunity or a Painful Risk - AD HOC NEWS",
                "source": "AD HOC NEWS",
                "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/dax-40-is-germany-s-flagship-index-quietly-setting-up-the-next-big/68590504",
                "body": "DAX 40: Is Germany’s Flagship Index Quietly Setting Up the Next Big Opportunity or a Painful Risk Trap?\n18.02.2026 - 10:24:43Get the professional edge. Since 2005, the 'trading-notes' market letter has delivered reliable trading recommendations – three times a week, directly to your inbox. 100% free. 100% expert knowledge. Simply enter your email address and never miss a top opportunity again. Sign up for free now\nVibe Check: The DAX 40 is currently trading in a tense, watch-your-back zone. Think choppy ranges, sudden squeezes, and no clear winner between bulls and bears. No clean moonshot, no full-on crash – just a nervous, twitchy market where every ECB headline or macro data point can flip the script in seconds.\nWant to see what people are saying? Check out real opinions here:\n- Dive into fresh DAX 40 chart breakdowns on YouTube\n- Scroll the latest German stock market mood on Instagram\n- Watch viral DAX trading setups and scalps on TikTok\nThe Story: If you only look at the surface, the DAX 40 looks like it is just drifting. But under the hood, there is a massive narrative battle going on: ECB policy uncertainty, a wobbling German economy, stressed automakers, but at the same time a surprisingly resilient tech–industrial backbone driven by names like SAP and Siemens. The index is basically Europe’s macro story in one chart.\n1. ECB, Christine Lagarde, and the EUR/USD Shockwaves – Why the DAX Cares So Much\nThe European Central Bank is the invisible hand on every DAX intraday candle. Traders are obsessed with one question: are we closer to more rate cuts, or will the ECB stay tight and keep financial conditions restrictive?\nHere is the chain reaction you need to understand:\nECB policy ? Euro vs. US dollar ? DAX export power ? Earnings expectations ? Index trend\nWhen the ECB sounds dovish and opens the door for easier policy, the euro often softens against the dollar. That weaker euro is secretly bullish for the DAX, because German export giants suddenly look cheaper on the global stage. Think autos, industrial machinery, and chemicals. Their products become more competitive, their foreign earnings look beefier when converted back into euros, and equity analysts start nudging their models higher.\nBut if Christine Lagarde and the ECB push a more hawkish tone – keeping rates elevated to fight sticky inflation – traders immediately price in slower growth. Financing stays expensive, credit risk rises, and the euro can strengthen, which hits exporters right where it hurts. The result: nervous selloffs around ECB press conferences, whipsaw moves on every new inflation or growth print, and a DAX that feels like it is constantly reacting rather than trending.\nRight now, the market is caught in a tug-of-war. On one side, you have rate-cut hope and the argument that the worst inflation is already behind us. On the other, you have recession fear and the uncomfortable reality that Germany’s growth engine has been sputtering. The ECB is trying to walk a very thin line, and every hint from Lagarde about future cuts or a longer plateau in rates acts like a trigger for algorithmic flows straight into or out of the DAX.\nIn simple trading terms: the DAX is not just an equity index, it is a leveraged bet on where EUR/USD and ECB policy go next. If the euro weakens and rate-cut expectations rise, German bulls come back fast. If the ECB stays stubborn and the euro firms up, rallies get sold into by macro funds and systematic strategies.\n2. Sector Check: German Autos Under Pressure vs. SAP and Siemens Holding the Line\nIf you want to understand why the DAX is not ripping higher, look directly at the auto sector. VW, BMW, and Mercedes are facing a multi-front war:\n- China risk: A huge share of their profits still depends on Chinese demand. But local EV competitors in China are gaining ground fast, price wars are brutal, and geopolitics are adding another layer of risk.\n- EV transition costs: The shift from combustion engines to electric vehicles is cap"
            },
            {
                "title": "Europe set to open mixed after ECB denies Lagarde exit - breakingthenews.net",
                "source": "breakingthenews.net",
                "url": "https://breakingthenews.net/Article/Europe-set-to-open-mixed-after-ECB-denies-Lagarde-exit/65685654",
                "body": "Breaking The News\nDownload our app\nPlay Store\nApp Store\nHome\nMarkets\nEconomy\nBusiness\nPolitics\nWorld\nWar/Terrorism\nTechnology\nCrypto\nSports\nInsights\nHome\nMarkets\nEconomy\nBusiness\nPolitics\nWorld\nWar/Terrorism\nTechnology\nCrypto\nSports\nInsights\nDownload our app\nPlay Store\nApp Store\nHome\nMarkets\nEconomy\nBusiness\nPolitics\nWorld\nWar/Terrorism\nTechnology\nCrypto\nSports\nInsights\nThis website uses cookies to ensure you get the best experience. Our\nTerms of Use\nand\nData Protection Policy\nexplain the data we collect, why we collect them, and how we may share them.\nI Accept"
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "97.120",
            "open": "24,878.030",
            "close": "24,933.150",
            "high": "24,945.150",
            "low": "24,848.030"
        },
        "market_summary": "### NDX100 Market Briefing\n* **Key Drivers:** AI sector recovery, Fed minutes reveal deep policy divisions, Meta-Nvidia chip deal boosts sentiment.\n* **Price Action:** Nasdaq Composite advanced **0.8%**, reversing recent AI-driven volatility.\n* **Technical Outlook:** Support levels holding, AI stocks rebounding after sharp sell-off.\n\n---\n**Overall Sentiment:** Neutral to Positive 📊  \n**Near-Term Risks:** Fed rate path uncertainty, AI investment payoff timeline.",
        "source_articles": [
            {
                "title": "Stock market today: Dow, S&P 500, Nasdaq rise as AI worries recede, Fed minutes released - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-gain-for-3rd-straight-day-nasdaq-jumps-as-traders-brush-aside-ai-worries-210052721.html",
                "body": "Stock market today: Dow, S&P 500 gain for 3rd straight day, Nasdaq jumps as traders brush aside AI worries\nUS stocks edged higher on Wednesday as AI fears waned and investors digested the release of the Federal Reserve minutes.\nThe S&P 500 (^GSPC) added 0.6%, while the tech-heavy Nasdaq Composite (^IXIC) picked up 0.8%. The Dow Jones Industrial Average (^DJI), which is less exposed to tech, moved up 0.3% after the major US gauges closed Tuesday with modest gains.\n(^GSPC)\nTechnology stocks were recovering composure after a turbulent stretch that saw software names in particular take a bruising. But while the pressure is easing, investors are still weighing the long-term impact of AI on business models and corporate competition, and whether AI investments will pay off.\nMeanwhile, minutes of the Fed's January meeting showed some policymakers leaning toward holding rates steady, though others suggested rate cuts could be in store if inflation comes down.\nThe minutes said \"several participants commented that further downward adjustments to the target range for the federal funds rate would likely be appropriate if inflation were to decline in line with their expectations.\" Markets are currently pricing in at least two rate cuts this year, and the minutes did little to shake faith in a cut by June.\nOn the earnings calendar, DoorDash (DASH), eBay (EBAY), and Analog Devices (ADI) report results Wednesday.\nLIVE COVERAGE IS OVER 27 updatesC.H. Robinson CEO says 'we are the disruptor' after transport sector wracked by AI trade\nTransportation and logistics stocks plunged last week after a little-known company that historically sold karaoke machines published a press release saying its new AI-powered logistics platform was scaling clients' freight volumes by 300% to 400%. On this morning's Yahoo Finance Opening Bid, we spoke with the CEO of C.H. Robinson.\nYahoo Finance executive editor Brian Sozzi reports:\nRead more here, and watch below:\nMSG stock pops as company plans to explore splitting Knicks, Rangers\nMSG (MSGS) stock rose as much as 10% in premarket trade on Wednesday after the company said it was exploring splitting up the New York Knicks and New York Rangers, which it owns under the same corporate umbrella, Madison Square Garden Sports Corp.\nThe split would create two publicly traded companies. Both separate entities would also include minor league affiliates of each franchise.\n“Both the Knicks and Rangers are premier teams in their respective leagues, with storied histories and large and passionate fan bases,\" said Jim Dolan, exec. chairman and CEO of the company. \"We believe this proposed transaction would provide each company with enhanced strategic flexibility, its own defined business focus, and clear characteristics for investors.”\nThe Knicks are currently in third place in the Eastern Conference, a half-game behind the Boston Celtics. The Rangers are in last place in the Eastern Conference."
            },
            {
                "title": "Markets News, Feb. 18, 2025: Tech Stocks Lead Markets Higher; Fed Minutes Reveal Deep Divisions Over Future Rate Cuts - Investopedia",
                "source": "Investopedia",
                "url": "https://www.investopedia.com/stock-market-today-dow-jones-s-and-p-500-02182026-11908516",
                "body": "Stocks rose on Wednesday, but pared their gains as investors questioned the outlook for interest rates in light of the minutes of January's Federal Reserve meeting.\nThe tech-heavy Nasdaq Composite rose 0.8% on Wednesday, while the benchmark S&P 500 advanced 0.6% and the blue-chip Dow Jones Industrial Average gained 0.3%. All three major indexes eked out tiny gains on Tuesday in a volatile session driven by rising and ebbing tech jitters.\nThe minutes of the Federal Reserve's last meeting revealed starkly diverging views among policymakers on the appropriate path of monetary policy. Some officials want to leave the door open for the Fed to raise rates if inflation remains sticky, while others are eager to continue cutting, according to the minutes released Wednesday.\nThe majority of officials voted in late January to leave interest rates unchanged for the first time since July. The odds of more cuts in the next few months dwindled last week following surprisingly rosy inflation and jobs reports. The December Personal Consumption Expenditures price index, the Fed's preferred inflation gauge, is set to be released on Friday morning.\nTech stocks found their footing Wednesday. Shares of Nvidia (NVDA) rose 1.6% after social media giant Meta (META) announced a new deal to buy millions of its chips. Several of Wall Street's favorite AI \"pick and shovel\" stocks rose, including Micron (MU) and Western Digital (WDC). Meta shares rose 0.6%.\nThe remainder of the Magnificent Seven closed in the green. Shares of Amazon (AMZN) rose nearly 2% despite Berkshire Hathaway reporting on Tuesday it had sold nearly all of its stake in the e-commerce giant. Apple (AAPL), Alphabet (GOOG), Microsoft (MSFT), and Tesla (TSLA) posted marginal gains.\nOn the earnings front, shares of Palo Alto Networks (PANW) slid 7% after its earnings guidance came up short of expectations. The stocks of chip firms Cadence Design Systems (CDNS) and Analog Devices (ADI) rose 8% and 3%, respectively, after each topped estimates on the top and bottom lines.\nThe 10-year Treasury yield, which impacts interest rates on a variety of consumer loans including mortgages, was recently 4.08%, up from 4.06% at Tuesday's close.\nWest Texas Intermediate futures, the U.S. crude oil benchmark, rose about 4.5% to $65.10 a barrel after Vice President JD Vance cast doubt on the progress of diplomatic negotiations between the U.S. and Iran. Gold and silver futures rebounded from their slump yesterday. Gold climbed 1.8% to $4,995 an ounce, while silver rose 4.9% to $77.10 an ounce.\nBitcoin traded around $66,300 in the late afternoon, down from its overnight highs above $68,000. The U.S. dollar index, which tracks the value of the greenback against a basket of currencies, ticked up 0.6% to 97.70.\nHoops or Hockey? Investors Might Get to Own Shares of the Knicks and Rangers\nIf you've always wanted to own a piece of a pro basketball team, this deal might be a slam dunk. (If you prefer ice hockey, insert your favorite metaphor here.)\nMadison Square Garden Sports (MSGS), which owns the NBA's New York Knicks and NHL's New York Rangers, said its board would explore a spinoff that would create publicly traded companies for each team. (The stadium itself is owned by Madison Square Garden Entertainment (MSGE), which was created by the 2020 separation of the teams from the facility.)\n\"We believe this proposed transaction would provide each company with enhanced strategic flexibility, its own defined business focus, and clear characteristics for investors,\" MSGS CEO Jim Dolan said.\nThe company's statement said no timetable had been set for a deal, and that it was not certain one would happen. League approval would be required, the company said.\nThe deal would offer investors an opportunity to do something comparatively rare: put their money where their rooting mouths are.\nMost sports teams are privately owned, and none of the organizations in the top U.S. leagues—the NBA and NHL, but also the NFL, Major League"
            },
            {
                "title": "Wall Street ends higher, lifted by Nvidia and other AI stocks - The Detroit News",
                "source": "The Detroit News",
                "url": "https://www.detroitnews.com/story/business/2026/02/18/wall-street-rises-as-tech-stocks-rebound-fed-minutes-on-tap/88738010007/",
                "body": "Wall Street ends higher, lifted by Nvidia and other AI stocks\nWall Street ended higher on Wednesday, lifted by gains in Nvidia, Amazon and other technology-related heavyweights following recent jitters about artificial intelligence. Nvidia climbed 1.6% after the world's most valuable company said it had signed a multi-year deal to sell to Meta Platforms millions of its current and future AI chips. Meta added 0.6%.\nSandisk, Western Digital and Seagate Technology Holdings climbed between 1.7% and 4.4% each, adding to strong gains in recent months fueled by massive AI-related demand for their storage technology.\nAI-related stocks lost ground earlier this month as investors worried about high valuations and how long it might take for AI investments to boost revenue growth.\nAmazon added 1.8% and Microsoft rose 0.7% on Wednesday.\n\"At a certain point, weakness in tech was bound to bring in the marginal buyer. These are still high-growth names. They were expensive and they've gotten cheaper,\" said Ross Mayfield, an investment strategy analyst at Baird in Louisville, Kentucky. \"There are still a lot of people who want to be exposed to tech for the next several years.\"\nSoftware makers also showed signs of recovery following recent worries that improved AI tools could lead to more competition and squeeze their profit margins. The S&P 500 software and services sector increased 1.1% after tumbling earlier this month. It was helped by advancing Cadence Design Systems shares, after the chip-design software provider beat fourth-quarter revenue estimates. Palo Alto Networks dropped 6.8% after trimming its annual profit forecast.\nEnergy leads S&P sector indexes up\nThe S&P 500 climbed 0.56% to end the session at 6,881.31 points.\nThe Nasdaq gained 0.78% to 22,753.64 points, while the Dow Jones Industrial Average rose 0.26% to 49,662.66 points.\nThe Nasdaq was up as much as 1.4% before trimming its gains in the afternoon.\nEight of the 11 S&P 500 sector indexes rose, led by energy , up 2%, followed by a 1% gain in consumer discretionary .\nVolume on U.S. exchanges was light, with 16.8 billion shares traded, compared to an average of 20.7 billion shares over the previous 20 sessions.\nWith Wednesday's gains, the S&P 500 is up about 0.5% in 2026, while the Nasdaq is down 2.1%. Federal Reserve officials were in nearly unanimous agreement to keep interest rates on hold at their meeting last month, but remained split over what might happen next, according to minutes of their January 27-28 meeting released on Wednesday.\nTraders are pricing in a roughly 50% chance of a rate cut of at least 25 basis points by the Fed's June meeting, according to CME's FedWatch Tool. Data released on Wednesday showed solid business spending and U.S. economic growth in the fourth quarter.\nAnalog Devices rose 2.6% after the chipmaker forecast second-quarter results above Wall Street estimates.\nGlobal Payments jumped over 16% after the payment technology firm projected annual adjusted profit above expectations.\nModerna climbed about 6% after the U.S. Food and Drug Administration agreed to review its influenza vaccine, reversing an earlier decision rejecting the application.\nAdvancing issues outnumbered falling ones within the S&P 500 by a 1.7-to-one ratio.\nThe S&P 500 posted 23 new highs and three new lows; the Nasdaq recorded 101 new highs and 120 new lows.\n___\nReporting by Shashwat Chauhan and Twesha Dikshit in Bengaluru, and by Noel Randewich in San Francisco; Editing by Pooja Desai, Saumyadeb Chakrabarty, Rod Nickel"
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "76.420",
            "open": "6,846.360",
            "close": "6,876.270",
            "high": "6,909.530",
            "low": "6,833.110"
        },
        "market_summary": "### SPX500 Market Briefing\n* **Key Drivers:** No relevant financial news identified in provided articles.\n* **Price Action:** No market data available in obituaries.\n* **Technical Outlook:** No technical analysis possible from non-financial content.\n\n**Overall Sentiment:** Neutral ⚖️\n\n*Note: The provided articles contain only obituaries and have no financial market relevance.*",
        "source_articles": [
            {
                "title": "Obituary for Marlyn S. Graham - Ronald V. Hall Funeral Home",
                "source": "Ronald V. Hall Funeral Home",
                "url": "https://www.ronaldvhall.com/obituary/MarlynS-Graham",
                "body": "Mrs. Marlyn S. Graham, age 87, of Lyons, passed away Tuesday, February 17, 2026. She was born and raised in Treutlen County. Throughout her life she worked in manufacturing. She retired at 64 as the owner and operator of TC Mfg Inc., working alongside her husband to produce Tom Cat Tree Climbers. She came out of retirement at the age of 70 and resumed the daily operations of the business. Her final retirement was at the age of 80 years old. She was a hard worker and was loved by so many. The employees and customers loved and had deep respect for her, as she did them. She was a devout Christian and attended Mount Moriah Church.\nShe is preceded in death by her loving husband, Jolly Y Graham, parents, Sam B. Steptoe, Sr. and Velma Edge Steptoe Purvis; three brothers Russell, Rabun, and Sam, and two sisters, Eugenia and Nellie.\nMrs. Graham is survived by seven children and five step-children, Rita Howard, Paul Graham (Jodi), Youman Graham (Gwen), Alan Graham, Lew Graham (Joy), Teresa Martin (LB), Mary Caraway (Michael), Sharon Dasher, Connie Moody, Danny Smith, Randy Smith, and Brenda Bagwell.\nThe only other job she loved more was being Nanny. She is also survived by her grandchildren, Matthew, Rustin, and William Graham Parker, Ellie Grace Graham, Ben Sisson, Tiffany Johnson, Haley Wright, Brandon Coleman, Megan Smith, Molli Smith, Madi Smith, Nick Smith, Justin Smith, Ntosha Standard, Courtney Allen, Cole Graham, Jacob Graham, Josie Sharpe, Amber Wilson, Levi Graham, Chris Riner, Jessica Warnock, Jonathan Caraway, and Jennifer Caraway; one brother, Jimmy Steptoe and wife Regina of Soperton; and numerous great-grandchildren, nieces, and nephews.\nThe funeral service will be held on Saturday afternoon, February 21st, 2026, at 3:00 in the chapel of Ronald V. Hall Funeral Home with Pastor Michael Kennedy and Reverend Roy Woods officiating. Interment will follow at Pine Crest Cemetery.\nThe family will receive friends at the funeral home on Saturday afternoon from 1:30 until just prior to the service.\nPallbearers are Jamey Gates, Jim Donald, Craig Dismuke, John Gladden, Keith Brooks, and Shawn Morgan.\nIn lieu of flowers, the family encourages memorial donations to the Community Hospice Foundation, PO Box 2277, Vidalia, GA 30475.\nRonald V. Hall Funeral Home of Vidalia is in charge of arrangements.\nTo send flowers\nto the family or plant a tree\nin memory of Marlyn S. Graham, please visit our floral store."
            },
            {
                "title": "Debra S. Smith Obituary February 15, 2026 - Rans Funeral Homes & Crematory",
                "source": "Rans Funeral Homes & Crematory",
                "url": "https://www.ransfuneralhomes.com/obituaries/debra-smith",
                "body": "Invite friends and family to read the obituary and add memories.\nWe'll notify you when service details or new memories are added.\nYou're now following this obituary\nWe'll email you when there are updates.\nPlease select what you would like included for printing:\nIN LOVING MEMORY OF\nDebra S.\nSmith\nJune 19, 1953 – February 15, 2026\nVisitation\nLogansport Chapel\n4:00 - 5:00 pm (Eastern time)\nCelebration of Life\nLogansport Chapel\nStarts at 5:00 pm (Eastern time)\nDebra S. Smith, 72 of Logansport passed away at 12:20 p.m., Sunday, February 15, 2026, at home.\nBorn on June 19, 1953, in Syracuse, she was the daughter of the late Donald and Norma (Klopenstein) Matthews.\nDeb retired from Four County in Logansport. She enjoyed gardening, taking care of her flowers and crafts.\nSurvivors include her children, Shawna Baugh (Robert) of Kokomo and Shane Hall of Peru, stepchildren, Lisa James (Chris) of Logansport and Angel Melroy of Logansport, her companion, Larry Ritchie of Logansport, brother, Jerry Klopenstein (Diana) and grandchildren Matthew Tucker, Dylan Armstrong and Chelsie Hall and Taylor Hall and step grandchildren, Noah James, McKenna James, Kassadie James and Cody and Brooke Tunis. She is also survived by numerous great grandchildren.\nShe was preceded in death by her longtime companion, Donnie Melroy.\nA Celebration of Life will be at 5:00 p.m., Thursday, February 19, 2026, at Rans Funeral Homes & Crematory, Marocco Chapel.\nVisitation will be one hour prior to the service.\nDeb’s online guestbook is available and condolences can be shared with the family at www.ransfuneralhomes.com.\nA beautifully bound keepsake book filled with memories and condolences from family and friends.\nContribute your memory to the online guestbook to be featured in this unique keepsake book.\nVisits: 1170\nThis site is protected by reCAPTCHA and the\nGoogle Privacy Policy and Terms of Service apply.\nService map data © OpenStreetMap contributors"
            },
            {
                "title": "Carol S. Gehl Obituary February 15, 2026 - Pederson-Volker Funeral Chapel & Cremation Services",
                "source": "Pederson-Volker Funeral Chapel & Cremation Services",
                "url": "https://www.pedersonvolker.com/obituaries/carol-gehl",
                "body": "Invite friends and family to read the obituary and add memories.\nWe'll notify you when service details or new memories are added.\nYou're now following this obituary\nWe'll email you when there are updates.\nPlease select what you would like included for printing:\nCarol Sue (TeStrake) Gehl (4/4/1941 to 2/15/2026), born in Muscatine, Iowa and raised in Marshfield, Wisconsin, was the beloved eldest daughter of Margaret and Harvey TeStrake. As the oldest of five, she grew up alongside her brothers Bernard, Willard, and Gary, and her baby sister, Sally, offering steady guidance and setting a loving example from the very beginning.\nIn 1964, she married Dr. Gerald “Jerry” Gehl, beginning a love story that spanned over six decades. Their early married life took them to San Diego while Jerry served in the United States Navy, where they welcomed their first daughter, Holly.\nFollowing their time in California, Carol and Jerry returned to Wisconsin and settled in Madison. There they experienced both profound sorrow and deep joy, losing their beloved son, Paul, at the age of two and welcoming their cherished daughter, Sara. Through every season of life, Carol showed what it meant to move forward with grace. The family later lived in Neenah before ultimately settling in Chippewa Falls, which they called home for the past 35 years.\nCarol was a devoted mother and an extraordinary role model for her daughters. As a registered nurse, she lived out her calling to care for others with skill and compassion. She was also deeply committed to defending the rights of women and gave generously of her time in service to her community. Among her many contributions, she was instrumental in creating a car seat distribution program for newborns when car seat laws were first enacted in the 1970s, a legacy that continues to protect families.\nCarol loved art and music and was an incredible seamstress, cook, and pianist. Her music filled the house, her meals gathered family, and her handmade creations became treasured heirlooms. She and Jerry also shared a love of travel and were fortunate to enjoy many adventures together, building a lifetime of memories side by side.\nCarol was preceded in death by her husband, Jerry, in 2023, and by her son, Paul. We take comfort in imagining their reunion and the continuation of a love that endures.\nShe is lovingly survived by her daughters, Holly (Tim) Reiter and Sara (Scott) Eidam; her grandchildren, Sophia and Joel Reiter, Gale and Andrew Eidam; and her great-grandson, Atlas, born in 2025. Carol was overjoyed to meet Atlas in December, a moment of pure happiness.\nIn every era of her life, Carol led with steadfast love, resilience, service, and strength. She leaves behind a family shaped by her example and a community better because she lived in it.\nThe family is deeply grateful to St. Croix Hospice for the extraordinary compassion, dignity, and comfort they provided during Carol’s final days.\nA private family service will be held.\nIn lieu of flowers, those wishing to honor Carol’s legacy of compassion and advocacy may consider a donation to Family Support Center, Planned Parenthood of Wisconsin, or the ACLU of Wisconsin, organizations whose missions reflect the causes she cared about deeply.\nVisits: 1257\nThis site is protected by reCAPTCHA and the\nGoogle Privacy Policy and Terms of Service apply.\nService map data © OpenStreetMap contributors"
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "980.000",
            "open": "56,998.410",
            "close": "57,532.700",
            "high": "57,748.410",
            "low": "56,768.410"
        },
        "market_summary": "### JPN225 Market Briefing  \n* **Key Drivers:** US tech rebound + stronger-than-expected US data; BoJ board nominations in focus.  \n* **Price Action:** Opened 0.6% higher; tech-driven momentum.  \n* **Technical Outlook:** Near-term resistance eyed around **¥60,000** after solid Japan data.  \n---  \n**Overall Sentiment:** Positive 📈  \n**Risk Factors:** BoJ policy shifts, US inflation trajectory, Iran geopolitical tensions.",
        "source_articles": [
            {
                "title": "Japan Stocks Rise As Wall Street Tech Rebounds - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/japan-stocks-rise-as-wall-street-tech-rebounds",
                "body": "US data came in stronger than expected while investors watch for the government’s next Bank of Japan board nominations.\n1 min\nWhat’s going on here?\nJapanese stocks opened higher Thursday, with the Nikkei 225 up 0.6% as US tech rebounded and fresh US data came in stronger than expected.\nWhat does this mean?\nWall Street set the tone. US industrial production had its biggest jump in nearly a year, business equipment orders beat forecasts, and housing starts hit a five-month high – a mix that suggests US demand is holding up. That tends to support Japan’s export-heavy, tech-leaning market because global growth expectations and US tech sentiment often spill over into Tokyo. Next up is the Bank of Japan’s (BoJ’s) bench. Japan’s government is expected to name replacements for two of the central bank’s nine boar..\nd seats, and Bloomberg says nominations could come as soon as February 25. Those picks matter because the board shapes the policy outlook that influences bond yields and the yen – two big inputs for Japanese company profits.\nWhy should I care?\nFor markets: Tokyo still takes cues from US tech.\nWhen US megacap tech stabilizes, Japan often benefits fast – many Nikkei heavyweights sit in semiconductors, electronics, and export supply chains. But the flip side is sensitivity: if US data re-accelerates inflation worries and pushes global yields up, riskier growth stocks can lose their shine again.\nThe bigger picture: Personnel moves can steer policy expectations.\nBoJ leadership changes can shift how investors price the next phase of monetary policy, even before any decision is made. A board that looks more hawkish could keep the yen firmer and lift funding costs, while a more dovish lineup would point to easier conditions lasting longer – and that would ripple across global FX and rate markets.\nThis content is free, but you must be logged in to continue reading.\nAlready have an account?"
            },
            {
                "title": "Oil prices jump on toughening US posture on Iran as US stocks advance - Nonstop Local News",
                "source": "Nonstop Local News",
                "url": "https://www.nbcrightnow.com/national/oil-prices-jump-on-toughening-us-posture-on-iran-as-us-stocks-advance/article_b7d422e0-1d46-5811-a34f-b67fa6d5974f.html",
                "body": "Global stock markets rose Wednesday as traders assessed company earnings and economic data, while oil prices surged more than four percent on a toughening US posture towards Iran.\nAll three major US indices advanced, with the broad-based S&P 500 winning 0.6 percent.\n\"You're getting a little bit of a bounce in some of the technology stocks that have been beaten up recently on fears of disruption over AI,\" said Tom Cahill of Ventura Wealth Management. \"Bargain hunting in the software space that helped to push up the technology stocks.\"\nBut the indices retreated a bit from session highs after the release of Federal Reserve minutes which Cahill characterized as \"a little more hawkish than some people were expecting.\"\nSeveral Fed officials supported leaving the door open to interest rate hikes, citing concerns that inflation could remain stubbornly high and lifting the dollar.\nMeanwhile, White House spokeswoman Karoline Leavitt warned that Iran would be \"wise\" to do a deal with the United States as President Donald Trump once again hinted at military action.\nOn Wednesday, Trump again suggested the United States might strike Iran in a post on his Truth Social site, with a US military buildup underway in the Middle East.\nUN nuclear watchdog chief Rafael Grossi said there was a \"step forward\" in talks between Iran and the United States in Geneva but warned \"we don't have much time.\"\nThe two sides took part in Omani-mediated talks in the Swiss city this week.\nChris Beauchamp, chief market analyst at investing and trading platform IG, said reports on possible military action in Iran \"naturally raise the risk of some kind of closure of the Hormuz straits, and while an oil rally has been an off again/on again move for some weeks, sustained action in the region is likely to precipitate a significant move higher in prices.\"\nDespite the geopolitical and technological uncertainty, European shares enjoyed a strong session.\nLondon's FTSE 100 shares index led continental gains at the close with a rise of 1.2 percent after data showed UK inflation eased in January, paving the way for the Bank of England to cut its benchmark interest rate next month, weighing on the pound.\nParis's CAC 40 set a new record high for its part, moving just past its previous mark of 8,437.35 set on February 12 before settling back a bit for a day gain of 0.8 percent while Frankfurt closed up 0.9 percent.\nTokyo's stock market closed up one percent after Washington announced a first tranche of investments by Japan following a pledge totalling $550 billion in a trade deal with US President Donald Trump.\nThe commitments of $36 billion for three infrastructure projects came as Japan faces pressure to deliver on its pledges made in 2025 in return for lower US trade tariffs.\nElsewhere in Asia, the Lunar New Year holiday meant trading floors were shut in Hong Kong, Shanghai, Seoul and Taipei.\nThe euro dipped against the dollar on a report from the Financial Times that Christine Lagarde would step down before her term as European Central Bank president ends in October 2027.\nAn ECB spokesperson said Wednesday that Lagarde had taken no decision on leaving before her term expires.\n- Key figures at around 2130 GMT -\nNew York - Dow: UP 0.3 percent at 49,662.66 (close)\nNew York - S&P 500: UP 0.6 percent at 6,881.31 (close)\nNew York - Nasdaq: UP 0.8 percent at 22,753.63 (close)\nLondon - FTSE 100: UP 1.2 percent at 10,686.18 (close)\nParis - CAC 40: UP 0.8 percent at 8,429.03 (close)\nFrankfurt - DAX: UP 1.1 percent at 25,278.21 (close)\nTokyo - Nikkei 225: UP 1.0 percent at 57,143.84 (close)\nHong Kong - Hang Seng Index: closed for holiday\nShanghai - Composite: closed for holiday\nDollar/yen: UP at 154.80 yen from 153.47 yen on Tuesday\nEuro/dollar: DOWN at $1.1784 from $1.1855\nPound/dollar: DOWN at $1.3500 from $1.3629\nEuro/pound: UP at 87.29 pence from 86.95 pence\nBrent North Sea Crude: UP 4.4 percent at $70.35 per barrel\nWest Texas Intermediate: UP 4.6 percent at $65.19 per barrel\nbur-jmb"
            },
            {
                "title": "Nikkei 225 Index rallies after solid Japan data: Will it hit ¥60,000? - Invezz",
                "source": "Invezz",
                "url": "https://invezz.com/news/2026/02/19/nikkei-225-index-rallies-after-solid-japan-data-will-it-hit-%C2%A560000/",
                "body": "Nikkei 225 Index rallies after solid Japan data: Will it hit ¥60,000?\nFeb 19, 2026, 06:27 AM\nManufacturing\nAirbus share price slowly forms a risky pattern as it flags engine delivery woes\nFeb 19, 2026, 06:23 AM\nStock Market\nMorning brief: Asia stocks rise, OpenAI nears $100B funding\nFeb 19, 2026, 05:24 AM\nArtificial intelligence\nSamsung shares hit record on HBM4 pricing power and AI demand\nFeb 19, 2026, 05:17 AM\nAsia Pacific\nKospi Index gets extremely overbought as Samsung stock hits all-time high\nFeb 19, 2026, 04:15 AM\nStock Market"
            }
        ]
    }
]