[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "767.880",
            "open": "5,383.370",
            "close": "4,895.170",
            "high": "5,450.910",
            "low": "4,683.030"
        },
        "market_summary": "### Gold (XAU/USD) Market Briefing\n* **Key Drivers:** **Fed Chair nomination** (Kevin Warsh) reinforced dollar strength; **BCA Research** maintains bullish gold outlook on **central bank buying** and long-term momentum, despite near-term **overbought** risks.  \n* **Price Action:** **Plunged ~9%** (article 3), extending losses as **dollar strengthened** post-Fed news; safe-haven outflow accelerates.  \n* **Technical Outlook:** Overbought conditions temper near-term upside (article 1); no explicit support levels cited.  \n---\n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "Sell U.S. dollar; buy oil, copper and gold: BCA - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/news/commodities-news/sell-us-dollar-buy-oil-copper-and-gold-bca-4478215",
                "body": "Is gold’s slump the start of a reversal? 3 Wall Street analysts weigh in\nInvesting.com -- BCA Research is urging investors to position for a weaker U.S. dollar while adding exposure to oil, copper and gold, as its MacroQuant models continue to flag downside risks for the greenback.\nMacroQuant, BCA’s quantitative asset-allocation and market-timing model, remains modestly bearish on the dollar after correctly anticipating recent declines in the U.S. dollar index, with negative price momentum weighing on the outlook despite some offset from rising market volatility.\nValuations are also working against the currency. While recent depreciation has pushed the dollar closer to fair value, BCA says the greenback \"is still expensive,\" and faster earnings growth outside the U.S. has reduced the relative appeal of U.S. assets on a cyclical basis.\nPositioning and sentiment indicators continue to lean against the greenback, while the sharp rise in gold prices is also seen as an unfavorable signal for the dollar.\nAt the same time, MacroQuant has turned decisively constructive on commodities. Gold remains a core bullish call within the model, which \"has been very bullish on the yellow metal for most of the past two years,” supported by central bank buying, strong long-term price momentum, positive sentiment and concerns over fiscal policy.\nAlthough overbought conditions are tempering the near-term score, the model continues to project positive returns.\nCopper has seen an even stronger shift in conviction. The firm highlights that the model “is now extremely bullish on the red metal,” reflecting an improved economic outlook in the U.S. alongside continued support from sentiment and price momentum indicators.\nThe oil score has \"increased meaningfully, moving into bullish territory,” BCA stresses, driven by strong price momentum and heightened geopolitical tensions that have lifted crude prices. Beyond those risks, the model points to firm global growth signals, manufacturing data and the outperformance of cyclical equities as reinforcing a more positive oil outlook.\nOverall, \"the model has upgraded oil from extreme underweight to modest overweight, and copper from neutral to extreme overweight. It continues to be bullish on gold,\" BCA said.\nWhat are the best investment opportunities in 2026?\nThe best investments start with better data. Going with your gut has its place, but when excitement masquerades as intuition, it can lead to costly mistakes—or analysis paralysis.\nInvestingPro+ combines institutional-grade data with AI-powered insights that you don't need a finance PhD to understand. It won't guarantee winners, but it will certainly help you find more of them, more often.\nSo what are the best investments of 2026 so far?"
            },
            {
                "title": "Business - Gold, silver continue to fall as record rally runs out of road - France 24",
                "source": "France 24",
                "url": "https://www.france24.com/en/tv-shows/business/20260202-gold-silver-continue-to-fall-as-record-rally-runs-out-of-road",
                "body": "Gold, silver continue to fall as record rally runs out of road\nBusiness\nTo display this content from YouTube, you must enable advertisement tracking and audience measurement.\nOne of your browser extensions seems to be blocking the video player from loading. To watch this content, you may need to disable it on this site.\nIssued on:\n04:51 min\nFrom the show\nReading time\n1 min\nPrecious metals continued to lose ground this Monday following steep declines last week, with investors piling out of the safe haven assets after US President Donald Trump picked Kevin Warsh to lead the Federal Reserve. Also in this edition: French tech giant Capgemini plans to sell off the US subsidiary that provides immigrant tracking data to ICE.\nAdvertising\nRelated keywords"
            },
            {
                "title": "CNBC Daily Open: Markets see Warsh as a safe pick for Fed chair — causing gold and silver to plunge - CNBC",
                "source": "CNBC",
                "url": "https://www.cnbc.com/2026/02/02/cnbc-daily-open-markets-see-warsh-as-safe-pick-for-fed-chair-gold-and-silver-plunged.html",
                "body": "Taken from CNBC’s Daily Open, our international markets newsletter — Subscribe today\nMarkets got what they wanted.\nU.S. President Donald Trump tapped Kevin Warsh to lead the Federal Reserve, and investors exhaled. Markets were reassured by Warsh's experience in the central bank — he served between 2006 and 2011, a period marked by the Global Financial Crisis — and the perception that he won't always bend to Trump's will.\n\"Kevin Warsh's nomination for Fed Chair is exactly what markets were hoping for, as he's a steady hand, well known in market circles and is expected to maintain the independence of the central bank, which is critical for markets,\" said Richard Saperstein, chief investment officer of Treasury Partners.\nThe U.S. dollar strengthened following Trump's announcement, signaling the market's approval of Warsh's credibility and perceived autonomy.\nRisk assets, however, fell. On Friday, major U.S. indexes closed lower on the back of flagging tech stocks. Spot gold lost around 9% and spot silver — seen as safe-haven assets to hedge against U.S. volatility — plunged 31.4% for its worst day since March 1980 — with both precious metals continuing to fall across the weekend.\nCryptocurrency also plummeted, with bitcoin trading around $77,250, its lowest level since April, as of 7:45 a.m. Singapore time (6:45 p.m. ET).\nElsewhere, policy and politics are moving fast.\nIndia on Sunday unveiled its Union Budget for fiscal year 2026. Finance Minister Nirmala Sitharaman said the government expects its fiscal deficit and debt-to-GDP ratio to dip, and plans to encourage manufacturing across several sectors. Separately, Trump said Saturday that India would buy Venezuelan oil in place of some Russian crude, Reuters reported.\nFor the week ahead in Asia, elections will be in the spotlight. Both Thailand and Japan will head to the polls on Sunday, with outcomes closely watched by markets and policymakers alike.\nWhat you need to know today\nKevin Warsh, explained. While at the Fed from 2006 to 2011, Warsh played an important role in the design and implementation of programs to stabilize credit markets. However, Warsh emerged from the era as a Fed critic.\n'Confident' government shutdown will end by Tuesday, said U.S. House Speaker Mike Johnson on Sunday. He added that he believes he has the votes to end the partial government shutdown by Tuesday.\nAstraZeneca goes stateside. That comes days after it announced billions in investment in China. The company wants a close relationship with the U.S., its biggest market, but is attracted by China's innovation-friendly landscape.\nMajor U.S. indexes fell on Friday, with the S&P 500 posting its third straight losing day but still notching a gain for January. Gold, silver and bitcoin plunged, while the U.S. dollar strengthened. The pan-European Stoxx 600 added 0.64%.\n[PRO] Eyes on Alphabet and Amazon earnings. In a busy week of earnings, the Google-parent is set to announce results on Wednesday after the bell, while Amazon's comes out on Thursday after markets close. CNBC's Fred Imbert breaks down what to expect.\nAnd finally...\nUnited Arab Emirates' 'Spy Sheikh' bought secret stake in Trump crypto company: WSJ\nA government official and top royal from the United Arab Emirates purchased a $500 million stake in the Trump family's cryptocurrency venture last year, months before the Trump administration greenlit the sale of advanced AI chips to the UAE, The Wall Street Journal reported on Saturday.\nSheikh Tahnoon bin Zayed Al Nahyan — also known as the \"spy sheikh\" — is the Gulf nation's national security adviser and manager of its largest wealth fund. Aryam Investment, a Tahnoon-backed company, took a 49% stake in World Liberty Financial, according to the Journal.\n— Garrett Downs"
            }
        ]
    },
    {
        "asset_name": "Silver",
        "symbol": "EIGHTCAP:XAGUSD",
        "status": "Success",
        "data": {
            "day_range": "16.671",
            "open": "84.065",
            "close": "82.816",
            "high": "87.896",
            "low": "71.225"
        },
        "market_summary": "### Silver (XAG/USD) Market Briefing  \n* **Key Drivers:** Trump’s nomination of **hawkish** Kevin Warsh as Fed chair; **CME margin hikes** (silver futures margins raised to **15%**).  \n* **Price Action:** Plunged **37%** to **$84.63/oz**; minimal rebound vs. gold.  \n* **Technical Outlook:** Volatility persists amid leveraged liquidation; testing key support levels.  \n---  \n**Overall Sentiment:** Negative 📉 (long-term bullish underpinnings: **supply deficit**, geopolitical risks).",
        "source_articles": [
            {
                "title": "The man who scared off gold and silver bulls - The Economic Times",
                "source": "The Economic Times",
                "url": "https://economictimes.indiatimes.com/news/international/global-trends/gold-and-silver-prices-kevin-warsh-federal-reserve-the-man-who-scared-off-bulls-metal-prices/articleshow/127858596.cms?from=mdr",
                "body": "A rally built on distrust and dollar pessimism\nIn the run-up to the crash, gold and silver had come to embody a broader loss of confidence in the US dollar and the institutions that manage it. Concerns over Federal Reserve independence, persistent geopolitical tensions from the Middle East to Latin America and a swelling US fiscal deficit combined to fuel demand for hard assets. Gold’s surge to nearly $5,600 an ounce and silver’s spike above $120 were seen as insurance against political and monetary disorder.\nThis narrative gathered momentum as Trump repeatedly criticised the dollar’s strength and expressed a desire for looser monetary policy. Investors increasingly bet that the next Fed chair would be an ultra-dove, willing to cut rates aggressively and tolerate higher inflation. In that environment, holding non-yielding assets such as gold and silver made sense. As prices rose, speculative flows followed, amplifying the move in a feedback loop familiar from previous commodity manias.\nWhy Kevin Warsh changed the story\nWarsh’s sudden emergence as the preferred candidate for Fed chair upended these expectations. Warsh, a former Fed governor, is widely seen as a policy hawk by recent standards. He has been sceptical of prolonged quantitative easing, wary of oversized central bank balance sheets, and more inclined to prioritise inflation control and currency credibility.\nFor a market priced for easy money and a weakening dollar, Warsh came as a shock. The prospect of a Fed leader less tolerant of inflation and more supportive of a stronger dollar immediately challenged the core thesis behind the metals rally. As the dollar turned higher when US markets opened on January 29, gold fell sharply, briefly losing more than $200 an ounce in minutes. When reports confirmed Trump’s intention to nominate Warsh, selling intensified.\nWarsh himself did not need to promise tighter policy to trigger the move. His reputation alone was enough. He was not the ultra dove investors had been expecting. In markets driven as much by expectations as by fundamentals, that distinction mattered enormously.\nLeverage, margins and the mechanics of a crash\nWhile the Warsh nomination provided the narrative trigger, the scale of the collapse also owed to market structure. By late January, precious metals futures were heavily leveraged. When prices began to fall, margin calls forced traders to liquidate positions at speed. CME Group’s decision to raise margin requirements on gold, silver, platinum and palladium futures added fuel to the fire.\nHigher margins increase the cost of holding futures positions, reducing speculative participation and forcing weaker hands out of the market. As leveraged investors scrambled to meet margin calls, they sold not only metals but also other assets, creating a cascade effect that far exceeded what the initial policy news might have justified. This dynamic explains why even seasoned observers were struck by the breathtaking speed of the decline. The Warsh nomination was the match and leverage was the inflammable gas that had been collecting.\nIn hindsight, the precious metals market was primed for a correction. Analysts had been warning for weeks that positioning was stretched and sentiment overheated. Scenes of retail buying from China to Germany, likened to the late-1970s gold boom, were classic late-cycle signals. Trump’s comment days earlier that the dollar was “doing great” had already sparked a final burst of buying, pushing prices to unsustainable extremes.\nAgainst that backdrop, almost any credible excuse could have prompted profit-taking. Warsh’s nomination happened to be the one that arrived first and was the most convincing because it struck at the heart of the easy-money narrative.\nKevin Warsh alone could not collapse gold and silver to this extent. Expectations of future rate cuts have not vanished as investors still anticipate at least two cuts in 2026. Geopolitical risks remain unresolved, and questions about US fis"
            },
            {
                "title": "Silver plummets after Trump taps Kevin Warsh to chair Federal Reserve - AOL.com",
                "source": "AOL.com",
                "url": "https://www.aol.com/silver-plummets-trump-taps-kevin-225416091.html",
                "body": "Silver plummets after Trump taps Kevin Warsh to chair Federal Reserve\nThe price of silver plummeted Friday, following President Donald Trump’s announcement that he will nominate economist Kevin Warsh to chair the Federal Reserve.\nSpot silver prices had dropped by more than 37% just before 5 p.m. ET, to around $84.63 a troy ounce. Precious metals trade nearly 24 hours a day.\nFriday’s plunge put an abrupt halt to silver’s red-hot run over the last 12 months. Analysts attributed the drop to investors selling their silver for high returns at what could be the end of its juggernaut.\nBut even accounting for Friday’s losses, silver is still up more than 150% since this time last year.\nSpot gold prices also fell in Friday trading, although not nearly as steeply as silver. The price of gold was down around 11% shortly before 5 p.m. ET, to around $4,864 a troy ounce.\nAdvertisement\nLike silver, gold has made remarkable gains over the past year, as investors flocked to “safe haven” assets like precious metals as a hedge against uncertainty in financial markets and the global economy. After Friday’s hit, gold was still up more than 70% over the past year.\nMeanwhile, the U.S. dollar traded higher Friday, reversing a downward trend that gained steam on Tuesday, when the U.S. currency had its worst day since April 2025.\nThe twin dynamics on Wall Street of investors selling their safe haven metals, while pushing up the dollar, signals an increase in confidence. This is likely due in part to the popular view that Warsh would be an experienced hand at the wheel of the Fed.\nWarsh is also a longtime monetary “hawk” who, during his time on the Fed board, generally opposed lowering interest rates as a way to turbo charge economic growth.\nWarsh has pivoted somewhat over the past year, as he carefully positioned himself in Trump’s camp, criticizing the current Fed and sounding open to lowering rates.\nThe S&P 500, Nasdaq Composite, and Dow Jones Industrial Average all closed slightly down Friday, investors weighed other factors, such as Friday’s unexpectedly sharp rise in the Producer Price Index."
            },
            {
                "title": "Gold, silver ETFs recover up to 10% after crash: Analysts say long-term outlook remains bullish - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/moneycontrol:7693f3c58094b:0-gold-silver-etfs-recover-up-to-10-after-crash-analysts-say-long-term-outlook-remains-bullish/",
                "body": "Gold, silver ETFs recover up to 10% after crash: Analysts say long-term outlook remains bullish\nGold and silver exchange traded funds (ETFs) made a partial recovery on February 2, after crashing sharply earlier during the day. Analysts have expressed belief in the long-term bullish outlook for the precious metals, despite current volatility.\nEdelweiss Silver ETF, which had hit the 20 percent lower circuit earlier during the day, recovered nearly 10 percent to trade at Rs 232.17 apiece, as seen at 10.30 am. Axis Silver ETF, which also crashed 20 percent earlier during the day, also recovered around 10 percent to trade at Rs 231.85 apiece.\nGold ETFs, which were down up to 9 percent in the early trading hours, were down up to 5 percent, as seen at 10.40 am. It is important to note that despite the partial recovery, most of the ETFs are still in the deep red.\nGold, silver prices recover:\nGold futures with March expiry on MCX, which fell to Rs 1,40,001 per 10 grams earlier during the day, recovered nearly 3 percent to trade at Rs 1,43,800 per 10 grams.\nSilver futures however are yet to show notable rebound from day’s lows.\nWhy are gold, silver prices falling today?\nGold and silver ETFs, which earlier saw a significant surge along with the precious metals, have seen a significant decline recently, with the trend continuing today as well. The sharp fall in gold and silver prices came amid rampant profit-booking, along with stronger dollar. US President Donald Trump said he had chosen former Federal Reserve Governor Kevin Warsh, who is known to be hawkish and rigid about rate cuts, to head the American central bank.\nAdditionally, CME Group announced hikes in margins on its metal futures on Saturday and the changes are set to take effect after market close on Monday. This will also likely weigh on precious metals. COMEX gold futures margins have been raised from 6 percent to 8 percent, while COMEX 5000 silver futures are set to increase to 15 percent from 11 percent.\nHere's what analysts say:\nThe recent \"flash crash\" in gold and silver, triggered by a hawkish US Fed nominee and increased margin requirements, is viewed by many as a necessary cooling of \"overbought\" markets rather than a trend reversal, said Abhinav Tiwari, Research Analyst at Bonanza.\nHe however noted that the long-term outlook remains structurally bullish, despite the volatility. “Record central bank buying, silver’s persistent supply deficit, and geopolitical tensions provide a solid floor,” he said.\n“We have maintained a cautious stance on silver following its parabolic move and have suggested trimming overallocation to precious metals to realign portfolios with long-term strategic allocation levels. While it is prudent to wait for further information and trend confirmation, we currently prefer gold from a relative risk-reward perspective,” said Siddharth Srivastava, Head - ETF Product & Fund Manager, Mirae Asset Investment Mangers (India).\nFollow all LIVE updates from the stock markets here.\nDisclaimer: The views and investment tips expressed by experts on Moneycontrol are their own and not those of the website or its management. Moneycontrol advises users to check with certified experts before taking any investment decisions."
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "2.420",
            "open": "70.135",
            "close": "70.488",
            "high": "70.895",
            "low": "68.475"
        },
        "market_summary": "### Spot Brent Crude Oil Market Briefing\n* **Key Drivers:** **International partnerships** (MOL Group, Chevron, TotalEnergies) accelerating **Libya's oil exploration** and production. **Over 40 bids** received in Libya’s first upstream licensing round in 18 years.  \n* **Supply Outlook:** Increased investment signals potential **long-term supply growth** from Libya’s untapped reserves.  \n\n---  \n**Overall Sentiment:** Neutral 🟡  \n\n*Note: No direct price action or technical levels were reported in the accessible articles. Sentiment reflects balanced supply expansion prospects against geopolitical uncertainties.*",
        "source_articles": [
            {
                "title": "MOL Group and Libya's NOC partner for exploration, technology and trading - Oil Review Middle East",
                "source": "Oil Review Middle East",
                "url": "https://oilreviewmiddleeast.com/exploration-production/mol-group-and-libyas-noc-partner-for-exploration-technology-and-trading",
                "body": "Hungary’s MOL Group has signed a memorandum of understanding (MoU) with Libya’s National Oil Corporation (NOC) for cooperation in hydrocarbons exploration, technological innovation and crude trading, as international interest in Libya hots up\nThe strategic partnership agreement sets out the framework for NOC and MOL to exchange information and jointly explore potential areas of cooperation. These include hydrocarbon exploration and production, technological and field development innovations, oilfield services opportunities in Libya, crude supply and trading activities.\n\"We recognise Libya’s oil and gas industry as a pillar of strength and expertise. I am sure that this new agreement will act as a catalyst for further expanding our international portfolio, creating clear mutual value for both companies and reinforcing the resilience of our region. From the perspective of security of supply and energy sovereignty, particularly for landlocked countries, diversification of sources is of crucial importance. Our cooperation also goes beyond business, as we have agreed to rebuild our educational, scientific, and university ties in order to learn as much as possible from each other. Such partnerships can also help Europe to find its own path to competitiveness, rather than switching between different forms of energy dependency,” – said Zsolt Hernádi, chairman and CEO of the MOL Group.\nThe agreement comes as MOL is looking to expand its international portfolio to maintain its strategy target of at least 90,000 barrels of oil equivalent/day production level over the next five years, recently signing cooperation agreements with the national oil company of Kazakhstan (KazMunayGas), the national oil company of Azerbaijan (SOCAR), and the national oil company of Türkiye (Turkish Petroleum). The company has oil and gas exploration and production assets in nine countries, with production in eight countries: in Croatia, Azerbaijan, Iraq, Kazakhstan, Russia, Pakistan, Egypt, and Hungary.\nThe agreement also reflects the hotting up of international interest in Libya. Chevron recently signed an MoU with NOC to evaluate exploration and development opportunities, while TotalEnergies has signed an agreement extending the Libya Waha Concessions up to 2050, paving the way for further investments. TGS has a global provider of energy data and intelligence, has just signed a Letter of Intent (LOI) with North Africa Geophysical Company, (NAGECO),a subsidiary of the NOC to advance high-quality subsurface data, supporting Libya’s upstream development through modern, fit-for-purpose data and technology solutions. Libya’s latest upstream licensing round launched in March 2025, the first in 18 years, has attracted more than 40 bids, signalling growing international interest in Libya’s largely untapped hydrocarbon potential."
            },
            {
                "title": "Middle East's Crude Coconut Oil Market Poised for Modest +2.2% CAGR Growth Through 2035 - IndexBox",
                "source": "IndexBox",
                "url": "https://www.indexbox.io/blog/crude-coconut-oil-middle-east-market-overview-2024-6/",
                "body": "Middle East - Crude Coconut (Copra) Oil - Market Analysis, Forecast, Size, Trends And Insights\nGet instant access to more than 2 million reports, dashboards, and datasets on the IndexBox Platform.\nView PricingMiddle East's Crude Coconut Oil Market Poised for Modest +2.2% CAGR Growth Through 2035\nIndexBox has just published a new report: Middle East - Crude Coconut (Copra) Oil - Market Analysis, Forecast, Size, Trends And Insights.\nThe Middle East's crude coconut oil market experienced a significant contraction in 2024, with consumption and imports dropping sharply after a period of growth. Saudi Arabia is the dominant consumer and importer, while Oman is the sole notable producer. The market is forecast to recover with a modest CAGR of +2.2% in volume and +3.2% in value through 2035. Import and export prices show significant variation between countries, with Turkey being the leading high-value exporter.\nKey Findings\n- Market forecast to grow at +2.2% volume CAGR to 9K tons by 2035, valued at $21M\n- Saudi Arabia leads consumption (50% share) and imports, with rapid growth over the past decade\n- Regional production is minimal, with Oman being the only producer (19 tons in 2024)\n- Imports fell sharply in 2024 (-48% to 7.4K tons) after a peak, ending a four-year rising trend\n- Turkey is the primary exporter, commanding 74% of export value with high unit prices\nMarket Forecast\nDriven by rising demand for crude coconut oil in the Middle East, the market is expected to start an upward consumption trend over the next decade. The performance of the market is forecast to increase slightly, with an anticipated CAGR of +2.2% for the period from 2024 to 2035, which is projected to bring the market volume to 9K tons by the end of 2035.\nIn value terms, the market is forecast to increase with an anticipated CAGR of +3.2% for the period from 2024 to 2035, which is projected to bring the market value to $21M (in nominal wholesale prices) by the end of 2035.\nConsumption\nMiddle East's Consumption of Crude Coconut (Copra) Oil\nAfter four years of growth, consumption of crude coconut (copra) oil decreased by -45.2% to 7.1K tons in 2024. In general, consumption saw a noticeable curtailment. As a result, consumption reached the peak volume of 13K tons, and then fell significantly in the following year.\nThe revenue of the crude coconut oil market in the Middle East reduced rapidly to $15M in 2024, dropping by -40.8% against the previous year. This figure reflects the total revenues of producers and importers (excluding logistics costs, retail marketing costs, and retailers' margins, which will be included in the final consumer price). Over the period under review, consumption, however, showed a relatively flat trend pattern. As a result, consumption attained the peak level of $25M, and then reduced rapidly in the following year.\nConsumption By Country\nThe country with the largest volume of crude coconut oil consumption was Saudi Arabia (3.6K tons), accounting for 50% of total volume. Moreover, crude coconut oil consumption in Saudi Arabia exceeded the figures recorded by the second-largest consumer, Turkey (1.5K tons), twofold. The third position in this ranking was taken by Yemen (540 tons), with a 7.6% share.\nIn Saudi Arabia, crude coconut oil consumption increased at an average annual rate of +38.5% over the period from 2013-2024. The remaining consuming countries recorded the following average annual rates of consumption growth: Turkey (-12.4% per year) and Yemen (+26.7% per year).\nIn value terms, Saudi Arabia ($6.8M) led the market, alone. The second position in the ranking was held by Turkey ($2.6M). It was followed by Yemen.\nIn Saudi Arabia, the crude coconut oil market expanded at an average annual rate of +39.9% over the period from 2013-2024. In the other countries, the average annual rates were as follows: Turkey (-7.3% per year) and Yemen (+33.8% per year).\nThe countries with the highest levels of crude coconut oil per capita consumption in"
            },
            {
                "title": "OPEC+ holds output - Oil & Gas Middle East",
                "source": "Oil & Gas Middle East",
                "url": "https://www.oilandgasmiddleeast.com/news/opec-holds-output",
                "body": "Before proceeding to your request, you need to solve a puzzle, and the puzzle requires Google Translate to be disabled. Please disable Google Translate and retry.\nLet's confirm you are human\nComplete the security check before continuing. This step verifies that you are not a bot, which helps to protect your account and prevent spam."
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "2.455",
            "open": "65.614",
            "close": "65.809",
            "high": "66.174",
            "low": "63.719"
        },
        "market_summary": "### Spot WTI Crude Oil Market Briefing\n* **Key Drivers:** OPEC+ maintains **1.65 million bpd voluntary output pause** until March 2026; **75% odds of U.S. attack on Iran** threatens **4.7 million bpd Iranian supply** and **Strait of Hormuz closure** (20% of global oil/LNG).  \n* **Price Action:** **Bullish momentum** as Brent crude surges **5% weekly, 14% YTD**, breaking year-long downtrend.  \n* **Technical Outlook:** Upward bias after breaking **year-long downtrend**; no clear resistance levels cited.  \n---\n**Overall Sentiment:** Cautiously Positive ⚠️📈  \n\n*Rationale: OPEC+ supply discipline supports prices, but geopolitical escalation risks (Iran) could trigger extreme volatility.*",
        "source_articles": [
            {
                "title": "Press Releases - Organization of the Petroleum Exporting Countries",
                "source": "Organization of the Petroleum Exporting Countries",
                "url": "https://www.opec.org/pr-detail/589-1-february-2026.html",
                "body": "The eight OPEC+ countries, which previously announced additional voluntary adjustments in April and November 2023, namely Saudi Arabia, Russia, Iraq, UAE, Kuwait, Kazakhstan, Algeria, and Oman met virtually on 1 February 2026, to review global market conditions and outlook.\nThe eight participating countries reaffirmed their decision on 2 November 2025 to pause production increments in March 2026 due to seasonality as detailed in the table below.\nThe eight participating countries reiterated that the 1.65 million barrels per day may be returned in part or in full subject to evolving market conditions and in a gradual manner. The countries will continue to closely monitor and assess market conditions, and in their continuous efforts to support market stability, they reaffirmed the importance of adopting a cautious approach and retaining full flexibility to continue pausing or reverse the additional voluntary production adjustments, including the previously implemented voluntary adjustments of the 2.2 million barrels per day announced in November 2023.\nThe eight countries reiterated their collective commitment to achieve full conformity with the Declaration of Cooperation, including the additional voluntary production adjustments that will be monitored by the Joint Ministerial Monitoring Committee (JMMC). They also confirmed their intention to fully compensate for any overproduced volume since January 2024.\nThe eight OPEC+ countries will hold monthly meetings to review market conditions, conformity, and compensation. The eight countries will meet on 1 March 2026."
            },
            {
                "title": "Top energy expert puts odds of U.S. attack on Iran at 75% — 'this one is real' - Fortune",
                "source": "Fortune",
                "url": "https://fortune.com/2026/02/01/us-attack-iran-probability-75-percent-disruption-risk-oil-supply-crude-prices/",
                "body": "Oil markets could be in for a major shock as President Donald Trump mulls a military strike on Iran, according to a top energy analyst.\nThe Islamic Republic responded to domestic unrest with unprecedented violence, slaughtering tens of thousands of people since protests broke out in late December.\nTrump warned the regime not to kill protesters and vowed help was on the way. While he reportedly held off on an attack last month, the recent arrival of a U.S. aircraft carrier in the Middle East has raised expectations that a strike is imminent.\n“We would put 75% odds in the coming days to weeks there will be some sort of U.S. attack on Iran,” Bob McNally, Rapidan Energy Group founder and former White House energy advisor, told CNBC on Thursday.\nBrent crude oil futures have jumped 5% in the past week and 14% since the start of the year. Prices have now broken their year-long pattern of a steady decline punctuated by brief spikes that quickly reverse to resume the downtrend, he noted.\nThe U.S. attack on Iran’s nuclear facilities last year only resulted in a temporary price surge as the conflict remained limited in scope and avoided the country’s oil infrastructure.\nIn addition, the U.S. military raid last month to capture Venezuelan dictator Nicolas Maduro failed to move the needle much in oil markets as production wasn’t interrupted.\n“But this one is real,” McNally warned. “The markets are pricing the risk that this time the past will not indicate the future—that we could have a sustained disruption in energy flows.”\nIran pumped 4.7 million barrels per day last year, accounting for 4.4% of global oil supplies. Much of its heavily sanctioned shipments go to China via a so-called shadow fleet.\nBut the bigger risk centers on the potential for Iran to close off the Strait of Hormuz, where a fifth off all the world’s oil and liquified natural gas passes through on the way to export markets.\nMarkets assume that the U.S. Navy could quickly clear any underwater mines or other threats that would prevent tankers from traversing the Strait of Hormuz, but McNally thinks that’s a mistake.\nHe pointed out that the U.S. failed to completely pacify the threat from Houthi rebels, who attacked shipping in the Persian Gulf before Trump essentially reached a ceasefire agreement.\n“Iranians have much better weaponry and a better coastline to harass that strait, so God forbid it comes to that,” McNally added.\nOn Sunday, Iran’s supreme leader warned that any attack by the U.S. would spark a “regional war” in the Mideast, marking the most-direct threat he’s made so far during Trump’s military build-up in the area.\nBut sources told Axios that Trump administration told Tehran through back channels that it’s open to meeting to negotiate a deal.\nMcNally on Thursday flagged the escalating rhetoric and highlighted the potential for upheaval in the LNG market in the event of an Iranian blockage of the strait.\n“If it lasts more than one or two days, the market will be shocked because we simply can’t imagine a scenario where the U.S. military doesn’t prevail militarily [and] overwhelmingly in hours to days,” he predicted. “We just haven’t seen it in history, but it’s entirely possible. In that case, you will see the mother of all bidding on any spot cargoes for LNG.”"
            },
            {
                "title": "OPEC+ Eight Maintain Pause on Output Increases - Egypt Oil & Gas",
                "source": "Egypt Oil & Gas",
                "url": "https://egyptoil-gas.com/news/opec-eight-maintain-pause-on-output-increases/",
                "body": "Eight OPEC+ member nations agreed to maintain their pause on planned oil production increases during a virtual meeting held on February 1. The group cited seasonal demand factors and ongoing market uncertainty as the primary reasons for extending the output freeze.\nThe participating countries, Saudi Arabia, Russia, Iraq, the UAE, Kuwait, Kazakhstan, Algeria, and Oman, reaffirmed their decision to halt production increments originally scheduled for March 2026. This move follows an earlier agreement in November 2025 to delay the restoration of voluntary output reductions.\nUnder the original plan, the group intended to gradually unwind 1.65 million barrels per day (bbl/d) of voluntary cuts. However, the producers have opted for a cautious approach due to expected seasonal weakness in oil demand during the first quarter.\nThe group reiterated that these volumes could still return to the market either partially or in full. This re-entry would happen only in a gradual manner and remains strictly dependent on evolving market conditions. The participating nations stressed that flexibility is central to their strategy, including the potential to extend the current pause or reverse future increases if necessary.\nIn addition to the current pause, the group emphasized the continued importance of the larger 2.2 million bbl/d of voluntary cuts announced in late 2023. These measures remain in place to support global market stability amid concerns over demand volatility and economic growth.\nThe eight producers reaffirmed their collective commitment to full compliance with the OPEC+ Declaration of Cooperation. They also pledged to fully compensate for any volumes overproduced since January 2024. The Joint Ministerial Monitoring Committee (JMMC) will continue to oversee compliance and compensation progress.\nThe next meeting to assess market conditions and conformity is scheduled for March 1, 2026. OPEC+ is an alliance consisting of the Organization of the Petroleum Exporting Countries (OPEC) and several non-OPEC producers, including Russia, that coordinate to manage global oil supply."
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0125",
            "open": "1.1962",
            "close": "1.1849",
            "high": "1.1974",
            "low": "1.1849"
        },
        "market_summary": "### EUR/USD Market Briefing  \n* **Key Drivers:** **Fed Chair nomination** of Kevin Warsh supports USD; **upcoming ECB decision** and **US NFP data**.  \n* **Price Action:** Consolidates near **1.1850** after **1% drop** Friday; earlier tested **1.2090** (55-month high).  \n* **Technical Outlook:** Critical resistance at **1.1917-1.2020**; support at **1.1746/75** and **1.1835** (Fibonacci level).  \n\n---  \n**Overall Sentiment:** Neutral to Bearish 📉  \n\n### Key Details  \n- **Fed Policy:** **Kevin Warsh’s nomination** (seen as hawkish) bolsters USD. Market prices **two 2026 rate cuts** (CME FedWatch).  \n- **Eurozone Data:** Eurozone Manufacturing PMI revised up to **49.5** (vs. 49.4 est.), German PMI at **49.1**. Limited EUR upside despite positive data.  \n- **Technical Risks:** **4-hour chart shows bearish momentum** (RSI <50, expanding MACD negative bars). Weekly close above **1.2020** needed for bullish breakout.  \n- **Forecasts:** **UBS** caps EUR/USD at **1.20** near-term; **ING** targets **1.22** by 2026-end. Downside risks include Fed turmoil (→**1.15**) vs. upside (→**1.25**).  \n\n### Upcoming Catalysts  \n- **US ISM Manufacturing PMI** (Today: est. **48.3** vs. prior 47.9).  \n- **ECB Rate Decision** (Thu) – Dovish guidance likely.  \n- **US Nonfarm Payrolls** (Fri) – Key for USD direction.  \n\n*Market remains cautious amid technical inflection and policy divergence.*",
        "source_articles": [
            {
                "title": "EUR/USD remains pinned near lows ahead of a data-packed week - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/eur-usd-stays-low-in-risk-off-markets-with-a-busy-week-ahead-202602020839",
                "body": "EUR/USD hovers near lows with all eyes on US manufacturing activity\n- EUR/USD consolidates losses around 1.1850 after dropping by over 1% on Friday.\n- Eurozone and German HCOB manufacturing PMIs have been upwardly revised.\n- The US Dollar remains supported by the nomination of Kevin Warsh as the next Fed Chair.\nThe Euro (EUR) posts marginal gains against the US Dollar (USD) on Monday, moving at 1.1867 at the time of writing, despite rather positive data from the Eurozone. The Dollar holds its ground, supported by the nomination of Kevin Warsh as the next Federal Reserve (Fed) Chair, while a risk-averse market sentiment is weighing on the Euro.\nInvestors showed some relief after US President Donald Trump confirmed on Friday that Kevin Warsh will replace Jerome Powell as Fed Chairman when his term expires in May. Warsh is partidary of a smaller balance sheet and has advocated for lower borrowing costs in recent times, although he is expected to take a cautious approach to inflation.\nIn Europe, the final HCOB Manufacturing PMI readings revealed that the sector's activity improved beyond expectations in January. The Eurozone PMI has been revised up to 49.5, from previous estimations of 49.4, and also above December's 48.8 reading. In a similar line, German PMI has been revised up to 49.1. Preliminary estimations had shown a 48.7 reading, unchanged from the previous month.\nThe focus now will be on the US Manufacturing Purchasing Managers' Indexes (PMI) due later today. Investors, however, are likely to remain cautious ahead of a busy economic calendar this week, which includes the Eurozone Central Bank's (ECB) monetary policy decision on Thursday and the key US Nonfarm Payrolls (NFP) report on Friday, among other relevant releases.\nEuro Price Today\nThe table below shows the percentage change of Euro (EUR) against listed major currencies today. Euro was the strongest against the Swiss Franc.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Euro from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent EUR (base)/USD (quote).\nDaily Digest market Movers: The Dollar remains supported by Warsh's nomination\n- The market has reacted positively to the nomination of Kevin Warsh as the next Fed Chief. The market is forecasting at least two rate cuts in 2026, according to data from the CME Group's Fed Watch Tool, but Warsh has already served as a Fed Governor, and he was sensitive to inflation risks during his tenure.\n- German Retail Sales have shown a 0.1% growth in December, following a 0.5% decline in November and beating the market consensus that had anticipated a 0.2% drop. Year-on-year, German retail consumption accelerated by 1.5%, from 1.3% in the previous month. The impact of the data on the Euro has been minor.\n- In the US, January's ISM Manufacturing PMI is expected to show a moderate improvement to 48.3 from 47.9 in December, with prices paid accelerating to a four-month high of 60.5.\n- Later on, Atlanta Fed President Raphael Bostic will take the stage. Bostic has been reluctant to cut interest rates and recently affirmed that the balance sheet is \"about right\" last week, which brings to light the divergences within the central bank's committee.\nTechnical Analysis: EUR/USD hovers above 1.1835 with bears in control\nThe EUR/USD is on a bearish correction, hovering near 1.1850 after pulling back from four-year highs near 1.2100. Technical indicators are pointing lower on the 4-hour chart. The Relative Strength Index (RSI) has dropped below the key 50 level, and the Moving Average Convergence Divergence (MACD) histogram shows expanding negative bars.\nThe pair has found some footing above the January 26 low, at the 1.1835 area, and the 50% Fibonacci retracement of the late-January rally, at 1.1830. Furthe"
            },
            {
                "title": "Euro to Dollar Forecast: Fed Credibility Tested as EUR/USD Volatility Surges - CurrencyNews.co.uk",
                "source": "CurrencyNews.co.uk",
                "url": "https://www.currencynews.co.uk/forecast/20260202-45122_euro-to-dollar-forecast-fed-credibility-tested-eur-usd-volatility-surges.html",
                "body": "The Euro to Dollar exchange rate (EUR/USD) has swung sharply around the 1.20 level as markets grapple with Federal Reserve credibility, political pressure on monetary policy, and the fallout from Kevin Warsh’s expected nomination as the next Fed Chair.\nWhile the move briefly stabilised the dollar after a 55-month EUR/USD high, investors remain wary that lingering policy uncertainty could reignite dollar selling.\nEUR/USD Forecasts: Crucial Fed\nUBS considers that the Euro to Dollar (EUR/USD) exchange rate can strengthen further in the short term, but expects the end-2026 rate will be held at 1.20.\nING has a year-end target of 1.22 amid on-going dollar vulnerability.\nAccording to ING; “Bullish sentiment on the global economy continues to challenge the US exceptionalism narrative, while geopolitics, fiscal risks and now the threat of joint FX intervention are all hitting the dollar, too. Our preference remains for a broader dollar sell-off occurring later in the year.”\nThe dollar posted sharp losses early in the week with on-going unease over the geo-political stance, coupled with talk that the Administration would push for a weaker dollar.\nSave on Your EUR/USD Transfer\nGet better rates and lower fees on your next international money transfer.\nCompare TorFX with top UK banks in seconds and see how much you could save.\nIn this context, there was speculation that global hedge funds would increase their hedging ratios on US assets and EUR/USD surged to a 55-month high close to 1.2090.\nFed policy and potential threats to its independence remained a key element.\nThe Federal Reserve held rates at 3.75% with a slightly hawkish statement which helped stabilise the dollar and there was a more decisive recovery late in the week amid talk, later confirmed, that Kevin Warsh would be nominated as the next Fed Chair.\nEUR/USD retreated sharply to lows at 1.19 before stabilising.\nING commented; “It’s good news for the dollar, which can price out some risks of a more dovish pick.”\nRabobank commented; “The market may respond optimistically to the prospect of Warsh’ nomination, but broader US policy uncertainty is still not doing the dollar any favours.”\nUBS notes that the dollar has been under notable pressure due to fears over geo-political developments over Greenland and threats of additional tariffs.\nAccording to the bank; “We believe that the combination of these recent developments has prompted international investors to price in a USD risk premium. The sharp rally of gold or precious metals in general reflects investors’ unease over political and geopolitical developments as of late.”\nIt notes that the selling could continue in the near term, but is cautious over the potential for sustained losses\nAccording to the bank; “policymakers are expected to push back against excessive USD weakness, just as European officials would resist an overly strong euro. Third, US economic data will likely prove robust enough to end the Fed’s easing cycle in 1H26. Collectively, these factors make it hard for EURUSD to trade materially higher than 1.20 in the coming months.”\nUBS also noted that there are important upside and downside dollar risks\nAccording to the bank; “Further turbulence at the Federal Reserve would open the door for a EURUSD closer to 1.25. Meanwhile, the prospect for renewed US exceptionalism and European growth failing to accelerate in 2026 could bring EURUSD to 1.15 or lower.”\nLike this piece? Please share with your friends and colleagues:\nInternational Money Transfer? Ask our resident FX expert a money transfer question or try John's new, free, no-obligation personal service! ,where he helps every step of the way,\nensuring you get the best exchange rates on your currency requirements."
            },
            {
                "title": "Euro Technical Forecast: EUR/USD Surge Hits Multi-Year Barrier – Inflection Risk Builds - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/euro-technical-forecast-eur-usd-surge-hits-multi-year-barrier-inflection-risk-builds-2-1-2026-2026-02-02/?amp=true",
                "body": "Euro Technical Forecast: EUR/USD Surge Hits Multi-Year Barrier – Inflection Risk Builds\nEuro Technical Forecast: EUR/USD Weekly Trade Levels\n- EUR/USD rally extended more than 4% from the January low with price testing major multi-year trend resistance into the close\n- While the broader outlook remains constructive, the bulls may be vulnerable into monthly cross and a sustained break through resistance is needed to fuel the next leg of the uptrend.\n- Major event risk on tap into the monthly open with ECB and NFPs next week\n- Resistance 1.1917-1.2020 (key), 1.2218, 1.2350 - Support 1.1746/75, 1.1598 (key), 1.1497\nEUR/USD surged more than 4% off the January lows with the rally exhausting this week at a major multi-year resistance zone. The immediate focus is on the market’s response at this threshold and while the broader structure remains constructive, a reaction here is likely to shape near-term direction into the start of February trade. Battle lines drawn on the EUR/USD monthly & weekly technical charts\nReview my latest Weekly Strategy Webinar for an in-depth breakdown of this EUR/USD technical setup and more. Join live on Monday’s at 8:30am EST.\nEuro Price Chart – EUR/USD Monthly\nEuro Price Chart – EUR/USD Weekly\nChart Prepared by Michael Boutros, Sr. Technical Strategist; EUR/USD on TradingView\nTechnical Outlook: In my last Euro Technical Forecast we noted that the early-month pullback in EUR/USD was, “approaching confluent uptrend support. From a trading standpoint, the focus is on possible inflection into 1.1598- a reaction there will likely determine if the late-December pullback was simply a correction or whether a larger trend reversal will take shape into the start of the year.” Price registered a close low at 1.1598 days later before rebounding sharply with EUR/USD marking an outside-weekly reversal off the low the following week.\nThe rally extended more than 4.3% off the January lows before exhausting into a major technical barrier this week at 1.1917-1.2020- a region defined by the 2025 swing high, the 100% extension of the 2022 advance, and the 38.2% retracement of the broader 2008 decline. Note that the upper parallel converges on this threshold over the next few weeks and the focus is on possible inflection off this zone into the start of February. The immediate advance may be vulnerable while below this threshold and a topside breach / weekly close above is ultimately needed to fuel the next major leg of the rally.\nInitial weekly support now rests at 1.1746/75- a region define by the objective yearly open, the 2025 high-week close (HWC) and the 2025 high-close. Medium-term bullish invalidation is now raised to the 75% parallel which converges on the January low-close at 1.1598. A break / weekly close below this slope would suggest a more significant high is in place and a larger correction is underway within the 2025 uptrend. Subsequent support rests with the March 220 and the 2022 high at 1.1497 and the April high-close at 1.1394.\nA weekly close above this key pivot zone would be needed to mark uptrend resumption and could fuel another bout of accelerated gains for the Euro. Subsequent resistance objectives are eyed at the 2021 HWC at 1.2218 and the 2021 swing high at 1.2350.\nBottom line: The Euro rally exhausted into uptrend resistance this week at key technical barrier- risk for major inflection off this zone into the start of the month. From a trading standpoint, losses would need to be limited to 1.1746 IF price is heading higher on this stretch with a close above 1.2020 needed to fuel the next major leg of the advance.\nKeep in mind key event risk is slated into start of February with the European Central Bank (ECB) rate decision and US Non-Farm Payrolls on tap next week. Stay nimble into the monthly cross and watch the weekly closes for guidance here. I’ll publish an updated Euro Short-term Outlook once we get further clarity on the near-term EUR/USD technical trade levels.\nKey Euro / US Economic Data Re"
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0135",
            "open": "1.3794",
            "close": "1.3681",
            "high": "1.3814",
            "low": "1.3679"
        },
        "market_summary": "### GBP/USD Market Briefing\n* **Key Drivers:** Trump’s **hawkish Fed Chair nominee (Warsh)** bolsters USD strength; **hot US PPI** supports Fed hold. **BoE decision** (Thursday) eyed for rate hints amid UK **inflation at 3.4%** (above 2% target).\n* **Price Action:** Plunged from YTD high of **1.3876** to **1.3688**; broke **1.3727** support. Consolidating near **1.3670**.\n* **Technical Outlook:** Support zone **1.3630-1.3650** (Fibonacci/EMA). Break below targets **1.3550**; resistance at **1.3875**. RSI near 50 shows muted momentum.\n---\n**Overall Sentiment:** Negative 📉 (USD strength dominates; watch BoE/NFP for volatility).",
        "source_articles": [
            {
                "title": "GBP/USD Forex Signal 02/02:Bearish Outlook Ahead - DailyForex",
                "source": "DailyForex",
                "url": "https://www.dailyforex.com/forex-technical-analysis/2026/02/gbpusd-forex-signal-02-feb-2026/240592",
                "body": "Bearish view\n- Sell the GBP/USD pair and set a take-profit at 1.3550.\n- Add a stop-loss at 1.3835.\n- Timeline: 1-2 days.\nBullish view\n- Buy the GBP/USD pair and set a take-profit at 1.3835.\n- Add a stop-loss at 1.3550.\nThe GBP/USD exchange rate dropped sharply as the US Dollar Index (DXY) staged a strong comeback after the recent Federal Reserve news. If dropped to a low of 1.3688, down sharply from the year-to-date high of 1.3876.\nBank of England Decision Ahead\nThe GBP/USD exchange rate retreated sharply after the Federal Reserve delivered its interest rate decision and after Donald Trump announced his nominee for the Federal Reserve Chairman.\nThe Fed decided to leave interest rates unchanged in the first meeting of the year. In a statement, the bank also upgraded its economic outlook for the year and hinted that its inflation was being contained. All factors constant, the bank is expected to deliver two to three interest rate cuts this year.\nThe GBP/USD pair also crashed after Trump named Kevin Warsh to be the next Federal Reserve Chair. Unlike Kevin Hassett, analysts believe that Warsh will maintain a relatively hawkish view in the long term. He has historically voiced opposition for quantitative easing policies and criticized the Federal Reserve for delivering several interest rate cuts.\nThe main catalyst for the GPP/USD pair this week will be the Bank of England (BoE) interest rate decision, which will come out on Thursday.\nEconomists polled by Reuters expect the bank to leave interest rates unchanged and maintain a more hawkish tone as inflation has remained at an elevated level in the past few months. The most recent data showed that the headline Consumer Price Index rose to 3.4% in December, higher than the bank's target of 2.0%.\nThe Bureau of Labor Statistics (BLS) will publish the latest non-farm payrolls (NFP) data, which will come out on Friday. Economists expect the data to show that the economy created 70k jobs in January after adding 50k jobs.\nGBP/USD Technical Analysis\nThe GBP/USD exchange rate pulled back from the year-to-date high of 1.3876 to 1.3688, its lowest level on January 27. It moved below the key support level at 1.3727, its highest on September 17 last year.\nThe Relative Strength Index (RSI) and the Percentage Price Oscillator (PPO) have pulled back in the past few days. It has moved below the Major S&R Pivot point at 1.3670.\nTherefore, the pair will likely continue falling, potentially to the bottom of the trading range at 1.3550. A move above the resistance level at 1.3875 will invalidate the bearish outlook.\nReady to trade our free trading signals? We’ve made a list of the best UK forex brokers worth using."
            },
            {
                "title": "Pound Sterling softens below 1.3700 as Trump picks Warsh for Fed - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-usd-softens-below-13700-as-trump-picks-warsh-for-fed-202602020628",
                "body": "GBP/USD softens below 1.3700 as Trump picks Warsh for Fed\n- GBP/USD softens to near 1.3670 in Monday’s early European session.\n- Easing concerns over the Fed’s independence and hotter PPI inflation underpin the US Dollar.\n- The Bank of England is expected to leave interest rates unchanged at 3.75%\nThe GBP/USD pair loses ground to around 1.3670 during the early European session on Monday, pressured by renewed US Dollar demand. Signs of political stability in the United States (US) provide some support to the Greenback against the Pound Sterling (GBP). Traders will take more cues from the US ISM Manufacturing Purchasing Managers Index (PMI) data later on Monday.\nUS President Donald Trump said on Friday that Kevin Warsh, who prefers a smaller central bank balance sheet, would be his pick for the next Fed chair. Markets anticipate that Warsh may lean toward a smaller Fed balance sheet and hold the interest rate higher for longer, which provides some support to the USD and creates a headwind for the major pair.\nHotter-than-expected US producer price inflation might contribute to the US Dollar’s upside, as it could further strengthen the case for the Fed to hold rates steady. The Bureau of Labor Statistics revealed on Friday that the US Producer Price Index (PPI) climbed 3.0% YoY in December, beating the forecast of 2.7%. On a monthly basis, the PPI rose 0.5% MoM in December, above the market consensus and the previous reading of 0.2%.\nOn the Cable front, the Monetary Policy Committee voted 5-4 to cut the bank rate in December, the fourth quarter-point reduction of 2025. But most of its policymakers suggested the pace of rate cuts could slow. The Bank of England (BoE) is expected to keep its benchmark rate at 3.75% on Thursday, with Governor Andrew Bailey and colleagues keeping their options open.\nPound Sterling FAQs\nThe Pound Sterling (GBP) is the oldest currency in the world (886 AD) and the official currency of the United Kingdom. It is the fourth most traded unit for foreign exchange (FX) in the world, accounting for 12% of all transactions, averaging $630 billion a day, according to 2022 data. Its key trading pairs are GBP/USD, also known as ‘Cable’, which accounts for 11% of FX, GBP/JPY, or the ‘Dragon’ as it is known by traders (3%), and EUR/GBP (2%). The Pound Sterling is issued by the Bank of England (BoE).\nThe single most important factor influencing the value of the Pound Sterling is monetary policy decided by the Bank of England. The BoE bases its decisions on whether it has achieved its primary goal of “price stability” – a steady inflation rate of around 2%. Its primary tool for achieving this is the adjustment of interest rates. When inflation is too high, the BoE will try to rein it in by raising interest rates, making it more expensive for people and businesses to access credit. This is generally positive for GBP, as higher interest rates make the UK a more attractive place for global investors to park their money. When inflation falls too low it is a sign economic growth is slowing. In this scenario, the BoE will consider lowering interest rates to cheapen credit so businesses will borrow more to invest in growth-generating projects.\nData releases gauge the health of the economy and can impact the value of the Pound Sterling. Indicators such as GDP, Manufacturing and Services PMIs, and employment can all influence the direction of the GBP. A strong economy is good for Sterling. Not only does it attract more foreign investment but it may encourage the BoE to put up interest rates, which will directly strengthen GBP. Otherwise, if economic data is weak, the Pound Sterling is likely to fall.\nAnother significant data release for the Pound Sterling is the Trade Balance. This indicator measures the difference between what a country earns from its exports and what it spends on imports over a given period. If a country produces highly sought-after exports, its currency will benefit purely from the extra demand created from"
            },
            {
                "title": "US Dollar Price Forecast: DXY Weakens Ahead of NFP – Are GBP/USD and EUR/USD Set to Break Higher? - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/us-dollar-price-forecast-dxy-weakens-ahead-of-nfp-are-gbp-usd-and-eur-usd-set-to-break-higher-1576529",
                "body": "The US dollar began the week strong, helped by several factors. Right now, the US Dollar Index (DXY), which measures the dollar against major currencies, stands at 97.22. The main reason for this rise is the White House’s nomination of Kevin Warsh, a former Federal Reserve governor, to replace Jerome Powell as Fed Chair.\nInvestors think Warsh’s appointment could lift the dollar because he has supported a strong currency in the past while at the Fed.\nSome investors expect Warsh may support cutting interest rates, especially since President Trump said the new chairman would back larger cuts. They also think he will try to reduce the Fed’s balance sheet. Because of this, the dollar rose sharply after his nomination.\nLooking ahead, investors are waiting for several employment reports. The main focus is the Nonfarm Payrolls (NFP) report for January, due on Friday, which is expected to give an important clue about the Fed’s next move.\nTraders are also watching the ISM Manufacturing PMI, which comes out on Monday at 15:00 GMT. Economists think manufacturing has slowed again, but only a bit. The PMI is expected to rise slightly to 48.3 from 47.9 in December.\nSince a reading below 50 means the sector is still shrinking, this report could influence how markets see future Fed policy.\nThe Dollar Index (DXY) is trading around $97.10 after bouncing from a low of $95.60, where buyers stepped in. On the 4-hour chart, the price has moved above a short-term downward trendline, which points to a corrective bounce instead of a full trend reversal. Recent bullish candles show some stability, but momentum is still weak.\nDXY is now testing resistance between $97.20 and $97.60, which matches the 0.618 Fibonacci retracement of the recent drop. The 50-EMA is still below the 200-EMA, so the overall trend remains bearish. The RSI has moved up from oversold levels to about 45, showing some improvement in momentum but not much strength. If DXY cannot move above $97.60, it could pull back to $96.35 or even $95.60.\nTrade idea: Consider selling near $97.60, with a target of $96.40. This idea is invalid if the price rises above $98.30.\nGBP/USD is trading around $1.3690, consolidating after a strong rally that stopped just below $1.3860. On the 4-hour chart, recent small candles show some hesitation after the sharp move up. The price is staying above the $1.3630 to $1.3650 area, which matches the 0.50 Fibonacci retracement and short-term support.\nThe pair is still above the rising trendline and the 50-EMA, which keeps the short-term outlook positive. The 200-EMA near $1.3480 supports the overall uptrend. The RSI has dropped from overbought levels and is now close to 50, which suggests momentum is cooling but not reversing.\nIf GBP/USD breaks above $1.3755, it could move toward $1.3860. If it falls below $1.3630, it may head down to $1.3580.\nTrade idea: Look to buy on dips near $1.3630, aiming for $1.3860. This idea is invalid if the price drops below $1.3570.\nEUR/USD is trading around $1.1850, consolidating after a sharp rally that peaked just below $1.2050. On the 4-hour chart, recent candles have small bodies and long wicks, showing indecision after the pullback. The price is right on a rising trendline and close to the 50-EMA, which lines up with short-term support between $1.1840 and $1.1820.\nThe overall outlook stays positive since the pair is well above the 200-EMA near $1.1750. The RSI has dropped from overbought levels and is now around 45, which means momentum has slowed but there is not much selling pressure. If the price bounces from this area, it could move back up to $1.1980. If it falls below $1.1820, it could drop further to $1.1770.\nTrade idea: Consider buying if the price holds above $1.1820, with a target of $1.1980. This idea is invalid if the price falls below $1.1760.\nArslan is a finance MBA and also holds an MPhil degree in behavioral finance. An expert in financial analysis and investor psychology, Arslan uses his academic background to br"
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0115",
            "open": "0.7041",
            "close": "0.6958",
            "high": "0.7055",
            "low": "0.6939"
        },
        "market_summary": "### AUD/USD Market Briefing\n* **Key Drivers:** **RBA rate hike bets** (70-75% chance of **25bps to 3.85%**) vs. **hawkish Fed risks** from **Kevin Warsh’s nomination** as Chair.  \n* **Price Action:** Snapped **nine-day winning streak** (longest in 9 years); trades below **0.7100** amid bearish momentum.  \n* **Technical Outlook:** Support at **0.6920** (50-period MA), then **0.6810** (100-period MA); resistance at **0.6950/0.7000**.  \n\n---\n**Overall Sentiment:** Negative 📉  \n* **RBA hike** likely priced in/potentially one-off; **AUD longs overcrowded** (COT gross longs near 9-year highs).  \n* **USD strength** risks rise on **less-dovish Fed expectations** and resilient US data (ISM/NFP).",
        "source_articles": [
            {
                "title": "Australian Dollar Outlook: AUD/USD Mulls Pullback Despite RBA Hike Bets - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/en-us/news-and-analysis/australian-dollar-outlook-aud-usd-mulls-pullback-despite-rba-hike-bets/",
                "body": "View related analysis:\n- Australian Dollar Outlook: AUD/USD, AUD/JPY, AUD/CAD Momentum Slows\n- Australian Dollar Mixed as CPI Falls Short of Guaranteeing RBA Hike\n- The US Dollar’s Demise Could Just Be Getting Started\n- Silver Outlook: Volatility Tests Bulls in Early 2026\nAustralian Dollar Performance\nIt has been a very strong start to the year for the Australian dollar overall. However, with several AUD crosses at or near resistance — or already retracing — it suggests any hawkish surprise from this week’s RBA meeting may already be priced in.\nSource: LSEG\n- AUD/USD snapped a nine-day winning streak on Friday, its strongest daily run in nine years\n- AUD/CAD printed a weekly shooting star at the 2023 high, warning of potential trend exhaustion\n- AUD/JPY formed an inside week and spinning-top doji, signalling hesitancy to break above the 2024 high near the 110 handle\n- AUD/NZD retraced for a third consecutive week, though price action still looks corrective rather than a trend reversal\n- EUR/AUD suffered its worst monthly decline in 3.5 years as the Aussie rose against the euro for a sixth straight week\n- GBP/AUD fell to a 13-month low and closed decisively below 2.00\nAustralia This Week: Economic Data and Events for AUD/USD Traders\nRBA Policy Outlook: Big Four Banks Brace for a Rate Hike\nOver the past couple of weeks, Australia’s jobs report has beaten expectations while quarterly inflation landed broadly in line with consensus — the issue being that those estimates were already pitched at a higher inflation outcome. As a result, trimmed mean CPI rose to 3.3% y/y, remaining above the Reserve Bank of Australia’s 2–3% target band. That contrasts with the RBA’s November forecast, which pencilled in a moderation to 2.7% y/y by Q4.\nStill, market reaction suggests positioning had leaned toward an even hotter inflation print, with the three-year yield falling 11bp following the release. Even so, economist forecasts and market pricing currently favour a 25bp hike on Tuesday, which would lift the cash rate to 3.85%.\nRBA cash rate futures implied a 67% probability of a 25bp hike on Friday, and all Big Four banks have now updated their forecasts to expect tightening. While ANZ view a single 25bp move this week as “insurance” rather than the start of a sustained hiking cycle, NAB also expects a second 25bp hike in May, which would take the cash rate to 4.10%.\nI may be left with egg on my face by Tuesday’s close, but my base case is that the RBA holds rates at 3.6% while delivering a clearly hawkish undertone. Even if the RBA does hike this week, it is difficult to see sufficient appetite for another move in May unless inflation re-accelerates in the late-April CPI report.\nTake note that the RBA will also release its Monetary Policy Statement, including updated economic and inflation forecasts.\nISM, NFP and FOMC Speakers on Standby\nThe key risk from this week’s ISM and NFP reports is that they fail to soften enough to revive rate-cut discussions. That leaves markets exposed to upside surprises — and the potential for less-dovish commentary from FOMC members.\nThat risk is amplified by Friday’s rebound in the US dollar following confirmation that President Trump has nominated Kevin Warsh to replace Jerome Powell as Fed Chair. The dollar sell-off has now lost an important dovish narrative. Markets had assumed Trump would opt for a more rate-cut-friendly replacement, but Warsh has previously argued that the Fed was too loose during Covid.\nIf US data shows renewed resilience, Warsh could ultimately prove more inclined to keep rates higher for longer than Powell. That leaves the US dollar vulnerable to a broader rebound — a dynamic that could weigh on AUD/USD over the near term.\nAUD/USD Futures Positioning | COT Report\nLarge speculators flipped to net-long exposure for the first time since December 2024. While net longs of 7.1k contracts are not a sentiment extreme, gross long exposure sits just below a nine-year high, warning of near-term crowd"
            },
            {
                "title": "AUD/USD recovers early losses as US Dollar edges down, RBA policy eyed - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/aud-usd-recovers-early-losses-as-us-dollar-edges-down-rba-policy-eyed-202602021104",
                "body": "AUD/USD recovers early losses as US Dollar edges down, RBA policy eyed\n- AUD/USD regains ground as the US Dollar ticks lower, while the outlook of the latter remains firm.\n- US President Trump nominates Kevin Warsh as the Fed’s new Chairman.\n- The RBA is expected to raise its OCR by 25 bps to 4% on Tuesday.\nThe AUD/USD pair recoups its early losses and rebounds to near its opening price around 0.6960 during the European trading session on Monday. The Aussie pair bounces back as the US Dollar (USD) ticks down, but broadly remains firm.\nDuring the press time, the US Dollar Index (DXY), which tracks the Greenback’s value against six major currencies, edges lower to near 97.00.\nStill, the DXY is broadly firm as its appeal has improved, following the nomination of Kevin Warsh as the Federal Reserve’s (Fed) new Chairman by the United States (US) President Donald Trump on Friday.\nWarsh’s nomination as the current Fed Chair Jerome Powell’s successor has resulted in a sharp increase in the US Dollar’s appeal on expectations that he will not pursue rapid interest rate cuts. Warsh was known for supporting a firmer US Dollar and disliked Quantitative Easing (QE) in his previous tenure at the Fed.\nMeanwhile, investors await the US Nonfarm Payroll (NFP) data for January to get fresh cues on the outlook of upcoming monetary policies, which will be released on Friday.\nOn the Australian Dollar (AUD) front, investors await the Reserve Bank of Australia’s (RBA) monetary policy announcement on Tuesday. The RBA is expected to raise its Official Cash Rate (OCR) by 25 basis points (bps) to 4% to tighten the curb on mounting inflationary pressures.\nLast week, the Australian Bureau of Statistics reported that price pressures grew at an annualized pace of 3.6% in the last quarter of 2025, faster than the prior reading of 3.2%.\nEconomic Indicator\nRBA Interest Rate Decision\nThe Reserve Bank of Australia (RBA) announces its interest rate decision at the end of its eight scheduled meetings per year. If the RBA is hawkish about the inflationary outlook of the economy and raises interest rates it is usually bullish for the Australian Dollar (AUD). Likewise, if the RBA has a dovish view on the Australian economy and keeps interest rates unchanged, or cuts them, it is seen as bearish for AUD.\nRead more.Next release: Tue Feb 03, 2026 03:30\nFrequency: Irregular\nConsensus: 3.85%\nPrevious: 3.6%\nSource: Reserve Bank of Australia\nAuthor\nSagar Dua\nFXStreet\nSagar Dua is associated with the financial markets from his college days. Along with pursuing post-graduation in Commerce in 2014, he started his markets training with chart analysis."
            },
            {
                "title": "AUD/USD Forecast: RBA Decision vs Hawkish Fed Risks Cap Near-Term Upside - Forex Crunch",
                "source": "Forex Crunch",
                "url": "https://www.forexcrunch.com/blog/2026/02/02/aud-usd-forecast-rba-decision-vs-hawkish-fed-risks-cap-near-term-upside/",
                "body": "- The AUD/USD forecast edges to the downside despite a hotter inflation print as the yields fell sharply, suggesting only a single RBA hike in the near term.\n- Trump’s nomination of Kevin Warsh as the next Fed Chair lifts the US dollar, as markets view the decision as less dovish.\n- COT positioning suggests reduced AUD longs, increasing odds for significant pullbacks.\nThe AUD/USD pair had a good start to the year, but it is clearly losing steam, trading well below recent highs around 0.7100. Strong domestic data has helped the Australian dollar, but positioning and external risks suggest it may not rise much in the near future.\n–Are you interested in learning more about Bitcoin price prediction? Check our detailed guide-\nAustralian labor market data surprised to the upside, while inflation remains sticky. Trimmed mean CPI is running at 3.3% year-on-year, still above the RBA’s 2-3% target band and well above its November forecast of 2.7% by Q4. Markets currently price a 70-75% probability of a 25-bps rate hike at this week’s RBA meeting, which would lift the cash rate to 3.85%.\nAll major banks now expect tightening, although views differ on whether this marks a one-off move or the start of a short extension to the cycle.\nHowever, market reaction to recent inflation data was telling. Australian three-year yields fell sharply after the CPI release, suggesting investors were positioned for an even hotter print. That raises the risk that a hike, if delivered, is treated as “one and done.” A surprise hold, even with hawkish guidance, would likely pressure AUD/USD in the short run.\nOn the other hand, the US dollar has rebounded following Donald Trump’s nomination of Kevin Warsh as the next Fed Chair, a move markets interpret as less dovish than expected. This lowers expectations for short-term US rate cuts, in line with solid US PPI data and the Fed’s cautious rhetoric. Asymmetric risk persists ahead of the ISM and NFP data. Any positive surprise could strengthen the dollar.\nMeanwhile, large speculators have flipped net long AUD for the first time since late 2024, according to CFTC data, with gross longs close to multi-year highs. This crowding increases pullback susceptibility.\nAUD/USD Technical Forecast: Wobbling Between 20 & 100 MAs\nThe AUD/USD 4-hour chart shows mild support near the order block at 0.6920, which aligns with the 50-period MA. However, the price is well below the 20-period MA near 0.7000, while the RSI has slipped below 50.0, suggesting a bearish bias.\n–Are you interested in learning more about scalping forex brokers? Check our detailed guide-\nIn case of a bearish continuation, the pair needs a break below the 0.6920 area to find the next support at the 100-period MA near 0.6810. Conversely, the upside could face interim resistance around 0.6950 before 0.7000.\nLooking to trade forex now? Invest at eToro!\n68% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money."
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "1.9280",
            "open": "152.9120",
            "close": "154.7470",
            "high": "154.7890",
            "low": "152.8610"
        },
        "market_summary": "### USD/JPY Market Briefing\n\n* **Key Drivers:** \n  - **BoJ Summary of Opinions** signals urgency for further rate hikes due to inflationary risks from a weak JPY, with policymakers citing \"rising prices as an urgent priority\".  \n  - **Narrowing US-Japan rate differentials** as markets price **multiple Fed cuts in 2026** vs. BoJ’s hawkish tightening outlook.\n  - **US PPI inflation holds steady at 3.0% YoY** (above forecasts), reinforcing Fed’s cautious stance; officials (Musalem, Bostic) oppose near-term cuts. \n  - **Japanese PM Takaichi** endorses weak JPY for export/auto sector benefits. \n\n* **Price Action:** \n  - Volatile swings between **152.09–159.45** in January; currently trades **below 155** (key resistance-turned-support level). \n  - Failed to sustain momentum above long-term anchors; **bearish reversal** signals intensify amid weak carry-trade demand.\n\n* **Technical Outlook:** \n  - **Below 50-day EMA**, above **200-day EMA** – near-term bearish bias. \n  - **Support zones at 152**; breakdown risks toward **150** if USD weakness accelerates. \n\n---\n**Overall Sentiment:** Bearish 📉  \n*Rationale: Hawkish BoJ trajectory aligns with narrowing rate spreads, Fed repricing delays fail to offset JPY’s strengthening fundamentals.*",
        "source_articles": [
            {
                "title": "USD/JPY treads water above 155.00 as BoJ reinforces gradual tightening path - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-jpy-steadies-above-15500-as-boj-signals-no-policy-urgency-202602020202",
                "body": "USD/JPY treads water above 155.00 as BoJ reinforces gradual tightening path\n- USD/JPY steadies as the BoJ signaled the risk of falling behind the curve has not increased materially.\n- Japanese PM Sanae Takaichi said a weak JPY supports exports and helps cushion the auto sector from US tariffs.\n- The US Dollar strengthens following Kevin Warsh’s nomination as Fed Chair.\nUSD/JPY holds ground after three days of gains, trading around 155.20 during the Asian hours on Monday. The upside of the pair could be limited as the Japanese Yen (JPY) remains calm following the Bank of Japan’s (BoJ) January Summary of Opinions.\nBoJ Summary of Opinions suggested the risk of falling behind the curve has not risen materially, though timely policy execution is becoming more important. With real rates still deeply negative, members agreed that further rate hikes would be appropriate if the outlook for growth and inflation holds, while maintaining a gradual tightening path.\nJapanese Prime Minister Sanae Takaichi stated over the weekend that a weak Japanese Yen (JPY) could present significant opportunities for export-oriented industries and help cushion the automobile sector against the impact of US tariffs.\nThe pair could further gain ground as the US Dollar (USD) gains ground after President Donald Trump’s nomination of Kevin Warsh as the next Federal Reserve (Fed) Chair. Markets interpreted the Warsh’s appointment as signaling a more disciplined and cautious approach to monetary easing.\nUS producer-side inflation firmed, moving further away from the Federal Reserve’s 2% target and reinforcing the central bank’s policy stance. US PPI inflation holds steady at 3.0% year-over-year (YoY) in December, unchanged from November and above expectations for a moderation to 2.7%. Core PPI, excluding food and energy, accelerated to 3.3% YoY from 3.0%, defying forecasts for a decline to 2.9% and highlighting persistent upstream price pressures.\nSt. Louis Fed President Alberto Musalem said additional rate cuts are not warranted at this stage, characterizing the current 3.50%–3.75% policy rate range as broadly neutral. Similarly, Atlanta Fed President Raphael Bostic urged patience, arguing that monetary policy should remain modestly restrictive.\nBank of Japan FAQs\nThe Bank of Japan (BoJ) is the Japanese central bank, which sets monetary policy in the country. Its mandate is to issue banknotes and carry out currency and monetary control to ensure price stability, which means an inflation target of around 2%.\nThe Bank of Japan embarked in an ultra-loose monetary policy in 2013 in order to stimulate the economy and fuel inflation amid a low-inflationary environment. The bank’s policy is based on Quantitative and Qualitative Easing (QQE), or printing notes to buy assets such as government or corporate bonds to provide liquidity. In 2016, the bank doubled down on its strategy and further loosened policy by first introducing negative interest rates and then directly controlling the yield of its 10-year government bonds. In March 2024, the BoJ lifted interest rates, effectively retreating from the ultra-loose monetary policy stance.\nThe Bank’s massive stimulus caused the Yen to depreciate against its main currency peers. This process exacerbated in 2022 and 2023 due to an increasing policy divergence between the Bank of Japan and other main central banks, which opted to increase interest rates sharply to fight decades-high levels of inflation. The BoJ’s policy led to a widening differential with other currencies, dragging down the value of the Yen. This trend partly reversed in 2024, when the BoJ decided to abandon its ultra-loose policy stance.\nA weaker Yen and the spike in global energy prices led to an increase in Japanese inflation, which exceeded the BoJ’s 2% target. The prospect of rising salaries in the country – a key element fuelling inflation – also contributed to the move.\nAuthor\nAkhtar Faruqui\nFXStreet\nAkhtar Faruqui is a Forex Analyst based in New Delhi, I"
            },
            {
                "title": "Japanese Yen Forecast: USD/JPY Pressured by Hawkish BoJ Outlook - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/japanese-yen-forecast-usd-jpy-pressured-by-hawkish-boj-outlook-1576496",
                "body": "USD/JPY took the spotlight in early trading on Monday, February 2. The Bank of Japan’s Summary of Opinions fueled speculation about a near-term rate hike, influencing yen demand.\nLast week, the Bank of Japan’s upward revisions to quarterly GDP and inflation forecasts, and a hawkish Governor Kazuo Ueda, sent the USD/JPY pair to 152.092. It was the pair’s lowest level since October.\nThe BoJ’s policy stance and expectations of multiple Fed rate cuts in 2026 continue to support a bearish medium-term outlook for USD/JPY.\nBelow, I’ll discuss the macro backdrop, near-term price catalysts, and technical levels traders should closely watch.\nOn February 2, the BoJ’s Summary of Opinions from the January 2026 meeting indicated a more hawkish stance among policymakers, aligning with expectations of an H1 2026 rate hike.\nThere was a growing sense that the need for another interest hike was approaching. Policymakers cited concerns about inflationary pressures and yen depreciation. However, there were some calls to continue assessing the effects of current inflation levels on the economy and prices.\nUSD/JPY reacted to the Summary of Opinions, initially climbing to a high of 155.240 before falling to a low of 154.821. The pullback reflected rising bets on a rate hike before the summer.\nWhile the opinions were skewed toward the hawks, not all policymakers were aligned.\nIncoming Japanese economic indicators will be crucial to the short- to medium-term outlook for USD/JPY, given the BoJ’s quarterly outlook report. Bank of Japan Governor Kazuo Ueda reaffirmed the Bank’s commitment to continue raising interest rates if the economy and prices aligned with its projections.\nLast week, softer Tokyo inflation and weak retail sales figures cooled bets on an April BoJ rate hike, sending USD/JPY toward 155. The price action underscored the USD/JPY pair’s sensitivity to incoming economic data and shifts in central banks’ policy stances.\nLater on Monday, US economic indicators will fuel speculation about an H1 2026 Fed rate cut and demand for the US dollar.\nEconomists expect the ISM Manufacturing PMI to increase from 47.9 in December to 48.3 in January. A less marked contraction across the manufacturing sector would ease concerns about a sharp slowdown in US GDP growth, bolstering the US Dollar. However, traders should consider price and employment trends, considering the Fed’s dual mandate.\nSofter prices and falling employment would likely overshadow a pickup in sector activity, and raise expectations of an H1 2026 Fed rate cut. A more dovish Fed policy stance would weaken the US dollar and send USD/JPY lower. Importantly, a more dovish Fed would support the bearish short- to medium-term outlook for USD/JPY.\nBeyond the economic data, traders should closely monitor Fed speeches for insights into inflation, the economy, and the timeline for rate cuts.\nAccording to the CME FedWatch Tool, the probability of a March Fed rate cut fell from 15.4% on January 23 to 13.4% on January 30, following a larger-than-expected rise in US producer prices. Meanwhile, the chances of a June cut rose from 60.7% to 61.8% last week. The modest increase in bets on a June cut underscored optimism that inflation will cool, enabling the Fed to lower rates.\nImportantly, an H1 2026 Fed cut would support expectations of multiple rate cuts in 2026. Multiple Fed rate cuts would coincide with the BoJ’s hawkish policy outlook, signaling narrower US-Japan rate differentials. Narrowing rate differentials, favoring the yen, would weigh on USD/JPY.\nFor USD/JPY price trends, traders should assess technicals and monitor economic data, central bank chatter, and geopolitical headlines.\nOn the daily chart, USD/JPY trades below its 50-day Exponential Moving Average (EMA), but above the 200-day EMA. The EMA positions signaled a near-term bearish trend reversal, aligning with the negative price outlook for USD/JPY. Notably, positive yen fundamentals have aligned with the near-term technicals.\nA break bel"
            },
            {
                "title": "USD to JPY Forecast: Yen Rally Gains as USD Slips Below 155 - Coinpaper",
                "source": "Coinpaper",
                "url": "https://coinpaper.com/14218/usd-to-jpy-forecast-yen-rally-gains-as-usd-slips-below-155",
                "body": "In This Article\nUSD/JPY trades below 155 as of writing, extending last week’s drop and marking a shift in short- to medium-term market dynamics. The pair dropped after failing to sustain momentum above levels that had anchored price action for months. The move followed a volatile and bearish January that saw USD/JPY swing between a low of 152.09 and a peak around 159.45.\nWhile price found support near long-term averages, momentum weakened, and traders began reassessing the durability of the yen-funded carry trade. Is the market preparing for a deeper reset?\nHawkish BoJ Signals Reshape Expectations\nYen demand strengthened as investors reacted to signs that the Bank of Japan may continue tightening policy. Preliminary PMI data pointed to improving momentum in manufacturing and services, supporting a firmer economic outlook. GDP upgrades reinforced expectations that inflation and growth may align with the BoJ’s projections.\nThese developments raised bets on further rate hikes in 2026, narrowing the gap between Japanese and US yields. As rate spreads compressed, the appeal of holding leveraged dollar-long positions weakened. The Bank of Japan's latest policy meeting on January 23, 2026, kept rates unchanged at 0.75%, with a dissenting vote for a hike, as policymakers viewed risks to the economic & price outlook as broadly balanced ahead of February's snap election.\nSource: MacroEdge Data Stream via X\nSummary of Opinions Takes Center Stage\nThe BoJ’s Summary of Opinions, scheduled on February 2, has become a focal point for markets as traders looked for clarity on wage growth, tariff risks, and price stability. The Summary of Opinions from the January policy meeting pointed to a clearer sense of urgency around raising interest rates as policymakers track the inflationary impact of a weak yen.\nReferences to “a weak yen” and “foreign exchange” doubled from the prior meeting, signaling that currency depreciation now sits at the center of policy discussions. One board member said the bank should move to a rate hike without missing the right timing, citing rising prices as an urgent priority.\nThe summary suggested growing support for tightening at a faster pace than the market’s expectation of roughly one hike every six months, reinforcing the view that yen weakness strengthens the case for earlier and more frequent policy action.\nElection Uncertainty Adds Political Noise\nJapan’s snap election on February 8th adds another layer of uncertainty. Prime Minister Sanae Takaichi seeks a stronger mandate to pursue fiscal spending plans. Earlier concerns over rising debt and issuance contributed to yen weakness during USD/JPY’s surge from October to January.\nA decisive election outcome could revive those fears. However, markets also recognize that fiscal expansion may pressure the BoJ to normalize policy faster, which could support the yen. This tension keeps volatility elevated and discourages one-directional trades.\nU.S. Data and Fed Signals Guide the Dollar Side\nOn the US side, economic data and Federal Reserve communication continue to steer dollar demand. The ISM Services PMI and the February jobs report will shape expectations for rate cuts. Forecasts point to moderating service sector growth and slower wage gains.\nSuch trends could cool inflation pressures and support a dovish shift later in 2026. FedWatch data already show declining odds of an early rate cut, yet markets still expect easing later in the year. This gradual repricing limits upside for the dollar against the yen.\nOutlook: Volatility Remains High\nUSD/JPY now trades in a more fragile environment as policy signals, political risk, and yield dynamics intersect. Levels near 155 have shifted from support to resistance, while areas below 152 and toward 150 draw attention. Yen intervention rhetoric continues to cap sharp upside moves, even as occasional rebounds emerge.\nWith multiple catalysts ahead, traders brace for continued volatility. Will narrowing rate spreads and BoJ guidan"
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0141",
            "open": "1.3487",
            "close": "1.3612",
            "high": "1.3622",
            "low": "1.3481"
        },
        "market_summary": "### USD/CAD Market Briefing  \n* **Key Drivers:** **Declining Oil prices** weaken commodity-linked CAD; **hawkish Fed signals** from Kevin Warsh’s potential nomination and cautious Fed rhetoric.  \n* **Price Action:** Gains for **second consecutive session**, trading near **1.3650** (Asia session high: **1.3660**).  \n* **Technical Outlook:** Strength persists amid bearish pressure on Oil and USD tailwinds.  \n\n---  \n**Overall Sentiment:** Positive 📈  \n\n#### Supplementary Insights:  \n- **Oil Impact:** WTI sank **>5%** to **$62.00/barrel** on eased Middle East tensions (US-Iran talks).  \n- **Fed Policy:** St. Louis Fed’s Musalem sees current rates (**3.50%–3.75%**) as neutral, dismissing cuts; Bostic advocates \"modestly restrictive\" policy.  \n- **Risks for CAD:** Upcoming Canadian PMI (expected contraction) and jobs data (employment change decline forecast).  \n- **USD Support:** US Senate funding deal averted shutdown, boosting risk sentiment.  \n\n**Watch:** BoC’s hold on rates and rejection of further cuts *vs.* soft Canadian data ahead.",
        "source_articles": [
            {
                "title": "USD/CAD remains stronger near 1.3650 as Oil prices decline - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-cad-remains-stronger-near-13650-as-oil-prices-decline-202602020504",
                "body": "USD/CAD remains stronger near 1.3650 as Oil prices decline\n- USD/CAD stays firm as the commodity-linked Canadian Dollar weakens amid falling Oil prices.\n- WTI drops over 5% as traders watch US–Iran talks that could ease geopolitical risk premiums.\n- The US Dollar may strengthen following Kevin Warsh’s nomination as Fed Chair.\nUSD/CAD extends its gains for the second successive session, trading around 1.3660 during the Asian hours on Monday. The pair remains stronger as the commodity-linked Canadian Dollar (CAD) struggles amid declining Oil prices, given Canada’s status of the largest crude exporter to the United States (US).\nWest Texas Intermediate (WTI) Oil price falls over 5% after four days of losses, trading around $62.00 per barrel at the time of writing. Crude Oil prices edge lower as traders keep a close watch on the United States (US)–Iran negotiations that could ease geopolitical risk premiums. Over the weekend, US President Donald Trump said the United States “hopefully” would reach a deal with Iran, after Supreme Leader Ayatollah Ali Khamenei warned that a US attack could trigger a wider regional conflict.\nThe USD/CAD pair may further strengthen as the US Dollar could receive support from rising cautious sentiment surrounding the Federal Reserve (Fed) policy outlook, following US President Donald Trump’s nomination of Kevin Warsh as the next Federal Reserve Chair, which markets view as signaling a more disciplined and cautious approach to monetary easing.\nFed officials also struck a patient tone. St. Louis Fed President Alberto Musalem said further rate cuts are not warranted, describing the 3.50%–3.75% policy range as broadly neutral, while Atlanta Fed President Raphael Bostic reiterated that policy should remain modestly restrictive.\nThe Greenback also gained support as risk sentiment improved after the US Senate reached an agreement to advance a government funding package, thereby averting a shutdown, according to Politico.\nCanadian Dollar FAQs\nThe key factors driving the Canadian Dollar (CAD) are the level of interest rates set by the Bank of Canada (BoC), the price of Oil, Canada’s largest export, the health of its economy, inflation and the Trade Balance, which is the difference between the value of Canada’s exports versus its imports. Other factors include market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – with risk-on being CAD-positive. As its largest trading partner, the health of the US economy is also a key factor influencing the Canadian Dollar.\nThe Bank of Canada (BoC) has a significant influence on the Canadian Dollar by setting the level of interest rates that banks can lend to one another. This influences the level of interest rates for everyone. The main goal of the BoC is to maintain inflation at 1-3% by adjusting interest rates up or down. Relatively higher interest rates tend to be positive for the CAD. The Bank of Canada can also use quantitative easing and tightening to influence credit conditions, with the former CAD-negative and the latter CAD-positive.\nThe price of Oil is a key factor impacting the value of the Canadian Dollar. Petroleum is Canada’s biggest export, so Oil price tends to have an immediate impact on the CAD value. Generally, if Oil price rises CAD also goes up, as aggregate demand for the currency increases. The opposite is the case if the price of Oil falls. Higher Oil prices also tend to result in a greater likelihood of a positive Trade Balance, which is also supportive of the CAD.\nWhile inflation had always traditionally been thought of as a negative factor for a currency since it lowers the value of money, the opposite has actually been the case in modern times with the relaxation of cross-border capital controls. Higher inflation tends to lead central banks to put up interest rates which attracts more capital inflows from global investors seeking a lucrative place to keep their money. This increases demand "
            },
            {
                "title": "Pound To Canadian Dollar Price News, Forecast: CAD Swings On Oil And BoC Signals - Exchange Rates UK",
                "source": "Exchange Rates UK",
                "url": "https://www.exchangerates.org.uk/news/45110/2026-02-02-pound-to-canadian-dollar-price-news-forecast-cad-swings-on-oil-boc-signals.html",
                "body": "The Pound Canadian Dollar (GBP/CAD) exchange rate moved in a wide range last week, initially rallying to a three-month high before sliding to an eight-day low.\nPound to Canadian Dollar (GBP/CAD): 1.8674 (+0.11%)\nEuro to Canadian Dollar (EUR/CAD): 1.61739 (+0.11%)\nDollar to Canadian Dollar (USD/CAD): 1.36331 (-0.04%)\nDAILY RECAP:\nAt the time of writing, GBP/CAD was trading at CA$1.8610, down around 0.5% on the week.\nThe Canadian Dollar (CAD) came under notable pressure at the start of last week’s session, after US President Donald Trump threatened Canada with a 100% tariff if the country made a trade deal with China.\nAs the US is Canada’s largest trading partner, this threat raised concerns about the impact such tariffs could have on the Canadian economy.\nHowever, the ‘Loonie’ managed to recover quickly, initially thanks to a steady uptick in oil prices. Fresh threats of US military action in Iran saw crude prices climb, lending support to the commodity-linked Canadian Dollar.\nCAD was also buoyed by the Bank of Canada’s (BoC) latest interest rate decision. The BoC left rates untouched, as expected, and sounded confident that further rate cuts were unlikely.\nMeanwhile, the Pound (GBP) was left rudderless through last week’s session, with a notable lack of impactful UK economic data and few important domestic events on the calendar.\nThis left GBP to trade in a wide range, with movement primarily driven by swings in other currencies.\nAlthough Prime Minister Keir Starmer travelled to China, where London and Beijing agreed new deals, this failed to boost the Pound as analysts said the agreements would have very little impact on the UK economy.\nNear-Term GBP/CAD Forecast: BoE Decision to Buoy the Pound?\nLooking forward, the focus for GBP investors this week is firmly on the Bank of England’s (BoE) interest rate decision.\nWith the bank broadly expected to leave interest rates unchanged, markets will be watching for hints of the bank’s monetary policy path moving forward. Any signs that the bank is cautious about further cuts considering how high UK inflation currently is could underpin the Pound.\nAs for the Canadian Dollar, Canada’s latest PMI results could dent CAD in the first half of the week, with economists anticipating ongoing contractions in both the manufacturing and services sectors.\nFriday then brings Canada’s latest jobs report. Although the country’s unemployment rate is expected to have held steady in January, a drop in the employment change figure could undermine the ‘Loonie’."
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "1.4980",
            "open": "210.9610",
            "close": "211.6640",
            "high": "212.4590",
            "low": "210.9610"
        },
        "market_summary": "### GBP/JPY Market Briefing  \n* **Key Drivers:** Japanese PM **Takaichi’s weak-Yen stance** undermines JPY; UK **Manufacturing PMI hits 17-month high (51.8)**. Political risks from Japan’s **tax-cut speculation** add JPY pressure.  \n* **Price Action:** Holds above **212.00**, recovers from **209.60** lows; faces resistance at **212.68–212.75**.  \n* **Technical Outlook:** **Support at 210.40/209.61**; break below targets **203.18**. Bullish breakout above **213.40** opens path to **214.90**.  \n---  \n**Overall Sentiment:** Cautiously Bullish 📈",
        "source_articles": [
            {
                "title": "GBP/JPY Daily Outlook - Action Forex",
                "source": "Action Forex",
                "url": "https://www.actionforex.com/technical-outlook/gbpjpy-outlook/627897-gbp-jpy-daily-outlook-2319/",
                "body": "Daily Pivots: (S1) 211.07; (P) 211.78; (R1) 212.53; More…\nConsolations continues in GBP/JPY and intraday bias stays neutral. Risk will stay on the downside as long as 214.83 holds, even in case of strong recovery. Below 209.61, and sustained break of 55 D EMA (now at 209.27) will argue that it’s correcting whole rise from 184.35 and target 38.2% retracement of 184.35 to 214.83 at 203.18.\nIn the bigger picture, up trend from 123.94 (2020 low) is in progress. Next target is 61.8% projection of 148.93 (2022 low) to 208.09 (2024 high) from 184.35 at 220.90. On the downside, break of 205.30 resistance turned support is needed to indicate medium term topping. Otherwise, outlook will stay bullish even in case of deep pullback."
            },
            {
                "title": "GBP/JPY holds gains above 212.00 as Takaichi talks down the yen - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-holds-gains-above-21200-as-takaichi-talks-down-the-yen-202602021122",
                "body": "GBP/JPY holds gains above 212.00 as Takaichi talks down the yen\n- GBP/JPY hesitates above 212.00, but holds moderate daily gains.\n- PM Takaichi's comments praising a weak Yen have sent the JPY lower across the board.\n- UK manufacturing sector's activity grew at its fastest pace in 17 months in January.\nThe Pound is posting moderate gains against a weaker Japanese Yen, weighed by Prime Minister Takaichi’s comments on Monday. The pair trades right above 212.00 at the time of writing, up from last week’s lows at the 209.60 area, but also below session highs at 212.68.\nJapanese Prime Minister rattled markets over the weekend, praising the benefits of a weaker Yen a campaign speech. These comments oppose her finance minister’s efforts to stem speculative JPY sales, which have included severe threats of intervention over the previous weeks. Tokyo has come to the rescue, attempting to contextualise Takaichi’s remarks, but the damage to the Yen seems irreversible for now.\nBeyond that, news reports pointing to the possibility of a landslide victory for the ruling LDP are adding pressure on the Japanese currency. Markets are wary that stronger political support will encourage Takaichi to pursue deeper tax cuts and bigger spending, adding strain to the already depleted Japanese government coffers.\nIn the UK, data released on Monday revealed that the manufacturing sector’s activity grew at a faster-than-expected pace in January. The Final S&P Global Manufacturing PMI has been revised up to 51.8, its best reading since August 2024, from preliminary estimates of 51.6, unchanged from the previous month. The impact of these figures on the Pound, however, has been limited.\n(This story was corrected on February 2 at 11:43 GMT to say that GBP/JPY hesitates at 212.00 in the first bullet point, and not USD/JPY as previously written.)\nEconomic Indicator\nS&P Global Manufacturing PMI\nThe Manufacturing Purchasing Managers Index (PMI), released on a monthly basis by S&P Global, is a leading indicator gauging business activity in the UK’s manufacturing sector. The data is derived from surveys of senior executives at private-sector companies. Survey responses reflect the change, if any, in the current month compared to the previous month and can anticipate changing trends in official data series such as Gross Domestic Product (GDP), industrial production, employment and inflation. The index varies between 0 and 100, with levels of 50.0 signaling no change over the previous month. A reading above 50 indicates that the manufacturing economy is generally expanding, a bullish sign for the Pound Sterling (GBP). Meanwhile, a reading below 50 signals that activity among goods producers is generally declining, which is seen as bearish for GBP.\nRead more.Last release: Mon Feb 02, 2026 09:30\nFrequency: Monthly\nActual: 51.8\nConsensus: 51.6\nPrevious: 51.6\nSource: S&P Global\nAuthor\nGuillermo Alcala\nFXStreet\nGraduated in Communication Sciences at the Universidad del Pais Vasco and Universiteit van Amsterdam, Guillermo has been working as financial news editor and copywriter in diverse Forex-related firms, like FXStreet and Kantox."
            },
            {
                "title": "The GBPJPY records some gains– Forecast today – 2-2-2026 - Economies.com",
                "source": "Economies.com",
                "url": "https://www.economies.com/forex/gbp-jpy-analysis/the-gbpjpy-records-some-gains%E2%80%93-forecast-today-%E2%80%93-2-2-2026-124525",
                "body": "The GBPJPY pair continued forming bullish trading since Friday’s trading, taking advantage of the repeated positive stability above 210.40 support, achieving several gains by reaching 212.75 which forms an intraday obstacle against the bullish trend.\nThe contradiction between the main indicators makes us expect providing mixed trading until gathering extra positive momentum, to ease the mission of surpassing the current obstacle, to target extra gains by its rally towards 213.40 and surpassing it will confirm its stability within the main bullish channel’s levels, opening the way towards for strong chance of recording new gains that might extend towards 214.15 and 214.90.\nThe expected trading range for today is between 211.80 and 213.40\nTrend forecast: Bullish\nThe (ETHUSD) price is experiencing free fall in its last intraday trading, amid the main bearish trend on short-term basis, with the continuation of the negative pressure due to its trading below EMA50, intensifying the negative pressures around the price, especially with the emergence of negative signals from relative strength indicators, despite reaching oversold levels, indicating the strength and volume of the bearish momentum in the near period.\nThe (Brent) price slipped lower in its last intraday trading, amid the emergence of negative signals from relative strength indicators, after offloading its oversold conditions previously, opening the way for recording those losses, to lean on EMA50’s support, which might provide a chance for gaining bullish momentum to help it rebound higher, especially with its trading alongside minor bullish trend line on short-term basis that reinforces this scenario.\nThe (USDCHF) price settles on gains in its last intraday trading, to test 0.7725 key resistance, accompanied by testing minor bearish trend line on short-term basis, amid the continuation of the negative pressure due to its trading below EMA50, which reduces the chances of full recovery on near-term basis, with the emergence of negative overlapping signals from relative strength indicators, after reaching overbought levels."
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "3,833.0000",
            "open": "76,449.7200",
            "close": "78,054.5000",
            "high": "78,324.5000",
            "low": "74,491.5000"
        },
        "market_summary": "### BTC/USD Market Briefing\n* **Key Drivers:** **$6.18B ETF net outflows** since inception; average ETF entry price (**$87,830-$90,200**) exceeds spot price, leaving investors **15% underwater**. Risk of **short-term trader capitulation** amid rising macro/geopolitical headwinds.\n* **Price Action:** Crashed **11% weekend/early Monday** to **nine-month low of $74,600** (vs. Oct. $84k-$165k ATHs).\n* **Technical Outlook:** *No explicit technical levels cited in sources.*\n---\n**Overall Sentiment:** Negative 📉  \n\n### Key Support Evidence  \n- **Institutional \"stickiness\" limiting full capitulation** (cumulative inflows down only **12%** vs. **40% price drop**).\n- **$2.8B ETF outflows** in past two weeks (2nd/3rd largest weekly redemptions).  \n- **Bear market risks escalating** on weakening demand, per LVRG Research.",
        "source_articles": [
            {
                "title": "BTC spot exchange-traded fund holders are in the red, may throw in the towel - CoinDesk",
                "source": "CoinDesk",
                "url": "https://www.coindesk.com/markets/2026/02/02/bitcoin-etf-holders-sitting-on-paper-losses-may-throw-in-the-towel",
                "body": "Bitcoin ETF holders, sitting on paper losses, may throw in the towel\nSpot ETF investors are now sitting on paper losses, which sets the stage for potential large redemptions.\nWhat to know:\n- Bitcoin spot ETF investors are now sitting on average paper losses of about 15%, with an implied entry price near $90,200 per bitcoin.\n- Being underwater could prompt redemptions from short-term traders, adding selling pressure.\n- Long-term institutional capital is seen as relatively \"sticky.\"\nBitcoin's\nSince their U.S. debut two years ago, the investors have paid an average of roughly $90,200 per BTC, according to estimates by Bianco Research and 10x Research. With the largest cryptocurrency now trading around $76,800, that leaves them with a paper loss of about $13,400 per BTC.\nBeing underwater could trigger ETF redemptions, particularly by short-term traders and speculators who bought in hopes of continued gains and quick profits. These potential redemptions could add to bearish pressures in the market.\nDemand for ETFs has cratered since the Oct. 8 crash, which social media is widely blaming on Binance, the leading cryptocurrency exchange by volume and open interest.\nJanuary already marked a third straight month of net outflows, the first three-month run since their inception. The 11 spot bitcoin ETFs have registered a net outflow of $6.18 billion in the period, according to data source SoSoValue.\nA deepening of the bear market could potentially spur a full-scale capitulation: Long-term holders give up, liquidate, and volumes explode. This dynamic often marks peak bear phases.\nThat said, analysts have previously told CoinDesk that institutional capital flowing into ETFs is meant for the long haul, and is \"sticky\", meaning a full-blown capitulation is unlikely."
            },
            {
                "title": "Average Bitcoin ETF Investor Turns Underwater After Heavy Outflows - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/average-bitcoin-etf-investor-turns-082418794.html",
                "body": "Bitcoin is trading below the average cost basis of US spot Bitcoin exchange-traded funds after the products recorded their second- and third-largest weekly outflows on record last month, according to research from Alex Thorn, head of research at Galaxy.\nKey Takeaways:\n-\nBitcoin has fallen below the average cost basis of US spot Bitcoin ETFs, leaving the typical ETF buyer underwater.\n-\nHeavy outflows of nearly $2.8 billion over two weeks signal a sharp reversal from last year’s strong inflows.\n-\nDespite price weakness, institutional holders show limited capitulation, though bear market risks are rising.\nUS spot Bitcoin ETFs now manage roughly $113 billion in assets and collectively hold about 1.28 million BTC, according to BiTBO.\nThat puts the average purchase price for ETF-held Bitcoin at approximately $87,830 per coin, well above current market levels.\nBitcoin Slides to Nine-Month Low, Leaving ETF Buyers Underwater\nBitcoin fell about 11% over the weekend, sliding from near $84,000 to a nine-month low around $74,600 in early Monday trading.\n“This means the average Bitcoin ETF purchase is underwater,” Thorn said in a post shared alongside the data.\nOutflows have accelerated in recent weeks. The 11 US spot Bitcoin ETFs recorded roughly $2.8 billion in net redemptions over the past two weeks, including $1.49 billion last week and $1.32 billion the week prior, according to Coinglass.\nThe sustained withdrawals mark a sharp reversal from the strong inflows seen late last year.\nDespite the drawdown, Thorn said institutional investors appear to be holding their positions better than the price action might suggest.\nTotal assets under management for spot Bitcoin ETFs have fallen about 31.5% from their October peak of roughly $165 billion, while Bitcoin’s price is down close to 40% over the same period.\nCumulative ETF inflows, however, are only about 12% below their peak, indicating limited outright capitulation by longer-term holders.\nStill, concerns are growing that weakening demand could deepen the downturn. Nick Ruck, director at LVRG Research, warned that Bitcoin risks sliding into a prolonged bear market if buying interest fails to return.\nHe pointed to ongoing macro uncertainty, geopolitical tensions and investor de-risking as key headwinds, adding that technical indicators are beginning to reflect sustained sell pressure.\nWhether ETF flows stabilize in the coming weeks may prove critical in determining whether Bitcoin can regain momentum or faces further downside.\nMorgan Stanley’s Bitcoin ETF Seen as Strategic Bet, Not Inflow Play\nMorgan Stanley’s planned spot Bitcoin ETF may be less about attracting large inflows and more about securing a long-term strategic position in crypto, according to Jeff Park, chief investment officer at ProCap."
            },
            {
                "title": "Beat Holdings Expands Bitcoin ETF Position and Corrects Prior Purchase Data - TipRanks",
                "source": "TipRanks",
                "url": "https://www.tipranks.com/news/company-announcements/beat-holdings-expands-bitcoin-etf-position-and-corrects-prior-purchase-data",
                "body": "www.tipranks.com\nVerifying you are human. This may take a few seconds.\nwww.tipranks.com needs to review the security of your connection before proceeding.\nVerification successful\nWaiting for www.tipranks.com to respond...\nEnable JavaScript and cookies to continue"
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "197.8000",
            "open": "2,414.7100",
            "close": "2,284.7500",
            "high": "2,472.6500",
            "low": "2,274.8500"
        },
        "market_summary": "### ETH/USD Market Briefing\n* **Key Drivers:** **Digital Asset Market Clarity Act** (regulatory catalyst) expected to boost institutional adoption; **asset tokenization** growth (multitrillion-dollar opportunity by 2030). \n* **Price Action:** Trading **45% below** August 2025 ATH of **$4,954**; analyst projects **$4,000** (+50%) in 6 months.\n* **Technical Outlook:** Critical liquidation support at **$1,830** (Trend Research’s leverage threshold).\n---\n**Overall Sentiment:** Cautiously Positive 📈  \n*Bullish catalysts (regulation, tokenization) counterbalanced by high-leverage systemic risks ($1.43B ETH position at risk if $1,830 breaks).*",
        "source_articles": [
            {
                "title": "2 Reasons to Buy Ethereum Before July 2026 - Finviz",
                "source": "Finviz",
                "url": "https://finviz.com/news/295070/2-reasons-to-buy-ethereum-before-july-2026",
                "body": "New: Instantly spot drawdowns, dips, insider moves, and breakout themes across Maps and Screener.\nEthereum is currently trading 45% below its all-time high from August 2025.\nNew crypto market legislation could provide a boost for Ethereum, by stimulating faster institutional adoption.\nRapid advances in asset tokenization are likely to benefit Ethereum, which is still the clear DeFi leader.\nPopular cryptocurrency Ethereum (CRYPTO: ETH) may be trading significantly below its all-time high from August 2025, but there's good reason to think that it could be headed for a major breakout this year.\nWithin the next six months, Ethereum could soar to a price of $4,000 or higher. That's a blistering gain of almost 50% based on today's prices. Here's a closer look at the two powerful catalysts leading the way.\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now. Continue »\nIt's impossible to overstate how important regulatory clarity is for the crypto market. It's what leads to faster institutional adoption of crypto, and it's what leads to greater transaction activity on popular blockchain networks. In other words, if market participants know the rules of the road (even if they don't agree with them), it's a huge positive for the crypto market.\nThat's why I'm keeping my eye on one key piece of crypto legislation that is likely going to be signed into law this summer: the aptly named Digital Asset Market Clarity Act (Clarity Act). This new piece of legislation attempts to establish a clear regulatory framework for the crypto market. It will close existing loopholes, outline the roles of different regulators, define key concepts, and specify how digital assets can be traded.\nImage source: Getty Images.\nIf there's one cryptocurrency that's poised to benefit the most from this new crypto legislation, it's Ethereum. As a Layer 1 blockchain network, it's exposed to every nook and cranny of the blockchain world. And it plays an especially important role in the world of decentralized finance (DeFi), which is one of the key areas affected by the Clarity Act.\nIn theory, passage of the Clarity Act should open the floodgates for more activity on the Ethereum blockchain. And it should make it much easier for financial institutions and big institutional investors to get involved in the crypto market.\nOverall, this new regulatory framework should be very bullish for Ethereum. I expect it to get the same type of lift that it did last summer, when Congress passed the Genius Act for stablecoins. That kicked off a remarkable summer rally for Ethereum that ended with it hitting a new all-time high of $4,954 in August.\nEthereum is also at the forefront of an important new trend in the financial world known as real-world asset (RWA) tokenization. That's a mouthful, but it simply refers to transforming traditional financial assets (such as stocks and bonds) into digital assets that can be managed and traded on a blockchain.\nRight now, Ethereum is the clear leader when it comes to asset tokenization. No other blockchain comes close. So when big Wall Street institutions look to tokenize assets, they turn to Ethereum first. Case in point: when BlackRock (NYSE: BLK) launched its first-ever tokenized fund back in 2024, it chose Ethereum.\nAsset tokenization could be a boon for Ethereum. According to top consulting firms, it could be a multitrillion-dollar market opportunity by 2030. If Ethereum maintains its dominant role in DeFi, it's hard to imagine a scenario in which it does not benefit from the meteoric rise of asset tokenization.\nAccording to Wall Street strategist Tom Lee of Fundstrat, asset tokenization is the type of once-in-a-lifetime event that can forever change the global financial system. He compares it to the U.S. decision back in 1971 to go off the gold standard. That's how big a seismic shift asset tokenization could be. In fact, says Lee, it could lead to Ethereum skyrocketing "
            },
            {
                "title": "Ethereum Liquidation Price: The Stunning $1.43B Gamble by Trend Research - bitget.com",
                "source": "bitget.com",
                "url": "https://www.bitget.com/amp/news/detail/12560605178252",
                "body": "Institutional cryptocurrency maneuvers often unfold behind closed doors, but a recent report has cast a stark light on one firm’s massive, high-stakes position. According to data from AmberCN, Trend Research, a subsidiary of the prominent LD Capital, currently holds approximately 618,000 Ethereum (ETH) valued at a staggering $1.43 billion. Crucially, the firm’s average purchase price sits at $3,180, while its liquidation price—the point at which its leveraged holdings could be forcibly sold—hovers around $1,830. This revelation provides a rare, transparent window into the complex interplay of accumulation, leverage, and risk management at the highest levels of digital asset investment. The firm’s recent strategic sale of 33,589 ETH, resulting in a $27.71 million realized loss to repay loans and lower this liquidation threshold, underscores the intense pressures within today’s crypto lending landscape.\nDecoding Trend Research’s Ethereum Liquidation Price\nUnderstanding the mechanics behind a liquidation price is fundamental to grasping this situation’s gravity. In decentralized finance (DeFi) and crypto lending, investors often use their existing cryptocurrency as collateral to secure loans. These loans can then fund further purchases, a strategy known as leverage. However, protocols like Aave, which Trend Research utilizes, require the loan’s value to remain below a specific percentage of the collateral’s value—the Loan-to-Value (LTV) ratio. If the collateral’s market price falls precipitously, threatening this ratio, the protocol automatically sells, or liquidates, the collateral to repay the loan and protect lenders. This trigger point is the liquidation price.\nFor Trend Research, the $1,830 figure represents this critical line. A sustained drop in Ethereum’s price below this level could force the automatic sale of hundreds of thousands of ETH, potentially exacerbating market downturns. The firm’s reported $941 million in outstanding loans against this collateral creates a highly leveraged position. Consequently, managing this liquidation risk becomes a paramount concern, directly leading to the firm’s recent decisive actions.\nThe Anatomy of a Strategic Withdrawal\nTrend Research’s move to sell 33,589 ETH for $79.12 million was not a panicked exit but a calculated risk mitigation strategy. By using the proceeds to repay a portion of its loans, the firm effectively increases the equity cushion in its position. This action lowers the overall Loan-to-Value ratio, which in turn pushes the liquidation price further down from the market price. Essentially, the firm sacrificed $27.71 million in realized capital to buy itself more breathing room and avoid a potentially catastrophic, protocol-enforced liquidation event. This trade-off highlights a core tenet of professional portfolio management: sometimes, realizing a controlled loss is preferable to risking a total wipeout.\nThe Broader Context of Crypto Lending Protocols\nTrend Research’s situation cannot be viewed in isolation. It is a prominent case study within the evolving ecosystem of crypto lending and decentralized finance. Protocols like Aave have revolutionized access to capital within the blockchain space, enabling sophisticated financial strategies previously confined to traditional markets. However, they also introduce new systemic risks. The potential for cascading liquidations—where one large liquidation triggers further price drops and more liquidations—remains a key concern for market stability.\nFurthermore, the firm’s ongoing accumulation since November of last year signals a strong, long-term conviction in Ethereum’s fundamental thesis, despite short-term market volatility. This behavior is consistent with institutional “dollar-cost averaging” strategies, where investors build positions over time to smooth out entry prices. Nevertheless, the addition of high leverage to this strategy dramatically amplifies both potential returns and risks, creating the delicate balanc"
            },
            {
                "title": "WLFI Investment Shows UAE Stake in Emerging DeFi Platform - Coinfomania",
                "source": "Coinfomania",
                "url": "https://coinfomania.com/wlfi-investment-shows-uae-stake-in-emerging-defi-platform/",
                "body": "WLFI Investment Shows UAE Stake in Emerging DeFi Platform\nWLFI investment reduces Trump family ownership to 38% while giving Abu Dhabi royal two board seats in the DeFi platform.\nQuick Take\nSummary is AI generated, newsroom reviewed.\nAbu Dhabi royal Sheikh Tahnoon acquired 49% of World Liberty Financial (WLFI) for $500 million.\nThe Trump family’s ownership was diluted from 75% to 38%, and Tahnoon gained two board seats.\nThe deal raises potential U.S. constitutional concerns under the emoluments clause.\nWLFI connects to broader UAE crypto investments, including a reported $2 billion stake in Binance.\nSheikh Tahnoon bin Zayed Al Nahyan, an Abu Dhabi royal, bought 49% of World Liberty Financial (WLFI), a DeFi platform backed by President Donald Trump. The Wall Street Journal reports that the deal is worth $500 million.\nThe Abu Dhabi investment firm paid the first $250 million installment. Of that, $187 million went directly to Trump-linked entities.\nWLFI Deal Details and Board Changes\nThe agreement was signed on January 16, 2025, just days before Trump’s inauguration. Tahnoon secured two board seats as part of the deal. At the same time, the Trump family’s ownership dropped from 75% to 38%.\nTahnoon also aims to gain access to U.S. AI technology through this investment. Analysts note that the deal makes the U.S.-UAE ties stronger in AI and crypto.\nPotential Constitutional Concerns\nLegal experts raised concerns about the emoluments clause. This rule prevents foreign influence on a president’s family business. Although Trump was no longer in office when the deal closed, the timing and size of the investment drew attention.\nThe deal also highlights how international investments interact with emerging financial technologies like DeFi. Investors, regulators and policymakers now face new challenges in monitoring cross-border ownership.\nBroader Implications for DeFi and Crypto\nWLFI launched in 2024 and quickly attracted high-profile investors. The platform also connects to larger UAE crypto investments. For example, the UAE reportedly invested $2 billion in Binance using WLFI’s stablecoin.\nAnalysts believe Tahnoon’s investment could increase WLFI’s growth. At the same time, it may increase scrutiny from U.S. regulators. The deal demonstrates how private equity, government-linked investors, and emerging technologies intersect globally.\nWhat Comes Next for WLFI\nThe Abu Dhabi–WLFI investment deal shows the growing international interest in U.S.-linked DeFi platforms. Observers will closely watch U.S. authorities’ response to large foreign stakes in sensitive financial projects.\nThe outcome may set precedents for future cross-border investments in crypto and AI. Overall, the deal highlights both opportunities and risks when wealthy investors and governments invest in emerging digital finance.\nReferences\nFollow us on Google News\nGet the latest crypto insights and updates."
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "6.4125",
            "open": "103.2259",
            "close": "100.6645",
            "high": "106.4674",
            "low": "100.0549"
        },
        "market_summary": "### SOL/USD Market Briefing\n* **Key Drivers:** Jupiter's **Polymarket integration** ($7.66B Jan. volume) and **$35M ParaFi investment** boost ecosystem confidence. Offset by **$30M Step Finance hack** and **$39.20M spot outflows**.\n* **Price Action:** Broke below **$100 support**, trades near **$98-102** with bearish channel resistance at **$105**.\n* **Technical Outlook:** Critical support at **$95-100** zone (July 2025 low). Resistance cluster at **$105-111**. Daily close below **$95** targets **$85**.\n\n---\n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "Solana Price Prediction: SOL Bounces From $95 Low As Jupiter Polymarket Deal Lifts Ecosystem Sentiment - bitget.com",
                "source": "bitget.com",
                "url": "https://www.bitget.com/amp/news/detail/12560605178850",
                "body": "Solana price today trades near $101.99 after rebounding from a session low at $95.83, its lowest level since July 2025. The recovery comes as Jupiter announced it will bring Polymarket to Solana for the first time, alongside a $35 million strategic investment from ParaFi Capital that signals institutional confidence in the ecosystem.\nJupiter announced a landmark integration that will bring Polymarket, the largest prediction market in crypto, to Solana for the first time. The deal positions Jupiter as a comprehensive on-chain predictions hub alongside its existing swap functionality.\nThe announcement came with a $35 million strategic investment in JUP from ParaFi Capital, settled entirely in JupUSD with an extended token lockup. Jupiter’s pseudonymous co-founder meow said prediction markets will be a major focus over the next year, with planned work spanning APIs and revamped market discovery tools.\nJupiter’s on-chain footprint supports the expansion. Total value locked sits at $2.35 billion with annualized fees near $650 million and protocol revenue around $150 million. The Polymarket integration could drive additional users and liquidity to Solana as prediction markets continue gaining traction.\nCoinglass data shows $39.20 million in spot outflows on February 2, continuing the distribution pattern that has defined the past several weeks. The selling pressure suggests that holders are using any bounce to reduce exposure rather than accumulating at lower levels.\nThe divergence between positive fundamental developments and negative spot flows highlights the broader risk-off environment affecting all altcoins. When ecosystem catalysts fail to attract fresh buying, it signals that macro sentiment remains the dominant driver of price action.\nOn the daily chart, Solana has broken below the descending trendline support that held since November, accelerating into a key horizontal support zone near $100. Price trades well below all four major EMAs, with the 20 day at $121.45, the 50 day at $129.53, the 100 day at $141.08, and the 200 day at $154.21.\nRelated: Hyperliquid Price Prediction: Can HYPE Reclaim $32.00 or Is Deeper Consolidation Ahead?\nThe Supertrend indicator remains bearish at $123.04, confirming the downtrend that began from the September highs near $260. The current price represents a 60 percent decline from those peaks.\nThe $95 to $100 zone represents critical support that held during the November correction. A break below this level would expose the $85 demand zone from July 2025, where SOL found buyers during the summer consolidation.\nOn the 2 hour chart, Solana trades within a descending channel that has guided price action since January 30. The channel resistance sits near $105, while support runs through the $95 zone.\nRSI has recovered to 40.04 from oversold levels near 30.15, suggesting the immediate selling pressure has eased. MACD shows the histogram turning positive at 0.32, with the signal lines beginning to converge, indicating momentum may be shifting.\nThe bounce from $95.83 has produced higher lows on the intraday timeframe, but price remains within the descending channel structure. Bulls need a break above channel resistance at $105 to signal any meaningful reversal attempt.\nThe trend remains bearish while price trades below the EMA cluster, but the $95 to $100 support zone offers a potential base for stabilization.\n- Bullish case: A daily close above $121.45 would reclaim the 20 day EMA and signal that the $95 low marked a local bottom. The Jupiter catalyst could attract buyers if broader crypto sentiment improves.\n- Bearish case: A close below $95 would break the 2025 support structure and expose the $85 demand zone. With spot outflows persisting and macro headwinds intact, that scenario remains probable."
            },
            {
                "title": "Polymarket Joins Solana Ecosystem Through New Jupiter DEX Integration - CoinCentral",
                "source": "CoinCentral",
                "url": "https://coincentral.com/polymarket-joins-solana-ecosystem-through-new-jupiter-dex-integration/",
                "body": "TLDR\n- Polymarket recorded $7.66B in trading volume in January 2026, up from $5.31B in December.\n- Kalshi reached $9.16B in January trading volume, rising from $6.58B in December 2025.\n- Jupiter launched an in-app Prediction feature for seamless Polymarket contract access.\n- Coinbase introduced Kalshi-powered markets across all 50 U.S. states in January 2026.\nPolymarket has expanded to the Solana blockchain through a new integration with Jupiter, a leading decentralized exchange aggregator on Solana. The move introduces Polymarket’s prediction markets directly into Jupiter’s application, allowing users to access event-based contracts without leaving the platform.\nNew Integration Brings Prediction Markets to Solana\nPolymarket, a decentralized prediction market platform, is now live on Solana via a new partnership with Jupiter. Jupiter is a major decentralized exchange aggregator operating on the Solana blockchain.\nOn Sunday, Jupiter announced on X (formerly Twitter) that it has launched a built-in “Prediction” tab in its app. This feature allows users to interact with Polymarket contracts directly inside Jupiter. Users no longer need to leave the app to access Polymarket’s event-driven markets.\n🚨 JUST IN: POLYMARKET EXPANDS TO SOLANA VIA JUPITER@Polymarket contracts are now embedded in @JupiterExchange interface.\nThe integration brings decentralized prediction markets to @Solana users.\nPolymarket’s January 2026 volume hit $7.66B, up from $5.31B in December. pic.twitter.com/VtnWVctzLN\n— BSCN (@BSCNews) February 2, 2026\n“Integrating Polymarket is primed for making Jupiter the most innovative predictions platform on Solana,” the platform stated. The collaboration aims to make event-based trading more accessible to Solana users by streamlining the experience.\nEvent-Driven Trading Sees Continued Growth\nPolymarket has become one of the largest prediction market platforms in the crypto space. It lets users trade on outcomes of real-world events, including politics, economics, sports, and culture.\nIn January 2026, Polymarket recorded a trading volume of $7.66 billion. This was an increase from $5.31 billion in December 2025, according to The Block’s data. Its competitor, Kalshi, also saw rising volumes, reaching $9.16 billion in January compared to $6.58 billion in the previous month.\nThe rise in volumes shows increasing user interest in event-driven contracts, especially around major global developments and sporting events.\nJupiter Positions Itself as a Solana-Based Prediction Hub\nBy integrating Polymarket directly, Jupiter has expanded its functionality beyond its original use as a trading aggregator. This new feature could position it as a central hub for prediction markets on the Solana network.\nThe prediction feature enables users to explore various contracts, track live outcomes, and place trades — all within the Jupiter interface. This offers convenience to users familiar with DeFi platforms but looking to engage in new market types.\nJupiter’s large user base and infrastructure on Solana may help Polymarket reach more traders and increase market activity in the Solana ecosystem.\nBroader Expansion of Prediction Markets in Crypto and TradFi\nThe integration is part of a wider trend of prediction markets gaining popularity. These platforms are moving beyond niche crypto communities and are entering more traditional trading environments.\nIn January 2026, Coinbase rolled out access to Kalshi-powered prediction contracts across all 50 U.S. states. This marked a step toward regulated access to event contracts in the traditional financial system.\nAdditionally, Polymarket recently signed a multi-year sports data deal with Major League Soccer. This gives it access to official league data, which can be used to create licensed prediction contracts around games and player outcomes.\nThis growing interest from major exchanges and sports leagues may help normalize prediction markets and encourage further institutional participation."
            },
            {
                "title": "Solana Price Prediction: $30M Hack Sends SOL Below $100 – Can Bulls Recover? - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/news/feed/c7ec9-solana-price-prediction-30m-hack-sends-sol-below-100-can-bulls-recover",
                "body": "Solana Price Prediction: $30M Hack Sends SOL Below $100 – Can Bulls Recover?\nShare:\nSolana (SOL) is trading around $97 after a sharp sell-off that pushed the token below the key $100 mark. The recent decline comes after a tough stretch for the crypto market overall, but Solana has dropped more than most due to new security concerns affecting investor confidence.\nSOL has dropped from the $140–$145 range in just a few weeks, wiping out much of its recovery from late 2025. For newer investors, this kind of decline usually comes from fear, forced selling, and uncertainty, not a sudden failure in the technology itself.\nStep Finance Hack Exposes $30M SOL Vulnerability, Raises Security Concerns in Solana DeFi\nA major reason for the recent drop was a security breach at Step Finance, where about $30 million in SOL was taken from treasury wallets. Around 261,854 SOL was moved quickly, leading to worries that someone with internal access, not just an automated hack, was involved.\nStep Finance has said that user funds were safe, but the incident still shook the Solana DeFi community. Big treasury wallets are increasingly becoming targets, and this event shows why stronger protections, such as multi-signature approvals and stricter access controls, are needed.\nFor the market, the news itself was more important than the details. When stress is high, security scares often speed up selling as traders rush to cut their risk.\nJupiter’s New Explorer Offers a Long-Term Positive\nThere are also some positive updates. Jupiter has launched explore.ag, a new tool for the Solana ecosystem that brings together data from Solscan and DeFiLlama in one place. This tool helps users track projects, transactions, and DeFi stats more easily, making the network more transparent.\nFor newcomers, this might not change prices right away, but it shows that Solana’s ecosystem is still growing. Improved data and analytics often bring in developers and long-term investors, even when the market is down.\nSolana Technical Analysis: Can SOL Reclaim $100?\nLooking at the charts, Solana is clearly in a short-term downtrend. The price is still moving within a downward channel that started in late 2025. When the price fell below the 100-day and 200-day EMAs near $140, it quickly dropped through $119 and $111, which points to forced selling instead of regular profit-taking.\nKey levels to watch now:\n- Resistance: $105–$111, where previous support has turned into a selling zone\n- Support: $90–$81, aligned with prior demand and Fibonacci extensions\n- Deeper risk: A move toward $70 if broader market weakness intensifies\nThe RSI is now in the mid-20s, which means the market is oversold. This can sometimes cause a short-term bounce, but it does not promise a quick turnaround.\nFor a more positive outlook, SOL needs to hold above $100, set a higher low, and close above $111 on the daily chart. This could lead to a recovery toward $120–$130 later on.\nFor now, Solana seems to be in a tough but common reset phase, which often comes before stronger and more lasting gains once the selling slows down.\nBitcoin Hyper: The Next Evolution of BTC on Solana?\nBitcoin Hyper ($HYPER) is bringing a new phase to the BTC ecosystem. While BTC remains the gold standard for security, Bitcoin Hyper adds what it always lacked: Solana-level speed. The result: lightning-fast, low-cost smart contracts, decentralized apps, and even meme coin creation, all secured by Bitcoin.\nAudited by Consult, the project emphasizes trust and scalability as adoption builds. And momentum is already strong. The presale has surpassed $31.4 million, with tokens priced at just $0.013665 before the next increase.\nAs Bitcoin activity climbs and demand for efficient BTC-based apps rises, Bitcoin Hyper stands out as the bridge uniting two of crypto’s biggest ecosystems. If Bitcoin built the foundation, Bitcoin Hyper could make it fast, flexible, and fun again.\nClick Here to Participate in the PresaleThe post Solana Price Prediction: $30M "
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "598.500",
            "open": "48,971.720",
            "close": "48,844.100",
            "high": "49,037.820",
            "low": "48,439.320"
        },
        "market_summary": "### US30 (Dow Jones) Market Briefing  \n* **Key Drivers:** **Fed's \"higher for longer\" stance** recalibrating rate-cut hopes; **inflation data sensitivity** driving volatility; **blue-chip earnings** under scrutiny for demand signals.  \n* **Price Action:** Choppy trading with **sharp intraday swings**; failed breakouts met with selling pressure; **38,000 level** acting as psychological resistance.  \n* **Technical Outlook:** Decision point at **38,000** (bullish confirmation requires strong volume). Support near **37,400**.  \n\n---  \n**Overall Sentiment:** Neutral/Cautious ⚠️  \n\n### Key Themes from Analysis:  \n1. **Fed Narrative:** Markets adjusting to delayed/limited rate cuts despite soft-landing hopes.  \n2. **Earnings Focus:** Industrials, financials, and consumer giants signaling **mixed demand** (strong infrastructure/AI capex vs. softer cyclical trends).  \n3. **Sector Rotation:** Tactical moves into defensive blue chips amid late-cycle jitters.  \n\n*Data sources: Investing.com, Ad Hoc News*",
        "source_articles": [
            {
                "title": "Dow Jones, Nasdaq, S&P 500 weekly preview: More megacap earnings, jobs data on tap - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/news/stock-market-news/dow-jones-nasdaq-sp-500-weekly-preview-more-megacap-earnings-jobs-data-on-tap-4478365",
                "body": "www.investing.com\nVerifying you are human. This may take a few seconds.\nwww.investing.com needs to review the security of your connection before proceeding.\nVerification successful\nWaiting for www.investing.com to respond...\nEnable JavaScript and cookies to continue"
            },
            {
                "title": "Dow Jones Futures Fall, Bitcoin Dives To Lowest Since 2024; Google, AMD, Amazon, Palantir Due - Investor's Business Daily",
                "source": "Investor's Business Daily",
                "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-risk-off-shift-google-amd-amazon-palantir-lilly/",
                "body": "Access to this page has been denied because we believe you are using automation tools to browse the website.\nThis may happen as a result of the following:\n- Javascript is disabled or blocked by an extension (ad blockers for example)\n- Your browser does not support cookies\nPlease make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.\nReference ID: #1e8b3ba3-0033-11f1-a7c5-8eee4c0ef8b0"
            },
            {
                "title": "Dow Jones At A Turning Point: Next Leg Higher Or Volatile Bull Trap For Wall Street? - AD HOC NEWS",
                "source": "AD HOC NEWS",
                "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/dow-jones-at-a-turning-point-next-leg-higher-or-volatile-bull-trap-for/68542941",
                "body": "Dow Jones At A Turning Point: Next Leg Higher Or Volatile Bull Trap For Wall Street?\n02.02.2026 - 05:45:09Get the professional edge. Since 2005, the 'trading-notes' market letter has delivered reliable trading recommendations – three times a week, directly to your inbox. 100% free. 100% expert knowledge. Simply enter your email address and never miss a top opportunity again. Sign up for free now\nVibe Check: The Dow Jones is moving in a tense, choppy zone where every headline feels like a catalyst. Instead of a clean breakout or a brutal crash, we are seeing a cautious tug-of-war: rotation into solid blue chips, tactical profit-taking in recent winners, and short-lived rallies that quickly meet selling pressure. Think of it as a late-cycle, high-alert environment: not panic, not euphoria, but edgy optimism with a built-in exit plan.\nThe market tone is defined by sharp intraday swings, fast reversals after the opening bell, and a constant back-and-forth between \"soft landing\" believers and \"recession is just delayed\" skeptics. Bulls are still very much alive, but they are being forced to work harder for every inch of upside.\nThe Story: What is driving this Dow Jones mood right now? It is all about three big pillars: the Federal Reserve, inflation expectations, and corporate earnings.\n1. The Fed and bond yields: the macro puppet masters\nJerome Powell and the Fed are the main characters in this script. After a long cycle of aggressive rate hikes to tame inflation, markets had been dreaming of swift, repeated rate cuts. Reality check: recent Fed messaging has been more cautious. \"Higher for longer\" is not dead, it is just being rebranded into \"data dependent.\" That subtle language shift is everything for the Dow.\nBond yields tell the story under the surface. When longer-term Treasury yields edge higher, you can see pressure on rate-sensitive sectors: industrials, real estate, and some financials. When yields ease lower, suddenly the \"risk-on\" crowd shows up again, and the dip-buyers rush into blue chips. The Dow, being packed with established multinationals, reacts more to growth expectations and funding costs than the ultra-speculative tech plays on the Nasdaq.\nThis week, markets are recalibrating: the Fed is not in full-on easing mode yet, but it is no longer trying to break the economy. That keeps the door open for a soft landing narrative: slowing, but not crashing.\n2. Inflation, consumers, and the real economy vibe\nOn the data front, traders are glued to every CPI, PPI, and jobs release. Inflation has cooled from the peak, but it is not comfortably back in the sweet spot. That is why each report sparks a reaction: a slightly hotter inflation read can trigger a sharp, nervous sell-off; a softer one can unleash a relief rally.\nConsumer spending remains the joker in the deck. The US consumer has been surprisingly resilient, still spending on travel, dining, and experiences, even as credit card balances rise and savings shrink. For the Dow, that matters a lot. Think: global brands, industrial giants, consumer-facing blue chips. As long as the consumer does not roll over, earnings for those Dow components can hold up better than the doom-and-gloom crowd expects.\nBut under the surface, you can feel a shift: more mentions of \"downtrading\" in earnings calls, hints of slower order books in cyclical sectors, and talk of cautious guidance. Markets are trying to sniff out whether this is just normalization after a wild post-pandemic run or the early phase of a demand slowdown.\n3. Earnings season: blue chips under the microscope\nEarnings season is the scoreboard, and for the Dow, it is pure x-ray vision into the real economy. Industrial leaders are talking about mixed demand: some strength in areas tied to infrastructure and AI-related capex, but more hesitancy in cyclical consumer and manufacturing demand. Financial names are navigating a tricky rate landscape, balancing net interest income with concerns about credit quality if growth slo"
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "105.450",
            "open": "10,208.010",
            "close": "10,230.460",
            "high": "10,240.460",
            "low": "10,135.010"
        },
        "market_summary": "### UK100 Market Briefing\n* **Key Drivers:** **BoE rate decision** (expected unchanged at **3.75%** amid **3.4% CPI inflation**), **earnings** from Shell/GSK/Unilever, **commodity slump** (gold -7%, silver -14%), **Iran tensions** (oil price risks).  \n* **Price Action:** Opened lower but **recovered mid-morning**; mining stocks (**Fresnillo -7%**, Endeavour -6.8%) lagged on metals plunge.  \n* **Technical Outlook:** **Resistance** near **all-time highs** (7,700-7,800 zone). Support at **7,500** (psychological level).  \n---\n**Overall Sentiment:** Neutral 🟡  \n\n### Key Catalysts This Week:  \n1. **BoE Decision (Thu):** Hawkish hold likely; focus on inflation trajectory.  \n2. **Earnings:** **Shell** (Thu), **GSK** (Wed), **Unilever** (Thu) to drive sector moves.  \n3. **Geopolitics:** Potential Iran strike threatens **oil volatility** (↑ inflation risks).  \n4. **Commodities:** Metals rout pressures **miners** (12% of FTSE 100).  \n\n**Risks:**  \n- **Iran escalation** → **↑ oil prices** → stagflation fears.  \n- **Tech sell-off spillover** (AI spending concerns).  \n- **US NFP data** (Fri) → Fed policy reassessment.",
        "source_articles": [
            {
                "title": "Top news catalysts for FTSE 100 and FTSE 250 Indices this week - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/invezz:b85bba7ef094b:0-top-news-catalysts-for-ftse-100-and-ftse-250-indices-this-week/",
                "body": "Top news catalysts for FTSE 100 and FTSE 250 Indices this week\nThe FTSE 100 and FTSE 250 Indices remained in a tight range on Monday as market participants waited for major macro events and earnings from British companies. This article explores some of the top catalysts to watch this week.\nFTSE 100 and FTSE 250 indices to react to Bank of England interest rate decision\nOne of the main catalysts for the FTSE 100 and FTSE 250 indices will be the upcoming Bank of England (BoE) interest rate decision, which will happen on Thursday this week.\nEconomists polled by Reuters expect the bank to leave interest rates unchanged at 3.75% as officials remain concerned about the elevated inflation.\nThe most recent results showed that the headline Consumer Price Index (CPI) rose to 3.8% in December, higher than the bank’s target of 2.0%. Core inflation, which excludes the volatile food and energy prices, has also remained at an elevated level in the past few months.\nStill, most officials, including Andrew Bailey, the bank’s governor, believe that inflation will continue falling in the coming months.\nThe BoE outlook explains why UK bond yields have remained unchanged in the past few months. Data shows that the ten-year bond yield has remained unchanged at 4.50%, while the five-year was at 4.6%.\nTop UK companies to publish earnings\nThe other key catalyst for the FTSE 100 and FTSE 250 indices are the upcoming earnings from some of the biggest companies in the UK.\nGSK, a major pharmaceutical valued at over $103 billion, will release its results on Wednesday.\nShell, the biggest energy company in Europe, will release it on Thursday. These numbers come as the energy market continued doing well because of the rising geopolitical tensions between the United States and Iran.\nUnilever, a major player in the Fast Moving Consumer Goods Industry (FCMG), will release its numbers on Thursday.\nMore companies like Entain, Watches of Switzerland BT Group, Compass Group, and Vodafone will also publish their numbers.\nOn top of this, hundreds of American companies, including popular names like Amazon and Google, will publish their financial results. Historically, these companies often have an impact on the global financial market.\nCommodity prices to impact UK stocks\nThe other major catalyst for the FTSE 100 and FTSE 250 indices is the performance of key commodities. Gold, copper, and silver prices tumbled on Monday, affecting key companies in the industry.\nIndeed, data shows that the Fresnillo stock price crashed by 7% as silver plunged. Fresnillo is one of the biggest silver miners globally. It has been one of the best-performing companies in FTSE 100 Index in the past few months as silver jumped.\nEndeavour Mining’s stock price dropped by 6.8% as gold prices dropped. Other mining companies like Antofagasta, Anglo American, Rio Tinto,and Glencore were among the top laggards in the FTSE 100 Index on Monday.\nGeopolitical events to impact British stocks\nThe FTSE 100 and FTSE 250 indices will also react to the upcoming geopolitical developments in the Middle East.\nDonald Trump has warned that he may attack Iran as soon as his armada near the region. Trump has accused the Iranian regime of killing protestors and for having nuclear ambitions. Also, Trump wants Iran to dismantle its civilian nuclear ambitions and limit its ballistic missile program.\nAn attack would have major implications in the US and UK equities as it would lead to higher oil prices and inflation. It would also disrupt the travel activity in the region, affecting companies like IAG and EasyJet."
            },
            {
                "title": "FTSE 100 latest: Stocks, gold, silver and oil plunge in market rout - The Telegraph",
                "source": "The Telegraph",
                "url": "https://www.telegraph.co.uk/business/2026/02/02/ftse-100-markets-gold-silver-bitcoin-kospi-oil-us-nasdaq-uk/",
                "body": "Stocks, gold and oil have plunged in a global market rout driven by fears about AI spending and the outlook for interest rates.\nAsian markets were pummelled and Wall Street was expected to open lower as a sell-off in precious metals fuelled a downturn across the world.\nGold was down as much as 7pc to nearly $4,400 an ounce, less than a week after hitting a record high close to $5,600. Silver plummeted by as much as 14pc to less than $72, having tipped above $120 for the first time last week. Oil was also down around 5pc to less than $66 a barrel.\nTim Waterer, chief market analyst at KCM Trade, said: “Traders are unnerved by the market tumult witnessed on Friday in precious metals.”\nGold and silver sold off sharply at the end of last week as a string of concerns swept the market, from Donald Trump’s trade war to the latest batch of tech earnings.\nThere were also questions over the outlook for US interest rates after President Trump nominated a Kevin Warsh to be the next chairman of the Federal Reserve.\nTrading was briefly halted on South Korea’s benchmark Kospi stock index, which plunged by more than 5pc as tech giants SK Hynix and Samsung fell by more than 8pc and 5pc, respectively.\nJapan’s Nikkei 225, also home to several big-name tech companies, shed more than 1pc while Taiwan’s stock exchange – where chip giant TSMC is listed – lost more than 2pc.\nThe FTSE 100 and European markets opened lower but recovered by mid-morning, although US stocks were on track to decline at the start of trading.\nIt followed losses on Wall Street on Friday in the wake of concerns about Microsoft’s huge spending on AI.\nThe tech giant resumed its downturn on Friday after falling more than 10pc on Thursday, which had wiped $357bn (£260bn) off its valuation in the second largest downturn in stock market history in a single day.\nStephen Innes of SPI Asset Management said the sell-off was “reflecting AI mega-cap bubble risk, in a familiar Monday morning echo of Wall Street’s late-week loss of balance”."
            },
            {
                "title": "GBP/USD forecast ahead of US NFP data, Bank of England decision - CryptoRank",
                "source": "CryptoRank",
                "url": "https://cryptorank.io/news/feed/54b5e-gbp-usd-forecast-ahead-of-us-nfp-data-bank-of-england-decision",
                "body": "GBP/USD forecast ahead of US NFP data, Bank of England decision\nShare:\nThe GBP/USD exchange rate continued its strong downward trend, moving from the year-to-date high of 1.3876 to the current 1.3672 as traders wait for the upcoming Bank of England (BoE) interest rate decision and US non-farm payrolls (NFP) data.\nBank of England interest rate decision\nThe GBP/USD exchange rate retreated as investors focused on the upcoming Bank of England interest rate decision on Thursday this week.\nMost economists believe that the BoE will leave interest rates unchanged at 3.75% as officials remain concerned about the elevated inflation in the country.\nThe most recent data showed that the UK’s consumer inflation remained much higher than the Bank of England’s target of 2.0%. Data released recently showed that the headline Consumer Price Index (CPI) dropped to 3.4% in December last year.\nWhile officials believe that prices will drop to 2.0% soon, officials at the Bank of England are divided on when this will happen. However, the recent crude oil price surge after Trump announced a potential attack on Iran, could push inflation higher in the near term.\nMore data showed that the unemployment rate remained steady at 5.1% in the three-months through November last year. Wage growth is expected to undershoot the bank’s forecast for the fourth quarter.\nMeanwhile, the central bank expects that the British economy will continue slowing in the coming months because of Rachel Reeves’ tax increases. The view is that the economy grew by 1.2% this year.\nUS non-farm payrolls jobs numbers\nThe next key catalyst for the GBP/USD exchange rate will be the upcoming US non-farm payrolls data, which will come out later this week.\nData compiled by TradingEconomics shows that the economy created 70k jobs in January, while the unemployment rate remained unchanged at 4.4%.\nThe data comes a day a week after the Federal Reserve left interest rates unchanged between 3.50% and 3.75%. Officials also upgraded the economic outlook, pointing to lower inflation in the coming weeks.\nThe GBP/USD pair will also react to the nomination of Kevin Warsh to become the next Federal Reserve Chairman. Warsh is widely seen as a highly hawkish official who has criticized the Fed for cutting interest rates and implementing quantitative easing policies.\nMeanwhile, the pair will also react to the upcoming attack on Iran, which may happen as early as this week. Such an attack will lead to higher oil prices, which will lead to more volatility and high inflation.\nGBP/USD technical analysis\nThe daily timeframe chart shows that the GBP/USD exchange rate peaked at 1.3876 in January and has pulled back to the current 1.3670. It has moved to the Major S&R pivot point of the Murrey Math Lines tool.\nThe GBP to USD pair has moved below the important support level at 1.3727, its highest level in September last year. Also, the Relative Strength Index (RSI) and the MACD indicators have continued falling.\nTherefore, the most likely GBP/USD forecast is bearish, with the next key target level being at 1.3500. The pair will likely resume the uptrend, potentially to the Ultimate Resistance level at 1.4160.\nThe post GBP/USD forecast ahead of US NFP data, Bank of England decision appeared first on Invezz\nRead More\nGBP/USD forecast ahead of US NFP data, Bank of England decision\nShare:\nThe GBP/USD exchange rate continued its strong downward trend, moving from the year-to-date high of 1.3876 to the current 1.3672 as traders wait for the upcoming Bank of England (BoE) interest rate decision and US non-farm payrolls (NFP) data.\nBank of England interest rate decision\nThe GBP/USD exchange rate retreated as investors focused on the upcoming Bank of England interest rate decision on Thursday this week.\nMost economists believe that the BoE will leave interest rates unchanged at 3.75% as officials remain concerned about the elevated inflation in the country.\nThe most recent data showed that the UK’s consumer inflation remain"
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "272.750",
            "open": "24,452.910",
            "close": "24,490.510",
            "high": "24,587.760",
            "low": "24,315.010"
        },
        "market_summary": "### GER40 Market Briefing\n\n* **Key Drivers:** **ECB rate cut speculation**, **mixed German industrial data**, and **global EV/AI competition**.  \n* **Price Action:** Choppy, range-bound trading with **fragile momentum** and fast intraday reversals.  \n* **Technical Outlook:** Tense range near **key long-term zones**; lack of decisive trend.  \n\n---  \n**Overall Sentiment:** Neutral 😐  \n\n### Breakdown:  \n1. **ECB Policy:** Market hypersensitive to **rate cut timing**, with cyclical sectors (autos, industrials) volatile on **hawkish/dovish signals**.  \n2. **German Economy:** Manufacturing shows **cautious stabilization**, but external demand (China, US) and energy costs remain risks.  \n3. **Autos & AI:** **Margin pressures** from Chinese EV rivals vs. tailwinds from **industrial automation/digitalization** investments.",
        "source_articles": [
            {
                "title": "DAX 40: Hidden Opportunity Or Silent Risk Before The Next Big Move? - AD HOC NEWS",
                "source": "AD HOC NEWS",
                "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/dax-40-hidden-opportunity-or-silent-risk-before-the-next-big-move/68543871",
                "body": "DAX 40: Hidden Opportunity Or Silent Risk Before The Next Big Move?\n02.02.2026 - 11:20:37Get the professional edge. Since 2005, the 'trading-notes' market letter has delivered reliable trading recommendations – three times a week, directly to your inbox. 100% free. 100% expert knowledge. Simply enter your email address and never miss a top opportunity again. Sign up for free now\nVibe Check: The DAX 40 is moving in a tense, cautious range, with traders clearly split between optimism about a potential European recovery and fear of another macro shock. Instead of a clean trend, we are seeing choppy sessions, fast intraday reversals, and a strong focus on headlines from the European Central Bank, energy markets, and German industry. This is not a calm bull market – this is a battlefield where every bounce is tested and every dip gets scanned for hidden opportunity.\nVolatility is not extreme, but the tone is nervous. German blue chips are hovering around important zones where long-term investors and short-term traders are fighting for control. Momentum is fragile: one strong macro surprise or central bank comment could flip the script from cautious optimism to aggressive risk-off – or ignite a powerful squeeze that forces the bears to cover.\nThe Story: To understand the DAX 40 right now, you need to zoom out and connect four big narratives: the ECB, the German economy, the global growth story, and the euro.\n1. ECB and interest rate drama\nThe European Central Bank is the main puppet master for European equities. After a brutal rate-hiking cycle to crush inflation, the market is now obsessed with one thing: the timing and pace of rate cuts. The narrative swinging around is simple: if inflation keeps grinding lower and growth stays weak, the pressure on the ECB to ease will increase. That is DAX-positive because cheaper money supports valuations, especially for cyclical and rate-sensitive sectors like autos, industrials, and real estate.\nBut there is a catch. The ECB cannot move too fast if wage growth and services inflation stay sticky. Every hawkish comment from policymakers revives fears of “higher for longer” and hits growth-sensitive names. Traders are now hyperfocused on every ECB press conference, every speech, and every inflation print. This creates a stop-and-go market: short rallies on hopes of cuts, quick pullbacks when the tone turns cautious again.\n2. German industry: from crisis talk to cautious stabilization\nGermany is still dealing with the aftermath of an energy price shock, weak global manufacturing, and a structural transition away from cheap Russian gas and old-school combustion engines. Recent data has been mixed: manufacturing activity has shown signs of bottoming but remains fragile, while business sentiment surveys still signal uncertainty rather than clear confidence.\nThe DAX 40 is heavily exposed to global trade and manufacturing. Industrial giants, chemical companies, and machinery exporters depend on external demand from the US, China, and the rest of Europe. When Chinese data looks weak or US growth expectations are revised lower, the DAX feels it quickly. On the flip side, any hint that global manufacturing is stabilizing or that inventory cycles are turning up can light a fire under German exporters.\n3. German autos vs. the global EV and AI wave\nThe German auto complex – think big legacy car manufacturers and their suppliers – is locked in a brutal competition with Chinese EV producers and US tech-driven players. Margins are under pressure, and the market is constantly asking: can German brands reinvent themselves fast enough, or will they slowly bleed market share?\nAt the same time, another theme is quietly helping the DAX: the global AI and digitalization wave. While the DAX is not as tech-heavy as the US indices, several components are deeply involved in industrial automation, semiconductors, cloud infrastructure, and software for factories and logistics. As companies worldwide invest in efficiency, r"
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "449.000",
            "open": "25,879.460",
            "close": "25,513.750",
            "high": "25,897.080",
            "low": "25,448.080"
        },
        "market_summary": "### NDX100 Market Briefing\n* **Key Drivers:** **AI trade doubts** (Nvidia's $100B OpenAI plan on hold), **Fed uncertainty** (Warsh nomination eyes $6.6T balance sheet reduction), **Big Tech earnings** (Amazon, Alphabet, AMD reports due).\n* **Price Action:** Futures slid **0.7%**, closed at **23,461.82** (-0.94%).\n* **Technical Outlook:** **Downward momentum** persists; support near **23,400** amid earnings volatility.\n---\n**Overall Sentiment:** Neutral-to-Negative 📉  \n*Earnings optimism (50% EPS beats) offsets AI/Fed jitters, but tech-led declines dominate near-term action.*",
        "source_articles": [
            {
                "title": "Stock market today: Dow, S&P 500, Nasdaq futures sink after gold sell-off as AI doubts creep in - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/live/stock-market-today-sp-500-nasdaq-futures-sink-as-ai-doubts-swirl-precious-metals-whipsaw-around-002413077.html",
                "body": "US stock futures slid on Monday after a dramatic sell-off in gold and silver unnerved investors, with tech leading the way lower as AI trade worries swirled and Federal Reserve uncertainty deepened.\nNasdaq 100 futures (NQ=F) dropped 0.7%, while those on the S&P 500 (ES=F) fell about 0.5%. Contracts on the Dow Jones Industrial Average (YM=F), which includes fewer tech names, hovered just below the flat line. All three indexes pared steeper overnight losses that followed a sharp reversal on Wall Street on Friday.\nNasdaq GIDS - Delayed Quote • USD 23,461.82 -223.28 (-0.94%)\nAt close: January 30 at 5:15:59 PM EST\nWall Street is heading into a new month digesting fresh uncertainty around Nvidia (NVDA) and the broader artificial intelligence trade. CEO Jensen Huang played down the chipmaker's pledge to invest $100 billion in OpenAI (OPAI.PVT) after The Wall Street Journal reported the plan was on ice.\nBig Tech has led market moves throughout the start of 2026, with earnings leading companies in oppositional directions. Quarterly reports from Amazon (AMZN), Alphabet (GOOG), and Advanced Micro Devices (AMD) lie ahead on the docket this week.\nStocks are under pressure as precious metals continue a rollercoaster ride that has seen them unwind much of 2026's most rip-roaring rally in recent days. Gold (GC=F) and silver (SI=F) swung back to gains early on Monday after tumbling in Asia hours, on the heels of a Friday wipeout that saw silver post its biggest single-day drop on record.\nOver the weekend, bitcoin (BTC-USD) sank below the $80,000 mark for the first time since April, extending losses after a volatile end to last week. The cryptocurrency was last trading at around $78,000 per token. At the same time, the dollar (DX-Y.NYB) gained against major peers, rising most against currencies sensitive to commodity prices.\nInvestors are also wondering what comes next after President Trump chose Kevin Warsh as his nominee to lead the Federal Reserve. That move is seen as reviving efforts to reduce the Fed's $6.6 trillion balance sheet, even as it opened the door to speculation on the path of interest rates. Most traders are still pricing in two rate cuts by the end of the year.\nThe week ahead brings a wave of corporate earnings, with more than 100 S&P 500 (^GSPC) companies set to report results. Disney (DIS) and Palantir (PLTR) are the highlights on Monday's docket, with high-profile reports from Amazon (AMZN), Alphabet (GOOG), and Advanced Micro Devices (AMD) due this week.\nOn the macro front, January updates on manufacturing activity due later Monday will start to set the stage for Friday's all-important monthly jobs report. Economists expect payrolls to have added 65,000 jobs in January, and the unemployment rate to hold at 4.4%.\nLIVE 10 updates Goldman: US earnings forecasts are looking healthy\nStrategists at Goldman Sachs said on Monday that earnings outlooks from US companies appear strong, easing concerns. Despite what some may say has an underwhelming reporting season so far, US companies have posted good 2026 earnings-per-share forecasts.\nStrategist Ben Snider said that more than half of the earnings released have been above analyst expectations, beating the historical average of 40%.\nSNP - Delayed Quote • USD 6,939.03 -29.98 (-0.43%)\nAt close: January 30 at 4:35:47 PM EST\nBloomberg News reports:\nRead more here.\nGood morning. Here's what's happening today.\nOracle to raise up to $50 billion in 2026 for cloud buildup\nFrom Bloomberg:\nOracle (ORCL) plans to raise $45 billion to $50 billion this year through a combination of debt and equity sales to build additional cloud infrastructure capacity, reflecting the scale of financing needed to feed AI’s growth.\nOracle is raising money to build additional capacity to meet the contracted demand from the company’s largest cloud customers, including Advanced Micro Devices (AMD), Meta Platforms (META), Nvidia (NVDA), OpenAI (OPAI.PVT), TikTok and xAI (XAAI.PVT), the company said in a statement Sund"
            },
            {
                "title": "Dow Jones, Nasdaq, S&P 500 weekly preview: More megacap earnings, jobs data on tap - Investing.com",
                "source": "Investing.com",
                "url": "https://www.investing.com/news/stock-market-news/dow-jones-nasdaq-sp-500-weekly-preview-more-megacap-earnings-jobs-data-on-tap-4478365",
                "body": "Is gold’s slump the start of a reversal? 3 Wall Street analysts weigh in\nInvesting.com -- U.S. stocks ended lower on Friday, led by continued weakness in technology shares, even as markets appeared broadly comfortable with President Donald Trump’s decision to nominate Kevin Warsh as the next Federal Reserve chair.\nThe S&P 500 slipped 0.43% to close at 6,939.03, extending its losing streak to three sessions. The Dow Jones Industrial Average declined 179 points, or 0.36%, finishing at 48,892.47. Losses were steeper in the NASDAQ Composite, which fell 0.94% to 23,461.82, after all three benchmarks had been down more than 1% earlier in the day.\nThat said, moves across other assets pointed to a calm reaction to the Fed nomination, with the U.S. dollar strengthening, while Treasury yields were little changed.\n\"The Warsh nomination should be viewed as a market stabilizing event with the recent parabolic rise in precious metals raising questions about the \"run it hot\" strategy,\" Morgan Stanley strategist Michael Wilson said in a note. \"Friday’s price action signals it was the right move as the S&P 500/Gold ratio had one of its best days in history.\"\nEven with Friday’s pullback and choppy trading through the month, Wall Street still posted gains for January. The S&P 500 rose about 1.4%, while the Dow added roughly 1.7%. The Nasdaq also finished higher, up around 1%. Smaller stocks outperformed, with the Russell 2000 climbing more than 5% over the month.\nThis week, attention will stay centered on the fourth-quarter earnings season, while investors also look ahead to the U.S. monthly jobs report scheduled for February 6. The Fed last week pointed to signs of stabilization in the labor market as it paused its interest-rate cutting cycle.\nEconomists expect January nonfarm payrolls to rise by about 64,000, according to a Reuters poll. Economic data releases are also returning to a more normal rhythm after delays caused by last year’s 43-day government shutdown.\nFollowing the Fed’s latest meeting, markets are now pricing in no additional rate cuts until June, though a sharper-than-expected slowdown in hiring could quickly shift those expectations.\nMore mega-cap earnings and jobs data set to steer markets this week\nAfter a weak report from heavyweight Microsoft pressured major indexes, another wave of high-profile earnings — including results from Alphabet (NASDAQ:GOOGL) and Amazon (NASDAQ:AMZN) — will put U.S. equities to the test in the days ahead.\nWith stocks now in the fourth year of a bull market, concerns around stretched valuations have grown, particularly among companies benefiting from enthusiasm over AI-driven growth.\nRoughly a quarter of the S&P 500 is due to report results this week, with solid U.S. profit growth continuing to underpin optimistic views for equities into 2026.\nInvestors will be watching closely for earnings and capital spending signals from Alphabet and Amazon, two key AI-focused hyperscalers.\nOther major names on the calendar include weight-loss drugmaker Eli Lilly (NYSE:LLY), Advanced Micro Devices (NASDAQ:AMD) and, Walt Disney (NYSE:DIS).\nWhat analysts are saying about U.S. stocks\nMorgan Stanley: \"The sharp reversal last week in the S&P/gold ratio gives an early indication that confidence may be restored. Near-term, further upside may come from falling gold amid tighter liquidity considerations, while longer- term upside is likely driven by productivity gains on the back of a capex cycle. Consistent with this view, markets are rewarding high capex-to-sales firms and improving earnings momentum. Amid these dynamics, we see a rotation from commodity cyclicals back to consumer cyclicals in the near/intermediate term.\"\nEvercore ISI: \"For stocks, the selloff in Parabolic Gold and Silver – after frantic, meme-like trading – is not a material headwind, instead putting to rest fear of building systemic risk and turning focus back to equities. 4 year into the Bull market, stocks “should” be more volatile. But rather than"
            },
            {
                "title": "Stock market today: S&P 500, Nasdaq futures sink as AI doubts swirl, precious metals whipsaw around - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/live/stock-market-today-sp-500-nasdaq-futures-sink-as-ai-doubts-swirl-precious-metals-whipsaw-around-002413077.html",
                "body": "US stock futures slid on Monday after a dramatic sell-off in gold and silver unnerved investors, with tech leading the way lower as AI trade worries swirled and Federal Reserve uncertainty deepened.\nNasdaq 100 futures (NQ=F) dropped 0.7%, while those on the S&P 500 (ES=F) fell about 0.5%. Contracts on the Dow Jones Industrial Average (YM=F), which includes fewer tech names, hovered just below the flat line. All three indexes pared steeper overnight losses that followed a sharp reversal on Wall Street on Friday.\nNasdaq GIDS - Delayed Quote • USD 23,461.82 -223.28 (-0.94%)\nAt close: January 30 at 5:15:59 PM EST\nWall Street is heading into a new month digesting fresh uncertainty around Nvidia (NVDA) and the broader artificial intelligence trade. CEO Jensen Huang played down the chipmaker's pledge to invest $100 billion in OpenAI (OPAI.PVT) after The Wall Street Journal reported the plan was on ice.\nBig Tech has led market moves throughout the start of 2026, with earnings leading companies in oppositional directions. Quarterly reports from Amazon (AMZN), Alphabet (GOOG), and Advanced Micro Devices (AMD) lie ahead on the docket this week.\nStocks are under pressure as precious metals continue a rollercoaster ride that has seen them unwind much of 2026's most rip-roaring rally in recent days. Gold (GC=F) and silver (SI=F) swung back to gains early on Monday after tumbling in Asia hours, on the heels of a Friday wipeout that saw silver post its biggest single-day drop on record.\nOver the weekend, bitcoin (BTC-USD) sank below the $80,000 mark for the first time since April, extending losses after a volatile end to last week. The cryptocurrency was last trading at around $78,000 per token. At the same time, the dollar (DX-Y.NYB) gained against major peers, rising most against currencies sensitive to commodity prices.\nInvestors are also wondering what comes next after President Trump chose Kevin Warsh as his nominee to lead the Federal Reserve. That move is seen as reviving efforts to reduce the Fed's $6.6 trillion balance sheet, even as it opened the door to speculation on the path of interest rates. Most traders are still pricing in two rate cuts by the end of the year.\nThe week ahead brings a wave of corporate earnings, with more than 100 S&P 500 (^GSPC) companies set to report results. Disney (DIS) and Palantir (PLTR) are the highlights on Monday's docket, with high-profile reports from Amazon (AMZN), Alphabet (GOOG), and Advanced Micro Devices (AMD) due this week.\nOn the macro front, January updates on manufacturing activity due later Monday will start to set the stage for Friday's all-important monthly jobs report. Economists expect payrolls to have added 65,000 jobs in January, and the unemployment rate to hold at 4.4%.\nLIVE 10 updates Goldman: US earnings forecasts are looking healthy\nStrategists at Goldman Sachs said on Monday that earnings outlooks from US companies appear strong, easing concerns. Despite what some may say has an underwhelming reporting season so far, US companies have posted good 2026 earnings-per-share forecasts.\nStrategist Ben Snider said that more than half of the earnings released have been above analyst expectations, beating the historical average of 40%.\nSNP - Delayed Quote • USD 6,939.03 -29.98 (-0.43%)\nAt close: January 30 at 4:35:47 PM EST\nBloomberg News reports:\nRead more here.\nGood morning. Here's what's happening today.\nOracle to raise up to $50 billion in 2026 for cloud buildup\nFrom Bloomberg:\nOracle (ORCL) plans to raise $45 billion to $50 billion this year through a combination of debt and equity sales to build additional cloud infrastructure capacity, reflecting the scale of financing needed to feed AI’s growth.\nOracle is raising money to build additional capacity to meet the contracted demand from the company’s largest cloud customers, including Advanced Micro Devices (AMD), Meta Platforms (META), Nvidia (NVDA), OpenAI (OPAI.PVT), TikTok and xAI (XAAI.PVT), the company said in a statement Sund"
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "77.090",
            "open": "6,964.620",
            "close": "6,933.400",
            "high": "6,967.490",
            "low": "6,890.400"
        },
        "market_summary": "### SPX500 Market Briefing\n* **Key Drivers:** *No relevant economic or market data in provided articles.*  \n* **Price Action:** *No SPX500 price movements or catalysts discussed.*  \n* **Technical Outlook:** *No technical levels or patterns mentioned.*  \n---\n**Overall Sentiment:** *Insufficient Information* ⚠️  \n\n**Note:** Provided articles focus on auto industry (Mercedes), true crime (Hunter S. Thompson), and hyper-local retail trends (LA coffee shop) – none directly impact SPX500 fundamentals or technicals.",
        "source_articles": [
            {
                "title": "Mercedes CEO’s Last Shot at Luxury Crown Hinges on Revamped S-Class - Bloomberg",
                "source": "Bloomberg",
                "url": "https://www.bloomberg.com/news/features/2026-02-02/mercedes-benz-s-s-class-sedan-rollout-sees-brand-fighting-to-defend-luxury-crown",
                "body": "To continue, please click the box below to let us know you're not a robot.\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.\nFor inquiries related to this message please contact our support team and provide the reference ID below.\nGet the most important global markets news at your fingertips with a Bloomberg.com subscription.\nSUBSCRIBE NOW"
            },
            {
                "title": "Hunter S. Thompson suicide ruling stands firm after 20-year review by Colorado investigators - Fox News",
                "source": "Fox News",
                "url": "https://www.foxnews.com/us/hunter-s-thompson-suicide-ruling-stands-firm-after-20-year-review-colorado-investigators",
                "body": "The Colorado Bureau of Investigation reaffirmed the 2005 cause of legendary \"Fear and Loathing in Las Vegas\" writer Hunter S. Thompson's death more than 20 years after it was ruled a suicide.\nThe review was initiated in July 2025 after the late gonzo journalist’s widow, Anita Thompson, raised new concerns with Sheriff Michael Buglione about the original investigation into her husband’s death at Owl Farm, the couple’s Woody Creek home. Thompson, 67, died on Feb. 20, 2005, from a self-inflicted gunshot wound.\n\"While we have always believed the original investigation was conducted properly, we recognized the importance of an independent review for the Thompson family,\" Buglione said in a statement. \"CBI’s conclusions reaffirm the original findings and, we hope, provide reassurance and clarity.\"\nTEACHER'S 23-STAB-WOUND DEATH RULED SUICIDE AGAIN DESPITE EXPERT CLAIMS OF HOMICIDE\nAccording to CBI, the review found no new physical evidence, facts or circumstances that would support a conclusion different from the original ruling.\nThe reexamination included a review of Pitkin County Sheriff’s Office records, autopsy findings by forensic pathologist Dr. Dean Havlik, and interviews with Thompson’s widow and family members, as well as original investigators, the Pitkin County coroner, and former sheriff’s officials.\nInvestigators also conducted a scene examination, though much of the original physical evidence and photographs had been destroyed under retention policies.\nCBI also said that a modern trajectory analysis and scene reconstruction conducted in 2025 was consistent with the original investigation, autopsy report and witness observations.\nRory Safir, a criminal defense attorney and forensic scientist, said the decision to conduct an independent review reflected transparency rather than doubt about the original findings.\n\"They had obviously originally ruled it as a suicide and then they re-initiated this review because I believe family members raised concerns which weren’t disclosed to the public,\" Safir told Fox News Digital. \"It doesn’t mean that original investigation was flawed.\"\nSafir said the review appears to have followed standard forensic practice for revisiting high-profile cases decades later.\n\"They would have looked at what would have been the original reports, any of the autopsy materials,\" he said. \"I know they interviewed some of the witnesses that were still around, the original investigators as well as re-examining the scene using the evidence that was available.\"\nSafir also credited updated technology as likely central to the outcome.\n\"I would imagine a big part of their confirming their findings had to do with the bullet trajectory reconstruction and using kind of modern technology to validate the original findings,\" Safir said.\nFOLLOW THE FOX TRUE CRIME TEAM ON X\nCBI did not disclose what specific information from Thompson’s widow prompted the review but said it did not rise to a level requiring the case to be reopened.\nSafir said that threshold is intentionally high.\nSIGN UP TO GET TRUE CRIME NEWSLETTER\n\"What they’re looking for to see if they would reopen a case like this, they would need some kind of new evidence that would materially contradict or undermine what they originally found,\" he said. \"And that didn’t happen here.\"\nSafir said a renewed investigation would require grounded evidence – not internet theories.\n\"As far as what’s out there on the internet, I would say that just a lot of this speculation and internet theories are not evidence,\" he said. \"This is a criminal investigation. It’s going to be grounded in evidence, not in, you know, internet theories.\"\nLIKE WHAT YOU'RE READING? FIND MORE ON THE TRUE CRIME HUB\nThompson killed himself on Feb. 20, 2005, at his home in Woody Creek, Colorado, leaving behind a darkly funny suicide note titled \"Football Season Is Over.\"\n\"No More Games. No More Bombs. No More Walking. No More Fun. No More Swimming. 67. That is 17 years past 50. 17 more than I needed or"
            },
            {
                "title": "L.A.'s buzziest coffee shop is in a gorgeous Angelino Heights home. Is this the start of a bigger trend? - Los Angeles Times",
                "source": "Los Angeles Times",
                "url": "https://www.latimes.com/food/newsletter/2026-01-31/granada-coffee-shop-mehko-angelino-heights-bill-addison",
                "body": "L.A.’s buzziest coffee shop is in a gorgeous Angelino Heights home. Is this the start of a bigger trend?\n- Share via\nIt’s 10:54 a.m. Thursday at Granada coffee shop in Angelino Heights, on one of those 73-degree winter mornings in Los Angeles when the sky glows its sunniest cobalt-blue through bare branches. An 11-person-deep line stretches just past the open door. I’m sitting on an L-shaped couch with sturdy burgundy upholstery, taking in the scene while waiting for a cortado.\nThe room beams casual charm — plants, light woods, abstract prints on the wall to add color, a communal table and a toddler-size rocking chair among a couple Eames-style loungers — and couldn’t hold many more people. Three women, all with babies in their arms, find seats at a second common table in the backyard garden, joining others who’ve disappeared into laptop-headphones concentration mode.\nA guy with a complicated-looking video camera pans the crowd while maneuvering around the furniture. He’s in media, too, and we’re here for the same reason.\nWhat makes this coffee destination unique\nSydney Wayser and her husband, Isaac Watters, opened Granada in early January. They run it out of the ground-floor section of their house. Their business has become the first breakout sensation in central Los Angeles that’s part of the Microenterprise Home Kitchen Operation (MEHKO) program, introduced as a California Health and Safety Code statute in 2019, designed to legally permit enterprising cooks who want to make food to sell from home, or to create a micro-restaurant in their residence.\nThe state mandate left it to individual counties to approve MEHKO operations, which the L.A. County Board of Supervisors passed in May 2024. Applicants began receiving permits in November 2024, after a process that involved steps any local restaurant would go through, including food safety certification, business licensing and inspection via the L.A. County Department of Public Health.\nWatters and Wayser brainstormed the idea for Granada after Watters heard a segment on KCRW, during which L.A. journalist Meghan McCarron was discussing an article about the MEHKO initiative she had written for the New York Times.\nThe couple had in essence already constructed a possibility for such a space, and as individuals they were built for it.\nThey’d designed their house, a tasteful modern cube at the top of a cul-de-sac among the 19th century Victorian and California Craftsman homes of Angelino Heights, for post-pandemic entertaining. They have a 3-year-old daughter. Something like a coffee shop, they thought, would be ideal to operate roughly during the hours she was in preschool Monday through Friday.\nA short menu came together: classic espresso drinks, cold brew, loose leaf tea and the requisite matcha latte, alongside a few pastries (seasonally shifting galettes, both sweet and savory, square biscuits with visible layers and a delicately crumbed ricotta-blood orange cake) from star L.A. baker Sasha Piligian. Ceramicist Amy Louise Johnson crafted beautiful earthen cups.\nI’m guessing neither Watters nor Wayser anticipated quite the instant burst of social-media-driven popularity, but they’re also both musicians. I watched them both navigate customer interactions with unflagging charisma. When a woman complimented the vase of flowers on the kitchen island that serves as an ordering counter, Wayser waved her hand breezily and said, “They’re a week and a half old now and starting to wilt. I haven’t had the time to change them!”\nComing and going, I noticed patrons acting respectfully with regard to neighbors. No one unthinkingly parked in the long, steep driveway that serves multiple properties; the area has plenty of street parking. A fence around Granada dampens the sound. You won’t know the place exists until you pass through the entrance to find a yard full of souls attending what feels like an unusually mellow house party.\nBigger MEHKO implications and possibilities\nIt is thrilling to witn"
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "890.000",
            "open": "53,231.780",
            "close": "53,411.070",
            "high": "53,771.780",
            "low": "52,881.780"
        },
        "market_summary": "### JPN225 Market Briefing  \n* **Key Drivers:** **Weaker yen** boosts exporters; **election optimism** (expected LDP win) signals policy continuity.  \n* **Price Action:** Mixed movement – lifted by yen tailwinds but pressured by **tech/resources sell-off**.  \n* **Technical Outlook:** Volatile near-term amid sector divergence.  \n\n---  \n**Overall Sentiment:** Neutral/Cautiously Positive ⚠️📈  \n\n*Explanation*: Positive sentiment from currency and political stability is offset by sector-specific weakness (tech/resources). Election clarity supports risk appetite, but bond and import inflation risks linger.",
        "source_articles": [
            {
                "title": "Nikkei slides on tech, resources sell-off despite weaker yen - TradingView",
                "source": "TradingView",
                "url": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3YY0EH:0-nikkei-slides-on-tech-resources-sell-off-despite-weaker-yen/",
                "body": "Nikkei slides on tech, resources sell-off despite weaker yen\nRefinitivLess than 1 min read\n© Copyright Thomson Reuters 2026. Click For Restrictions - https://agency.reuters.com/en/copyright.html\nLogin or create a forever free account to read this news"
            },
            {
                "title": "A Weak Yen And Election Optimism Lift Japan’s Nikkei - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/a-weak-yen-and-election-optimism-lift-japans-nikkei",
                "body": "Shares rose as investors priced in political stability and easy fiscal policy, even as that backdrop keeps pressure on the yen and Japanese government bonds.\nabout 10 hours ago • 1 min\nWhat’s going on here?\nJapan’s Nikkei 225 ticked up as the yen weakened and polls pointed to a solid win for the ruling Liberal Democratic Party (LDP) ahead of a Feb. 8 snap election.\nWhat does this mean?\nMarkets tend to like two things: a currency tailwind and fewer political surprises. A weaker yen boosts Japanese exporters by making overseas profits worth more when translated back home. And election optimism signals policy continuity, which investors often interpret as ongoing fiscal support for growth. The flip side is that the same easy-policy vibe can weigh on the yen and Japanese government bonds, since looser conditions can keep real yields low and stoke concerns about larg..\ner deficits.\nWhy should I care?\nFor markets: Stocks can cheer while the yen struggles.\nIf investors expect steady leadership and supportive policy, equities – especially exporters and other yen-sensitive firms – can benefit even as the currency slides. That split matters because it can reshape sector winners and losers, and it can also keep pressure on government bonds if markets demand more compensation for fiscal expansion.\nThe bigger picture: Japan’s playbook is still support growth first.\nJapan has leaned on accommodative policy for decades, and the latest election backdrop reinforces that approach. It can help sustain risk-taking at home, but it also leaves Japan more exposed if global rates stay high – a weak yen raises import costs, and bond investors may push back if deficits look set to widen.\nThis content is free, but you must be logged in to continue reading.\nAlready have an account?"
            },
            {
                "title": "Nikkei slides on tech, resources sell-off despite weaker yen - marketscreener.com",
                "source": "marketscreener.com",
                "url": "https://www.marketscreener.com/news/nikkei-slides-on-tech-resource-sell-off-despite-weaker-yen-ce7e5bdddd88f322",
                "body": "Access Denied\nYou don't have permission to access \"http://www.marketscreener.com/news/nikkei-slides-on-tech-resource-sell-off-despite-weaker-yen-ce7e5bdddd88f322\" on this server.\nReference #18.8cc83017.1770035844.8fd43ac3\nhttps://errors.edgesuite.net/18.8cc83017.1770035844.8fd43ac3"
            }
        ]
    }
]