[
    {
        "asset_name": "Gold",
        "symbol": "EIGHTCAP:XAUUSD",
        "status": "Success",
        "data": {
            "day_range": "66.910",
            "open": "4,491.970",
            "close": "4,532.710",
            "high": "4,549.880",
            "low": "4,482.970"
        },
        "market_summary": "### Gold (XAU/USD) Market Briefing\n\n* **Key Drivers:** Profit-taking and a stronger **US dollar** are driving **gold** prices down from their record highs, despite expectations of **US Federal Reserve interest rate cuts** in 2026 and ongoing **geopolitical tensions**.\n* **Price Action:** Gold eased from its record high near **$4,550**, showing a **2%** decline, with current prices around **$4,445**.\n* **Technical Outlook:** Immediate resistance stands at the **$4,550** high, with support at the December 23 low of **$4,430**. The **Relative Strength Index (RSI)** indicates an overbought condition, suggesting caution for gold's near-term trajectory.\n\n---\n**Overall Sentiment:** Neutral ️",
        "source_articles": [
            {
                "title": "Gold Eases From Record High on Profit Taking; Silver Sets New Peak - Meyka",
                "source": "Meyka",
                "url": "https://meyka.com/blog/gold-eases-from-record-high-on-profit-taking-silver-sets-new-peak/",
                "body": "Gold Eases From Record High on Profit Taking; Silver Sets New Peak\nGold markets have been full of excitement lately. After riding a huge rally and reaching fresh all‑time highs, Gold prices eased back as investors decided to lock in profits. At the same time, silver continued to make waves by setting new peak levels.\nGold Market Update\n- Record High Reached: Gold hit $4,500 per ounce in recent trading. Strong investor demand for safety drove this peak.\n- Profit Taking: Investors sold some holdings after large gains, causing a short-term dip. This is normal after big rallies.\n- Yearly Gain: Gold’s price is up roughly 70% in 2025, reflecting market trends and interest in safe-haven assets.\n- Influencing Factors: Gains are boosted by expectations of U.S. rate cuts in 2026, macroeconomic uncertainty, central bank buying, and a weaker U.S. dollar.\n- Market Outlook: Short-term pullbacks don’t indicate a crash. Gold remains strong as investors continue seeking security amid global uncertainty.\nSilver’s New Peak\n- Record Levels: Silver continues to rise while Gold eased. Prices hit all-time peaks in multiple markets. In India, silver crossed historic price levels per kilogram for the first time.\n- Rally Drivers: The surge is fueled by investment demand and industrial use. Silver is key in tech, renewable energy, EVs, and data centers, fast-growing sectors.\n- Performance vs Gold: In 2025, silver jumped about 138% year-to-date, far outpacing Gold, which rose roughly 74.5%.\n- Market Impact: This strong move reflects tight supply, rising industrial demand, and high investor interest, pushing prices sharply higher.\nKey Factors Driving Recent Moves\n- Safe-Haven Demand: Gold and silver rise during uncertainty, like geopolitics and inflation.\n- Interest Rates: Expected Fed rate cuts in 2026 make Gold more attractive.\n- Dollar Influence: A weaker U.S. dollar boosts Gold prices.\n- Silver Demand: Industrial use in tech and clean energy drives silver prices.\nWhat This Means for Investors\nIf you’re watching the Gold price and silver trends, here’s what to keep in mind:\n- Gold is still strong: Even after easing, prices remain high. The long‑term trend is up unless macro conditions shift suddenly.\n- Silver’s rally shows strength: Industrial demand gives silver extra legs to stand on. But high volatility means big swings are possible.\n- Diversification matters: Precious metals can help stabilize portfolios during uncertain times. Investors often use ETFs, bullion, or mining stocks to gain exposure.\n- Watch the news: Economic data, Fed signals, and geopolitical developments will keep moving these markets. Staying informed is key.\nConclusion\nGold has eased a bit from its record highs due to profit-taking and a firmer dollar. Yet the metal’s broader trend remains strong as investors seek safety and hedge against uncertainty. Meanwhile, silver has marched ahead to new peaks, powered not only by investment demand but by real‑world industrial use. We believe the precious metals story in late 2025 highlights how markets balance fear, opportunity, and utility. Both gold and silver continue to matter for investors, even as they behave differently in the face of global forces. The key is to watch price trends closely and understand what’s driving them, whether it’s profit taking, rate expectations, or demand from industry.\nFAQS\nGold fell slightly due to profit-taking and a stronger U.S. dollar.\nSilver’s surge is driven by industrial demand and tight supply, along with investor interest.\nLower interest rates make Gold more attractive compared to bonds and savings.\nNo, dips are usually temporary; Gold and Silver remain strong amid uncertainty.\nDisclaimer:\nThe content shared by Meyka AI PTY LTD is solely for research and informational purposes. Meyka is not a financial advisory service, and the information provided should not be considered investment or trading advice."
            },
            {
                "title": "Gold gives up record highs on profit-taking - Economies.com",
                "source": "Economies.com",
                "url": "https://www.economies.com/commodities/gold-news/gold-gives-up-record-highs-on-profit-taking-48022",
                "body": "Gold prices fell by nearly 2% in the European market on Monday at the start of the final trading week of 2025, retreating from their all-time highs amid accelerating correction and profit-taking activity, in addition to pressure from the continued recovery of the US dollar in foreign exchange markets.\nThe decline was also driven by reduced safe-haven demand following positive developments in peace talks between Russia and Ukraine, after US President Donald Trump said that both Vladimir Putin and Volodymyr Zelenskyy are showing genuine willingness to reach an agreement to end the war, noting that negotiations have entered their final stages.\nPrice Overview\n• Gold prices today: Gold fell by about 2.0% to $4,445.16, from an opening level of $4,533.42, after recording an intraday high of $4,549.77.\n• At Friday’s settlement, gold prices rose by 1.2%, marking a fresh all-time high at $4,550.04 per ounce.\n• Gold prices gained 4.5% last week, posting a third consecutive weekly increase and the largest weekly gain since last October, supported by hopes that the Federal Reserve will continue cutting interest rates in 2026.\nUS Dollar\nThe US dollar index rose by 0.1% on Monday, extending its gains for a third consecutive session and continuing its recovery from two-and-a-half-month lows, reflecting a broader rebound in the US currency against a basket of major and secondary currencies.\nIn addition to buying from lower levels, the dollar’s recovery ahead of year-end trading has been supported by short-covering activity, as the US currency approaches its largest annual loss since 2017.\nPositive Developments\nFollowing the recent meeting between US President Donald Trump and Ukrainian President Volodymyr Zelenskyy, expectations have risen for tangible progress toward ending the war in Ukraine.\nTrump said after the meeting in Florida that both the Russian and Ukrainian sides “want to reach an agreement,” adding that talks have entered a sensitive and advanced phase.\nHe acknowledged that some outstanding issues still require careful handling, but expressed optimism about the possibility of reaching a settlement in the coming period, boosting market hopes for a geopolitical breakthrough that could support global stability.\nUS Interest Rates\n• According to the CME FedWatch Tool, pricing for the probability of keeping US interest rates unchanged at the January 2026 meeting currently stands at 82%, while the probability of a 25 basis point rate cut is priced at 18%.\n• Investors are currently pricing in two US interest rate cuts over the course of next year, while Federal Reserve projections point to a single 25 basis point cut.\n• To reprice these expectations, investors are closely monitoring upcoming US economic data, in addition to comments from Federal Reserve officials.\nGold Outlook\nTim Waterer, Chief Market Analyst at KCM Trade, said that the $5,000 level appears to be an achievable target for gold next year, provided the next Federal Reserve chair adopts a more dovish approach to monetary policy.\nWaterer added that interest rate cuts, along with continued strong industrial demand and supply constraints, could set the stage for silver to rally toward $100 per ounce in 2026.\nSPDR Fund\nGold holdings at the SPDR Gold Trust, the world’s largest gold-backed exchange-traded fund, rose by about 2.86 metric tons on Friday, bringing total holdings to 1,071.13 metric tons, the highest level since June 22, 2022.\nThe euro retreated in European trading on Monday against a basket of global currencies, extending its losses against the US dollar for a third consecutive session and pulling back from a three-month high. The decline comes amid ongoing correction and profit-taking, alongside a recovery in the US currency ahead of the close of trading for 2025.\nThe downside in the single currency is being limited by fading expectations that the European Central Bank will cut interest rates in February 2026, particularly as economic activity in the euro area has im"
            },
            {
                "title": "As traders secure profits, gold price declines after reaching a near $4,550 peak amid rising dollar - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/as-traders-secure-profits-gold-price-declines-after-reaching-a-near-4550-peak-amid-rising-dollar/",
                "body": "Gold prices declined during the early European session on Monday, following a record high near $4,550. Traders took profits before the holidays, causing a pullback despite a nearly 70% surge in 2025, marking its best performance since 1979.\nThe potential for US Federal Reserve interest rate cuts in 2026 could provide support, as lower rates reduce the opportunity cost of holding gold. Persistent geopolitical tensions may also support gold’s appeal. The US Dollar’s strength applies downward pressure on gold, increasing costs for non-US buyers.\nFinancial Markets Overview\nFinancial markets showed reduced activity ahead of the New Year. The US Pending Home Sales report for November was set to release later on Monday, while US Initial Jobless Claims declined to 214,000, exceeding forecasts.\nThe overbought Relative Strength Index (RSI) indicates caution for gold’s near-term trajectory, despite maintaining strength above key technical levels. Immediate resistance stands at the $4,550 high, with support at the December 23 low of $4,430.\nGold remains a key investment during uncertain times and is a safeguard against inflation. Central banks, notably in China, India, and Turkey, have significantly increased gold reserves, with record purchases in 2022. Gold tends to rise when the US Dollar depreciates, maintaining its inverse relationship with various assets.\nWe are seeing some profit-taking in gold after it touched a record high near $4,550, which is natural given the thin trading volumes heading into the New Year. This slight pullback shouldn’t be mistaken for a major reversal of the trend. The underlying reasons for its incredible 70% surge in 2025 are still firmly in place.\nExpectations for the Federal Reserve to continue cutting interest rates into 2026 remain the primary driver for higher prices. With US inflation data throughout 2025 consistently running above the Fed’s 2% target, the appeal of gold as an inflation hedge is strong. Lower interest rates would also reduce the opportunity cost of holding the non-yielding metal.\nInvestment Strategies and Market Dynamics\nDespite the strong trend, we must acknowledge the overbought signals from technical indicators like the Relative Strength Index (RSI). This suggests the market is extended and could be vulnerable to a near-term correction before pushing higher. A drop towards support levels around $4,430 or even $4,338 would offer a better entry point for new long positions.\nFor those holding long futures positions, buying near-term put options could provide a cost-effective hedge against a sudden holiday-thinned market drop. Conversely, traders anticipating a continuation of the rally after this brief pause could look at buying call options with expirations in late January or February 2026. This allows us to participate in the upside while defining our risk.\nWe also see continued support from persistent geopolitical uncertainty, from the ongoing talks over Ukraine to other global hotspots that keep safe-haven demand elevated. Furthermore, data from the World Gold Council has confirmed that central banks continued their historic buying spree through 2025, absorbing supply and putting a floor under the price. These institutional flows are a powerful force that is unlikely to reverse course quickly."
            }
        ]
    },
    {
        "asset_name": "Spot Brent Crude Oil",
        "symbol": "EIGHTCAP:UKOUSD",
        "status": "Success",
        "data": {
            "day_range": "2.100",
            "open": "62.255",
            "close": "60.788",
            "high": "62.610",
            "low": "60.510"
        },
        "market_summary": "### Spot Brent Crude Oil Market Briefing\n* **Key Drivers:** Renewed tension in the Middle East and geopolitical fears are driving **bullish momentum**, while a potential global oil supply surplus and **Saudi price cuts** are weighing on prices.\n* **Price Action:** Recovered from earlier losses, with **Spot Brent Crude Oil** rising **2%** to **$61.44** a barrel, driven by heightened Middle East tensions and supply disruption risks.\n* **Technical Outlook:** Immediate support is near the recent low of **$59**, with resistance at **$62**, as thin trading volumes and **geopolitical uncertainty** may lead to increased **volatility** in the oil market.\n\n--- \n**Overall Sentiment:** Neutral 📊",
        "source_articles": [
            {
                "title": "Oil prices recover from earlier losses amid renewed tension in Middle East - Upstream Online",
                "source": "Upstream Online",
                "url": "https://www.upstreamonline.com/finance/oil-prices-recover-from-earlier-losses-amid-renewed-tension-in-middle-east/2-1-1921591?zephr_sso_ott=X9A6jo",
                "body": "Oil prices recover from earlier losses amid renewed tension in Middle East\nMarkets fell in previous trading sessions on reported ‘progress’ towards Russia-Ukraine peace deal\nMarkets fell in previous trading sessions on reported ‘progress’ towards Russia-Ukraine peace deal"
            },
            {
                "title": "Oil prices rebound over 2% on geopolitical fears, but global supply glut, Saudi cuts loom - TradingView — Track All Markets",
                "source": "TradingView — Track All Markets",
                "url": "https://www.tradingview.com/news/invezz:79d70e21e094b:0-oil-prices-rebound-over-2-on-geopolitical-fears-but-global-supply-glut-saudi-cuts-loom/",
                "body": "Oil prices rebound over 2% on geopolitical fears, but global supply glut, Saudi cuts loom\nOil prices jumped on Monday on potential disruptions in oil supply from the Middle East.\nAt the time of writing, the price of West Texas Intermediate crude oil was at $58 per barrel, up 2.2%, while Brent was 2% higher at $61.44 a barrel.\nBoth oil benchmarks had fallen more than 2% on Friday.\nGeopolitical tensions fuel a surge\nOil prices rose, driven by heightened Middle East tensions that increase the risk of supply disruptions.\nThis includes Saudi Arabia’s reported airstrikes in Yemen and Iran’s provocative rhetoric, which said that it is in a “full-fledged war” with the US, Europe, and Israel.\n“Energy markets moved higher as geopolitical developments lent support to crude prices, with Brent edging up on renewed Middle East tensions and shifting Ukraine peace talks,” IG analyst Axel Rudolph was quoted as saying in a Reuters report.\nThin trading volumes could pave the way for more volatility in the oil market at the start of next year, added Rudolph.\nAccording to a Sunday report from Bloomberg, President Trump indicated “a lot of progress” in his talks with Zelenskiy.\nHowever, he cautioned that no definitive breakthrough has been achieved on territorial disputes, suggesting a final agreement might still be several weeks away.\nMeanwhile, a meeting with Russia, according to Zelenskyy, can only take place once both President Trump and European leaders have consented to a peace framework put forth by Ukraine.\nSaudi Arabia’s price cuts and supply glut\nAdditionally, Saudi Arabia, the world’s largest oil exporter, is anticipated to reduce the price of its primary Arab Light crude for Asian customers in February.\nThis expected reduction is due to declines observed in the spot market, reflecting plentiful crude supplies, according to a Reuters survey of six Asia-based refining sources.\nThis decline would represent the third consecutive monthly drop, deepening losses from the January premium of 60 cents a barrel, which was already the lowest in five years.\nThe OSP for Arab Extra Light crude oil is anticipated to decrease in February, according to the latest market survey.\nThis decline is projected to be in the range of 10 to 20 cents per barrel.\nMeanwhile, China’s announcement of increased fiscal spending in 2026 suggests a proactive stance to stimulate economic growth, which is generally seen as a positive sign for future oil demand.\nThis comes as the crude oil market faces significant downward pressure. Despite the potential tailwind from Chinese stimulus, crude is currently headed for a more than 20% decline this year—its steepest annual drop since 2020.\nThe primary factor driving this sharp decline is the widespread expectation of a global oil supply surplus in the coming year, overshadowing near-term positive demand signals.\nOn the other hand, US crude oil stockpiles data for the week ending December 19 is highly anticipated by investors.\nA Reuters poll, which was extended, suggests a likely decline in US crude oil inventories for the past week, although both distillate and gasoline inventories are projected to have increased.\nDue to the Christmas holiday, the report’s release was postponed from its typical Wednesday schedule last week."
            },
            {
                "title": "Chengdu Expressway Renews Connected Refined Oil Supply Deal With PetroChina Unit - TipRanks",
                "source": "TipRanks",
                "url": "https://www.tipranks.com/news/company-announcements/chengdu-expressway-renews-connected-refined-oil-supply-deal-with-petrochina-unit",
                "body": "Claim 70% Off TipRanks This Holiday Season\n- Unlock hedge fund-level data and powerful investing tools for smarter, sharper decisions\n- Stay ahead of the market with the latest news and analysis and maximize your portfolio's potential\nChengdu Expressway Co., Ltd. Class H ( (HK:1785) ) just unveiled an update.\nChengdu Expressway Co., Ltd. has announced that its subsidiary Zhongyou Energy has entered into a new three-year refined oil framework agreement with the Chengdu Sales Branch of PetroChina, effective from 1 January 2026 to 31 December 2028, to replace the existing agreement that expires at the end of 2025. Under the deal, Zhongyou Energy may purchase designated types of refined oil from PetroChina’s Chengdu branch, and the arrangement is classified as a continuing connected transaction under Hong Kong listing rules because PetroChina is a substantial shareholder of Zhongyou Energy. The board and independent non-executive directors have endorsed the agreement as being on normal commercial terms and in the interests of the company and its shareholders, meaning it will be subject only to reporting and announcement requirements and will be exempt from the need for a circular, independent financial advice and independent shareholders’ approval. The renewed framework provides continuity in fuel supply and regulatory clarity for Chengdu Expressway’s operations, while formalizing ongoing cooperation with PetroChina at the subsidiary level.\nThe most recent analyst rating on (HK:1785) stock is a Buy with a HK$2.50 price target. To see the full list of analyst forecasts on Chengdu Expressway Co., Ltd. Class H stock, see the HK:1785 Stock Forecast page.\nMore about Chengdu Expressway Co., Ltd. Class H\nChengdu Expressway Co., Ltd. is a PRC-incorporated joint stock company whose core business is the investment, operation and management of expressways and related infrastructure in and around Chengdu, leveraging stable toll-road revenue and associated services. Through its material subsidiary Zhongyou Energy, in which PetroChina holds a 49% stake, the group is also involved in the procurement and supply of refined oil products to support its operational needs and related commercial activities.\nAverage Trading Volume: 1,348,000\nTechnical Sentiment Signal: Buy\nCurrent Market Cap: HK$3.44B\nFor an in-depth examination of 1785 stock, go to TipRanks’ Overview page."
            }
        ]
    },
    {
        "asset_name": "Spot WTI Crude Oil",
        "symbol": "EIGHTCAP:USOUSD",
        "status": "Success",
        "data": {
            "day_range": "2.220",
            "open": "58.491",
            "close": "56.996",
            "high": "58.946",
            "low": "56.726"
        },
        "market_summary": "### Spot WTI Crude Oil Market Briefing\n* **Key Drivers:** Geopolitical tensions in the Middle East, particularly between Saudi Arabia and Iran, are driving **volatility** in oil prices, while a global **supply glut** and **Saudi price cuts** are expected to exert downward pressure.\n* **Price Action:** Spot WTI Crude Oil prices have rebounded over **2%** to **$58** per barrel, driven by potential disruptions in oil supply from the Middle East, after falling more than **2%** on Friday.\n* **Technical Outlook:** Immediate support is near the **$55** per barrel level, with resistance at **$60** per barrel, as the market is expected to remain **range-bound** due to **persistent oversupply** and **weakening demand signals**.\n\n--- \n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "What's happening further down the Vaca Muerta shale oil production table? - BNamericas",
                "source": "BNamericas",
                "url": "https://www.bnamericas.com/en/analysis/whats-happening-further-down-the-vaca-muerta-shale-oil-production-table",
                "body": "What's happening further down the Vaca Muerta shale oil production table?\nArgentina's Vaca Muerta shale play is typically associated with established oil heavyweights like YPF and Vista Energy – but smaller firms are looking to either gain a production toehold or grow their presence.\nYPF and Vista, along with five others, Pan American Energy (PAE), Pluspetrol, Shell, Tecpetrol and Chevron, account for around 90% of unconventional oil production, chiefly in Neuquén province.\nAround 10 others are working to tap Vaca Muerta resources, not just in Neuquén but also in Río Negro and Mendoza province, each sitting over a sliver of the formation.\nCompared with the billions of dollars of capex assigned by the big players, the smaller firms are typically planning smaller outlay, for exploration and development.\nA chief attraction of Vaca Muerta is the relatively low lifting costs achievable. In the conventional hydrocarbons segment, costs are typically higher and assets mature.\nMidstream infrastructure is also being built and the government has indicated that Rigi investment incentive regime benefits could be extended to include upstream hydrocarbons.\nUnconventional oil production in October registered at around 571,330b/d, according to data from local oil and gas institute IAPG.\nThe global oil price outlook for 2026 is not favorable for producers and could potentially impact investment decisions. US government energy data platform the US Energy Information Administration expects Brent to average US$55/b next year, down from an expected US$69/b in 2025.\nProducers will also be looking at long-term global demand trends amid the energy transition.\nGeoPark\nFor next year, Colombia-based GeoPark aims to deploy US$80mn-100mn at new acquired acreage Loma Jarillosa Este and Puesto Silva Oeste in Neuquén province, the company says in a work program.\nWork includes bringing a five-well pad into production, upgrading facilities and advancing permitting work for Puesto Silva Oeste.\nCompany output in Argentina is forecast to reach 20,000boe/d by end-2028, up from around 1,100boe/d.\nTanGo Energy\nPartly owned by Vista Energy, TanGo Energy has joined forces with PAE to invest US$36mn in the Loma Guadalosa area, in Río Negro province.\nThis falls under a provincial push to tap its sliver of the Vaca Muerta formation.\nFormerly Petrolera Aconcagua Energía, TanGo also holds rights to Mendoza province acreage Payún Oeste, seen holding unconventional and conventional potential. Outlay of US$8mn over 10 years is expected, local press reported.\nPampa Energía\nTraditionally gas-focused, Pampa Energía is investing to build a Vaca Muerta oil footprint, via acreage Rincón de Aranda in Neuquén province. The company has said it planned to spend US$750mn at the project in 2026, to reach a production plateau of 45,000b/d in 1Q27.\nKilwer (Phoenix Global Resources)\nThe flagship Vaca Muerta asset of Kilwer – a unit of British company Phoenix Global Resources – is Mata Mora Norte in Neuquén province.\nIn Neuquén, company output is around 13,000b/d and a treatment plant is being built.\nIn neighboring Río Negro, Phoenix was granted rights to Confluencia Norte and Confluencia Sur. Phoenix – which currently accounts for 30% of the province’s output – has brought four wells into production in the Confluencia Sur area, pumping around 5,000b/d. Including production from Confluencia Norte, the company’s total output in the jurisdiction is about 7,000b/d. Rights to the acreage were awarded in 2023. Overall outlay of around US$90mn is expected.\nLast half, Phoenix said Vaca Muerta investment would reach around US$2bn over the next five years.\nThe company goal is hitting a production plateau of 50,000-70,000b/d in 2026-27.\nCapex\nAnother Argentine minnow, Capex was awarded the rights to explore Río Negro acreage Cinco Saltos Norte.\nAssociated investment in US$6.85mn.\nWork includes reprocessing 200km2 of 3D seismic. Capex must form a consortium with provincial hydrocarbons firm Edhipsa.\nIf "
            },
            {
                "title": "Oil Stuck in Tug of War - Rigzone",
                "source": "Rigzone",
                "url": "https://www.rigzone.com/news/oil_stuck_in_tug_of_war-29-dec-2025-182632-article/",
                "body": "Oil Stuck in Tug of War\nOil is stuck in a tug of war, Naeem Aslam, Chief Market Analyst at Zaye Capital Markets, said in a comment sent to Rigzone on Monday.\n“Geopolitics are adding short term volatility and keeping prices supported, but persistent oversupply, rising inventories, and weakening demand signals are capping any real upside,” Aslam said in the statement.\n“Unless there’s a major supply shock, crude is likely to stay range bound around the low $60s rather than break higher,” Aslam added.\nA BofA Global Research report sent to Rigzone on December 18 noted that Brent broke below $60 per barrel that week “on news that China crude oil inventories continued to balloon during the past week, even though much of the oil is likely set to go into strategic storage”.\n“The reality is that crude oil prices have been falling since OPEC+ announced a return of idle production in June 2024, as incremental volumes have exacerbated an already-sluggish market environment for crude oil,” the BofA report stated.\n“While near dated crude oil prices have come down significantly, long dated prices have only fallen by a few dollars,” it added.\nThat report went on to state that “a global projected surplus of two million barrels per day means that crude oil prices should average substantially less in 2026 than they did in 2025”.\n“Heading into next year, we remain only somewhat bearish on prices despite the large projected surplus, as we do not believe it is in OPEC’s self-interest to drive Brent below $50 per barrel,” the report noted.\nThe report went on to project that the Brent price will average about $60 per barrel next year “compared to almost $69 per barrel this year”.\nIn a statement sent to Rigzone by the Enverus team on December 16, Enverus subsidiary Enverus Intelligence Research (EIR) projected that the Brent price will average $55 per barrel in 2026. According to the statement, EIR sees the Brent price rising from an average of $50 per barrel in the first half of next year to an average of $60 in the second half.\n“EIR projects oil prices will weaken in 2026, with Brent crude expected to average $55 per barrel,” EIR noted in that statement.\n“Near term oil price pressure reflects global inventory levels approaching highs last seen during the pandemic and the shale price war,” it added.\nEIR outlined in the statement that it “adopts a bullish stance” beyond 2026.\n“OPEC-12 liquids output is near historic highs and could tap untested spare capacity in coming years, while long term oil demand projections have strengthened,” EIR said in the statement.\n“At the same time, global oil and gas supply projects are declining due to underinvestment - setting the stage for tighter balances and higher prices later in the decade,” it added.\nIn the statement, EIR Director Al Salazar said, “our analysis shows that while short term pressures will weigh on oil and gas prices, both markets become supply short post 2026”.\n“This should pave the way for renewed bullish momentum through the rest of the decade,” he added.\nA report sent to Rigzone by the Macquarie team on December 5 showed that Macquarie was projecting that the Brent price will average $68.21 per barrel overall in 2025 and $60.75 per barrel overall in 2026.\nAccording to its December short term energy outlook (STEO), which was released on December 9, the U.S. Energy Information Administration (EIA) sees the Brent spot price averaging $68.91 per barrel this year and $55.08 per barrel next year. In its previous STEO, which was released in November, the EIA projected that the Brent spot price would average $68.76 per barrel in 2025 and $54.92 per barrel in 2026.\nTo contact the author, email andreas.exarheas@rigzone.com\nWhat do you think? We’d love to hear from you, join the conversation on the\nRigzone Energy Network.\nThe Rigzone Energy Network is a new social experience created for you and all energy professionals to Speak Up about our industry, share knowledge, connect with peers and industry insiders"
            },
            {
                "title": "Oil prices rebound over 2% on geopolitical fears, but global supply glut, Saudi cuts loom - TradingView — Track All Markets",
                "source": "TradingView — Track All Markets",
                "url": "https://www.tradingview.com/news/invezz:79d70e21e094b:0-oil-prices-rebound-over-2-on-geopolitical-fears-but-global-supply-glut-saudi-cuts-loom/",
                "body": "Oil prices rebound over 2% on geopolitical fears, but global supply glut, Saudi cuts loom\nOil prices jumped on Monday on potential disruptions in oil supply from the Middle East.\nAt the time of writing, the price of West Texas Intermediate crude oil was at $58 per barrel, up 2.2%, while Brent was 2% higher at $61.44 a barrel.\nBoth oil benchmarks had fallen more than 2% on Friday.\nGeopolitical tensions fuel a surge\nOil prices rose, driven by heightened Middle East tensions that increase the risk of supply disruptions.\nThis includes Saudi Arabia’s reported airstrikes in Yemen and Iran’s provocative rhetoric, which said that it is in a “full-fledged war” with the US, Europe, and Israel.\n“Energy markets moved higher as geopolitical developments lent support to crude prices, with Brent edging up on renewed Middle East tensions and shifting Ukraine peace talks,” IG analyst Axel Rudolph was quoted as saying in a Reuters report.\nThin trading volumes could pave the way for more volatility in the oil market at the start of next year, added Rudolph.\nAccording to a Sunday report from Bloomberg, President Trump indicated “a lot of progress” in his talks with Zelenskiy.\nHowever, he cautioned that no definitive breakthrough has been achieved on territorial disputes, suggesting a final agreement might still be several weeks away.\nMeanwhile, a meeting with Russia, according to Zelenskyy, can only take place once both President Trump and European leaders have consented to a peace framework put forth by Ukraine.\nSaudi Arabia’s price cuts and supply glut\nAdditionally, Saudi Arabia, the world’s largest oil exporter, is anticipated to reduce the price of its primary Arab Light crude for Asian customers in February.\nThis expected reduction is due to declines observed in the spot market, reflecting plentiful crude supplies, according to a Reuters survey of six Asia-based refining sources.\nThis decline would represent the third consecutive monthly drop, deepening losses from the January premium of 60 cents a barrel, which was already the lowest in five years.\nThe OSP for Arab Extra Light crude oil is anticipated to decrease in February, according to the latest market survey.\nThis decline is projected to be in the range of 10 to 20 cents per barrel.\nMeanwhile, China’s announcement of increased fiscal spending in 2026 suggests a proactive stance to stimulate economic growth, which is generally seen as a positive sign for future oil demand.\nThis comes as the crude oil market faces significant downward pressure. Despite the potential tailwind from Chinese stimulus, crude is currently headed for a more than 20% decline this year—its steepest annual drop since 2020.\nThe primary factor driving this sharp decline is the widespread expectation of a global oil supply surplus in the coming year, overshadowing near-term positive demand signals.\nOn the other hand, US crude oil stockpiles data for the week ending December 19 is highly anticipated by investors.\nA Reuters poll, which was extended, suggests a likely decline in US crude oil inventories for the past week, although both distillate and gasoline inventories are projected to have increased.\nDue to the Christmas holiday, the report’s release was postponed from its typical Wednesday schedule last week."
            }
        ]
    },
    {
        "asset_name": "EUR/USD",
        "symbol": "EIGHTCAP:EURUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0035",
            "open": "1.1791",
            "close": "1.1769",
            "high": "1.1796",
            "low": "1.1761"
        },
        "market_summary": "### EUR/USD Market Briefing\n\n* **Key Drivers:** The **EUR/USD** exchange rate is influenced by expectations of **interest rate cuts** by the Federal Reserve in 2026, potentially exceeding expectations, and the European Central Bank maintaining its current monetary policy.\n* **Price Action:** The pair is currently trading near **1.1760**, with **support levels** at **1.1745**, **1.1680**, and **1.1600**, and **resistance levels** at **1.1830**, **1.1880**, and **1.1930**.\n* **Technical Outlook:** The **20-period Simple Moving Average (SMA)** provides dynamic resistance near **1.1780**, while the **100- and 200-period SMAs** indicate a positive medium-term tone, with the **Momentum indicator** signaling waning buying interest.\n\n---\n**Overall Sentiment:** **Bullish**",
        "source_articles": [
            {
                "title": "EUR/USD Analysis 29/12: Interest Rate Outlook (Chart) - DailyForex",
                "source": "DailyForex",
                "url": "https://www.dailyforex.com/forex-technical-analysis/2025/12/eurusd-analysis-29-december-2025/239092",
                "body": "EUR/USD Analysis Summary Today\n- Overall Trend: Bullish\n- Support Levels for EUR/USD Today: 1.1745 – 1.1680 – 1.1600.\n- Resistance Levels for EUR/USD Today: : 1.1830 – 1.1880 – 1.1930.\nEUR/USD Trading Signals:\n- Buy EUR/USD from the support level of 1.1690 with a target of 1.1820 and a stop-loss at 1.1600.\n- Sell EUR/USD from the resistance level of 1.1830 with a target of 1.1500 and a stop-loss at 1.1900.\nTechnical Analysis of EUR/USD Today:\nThe Euro is stabilizing against the US Dollar (EUR/USD) near the 1.1800 resistance as the final trading days of 2025 begin. This sets the stage for a strong performance heading into 2026. According to top-tier trading platforms, Euro trading has remained positive, fueled by market expectations regarding the future policies of the US Federal Reserve compared to those of the European Central Bank (ECB).\nAmidst quiet holiday trading between Christmas and the New Year, the exchange rate settled near 1.1772. The US Dollar remains under pressure despite strong US growth data. Recently, financial markets have shifted their focus toward Federal Reserve policy outlooks and concerns over central bank independence, rather than short-term economic activity indicators.\nWith long positions on the euro increasing, the potential for further gains may depend on the emergence of new catalysts in early January.\nWill the Euro's gains continue in the coming days?\nTop Regulated Brokers\nAccording to forex market trading, the euro (EUR) remained stable in global markets last week, while the dollar remained under pressure despite better-than-expected US GDP data. Consequently, the EUR/USD exchange rate reached its highest level in three months, approaching 1.1810, before settling slightly below 1.18.\nRegarding factors influencing currency prices, any developments related to the incoming Federal Reserve Chair and other US central bank officials will be closely monitored. Looking ahead, MUFG Bank anticipates further limited net losses for the dollar in 2026 due to interest rate changes. They stated, \"We expect the European Central Bank to maintain its current monetary policy throughout 2026, justifying the EUR/USD exchange rate's rise in short-term yield movements, given that the Federal Reserve is poised to cut interest rates at least three times, exceeding expectations.\"\nAfter an initial stabilization, the bank expects the EUR/USD exchange rate to reach 1.24 by the end of 2026.\nTrading Advice:\nTraders advise caution when trading during periods of low market liquidity, a natural reaction to holidays in many financial markets.\n2026 Trading Outlook:\nAccording to currency trading experts, the US dollar is likely to remain vulnerable to volatility in global markets until the start of the new year. However, the latest Commitments of Traders (COT) data from the Commodity Futures Trading Commission (CFTC) shows an increase in non-commercial long positions in the euro to nearly 145,000 contracts from 138,000 contracts previously, its highest level in two years. This concentration will increase the risk of a euro correction early next year. Very strong resistance is also likely for the EUR/USD pair on any move towards the psychological resistance level of 1.20.\nOn the Economic Front, US GDP data for the third quarter showed annualized growth of 4.3%, compared to 3.8% previously, exceeding analysts' expectations of 3.3%. Consequently, financial markets are currently trading at a probability of less than 15% for another US interest rate cut by the Federal Reserve in January, with two further cuts expected in 2026.\nReady to trade our daily Forex analysis? We’ve made this forex brokers list for you to check out."
            },
            {
                "title": "EUR/USD Price Forecast: Consolidating in holiday’s trading - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/analysis/eur-usd-price-forecast-consolidating-in-holidays-trading-202512291316",
                "body": "EUR/USD Price Forecast: Consolidating in holiday’s trading\nEUR/USD Current price: 1.1760\n- Diminished volumes due to the New Year’s holiday maintain major pairs within limited ranges.\n- The FOMC will release the Minutes of the December meeting next Wednesday.\n- EUR/USD turns bearish in the near term, but the odds of a steeper decline are limited.\nThe EUR/USD pair hovers around 1.1760 early in the American session on Monday, unchanged on a daily basis. The US Dollar (USD) started the week with a soft tone. Still, the pair was unable to advance beyond the 1.1800 mark, as holiday diminished volumes contain major pairs within limited intraday ranges.\nFinancial markets have little to focus on this week, as the macroeconomic calendar won’t offer any relevant data. However, the Federal Open Market Committee (FOMC) will release the Minutes of the December meeting next Wednesday. The document usually sheds light on policymakers’ thinking during the rate-decision meeting. Given the limited trading volumes, the news can trigger a reaction in USD.\nThe EU did not publish relevant data earlier in the day, while the United States (US) will soon release November Pending Home Sales and the Dallas Fed Manufacturing Business Index for December.\nEUR/USD short-term technical outlook\nFrom a technical point of view, the EUR/USD pair is bearish in the 4-hour chart. The EUR/USD trades at 1.1761, below the day's opening by 16 pips and little changed on a daily basis. In the same chart, the 20-period Simple Moving Average (SMA) has flattened near 1.1780, providing dynamic resistance. At the same time, the pair remains above rising 100- and 200-period SMAs, preserving a positive medium-term tone. Meanwhile, the Momentum indicator edges lower below its midline, signaling waning buying interest. The Relative Strength Index (RSI) indicator stands at 45 and inches down, aligning with the increased downward bias. A decisive push above the 20 SMA would revive upside traction, whereas a break beneath the 100 SMA would open the door for a deeper retracement toward the longer baseline.\nIn the daily chart, EUR/USD trades above all its moving averages, with the 20-day SMA rising above the 100- and 200-day SMAs, with all three sloping higher, reinforcing a bullish bias. The 20-day SMA at 1.1716 offers nearby dynamic support. Finally, the Momentum indicator remains above its midline, though it has eased modestly, signaling steady buying interest while the RSI indicator stands at 62, easing from its recent highs.\n(The technical analysis of this story was written with the help of an AI tool)\nPremium\nYou have reached your limit of 3 free articles for this month.\nStart your subscription and get access to all our original articles.\nAuthor\nValeria Bednarik\nFXStreet\nValeria Bednarik was born and lives in Buenos Aires, Argentina. Her passion for math and numbers pushed her into studying economics in her younger years."
            },
            {
                "title": "US Dollar Price Forecast: Steady Near 98 as Fed Rate Cuts Loom – GBP/USD and EUR/USD - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/us-dollar-price-forecast-steady-near-98-as-fed-rate-cuts-loom-gbp-usd-and-eur-usd-1570045",
                "body": "Early on Monday in Europe, the US Dollar Index (DXY), which tracks the US dollar against six major global currencies, was holding steady at 98.00. Given thin trading volumes, plenty of people are off work for the New Year holiday, so there’s less money sloshing around to cause significant price swings.\nThe Federal Reserve (Fed) chopped the federal funds rate by 25 basis points at its December meeting, knocking the target range down to 3.50%-3.75%. That’s right – this is the 3rd cut the Fed has made in 2025 – a total of 75 bps.\nNow that the Fed has delivered these cuts, markets are looking at the possibility of more, at least two more in 2026. The CME FedWatch tool currently suggests there’s an 18.3% chance the Fed will reduce rates at its next policy meeting in January.\nAfter last week’s comments from Donald Trump about wanting the next Fed Chair to ease off on interest rates a bit if the markets do well, some folks are getting a bit worried about the Fed’s independence. This could put extra downward pressure on the dollar.\nAll the same, geopolitical risk is pushing investors towards safe havens – and that’s good news for the US dollar. On Sunday, Trump was talking about how he’d made a lot of progress with Ukraine’s Volodymyr Zelenskiy on a possible peace deal – but he also said it might still be a few weeks before the deal’s actually done. At the same time, all these geopolitical uncertainties are giving investors the jitters – and that means they’re reaching for safe havens.\nSo, even though the Fed is looking to cut interest rates, the DXY is still holding firm – for now, at least. Traders are keeping a close eye on the Pending Home Sales report that’s due out later today, as well as any more comments from Federal Reserve officials.\nThe US Dollar Index (DXY) is hovering around 98.02 after a bit of a bounce last week from that 97.73-97.80 support level. On the 2-hour chart, the price is still holding within a short-term rising channel, suggesting it has some momentum but isn’t quite ready to shake off that downtrend just yet. The 50-day EMA at 98.12 is acting as a ceiling, while the 100-day EMA at 98.55-98.60 is a much stronger resistance level above.\nLooking at Fibonacci levels from that recent downward move, we can see the price struggling to get above that 38.2% retracement at 98.12, which is keeping any upside pretty firmly in check. If we can finally break above 98.25, then 98.55 looks like it might be in play – but if we fail to make that break, then 97.75 is looking like it’s next port of call.\nThe GBP/USD pair is hovering around $1.3490 at the moment, trading in a tight range within a clear rising channel on a 2-hour chart. The bigger picture remains bullish, with the price staying above the channel midpoint and key moving averages.\nPrice is also holding up well above the 50-day EMA at $1.3470, which is currently acting as short-term support, and the 100-day EMA at $1.3340 is the foundation of the medium-term trend.\nThe immediate support is sitting around $1.3470-$1.3450, then comes the slightly stronger support just below $1.3410. On the other hand, there’s resistance capping things at $1.3535, and the upper channel boundary is not far off at $1.3600.\nThe EUR/USD pair is still trading around $1.1780, though it’s now stuck in a neat little rising channel on the 2-hour chart. Price action remains bullish, with buyers still strongly defending the lower channel boundary at $1.1750, which is short-term horizontal support.\nThe 50-day EMA comes in around $1.1765 and is acting as a real line of defence, while the 100-day EMA at $1.1705 is also adding to the overall bullish picture.\nOn the upside, there’s some resistance around $1.1805, and then that upper channel limit comes in at $1.1850. As long as EUR/USD can stay above $1.1750, we’re looking good for an upward trend – with dips naturally attracting buyers.\nArslan is a finance MBA and also holds an MPhil degree in behavioral finance. An expert in financial analysis and i"
            }
        ]
    },
    {
        "asset_name": "GBP/USD",
        "symbol": "EIGHTCAP:GBPUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0043",
            "open": "1.3481",
            "close": "1.3504",
            "high": "1.3512",
            "low": "1.3469"
        },
        "market_summary": "### GBP/USD Market Briefing\n\n* **Key Drivers:** The **Bank of England's** guidance on a gradual downward monetary policy and the **US Federal Reserve's** potential rate cuts in 2026 are influencing the pair, with the **US Dollar** experiencing renewed demand.\n* **Price Action:** The GBP/USD pair is trading around **$1.3490**, having softened below **$1.3500** but retaining a positive technical outlook, with the price holding above the **100-day EMA** at **$1.3340**.\n* **Technical Outlook:** Immediate support is near **$1.3393**, with resistance at **$1.3547**, and the pair remains in a **bullish channel** on the 2-hour chart, suggesting **bullish momentum** with potential for extension if the pair closes above the upper band.\n\n---\n**Overall Sentiment:** Neutral",
        "source_articles": [
            {
                "title": "The GBP/USD pair experiences a downturn below 1.3500, yet maintains a favourable technical perspective - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/the-gbp-usd-pair-experiences-a-downturn-below-1-3500-yet-maintains-a-favourable-technical-perspective/",
                "body": "The GBP/USD pair sees a decline to approximately 1.3485 during the early European session on Monday, with increased demand for the US Dollar. Despite this weakening, the Bank of England’s guidance on a gradual downward monetary policy could limit further downside risks for the pair.\nThe BoE cut its benchmark interest rate by a quarter point to 3.75% in December, marking the first reduction since last August. Governor Andrew Bailey mentioned that while rates may continue to fall, the extent of additional cuts will require careful consideration. Meanwhile, the US Federal Reserve may make two rate cuts in 2026 due to a cooling labour market, with financial markets forecasting an 18.3% chance of a rate reduction by January.\nTechnical Analysis of GBP/USD\nOn the technical front, GBP/USD holds at 1.3486 with support from the 100-day EMA, suggesting a medium-term upward trend. Initial support is at 1.3393, while the first resistance is at 1.3547. Bollinger Bands indicate persistent bullish pressure, with potential for extension if the pair closes above the upper band.\nThe Pound Sterling is the oldest currency, issued by the Bank of England, and accounts for 12% of global foreign exchange transactions. Economic data and trade balance figures, alongside BoE’s monetary policy, are key influences on its value.\nAs we look at the GBP/USD pair trading around 1.3485, its position above the 100-day moving average keeps the medium-term outlook positive. However, we see the Bank of England has already begun its easing cycle, having cut rates to 3.75% at its December 2025 meeting. This move was widely expected after the latest data from November 2025 showed UK inflation had fallen to 2.4%, bringing it much closer to the Bank’s 2% target.\nThe BoE’s dovish stance is further justified by an economy that has shown clear signs of stalling. We saw that UK GDP growth for the third quarter of 2025 was nearly flat at just 0.1%, and the most recent retail sales figures for November disappointed with a 0.5% month-over-month decline. This weak economic backdrop suggests that further rate cuts are likely in 2026, which could limit the Pound’s potential upside.\nOutlook for the US Dollar\nOn the other side of the trade, the US Dollar is feeling pressure from expectations of future Federal Reserve rate cuts, even though they have not started yet. The November 2025 jobs report indicated a cooling labor market, with a lower-than-expected 140,000 jobs added and the unemployment rate ticking up to 4.1%. This, combined with the Fed’s preferred inflation gauge falling to 2.6%, has solidified market bets for at least two rate cuts during 2026.\nFor derivative traders, the critical factor in the coming weeks will be the relative pace of easing between the BoE and the Fed. Since the BoE has already made the first move, any surprisingly weak US economic data could accelerate expectations for Fed cuts and push the pair toward the 1.3547 resistance level. We believe using options to play rising volatility heading into the January 2026 central bank meetings could be a prudent strategy to manage this uncertainty.\nIn the near term, the pair remains in a bullish channel, with the technicals suggesting dips could be shallow. We would view a pullback towards the 1.3393 support level as a potential buying opportunity, especially if upcoming US data confirms a softening economy. This is a starkly different environment from the aggressive rate-hiking cycle we traded through back in 2022 and 2023, where monetary policy provided a clear tailwind for the dollar."
            },
            {
                "title": "US Dollar Price Forecast: Steady Near 98 as Fed Rate Cuts Loom – GBP/USD and EUR/USD - FXEmpire",
                "source": "FXEmpire",
                "url": "https://www.fxempire.com/forecasts/article/us-dollar-price-forecast-steady-near-98-as-fed-rate-cuts-loom-gbp-usd-and-eur-usd-1570045",
                "body": "Early on Monday in Europe, the US Dollar Index (DXY), which tracks the US dollar against six major global currencies, was holding steady at 98.00. Given thin trading volumes, plenty of people are off work for the New Year holiday, so there’s less money sloshing around to cause significant price swings.\nThe Federal Reserve (Fed) chopped the federal funds rate by 25 basis points at its December meeting, knocking the target range down to 3.50%-3.75%. That’s right – this is the 3rd cut the Fed has made in 2025 – a total of 75 bps.\nNow that the Fed has delivered these cuts, markets are looking at the possibility of more, at least two more in 2026. The CME FedWatch tool currently suggests there’s an 18.3% chance the Fed will reduce rates at its next policy meeting in January.\nAfter last week’s comments from Donald Trump about wanting the next Fed Chair to ease off on interest rates a bit if the markets do well, some folks are getting a bit worried about the Fed’s independence. This could put extra downward pressure on the dollar.\nAll the same, geopolitical risk is pushing investors towards safe havens – and that’s good news for the US dollar. On Sunday, Trump was talking about how he’d made a lot of progress with Ukraine’s Volodymyr Zelenskiy on a possible peace deal – but he also said it might still be a few weeks before the deal’s actually done. At the same time, all these geopolitical uncertainties are giving investors the jitters – and that means they’re reaching for safe havens.\nSo, even though the Fed is looking to cut interest rates, the DXY is still holding firm – for now, at least. Traders are keeping a close eye on the Pending Home Sales report that’s due out later today, as well as any more comments from Federal Reserve officials.\nThe US Dollar Index (DXY) is hovering around 98.02 after a bit of a bounce last week from that 97.73-97.80 support level. On the 2-hour chart, the price is still holding within a short-term rising channel, suggesting it has some momentum but isn’t quite ready to shake off that downtrend just yet. The 50-day EMA at 98.12 is acting as a ceiling, while the 100-day EMA at 98.55-98.60 is a much stronger resistance level above.\nLooking at Fibonacci levels from that recent downward move, we can see the price struggling to get above that 38.2% retracement at 98.12, which is keeping any upside pretty firmly in check. If we can finally break above 98.25, then 98.55 looks like it might be in play – but if we fail to make that break, then 97.75 is looking like it’s next port of call.\nThe GBP/USD pair is hovering around $1.3490 at the moment, trading in a tight range within a clear rising channel on a 2-hour chart. The bigger picture remains bullish, with the price staying above the channel midpoint and key moving averages.\nPrice is also holding up well above the 50-day EMA at $1.3470, which is currently acting as short-term support, and the 100-day EMA at $1.3340 is the foundation of the medium-term trend.\nThe immediate support is sitting around $1.3470-$1.3450, then comes the slightly stronger support just below $1.3410. On the other hand, there’s resistance capping things at $1.3535, and the upper channel boundary is not far off at $1.3600.\nThe EUR/USD pair is still trading around $1.1780, though it’s now stuck in a neat little rising channel on the 2-hour chart. Price action remains bullish, with buyers still strongly defending the lower channel boundary at $1.1750, which is short-term horizontal support.\nThe 50-day EMA comes in around $1.1765 and is acting as a real line of defence, while the 100-day EMA at $1.1705 is also adding to the overall bullish picture.\nOn the upside, there’s some resistance around $1.1805, and then that upper channel limit comes in at $1.1850. As long as EUR/USD can stay above $1.1750, we’re looking good for an upward trend – with dips naturally attracting buyers.\nArslan is a finance MBA and also holds an MPhil degree in behavioral finance. An expert in financial analysis and i"
            },
            {
                "title": "Pound Sterling Price News and Forecast: GBP/USD loses momentum, pressured by renewed US Dollar demand - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/pound-sterling-price-news-and-forecast-gbp-usd-loses-momentum-pressured-by-renewed-us-dollar-demand-202512290559",
                "body": "Pound Sterling Price News and Forecast: GBP/USD loses momentum, pressured by renewed US Dollar demand\nGBP/USD Price Forecast: Softens below 1.3500 but retains positive technical outlook\nThe GBP/USD pair loses momentum near 1.3485 during the early European session on Monday, pressured by renewed US Dollar (USD) demand. The potential downside for a major pair might be limited, as the Bank of England (BoE) guided that monetary policy will remain on a gradual downward path.\nThe BoE’s Monetary Policy Committee decided to cut a quarter point in its benchmark interest rate to 3.75% at its December meeting, the first cut since last August. Governor Andrew Bailey said during the press conference that rates are likely to continue on a gradual downward path, but \"how much further we go becomes a closer call\" with each cut. Read more...\nGBP/USD edges higher above 1.3500, eyes Fed rate cut outlook\nGBP/USD gains after a gap-down open, trading around 1.3510 during the Asian hours on Monday. The pair gains ground as the US Dollar (USD) faces challenges, which could be attributed to growing expectations of two more rate cuts by the Federal Reserve (Fed) in 2026.\nTraders are likely to focus on the Federal Open Market Committee (FOMC) December Meeting Minutes due on Tuesday, which may shed light on internal policy debates shaping the Fed’s outlook for 2026. Read more...\nAuthor\nFXStreet Team\nFXStreet"
            }
        ]
    },
    {
        "asset_name": "AUD/USD",
        "symbol": "EIGHTCAP:AUDUSD",
        "status": "Success",
        "data": {
            "day_range": "0.0028",
            "open": "0.6717",
            "close": "0.6708",
            "high": "0.6724",
            "low": "0.6697"
        },
        "market_summary": "### AUD/USD Market Briefing\n\n* **Key Drivers:** Growing expectations of **hawkish** Reserve Bank of Australia (RBA) actions, driven by rising Australian inflationary pressures, with **3.8%** annualized inflation in November, are supporting the AUD.\n* **Price Action:** The AUD/USD pair reached a **14-month high of 0.6727**, before correcting to near **0.6700**, still showing significant **bullish momentum**.\n* **Technical Outlook:** Immediate resistance is at **0.6800**, with support near the **0.6650** level, and the **50-day moving average** providing additional support.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "AUD/USD corrects to near 0.6700, outlook remains firm amid hawkish RBA bets - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/aud-usd-corrects-to-near-06700-outlook-remains-firm-amid-hawkish-rba-bets-202512291104",
                "body": "AUD/USD corrects to near 0.6700, outlook remains firm amid hawkish RBA bets\n- AUD/USD falls off from fresh over-a-year high to near 0.6700 as profit-booking in the AUD kicks in.\n- Australian Monthly CPI grew at an annualized pace of 3.8% in November.\n- Investors await FOMC minutes for fresh cues on the US interest rate outlook.\nThe AUD/USD pair retraces to near 0.6700 during the European trading session on Monday from its over-a-year high of 0.6727 posted earlier in the day. The Aussie pair gives back its intraday gains as the Australian Dollar (AUD) faces profit-booking after rallying for weeks, with the US Dollar (USD) trading broadly calm.\nAustralian Dollar Price This Month\nThe table below shows the percentage change of Australian Dollar (AUD) against listed major currencies this month. Australian Dollar was the strongest against the Japanese Yen.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Australian Dollar from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent AUD (base)/USD (quote).\nThe AUD has outperformed in past few weeks amid growing expectations that the Reserve Bank of Australia (RBA) could raise interest rates in 2026. RBA hawkish expectations are backed by rising Australian inflationary pressures. Australian monthly Consumer Price Index (CPI) rises at a faster pace of 3.8% year-on-year (YoY) in October.\nAs of writing, the US Dollar Index (DXY), which tracks the Greenback’s value against six major currencies, trades flat around 98.00.\nThe US Dollar flattens ahead of the release of Federal Open Market Committee (FOMC) minutes on Tuesday. Investors will pay close attention to the FOMC minutes to get fresh cues on the United States (US) interest rate outlook.\nIn the policy meeting, the Fed reduced interest rates by 25 basis points (bps) to 3.50%-3.75% and signaled that there will be only one in the entire 2026. On the contrary, the CME FedWatch tool shows the odds of the Fed reducing interest rates at least 50 bps in 2026 are 73.3%.\nAustralian Dollar FAQs\nOne of the most significant factors for the Australian Dollar (AUD) is the level of interest rates set by the Reserve Bank of Australia (RBA). Because Australia is a resource-rich country another key driver is the price of its biggest export, Iron Ore. The health of the Chinese economy, its largest trading partner, is a factor, as well as inflation in Australia, its growth rate and Trade Balance. Market sentiment – whether investors are taking on more risky assets (risk-on) or seeking safe-havens (risk-off) – is also a factor, with risk-on positive for AUD.\nThe Reserve Bank of Australia (RBA) influences the Australian Dollar (AUD) by setting the level of interest rates that Australian banks can lend to each other. This influences the level of interest rates in the economy as a whole. The main goal of the RBA is to maintain a stable inflation rate of 2-3% by adjusting interest rates up or down. Relatively high interest rates compared to other major central banks support the AUD, and the opposite for relatively low. The RBA can also use quantitative easing and tightening to influence credit conditions, with the former AUD-negative and the latter AUD-positive.\nChina is Australia’s largest trading partner so the health of the Chinese economy is a major influence on the value of the Australian Dollar (AUD). When the Chinese economy is doing well it purchases more raw materials, goods and services from Australia, lifting demand for the AUD, and pushing up its value. The opposite is the case when the Chinese economy is not growing as fast as expected. Positive or negative surprises in Chinese growth data, therefore, often have a direct impact on the Australian Dollar and its pairs.\nIron Ore is Australia’s largest export, accounting fo"
            },
            {
                "title": "AUD/USD Forex Signal 29/12: Bullish Forecast (Chart) - DailyForex",
                "source": "DailyForex",
                "url": "https://www.dailyforex.com/forex-technical-analysis/2025/12/audusd-forex-signal-29-december-2025/239040",
                "body": "Bullish view\n- Buy the AUD/USD pair and set a take-profit at 0.6800.\n- Add a stop-loss at 0.6650.\n- Timeline: 1-2 days.\nBearish view\n- Sell the AUD/USD pair and set a take-profit at 0.6650.\n- Add a stop-loss at 0.6800.\nThe AUD/USD exchange rate continued soaring, reaching its highest point since October last year. It rose to a high of 0.6715, much higher than this month’s low of 0.6440 as commodity prices jump and odds of RBA and Fed divergence rise.\nAussie Boosted by Fed and RBA Divergence Odds\nThe AUD/USD pair continued its recent bull run as odds that the Reserve Bank of Australia (RBA) and the Federal Reserve will take divergent paths rose.\nThe Fed has already slashed interest rates three time this year and hinted that it will continue in the coming year. Donald Trump has pledged that he will only nominate a Fed Chair who will cut interest rate.\nTop Regulated Brokers\nAs such, there is a likelihood that the bank will deliver more cuts in 2026. However, there is a chance that the other Fed officials will push back against these cuts, especially if inflation remains above the 2% target.\nMeanwhile, there are chances that the RBA will hike interest rates or maintain the status quo in the coming meetings. Officials have already hinted that they will not be in a hurry to cut rates, especially if inflation remains at an elevated level.\nRecent data showed that Australia’s inflation continued rising, a trend that may continue in the coming months.\nThe soaring commodity prices are also boosting the AUD/USD pair. Top commodities like copper, gold, and silver have all surged in the past few months. Iron ore is also rising. Historically, the Australian dollar has been seen as a commodity proxy because of the vast amounts that it exports to China.\nAUD/USD Technical Analysis\nThe daily chart shows that the AUD/USD exchange rate has been in a strong uptrend in the past few weeks. It rose and crossed the important resistance level at 0.6685, the previous year-to-date high.\nThe pair has jumped above all moving averages and the Supertrend indicator. Also, top indicators like the Relative Strength Index and the MACD have continued rising.\nTherefore, the pair will likely continue rising as bulls target the next important resistance level at 0.6800. A move below the key support at 0.6600 will invalidate the bullish outlook.\nReady to trade our daily Forex signals? Here’s a list of some of the best Forex platforms in Australia to check out"
            },
            {
                "title": "Australian Dollar holds ground on hawkish RBA tone - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/australian-dollar-steadies-near-14-month-highs-on-rba-hike-expectations-202512290302",
                "body": "Australian Dollar holds ground on hawkish RBA tone\n- Australian Dollar reached a 14-month high of 0.6727 on Monday.\n- The AUD gains support as expectations grow for RBA interest rate hikes.\n- Traders await Tuesday’s FOMC December Meeting Minutes for insight into the Fed’s 2026 outlook.\nThe Australian Dollar (AUD) rises against the US Dollar (USD), reaching a 14-month high of 0.6727 on Monday. The AUD/USD pair strengthens as the Aussie Dollar finds support amid growing expectations of interest rate hikes from the Reserve Bank of Australia (RBA).\nThe RBA’s December Meeting Minutes indicated that board members are becoming less confident that monetary policy remains sufficiently restrictive. The minutes also indicated the board is prepared to tighten policy if inflation does not ease as anticipated, putting the spotlight on the fourth-quarter CPI report due January 28. Analysts say that a stronger-than-expected Q4 core inflation print could prompt a rate hike at the RBA’s February 3 meeting.\nBloomberg reported Sunday that China’s Ministry of Finance plans to expand targeted investment in priority sectors, including advanced manufacturing, technological innovation, and human capital development. The announcement followed a year-end meeting outlining next year’s fiscal policy priorities. Any impact on China’s economy could affect the AUD, given Australia’s close trade ties with China.\nChina launched the “Justice Mission 2025” drills on Monday, simulating a blockade around Taiwan, according to China Daily, citing Senior Colonel Shi Yi of the People's Liberation Army (PLA) Eastern Theater Command. The exercises underscore ongoing geopolitical risk in Asia, keeping markets alert to potential spillovers into shipping, semiconductors, and regional FX if the drills are prolonged or repeated.\nUS Dollar advances despite ongoing odds of more Fed rate cuts\n- The US Dollar Index (DXY), which measures the value of the US Dollar against six major currencies, has recovered its daily losses and is trading around 98.10 at the time of writing. However, the Greenback could face challenges amid ongoing expectations of two more rate cuts by the Federal Reserve (Fed) in 2026. Traders are likely to focus on the Federal Open Market Committee (FOMC) December Meeting Minutes due on Tuesday.\n- The Federal Reserve lowered the interest rates by 25 basis points (bps) at the December meeting, bringing the target range to 3.50%–3.75%. The Fed delivered a cumulative 75 bps of rate cuts in 2025 amid a cooling labor market and still-elevated inflation.\n- The CME FedWatch tool shows an 81.7% probability of rates being held at the Fed’s January meeting, up from 77.9% a week earlier. Meanwhile, the likelihood of a 25-basis-point rate cut has fallen to 18.3% from 22.1% a week ago.\n- US Initial Jobless Claims declined to 214K from 224K in the prior week, beating the 223K market forecast. Meanwhile, Continuing Jobless Claims rose to 1.923 million from 1.885 million, while the four-week average of Initial Claims edged lower to 216.75K from 217.5K.\n- The US Bureau of Economic Analysis (BEA) released delayed data showing that preliminary US Gross Domestic Product (GDP) Annualized expanded 4.3% in the July–September period. The reading exceeded market expectations of a 3.3% increase and surpassed the 3.8% growth recorded in the previous quarter.\n- Australia’s headline inflation rose to 3.8% in October 2025 from 3.6% in September, remaining above the RBA’s 2–3% target range. As a result, markets are increasingly pricing in a rate hike as early as February 2026, with both the Commonwealth Bank of Australia and National Australia Bank projecting a rise to 3.85% at the RBA’s first policy meeting of the year.\n- Australia’s Consumer Inflation Expectations rose to 4.7% in December from November’s three-month low of 4.5%, supporting the Reserve Bank of Australia’s (RBA) hawkish stance.\nAustralian Dollar reaches new 14-month highs above 0.6700\nAUD/USD is hovering around 0.6720 on Mon"
            }
        ]
    },
    {
        "asset_name": "USD/JPY",
        "symbol": "EIGHTCAP:USDJPY",
        "status": "Success",
        "data": {
            "day_range": "0.7370",
            "open": "156.2020",
            "close": "156.5220",
            "high": "156.7250",
            "low": "155.9880"
        },
        "market_summary": "### USD/JPY Market Briefing\n* **Key Drivers:** The **hawkish** stance of the Bank of Japan, signaled by its recent rate hike to **0.75%** and indications of further tightening, is supporting the yen. Meanwhile, the US Federal Reserve's easing bias, with expectations of at least two more rate cuts in **2026**, is weighing on the USD.\n* **Price Action:** The pair is steady above **156.00**, after pulling back from **156.60** highs, with the downside technically well protected by the **38.2% Fibonacci retracement** and the ascending trendline from the September lows.\n* **Technical Outlook:** Immediate support is near the **200-day EMA**, with resistance at **157.78**, the recent high. A break below the **200-day EMA** could challenge the upside momentum, while the **38.2% Fibonacci retracement** and the ascending trendline may limit the downside.\n--- \n**Overall Sentiment:** Neutral",
        "source_articles": [
            {
                "title": "USD/JPY soft on Fed–BoJ diverging monetary policy paths - FXCM Markets",
                "source": "FXCM Markets",
                "url": "https://www.fxcm.com/markets/insights/usd-jpy-soft-on-fed-boj-diverging-monetary-policy-paths/",
                "body": "USD/JPY soft on Fed–BoJ diverging monetary policy paths\nUSD/JPY Analysis\nThe Bank of Japan raised rates by 25 bps earlier this month to 0.75% and the highest level in three decades, with officials signalling additional moves if the economy evolves as expected [1]. The Summary of Opinions published today reaffirmed the tightening bias, with one member stating that further increases are needed to \"avoid falling behind the curve\" and another noting that there remains a \"considerable distance to the neutral\". [2]\nThe central bank retains scope for further tightening as core inflation remains well above the 2% target, while elevated wage growth is expected to persist into the next fiscal year. In addition, the US-Japan trade agreement to lower tariffs and the government's sizeable fiscal stimulus could support the economy.\nThis hawkish bias is supporting the yen, alongside recent currency intervention warnings from Japanese officials. These include comments from the Finance Minister, who stated that \"we are always ready to act\" in a Bloomberg interview last week [3]. Meanwhile, the USDOLLAR is weighed down by the Fed's December rate cut and its easing bias [4], as the US economy and labour market face tariff-related headwinds.\nThese monetary policy dynamics are pressuring USD/JPY, leaving the pair vulnerable to a break below the 200-day EMA, which would challenge the upside momentum. However, the downside appears technically well protected, with the 38.2% Fibonacci retracement and the ascending trendline from the September lows following. This creates scope for a recovery and keeps the 2025 peak in play.\nThe Bank of Japan may have raised rates but maintained its slow and gradual approach, while economic headwinds may limit the extent of further tightening. Moreover, the US central bank remains on a cautious easing path, with the latest Summary of Economic Projections pointing to just one rate cut in 2026.\nNikos Tzabouras\nSenior Financial Editorial Writer\nNikos Tzabouras is a graduate of the Department of International & European Economic Studies at the Athens University of Economics and Business. He has a long time presence at FXCM, as he joined the company in 2011. He has served from multiple positions, but specializes in financial market analysis and commentary.\nWith his educational background in international relations, he emphasizes not only on Technical Analysis but also in Fundamental Analysis and Geopolitics – which have been having increasing impact on financial markets. He has longtime experience in market analysis and as a host of educational trading courses via online and in-person sessions and conferences."
            },
            {
                "title": "USD/JPY steadies above 156.00 following BoJ’s Summary of Opinions - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-jpy-steadies-above-15600-following-bojs-summary-of-opinions-202512291111",
                "body": "USD/JPY steadies above 156.00 following BoJ’s Summary of Opinions\n- USD/JPY steadies above 156.00 after pulling back from 156.60 highs.\n- A hawkish BoJ's Summary of Opinions provided some support to the JPY earlier on Monday.\n- The Fed's minutes, due on Tuesday, might give a further impulse to the pair.\nThe US Dollar is ticking lower against a moderately firmer Japanese Yen on Monday, yet with downside attempts contained above 156.00. The positive impact from the hawkishly-tilted Summary of Opinions of the Bank of Japan’s (BoJ) Monetary Policy Meeting seen during Monday’s Asian session has waned during London trading.\nThe Yen appreciated across the board after the Japanese central bank published the minutes of the last monetary policy meeting. BoJ policymakers observed that rates are still far from neutral, although some of them advised proceeding with caution to avoid undesired consequences on the economy and markets.\nThe Bank of Japan hiked its benchmark interest rate by 0.25% basis points to a 30-year high of 0.75% in December and signalled further rate cuts in 2026 amid the bank’s overall commitment to monetary policy normalisation.\nInvestors, however, remain concerned about Japanese Prime Minister Sanae Takaichi’s pro-stimulus measures and their potential impact on an already stretched Japanese fiscal deficit. Fears of a debt crisis are acting as a significant headwind for a steady Yen recovery.\nThe US Dollar, on the other hand, remains weighed by market expectations that the US Federal Reserve will cut its benchmark rate at least two more times in 2026, against the bank’s projection of a single rate cut. On Tuesday, the release of the minutes of the December meeting is likely to shed further light on the topic, and might set the near-term direction of the USD/JPY pair.\nBank of Japan FAQs\nThe Bank of Japan (BoJ) is the Japanese central bank, which sets monetary policy in the country. Its mandate is to issue banknotes and carry out currency and monetary control to ensure price stability, which means an inflation target of around 2%.\nThe Bank of Japan embarked in an ultra-loose monetary policy in 2013 in order to stimulate the economy and fuel inflation amid a low-inflationary environment. The bank’s policy is based on Quantitative and Qualitative Easing (QQE), or printing notes to buy assets such as government or corporate bonds to provide liquidity. In 2016, the bank doubled down on its strategy and further loosened policy by first introducing negative interest rates and then directly controlling the yield of its 10-year government bonds. In March 2024, the BoJ lifted interest rates, effectively retreating from the ultra-loose monetary policy stance.\nThe Bank’s massive stimulus caused the Yen to depreciate against its main currency peers. This process exacerbated in 2022 and 2023 due to an increasing policy divergence between the Bank of Japan and other main central banks, which opted to increase interest rates sharply to fight decades-high levels of inflation. The BoJ’s policy led to a widening differential with other currencies, dragging down the value of the Yen. This trend partly reversed in 2024, when the BoJ decided to abandon its ultra-loose policy stance.\nA weaker Yen and the spike in global energy prices led to an increase in Japanese inflation, which exceeded the BoJ’s 2% target. The prospect of rising salaries in the country – a key element fuelling inflation – also contributed to the move.\nAuthor\nGuillermo Alcala\nFXStreet\nGraduated in Communication Sciences at the Universidad del Pais Vasco and Universiteit van Amsterdam, Guillermo has been working as financial news editor and copywriter in diverse Forex-related firms, like FXStreet and Kantox."
            },
            {
                "title": "Yen edges up after BOJ meeting minutes - Economies.com",
                "source": "Economies.com",
                "url": "https://www.economies.com/forex/usd-jpy-news/yen-edges-up-after-boj-meeting-minutes-48024",
                "body": "The Japanese yen recouped some of its losses on Monday after retreating late last week, as markets assessed the timing of further interest rate hikes in Japan and the likelihood of official intervention, while thin year-end trading left European currencies largely stable.\nA summary of opinions from Bank of Japan policymakers at their December meeting, published on Monday, showed that members discussed the need to continue raising interest rates. Japanese Finance Minister Satsuki Katayama said last week that Japan has full freedom to act against excessive moves in the yen.\nBart Wakabayashi, head of State Street’s Tokyo branch, said these intervention warnings have helped limit positioning in dollar/yen, although bearish sentiment toward the Japanese currency is evident in other foreign exchange pairs.\n“I think holding long yen positions is extremely painful,” Wakabayashi said. “We’re seeing some expression of short yen positions against those currencies, especially against the Australian dollar.”\nHe added: “The market is still trying to understand the role the yen plays now in terms of being a safe haven.”\nThe dollar was last down 0.26% at 156.3 yen, after jumping 0.45% on Friday. The yen traded at 105.02 per Australian dollar, just shy of the 17-month low of 105.08 reached on Friday.\nThe dollar index, which measures the US currency against a basket of peers, edged slightly lower to 97.95. The euro ticked up marginally to $1.1780, while sterling was steady at $1.3503.\nThe Bank of Japan raised its benchmark interest rate to a 30-year high of 0.75% from 0.5% at its December meeting. The summary of opinions released on Monday showed that many board members saw the need for further rate hikes, with real interest rates still deeply negative once inflation is taken into account.\nHowever, the rate hike failed to stem the yen’s decline, with the currency falling to 157.78 per dollar on December 19, prompting renewed intervention warnings. Japan last intervened to support the yen in July 2024, when it bought the currency after it slid to a 38-year low of 161.96 per dollar.\nWith limited data this week and thin trading ahead of New Year holidays in many markets, geopolitical developments moved to the forefront.\nUS President Donald Trump said on Sunday that he and Ukrainian President Volodymyr Zelenskyy were “very close, perhaps extremely close” to reaching an agreement to end the war in Ukraine, although both leaders acknowledged that some of the most complex issues remain unresolved.\nIn Asia, tensions remained elevated as China deployed military units around Taiwan ahead of live-fire drills scheduled for Tuesday. Meanwhile, North Korean state media reported that leader Kim Jong Un oversaw the launch of long-range missiles on Sunday, while South Korea’s Yonhap news agency said further tests could take place around New Year’s Day.\nThe main data focus this week will be the release of minutes from the Federal Open Market Committee meeting on Tuesday, from a gathering held earlier this month. The US Federal Reserve cut interest rates at that meeting and projected just one additional cut next year, while market participants have priced in at least two more.\nGoldman Sachs analysts said in a note: “The FOMC adjusted its post-meeting statement to signal a higher bar for further rate cuts, and Federal Reserve Chair Jerome Powell reinforced this message during his press conference. We expect the December minutes to point to continued disagreement among committee members over the appropriate near-term path of monetary policy.”\nThe Australian dollar was little changed at $0.6717, while the Swiss franc was firmer at 0.787 per dollar.\nSilver prices fell by more than 6% in the European market on Monday, driven by accelerating correction and profit-taking activity, after earlier hitting a fresh all-time high during Asian trading by breaking above the $80 per ounce level for the first time ever.\nIn addition to profit-taking pressure, silver prices came un"
            }
        ]
    },
    {
        "asset_name": "USD/CAD",
        "symbol": "EIGHTCAP:USDCAD",
        "status": "Success",
        "data": {
            "day_range": "0.0043",
            "open": "1.3672",
            "close": "1.3664",
            "high": "1.3684",
            "low": "1.3642"
        },
        "market_summary": "### USD/CAD Market Briefing\n\n* **Key Drivers:** The **rebound in oil prices** and **dovish expectations** for US dollar policy are driving the **Canadian Dollar** higher, while the **US Dollar** weakens due to anticipated **rate cuts** by the Federal Reserve in 2026.\n* **Price Action:** USD/CAD has broken below the key support level of **1.3700**, testing lows in the **1.3640–1.3660** range, and showing significant **bearish** momentum, with a recent low of approximately **1.3642**.\n* **Technical Outlook:** Immediate support is near **1.3640**, with resistance at **1.3720–1.3750**; a break below **1.3640** could lead to a decline toward **1.3550–1.3580**.\n\n---\n**Overall Sentiment:** Negative",
        "source_articles": [
            {
                "title": "USD/CAD rebounds as US Dollar steadies, Oil-driven CAD gains fade - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/usd-cad-rebounds-as-us-dollar-recovers-oil-support-weakens-for-canadian-dollar-202512291304",
                "body": "USD/CAD rebounds as US Dollar recovers, Oil support weakens for Canadian Dollar\n- The US Dollar regains some ground against the Canadian Dollar\n- Support for the Canadian Dollar from higher Oil prices fades at the start of a holiday-shortened week\n- Investors remain cautious ahead of the Federal Reserve Minutes and amid expectations of rate cuts in 2026\nUSD/CAD rebounds toward 1.3700 and is up around 0.20% on the day on Monday. After trading near a five-month low around 1.3640 late last week, the pair benefits from a modest return of demand for the US Dollar (USD) amid thin liquidity at the start of a holiday-shortened week.\nThe Canadian Dollar (CAD) had recently found support from rising Oil prices, as Canada is the largest crude exporter to the United States (US). West Texas Intermediate (WTI) US Oil prices are recovering after sharp losses in the previous day, supported by persistent geopolitical tensions in the Middle East and concerns over potential supply disruptions. However, this commodity-related support appears to be losing momentum in the near term, limiting the Canadian Dollar’s ability to extend its gains.\nOn the monetary policy front, the US Dollar remains broadly under pressure but shows signs of stabilization. Investors continue to price in the prospect of further rate cuts by the Federal Reserve (Fed) in 2026, following the 25-basis-point rate cut delivered at the December meeting, which brought the target range to 3.50%-3.75%. The Federal Reserve has now delivered a cumulative 75 basis points of rate cuts in 2025, amid a gradually cooling labor market and inflation that remains above target.\nMarket focus now turns to the release of the Federal Open Market Committee (FOMC) Minutes, due on Tuesday, which could provide further insight into internal policy debates and the outlook for the coming year. According to the CME FedWatch tool, the probability of rates being left unchanged at the January meeting remains high, while expectations of an immediate rate cut continue to fade.\nOn the Canadian side, expectations remain more stable. The Bank of Canada (BoC) is expected to maintain a cautious stance, as inflation has remained slightly above the 2% target in recent months. Minutes from the latest meeting confirmed that policymakers consider the current policy stance appropriate, while standing ready to adjust if the economic outlook changes materially. This contrast between the expected monetary policy paths continues to keep USD/CAD in a consolidation phase.\n(This story was corrected on December 29 at 13:55 GMT to remove a reference that USD/CAD ended a four-day losing streak.)\nCanadian Dollar Price Today\nThe table below shows the percentage change of Canadian Dollar (CAD) against listed major currencies today. Canadian Dollar was the strongest against the New Zealand Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Canadian Dollar from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent CAD (base)/USD (quote).\nAuthor\nGhiles Guezout\nFXStreet\nGhiles Guezout is a Market Analyst with a strong background in stock market investments, trading, and cryptocurrencies. He combines fundamental and technical analysis skills to identify market opportunities."
            },
            {
                "title": "As oil prices rise amid Middle East tensions, USD/CAD falls to approximately 1.3650 - VT Markets",
                "source": "VT Markets",
                "url": "https://www.vtmarkets.com/live-updates/as-oil-prices-rise-amid-middle-east-tensions-usd-cad-falls-to-approximately-1-3650/",
                "body": "The USD/CAD pair has shown depreciation for a second consecutive session, hovering around 1.3660, close to the five-month low of 1.3642. This decline is influenced by the rise in Oil prices, with the Canadian Dollar benefiting from Canada’s role as the largest crude exporter to the US.\nOil prices see a recovery, with West Texas Intermediate trading at approximately $57.20, as tensions in the Middle East escalate due to Saudi airstrikes in Yemen and Iran’s aggressive stance against the US, Europe, and Israel. The potential disruption in oil supply is contributing to the increase in crude prices.\nThe Us Dollar Weakens\nThe US Dollar is weakening, partly due to the anticipation of further rate cuts by the Federal Reserve in 2026, with traders looking forward to the FOMC December Meeting Minutes for insights. The Federal Reserve recently reduced interest rates by 25 basis points, leading to a cumulative 75 bps cut in 2025.\nThe CME FedWatch tool indicates an 81.7% probability of interest rates being maintained at the Fed’s January meeting. Meanwhile, the likelihood of a 25-basis-point rate cut has decreased to 18.3%.\nThe Canadian Dollar is affected by various factors, including the Bank of Canada’s interest rates, oil prices, economic health, and inflation. Market sentiment and the health of the US economy also play roles in influencing the CAD.\nAs we approach the end of 2025, we are seeing the USD/CAD pair test significant lows not seen in five months. The primary drivers are clear: rising oil prices are boosting the Canadian dollar, while expectations of a more dovish Federal Reserve are weighing on the US dollar. This downward pressure on the currency pair presents specific opportunities and risks for the coming weeks.\nFactors Influencing Oil Prices\nThe strength in crude oil is a key factor, with West Texas Intermediate trading around $57 a barrel amid escalating geopolitical tensions in the Middle East. Recent data from the U.S. Energy Information Administration (EIA) has shown consistent draws on crude inventories over the past month, further supporting prices. Given Canada’s position as a top energy exporter, these higher oil prices create a fundamental tailwind for the Canadian dollar, suggesting that any trade looking for a stronger USD against the CAD faces an uphill battle.\nOn the other side of the pair, the US dollar is softening based on the Federal Reserve’s actions throughout 2025. We have already seen the Fed deliver 75 basis points in rate cuts this year, a response to a cooling US labor market where November’s non-farm payrolls report showed job growth slowing significantly. With the market pricing in the possibility of two more cuts in 2026, the path of least resistance for the greenback appears to be lower.\nFor derivative traders, this environment favors strategies that profit from a continued decline in USD/CAD. Buying put options on the pair could provide leveraged exposure to the downside, with a key target being a decisive break below the 1.3642 support level. Selling out-of-the-money call spreads would be a more conservative approach, designed to profit if the pair stays below a certain resistance level while generating income from the premium.\nHowever, we must watch for potential reversals heading into January 2026. The Federal Open Market Committee meeting minutes, due this Tuesday, could reveal a more divided or cautious stance than the market currently anticipates, which would strengthen the US dollar. Furthermore, any de-escalation of conflict in the Middle East could quickly unwind the recent rally in oil prices, removing a major pillar of support for the Canadian dollar."
            },
            {
                "title": "The rebound in oil prices supported the strengthening of the Canadian dollar, while the weakening of the US dollar pushed USD/CAD closer to a five-month low. - 富途牛牛",
                "source": "富途牛牛",
                "url": "https://news.futunn.com/en/post/66714619/the-rebound-in-oil-prices-supported-the-strengthening-of-the",
                "body": "During the Asian session on Monday, the US Dollar to Canadian Dollar (USD/CAD) extended its decline, with the exchange rate retreating to around 1.3660, approaching the five-month low of 1.3642 touched on December 26.\nThe Canadian Dollar remained relatively resilient, primarily supported by a rebound in oil prices. As one of the largest crude oil suppliers to the United States, Canada's currency is highly sensitive to fluctuations in international oil prices. In the oil market, WTI experienced a technical rebound after falling approximately 2.5% in the previous trading session, currently trading near $57.20 per barrel.\nMarket sentiment has been affected by the ongoing escalation of tensions in the Middle East, with concerns over potential supply disruptions resurfacing to support oil prices. A stronger oil price directly improves Canada’s terms of trade, providing positive support for the Canadian Dollar.\nInvestors will focus on the minutes of the Federal Reserve’s December meeting, scheduled for release on Tuesday, to assess internal divisions among policymakers regarding the future policy trajectory.\nLooking back at the policy context, the Federal Reserve cut interest rates by 25 basis points to a range of 3.50%–3.75% during its December meeting, with cumulative rate cuts projected to total 75 basis points for 2025, against a backdrop of a gradually cooling labor market but inflation still above target.\nThe CME FedWatch tool indicates that the market now assigns an 81.7% probability to the Federal Reserve maintaining interest rates unchanged at its January meeting, while the likelihood of a 25-basis-point rate cut has dropped to 18.3%, reflecting a cautious short-term policy stance.\nFrom a daily chart perspective, USD/CAD has been trending lower in a sustained downtrend since the November high, operating within a clearly defined descending channel. The current exchange rate has broken below the key support level of 1.3700 and is repeatedly testing lows in the 1.3640–1.3660 range, signaling dominance by bearish trends.\nIn terms of the moving average system, both short-term and medium-term moving averages are arranged in a bearish configuration and continue to diverge downward, exerting significant downward pressure on the exchange rate. The RSI indicator is hovering near 40, not yet entering extreme oversold territory, suggesting that downside potential remains technically open.\nIf the exchange rate subsequently breaks below 1.3640 effectively, USD/CAD may further decline toward the 1.3550–1.3580 region; conversely, if a technical rebound occurs, the 1.3720–1.3750 range will serve as the primary resistance zone.\nEditor’s View:\nAgainst the backdrop of recovering oil prices and dovish expectations for US dollar policy, USD/CAD still faces downward pressure in the short term. As long as crude oil prices remain relatively strong, the Canadian dollar's relative advantage is unlikely to weaken.\nHowever, considering that the exchange rate is already close to a phase low, caution is warranted against a technical rebound triggered by a pullback in oil prices or shifts in risk sentiment. Nevertheless, before the trend is disrupted, the overall outlook remains biased toward weakness with fluctuations."
            }
        ]
    },
    {
        "asset_name": "GBP/JPY",
        "symbol": "EIGHTCAP:GBPJPY",
        "status": "Success",
        "data": {
            "day_range": "0.8840",
            "open": "211.0980",
            "close": "211.1320",
            "high": "211.4960",
            "low": "210.6120"
        },
        "market_summary": "### GBP/JPY Market Briefing\n\n* **Key Drivers:** Concerns about a **BoJ intervention** and broad-based **Yen recovery** are pressuring GBP/JPY, despite the pair's overall **bullish momentum**.\n* **Price Action:** Retreated from long-term highs near **211.60**, currently trading near **210.50**, with a recent pullback from session highs at **211.43**.\n* **Technical Outlook:** Immediate support is at **210.05** (December 24 low) and **208.90** (mid-December highs), with resistance at the long-term high of **211.59** and potential targets at **212.75** (127.2% Fibonacci extension) and **214.38** (161.8% extension).\n\n---\n**Overall Sentiment:** Neutral ️️️️️",
        "source_articles": [
            {
                "title": "GBP/JPY Price Forecast: Pound fails at the 211.50 area, drifts toward 210.05 - FXStreet",
                "source": "FXStreet",
                "url": "https://www.fxstreet.com/news/gbp-jpy-price-forecast-pound-fails-at-the-21150-area-drifts-toward-21005-202512290828",
                "body": "GBP/JPY Price Forecast: Pound fails at the 211.50 area, drifts toward 210.05\n- GBP/JPY retreats from long-term highs near 211.60 amid a broad-based Yen recovery.\n- Concerns about a BoJ intervention are keeping yen bears in check.\n- The broader GBP/JPY trend remained positive, with pullbacks finding buyers so far.\nThe Yen is trimming recent losses against its main peers on Monday, which has triggered a nearly 100-pip reversal on the GBP/JPY. The pair is trading near 210.50 at the time of writing after pulling back from session highs at 211.43.\nThe Japanese Yen depreciated further last week as investors pondered the timing of the Bank of Japan’s (BoJ) interest rate hike, amid growing concerns about the impact of Prime Minister Takaichi’s expansive policies on the country's already strained accounts.\nTakaichi’s Finance Minister Satsuki Takayama launched the strongest warning to date last week. Takayama observed that Yen moves are not reflecting fundamentals and reiterated that Tokyo will take appropriate measures against Yen speculation. The thin trading volumes this week provide a good opportunity to step in for the Japanese authorities.\nTechnical analysis: Bears aim for 210.05 and 208.90 support areas\nThe 4-hour chart shows the GBP/JPY trading at 210.49, following another rejection at the long-term highs in the 211.50 - 211.60 area. The broader trend remains positive, with price action well above the trend line from 198.94 lows, which is offering support near 209.27. Immediate support stands at 210.05 (December 24 low), and at the mid-December highs, around 208.90.\nThe Moving Average Convergence Divergence (MACD) line sits below the Signal line and under the zero mark, with the histogram widening on the negative side, suggesting bearish momentum is building. The Relative Strength Index (14) has eased to 48.03, neutral after shedding overbought readings.\nTo the upside, above the mentioned long-term high, at 211.59 (December 22 high), the 127.2% Fibonacci extension of the December 15 to December 22 rally, at 212.75, and the 161.8% extension of the same cycle, at 214.38, are plausible targets.\n(The technical analysis of this story was written with the help of an AI tool.)\nJapanese Yen Price Today\nThe table below shows the percentage change of Japanese Yen (JPY) against listed major currencies today. Japanese Yen was the strongest against the New Zealand Dollar.\nThe heat map shows percentage changes of major currencies against each other. The base currency is picked from the left column, while the quote currency is picked from the top row. For example, if you pick the Japanese Yen from the left column and move along the horizontal line to the US Dollar, the percentage change displayed in the box will represent JPY (base)/USD (quote).\nAuthor\nGuillermo Alcala\nFXStreet\nGraduated in Communication Sciences at the Universidad del Pais Vasco and Universiteit van Amsterdam, Guillermo has been working as financial news editor and copywriter in diverse Forex-related firms, like FXStreet and Kantox."
            }
        ]
    },
    {
        "asset_name": "BTC/USD",
        "symbol": "EIGHTCAP:BTCUSD",
        "status": "Success",
        "data": {
            "day_range": "684.2000",
            "open": "87,611.8900",
            "close": "87,506.5000",
            "high": "88,028.7000",
            "low": "87,344.5000"
        },
        "market_summary": "### BTC/USD Market Briefing\n* **Key Drivers:** Expectations of **$180** to **$220 billion** in investment in Bitcoin ETFs in 2026, driven by regulatory clarity, potential **Federal Reserve** interest rate cuts, and increasing institutional adoption.\n* **Price Action:** Currently trading near the **$87,000** level, with a potential **red yearly close** if it doesn't surpass **$93,389** by the end of the year.\n* **Technical Outlook:** Immediate resistance is near the **$90,000** level, with support at **$85,000**. A break above **$100,000** could signal a **bullish momentum** shift, while a drop below **$80,000** could indicate a **bearish** trend.\n\n--- \n**Overall Sentiment:** Neutral 📊",
        "source_articles": [
            {
                "title": "Bitcoin ETFs enter 2026. Here’s why analysts expect over $180bn in investment - dlnews.com",
                "source": "dlnews.com",
                "url": "https://www.dlnews.com/articles/markets/bitcoin-etfs-to-top-180-billion-usd-in-2026-say-analysts/",
                "body": "- Bitcoin in ETFs could top $180 to $220 billion in 2026.\n- Major banks like Bank of America, Wells Fargo, and Vanguard are opening distribution to clients.\n- Historically, year three shows accelerating flows — gold saw the largest inflows two years after launch.\nBitcoin funds experienced explosive growth in their second year of existence.\nSince they launched in January 2024, spot Bitcoin exchange-traded funds have attracted more than $137 billion in assets under management, according to Dune Analytics. They now hold nearly 7% of the total Bitcoin supply.\nNext year, market watchers suggest, will see even more investment.\n“2026 is going to be an amazing year for Bitcoin and cryptoassets,” André Dragosch, head of research at Bitwise, told DL News. “We will see an aggressive increase in net inflows into Bitcoin ETFs.”\nThere’s a trifecta of catalysts: regulatory clarity, the expectation that the Federal Reserve will cut interest rates, and institutional adoption as prominent wealth managers distribute products to clients.\nThere’s even an auspicious historical precedent.\nWhen gold’s ETF launched in 2004, its most significant inflows came in 2006.\nCould digital gold follow the same timeline?\n'Wealth managers at big banks like Bank of America and JP Morgan now suggest clients allocate 1 to 5% of their net worth into crypto.’— Dom Kwok, former Goldman Sachs analyst\nYear three acceleration\nForecasting what will happen next year, Dragosch points to an attractive historical pattern.\n“We are entering year three after launch, which has historically shown an acceleration in flows compared to previous years,” Dragosch said, citing gold ETFs’ 2004 launch.\nYear three, 2006, “saw significantly higher flows than preceding years.”\nHis logic is simple. Year one brings the early adopters, while year two brings cautious institutions testing allocations.\nFinally, year three brings mass adoption as results validate the thesis.\nBut mass adoption needs infrastructure.\nIt’s all about distribution\nThe game-changer for Bitcoin ETFs in 2026 will be distribution, Dragosch said.\nProminent wealth managers that sat on the sidelines are now opening access.\n“Major wire houses and asset managers such as Wells Fargo, Bank of America and even Vanguard have finally opened up to distribute bitcoin ETFs to their clients,” the Bitwise exec told DL News.\n“That means tens of thousands of wealth advisors will now start distributing these products across the US.”\nKatherine Dowling, president of the Bitcoin Standard Treasury Company, emphasised the significance.\n“It’s important to underscore the fact that we now have big banks actively recommending Bitcoin exposure and bringing Bitcoin products on their platforms,” Dowling said.\nBank of America’s $3.5 trillion advisor pool can now recommend Bitcoin ETFs. Vanguard took a sharp U-turn and is now offering exposure to its 8 million clients.\n“ETFs will be the primary way these new investors get their first taste of crypto,” Dom Kwok, former Goldman Sachs analyst, told DL News.\nMoreover, Bitcoin ETFs can now be included in 401(k) retirement plans and defined-contribution schemes, unlocking trillions of dollars held in pension funds.\n$220 billion\nMike Marshall, head of research at Amberdata, sees even institutional capital flooding in.\n“[More than 80%] of institutions plan to increase crypto allocations, with 59% targeting over 5% of portfolios, pushing Bitcoin ETF assets toward $180–220 billion,\" Marshall told DL News.\nBitcoin ETF assets hitting $180 to 220 billion would represent massive growth from current levels, which sit at around $147 billion.\n“Institutions are warming up to crypto, seeing it as a way of boosting their returns and hedging currency devaluation,” Kwok said.\n“Wealth managers at big banks like Bank of America and JP Morgan now suggest clients allocate 1 to 5% of their net worth into crypto.”\nThey aren’t the only ones, either.\nRic Edelman, a Main Street financial adviser, has been publicly telling investors to al"
            },
            {
                "title": "Strategy Inc reports bitcoin acquisition and ATM update in SEC filing - Investing.com UK",
                "source": "Investing.com UK",
                "url": "https://uk.investing.com/news/sec-filings/strategy-inc-reports-bitcoin-acquisition-and-atm-update-in-sec-filing-93CH-4431928",
                "body": "Bitcoin price today: inches lower to $87k level amid subdued year-end trading\nStrategy Inc (NASDAQ:MSTR) reported Monday that it acquired 1,229 bitcoins between December 22 and December 28, 2025, for an aggregate purchase price of $108.8 million. The average purchase price for these bitcoins was approximately $88,568 per bitcoin, inclusive of fees and expenses, according to a statement made in its SEC Form 8-K filing.\nAs of December 28, 2025, the company’s total bitcoin holdings stood at 672,497 bitcoins, acquired at an aggregate purchase price of approximately $5.044 billion, with an average purchase price of about $74,997 per bitcoin.\nStrategy Inc also provided an update on its at-the-market (ATM) offering program for its securities. During the same period, the company sold 663,450 shares of its Class A common stock (NASDAQ:MSTR), resulting in net proceeds of $108.8 million. No shares of its preferred stock series—STRF (10.00% Series A Perpetual Strife Preferred Stock), STRC (Variable Rate Series A Perpetual Stretch Preferred Stock), STRK (8.00% Series A Perpetual Strike Preferred Stock), or STRD (10.00% Series A Perpetual Stride Preferred Stock)—were sold during this period.\nAs of December 28, 2025, the company reported the following amounts available for issuance and sale under its ATM program: $1,619.3 million for STRF, $4,042.4 million for STRC, $4,014.8 million for STRK, $11,698.9 million for MSTR, and $20,335.0 million for STRD.\nThe company stated that the bitcoin purchases were funded using proceeds from the sale of MSTR shares under its ATM program. All aggregate and average purchase prices include related fees and expenses.\nThis information is based on a statement made in a press release and disclosed in Strategy Inc’s SEC Form 8-K filing.\nThis article was generated with the support of AI and reviewed by an editor. For more information see our T&C.\nIs MSTR a bargain right now?\nThe fastest way to find out is with our Fair Value calculator. We use a mix of 17 proven industry valuation models for maximum accuracy.\nGet the bottom line for MSTR plus thousands of other stocks and find your next hidden gem with massive upside."
            },
            {
                "title": "Bitcoin Nears Red Yearly Close: Galaxy Digital Explains The Setup - TradingView — Track All Markets",
                "source": "TradingView — Track All Markets",
                "url": "https://www.tradingview.com/news/newsbtc:f9629a492094b:0-bitcoin-nears-red-yearly-close-galaxy-digital-explains-the-setup/",
                "body": "Bitcoin Nears Red Yearly Close: Galaxy Digital Explains The Setup\nBitcoin is heading into New Year’s Eve on the verge of printing a red yearly candle, an awkward setup after a year packed with pro-crypto policy and institutional headlines. Galaxy Digital head of research Alex Thorn said BTC is down 6.3% year-to-date and 8.25% year-over-year, and would need a daily close above $93,389 on New Year’s Eve to finish 2025 positive.\nThe late-year mood has been defined by a soft Q4 tape and a deeper drawdown than many bulls expected this late in the cycle. Thorn noted BTC traded as low as roughly 36% below its Oct. 6, 2025 all-time high of $125,296, even as a steady stream of bullish headlines landed throughout the year.\n“Despite the tepid finish, 2025 was a banner year for Bitcoin. Even Bitcoin’s staunchest supporters wouldn’t have believed some of 2025’s headlines just a few years ago… 2025 has been filled with dozens of positive headlines for Bitcoin that in the past would have sparked euphoria. Today, these victories feel like par for the course. Maybe we really are ‘tired of winning?’” Thorn wrote in Galaxy’s weekly research note.\nBitcoin On Verge Of Red Yearly Candle\nThorn argued that part of the market’s stalled feel is mechanical, not philosophical. He pointed to a large month-end options expiry as a potential catalyst for loosening the range-bound behavior he described between the mid-$80,000s and $90,000.\nRelated Reading: Why $100,000 Is Bitcoin’s Most Important Resistance Level\n“A significant options expiry at the end of the month clear some of the outstanding dealer gamma that has encouraged bitcoin to stay pinned between major $85k and $90k, and January may prompt some portfolio managers to take a fresh look at the world’s oldest cryptocurrency. There are reasons why the quiet period we’ve seen for the last month will not persist in the near term.”\nHe also cited headwinds that hit spot demand and risk appetite: “significant whale distribution,” an Oct. 10 leverage wipeout, and competition from other macro trades such as AI, hyperscalers, gold, and the “Mag 7.” One of Thorn’s key observations was the divergence between bitcoin’s drawdown and US bitcoin ETF behavior.\nHe said US bitcoin ETF cumulative inflows are down only 9% from their October peak of $62 billion, even though bitcoin fell sharply from its highs and, in his estimate, 60% of ETF inflows are underwater at current prices.\nThat resilience, he argued, makes the source of selling more notable. “So, who has been selling?” Thorn wrote. “The call is coming from inside the house.” Since July 2025, he said coins held by long-term holders have declined more sharply than at any point in the eight years since the 2017 bull run, suggesting older on-chain holders have been net sellers into newer brokerage-led demand.\nThorn framed that distribution as painful in the short run but constructive for the asset’s long-run maturity, lifting the average cost basis and broadening ownership. He highlighted bitcoin’s realized market cap above $1.1 trillion and a realized price above $56,000 as evidence of the network’s rising aggregate principal.\nIn a Dec. 21 post summarizing Galaxy’s 2026 outlook, Thorn said Galaxy predicts bitcoin to hit $250,000 by year-end 2027, while calling 2026 “too chaotic to predict.” Options markets, he noted, are currently pricing roughly equal odds of $70,000 or $130,000 by end-June 2026, and $50,000 or $250,000 by year-end 2026, reflecting unusually wide uncertainty bands.\nHe also pointed to a structural decline in longer-term volatility and a changed skew: the BTC vol smile now prices puts as more expensive than calls, which he described as a shift toward patterns more typical of macro assets than high-growth markets.\nLooking into 2026, Thorn’s near-term marker is whether BTC can “firmly re-establish” itself above $100,000–$105,000. Over the longer run, he argued the bigger story is demand for non-dollar hedges—and how little incremental allocation might"
            }
        ]
    },
    {
        "asset_name": "ETH/USD",
        "symbol": "EIGHTCAP:ETHUSD",
        "status": "Success",
        "data": {
            "day_range": "36.1000",
            "open": "2,932.3900",
            "close": "2,934.2500",
            "high": "2,957.7000",
            "low": "2,921.6000"
        },
        "market_summary": "### ETH/USD Market Briefing\n* **Key Drivers:** A surge in Ethereum's staking queue, led by **BitMine**'s significant investment, signals **bullish momentum** amidst regulatory progress, with the US Securities and Exchange Commission (SEC) clarifying that liquid staking activities do not constitute securities transactions.\n* **Price Action:** Currently trading near **$3,000**, with the staking queue surging past exits for the first time in six months, indicating a marked increase in staking demand relative to outflows, and **nearly twice as much ETH** is being lined up to stake as to withdraw.\n* **Technical Outlook:** Immediate support is near the **50-day moving average**, with resistance at **$4,000**, and the exit queue may soon hit zero at the current pace, potentially diminishing selling pressure on the market and bringing stability, as the **exit queue serves as a leading indicator of selling pressure**.\n\n--- \n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "Ethereum’s record staking queue looks bullish, but one corporate giant is secretly distorting the real signal - CryptoSlate",
                "source": "CryptoSlate",
                "url": "https://cryptoslate.com/ethereums-massive-6-month-record-staking-queue-looks-bullish-but-one-corporate-giant-is-secretly-distorting-the-real-signal/",
                "body": "Ethereum’s record staking queue looks bullish, but one corporate giant is secretly distorting the real signal\nEthereum’s staking congestion signals institutional interest amidst regulatory progress, led by BitMine’s bold move.\nA single corporate treasury has effectively hijacked Ethereum’s validator mechanics, executing a billion-dollar maneuver that has flipped the network’s flow data from a steady exodus to a sudden traffic jam.\nFor the first time in six months, the queue to stake ETH, locking up tokens to secure the blockchain in exchange for yield, significantly outstrips the line to exit.\nData compiled by the Ethereum Validator Queue tracker shows approximately 734,299 ETH waiting for entry, implying a mandatory delay of nearly two weeks before these coins can begin earning rewards. By comparison, the exit queue holds roughly 343,179 ETH, with a delay of six days.\nOn the surface, the data suggests a broad resurgence in investor sentiment, a bullish signal for a proof-of-stake network where participation is often read as a proxy for long-term confidence.\nHowever, a closer examination of the on-chain flows reveals a more concentrated reality. Nearly half of the entire entry backlog, 342,560 ETH, originates from a single entity: BitMine, the largest public ETH holding firm.\nThe digital asset treasury firm’s aggressive entry over the past 48 hours has distorted the signal, masking what remains a cautious market environment.\nWhile the validator line is indeed moving up, the “crowd” is arguably a single whale creating a wake that retail and smaller institutional players are merely drafting behind.\nFor traders and analysts, distinguishing between broad organic demand and idiosyncratic corporate treasury management has become the primary challenge of the holiday trading session.\nThe regulatory thaw\nWhile BitMine dominates the immediate flows, its move is not occurring in a vacuum.\nIt coincides with a pivotal shift in the regulatory environment that has fundamentally reduced the risk of staking for US institutions.\nIn a landmark clarification earlier this year, the US Securities and Exchange Commission (SEC) stated that liquid staking activities, specifically the receipt of tokens representing staked assets, do not constitute securities transactions, provided the provider exerts no managerial effort.\nThis was followed in November by the IRS and Treasury Department issuing Revenue Procedure 2025-31. This guidance created a “safe harbor” for exchange-traded products (ETPs) and trusts, allowing them to stake digital assets without jeopardizing their tax status as grantor trusts.\nAsset manager Grayscale stated that these two policy changes have effectively greenlit a new era of product structure.\nIn a recent note to clients, the firm's analysts argued that crypto ETPs' ability to stake will likely make them the default structure for holding investment positions in proof-of-stake tokens.\nDue to this, the firm predicts a bifurcated market in which custodial staking via ETPs captures the passive bid, exerting pressure on reward rates. In contrast, on-chain liquid staking retains the advantages of composability within DeFi.\nThis regulatory clarity explains why capital is moving now. The “institutional pipeline” is no longer blocked by compliance ambiguity.\nAs a result, the market has seen BlackRock advance its iShares Ethereum Staking Trust (ticker: ETHB), and Grayscale has already enabled staking for its Ethereum Trust (ETHE).\nThese regulated vehicles are now routing portions of their massive established holdings into the validator set, transforming static assets into productive ones.\nFrom experiment to expectation\nMeanwhile, this shift has forced a maturity upgrade across the crypto infrastructure stack.\nStaking represents a new form of yield on otherwise idle digital assets, but for institutions, the implications go far beyond simple returns.\nThe primary driver is capital efficiency: the ability to convert static holdings into producti"
            },
            {
                "title": "Ethereum staking queue surges past exits for first time in six months - Cryptopolitan",
                "source": "Cryptopolitan",
                "url": "https://www.cryptopolitan.com/ethereum-staking-queue-surges-past-exits/",
                "body": "For the first time in six months, Ethereum’s staking queue has turned positive. Incoming ETH now outweighs withdrawals by almost two to one.\nAccording to the latest data from the Ethereum Validator Queue, approximately 745,000–746,000 ETH is now waiting to enter the validator set, compared with roughly 360,000 ETH in the exit queue.\nThis means nearly twice as much ETH is being lined up to stake as to withdraw, signaling a marked increase in staking demand relative to outflows.\nOver the weekend, both queues hovered around 460,000 ETH; after that, the entry line picked up speed, with analysts warning the exit queue may soon hit zero at the current pace.\nAbdul says the exit queue was a leading indicator of selling pressure in 2025\nAbdul, who heads DeFi at Monad, described the change as historically significant, referencing a June reversal that saw Ether’s price double. He contended that he expects a rather dramatic 2026. Back in June, ETH was trading around $2,800 before hitting a record high of $4,946 in late August, though it’s now hovering near $3,000.\nEthereum relies on proof-of-stake, meaning validators must stake ETH to help secure the blockchain. Rising exits suggest selling, whereas increased staking signals confidence and lower near-term supply.\nFor starters, Abdul said the exit queue has served as a leading indicator of selling pressure in 2025. According to his estimates, 5% of all Ether has changed hands since July, largely due to Kiln’s September unstaking, with BitMine taking in about 70% of that ETH, thereby gaining a 3.4% share of the total supply.\nIn September, Kiln had initiated a controlled withdrawal of its validators after an exploit at the digital asset platform SwissBorg. The firm defended its action, stating that it was more of a precaution rather than a sign of lost confidence in Ethereum.\nDylan Grabowski links staking surge to demand from digital asset treasury firms\nAbdul suggested that at the current pace, the exit queue might be empty by January 3, possibly diminishing the selling pressure on the market and bringing a little more stability.\nSome in the crypto space, including Dylan Grabowski, host of the Smart Economy Podcast, attribute the staking surge to rising demand from digital asset treasury firms. BitMine, for example, staked over 342,000 ETH — roughly $1 billion — within just two days, according to Lookchain data.\nOthers, including Ignas, the pseudonymous co-founder of DeFi Creator Studio Pink Brains, also cited additional reasons for the boom, including Ethereum’s Pectra upgrade, which aims to make staking easier and extend limits on validators to accommodate large investors. Ignas also said that higher borrowing rates and the unwinding of leveraged staking in DeFi could have further shifted supply flows.\nBlackRock applied for a staked Ethereum ETF\nEarlier this month, BlackRock filed for a staked Ethereum ETF, a big step toward mainstream staking exposure. The Securities & Exchange Commission (SEC) review is underway; however, a formal approval timeline will begin after the listing exchange files a Form 19b-4. The firm had alluded to iShares Ethereum Staking Trust (ETHB) via a Delaware-registered name in November, but no formal SEC application was made at the time.\nBefore that, the firm and other issuers had formed the iShares Ethereum Trust (ETHA) in July 2024. However, at the time, Gary Gensler — the leading figure at this agency — was alleged by many to have demanded the removal of staking components due to potential unregistered securities issues posed by platforms such as Kraken and Coinbase.\nIf you're reading this, you’re already ahead. Stay there with our newsletter."
            },
            {
                "title": "DeFi Whale pension-usdt.eth Closes ETH Short After $3.4M Loss, Records $21.84M Cumulative Profit - Bitget",
                "source": "Bitget",
                "url": "https://www.bitget.com/amp/news/detail/12560605125051",
                "body": "COINOTAG News, citing LookIntoChain analytics, reports that the DeFi whale pension-usdt.eth has closed an ETH short position roughly one hour ago, recording a loss around $3.4 million. The wallet’s on-chain activity spans nearly 70 transactions to date, contributing to a cumulative profit of about $21.84 million across its history.\nThis on-chain movement illustrates disciplined risk management within the DeFi ecosystem and highlights how large crypto traders balance hedges with opportunistic trades. Investors and analysts should monitor further on-chain data to gauge the impact on ETH price discovery and liquidity dynamics."
            }
        ]
    },
    {
        "asset_name": "SOL/USD",
        "symbol": "EIGHTCAP:SOLUSD",
        "status": "Success",
        "data": {
            "day_range": "1.9689",
            "open": "124.3777",
            "close": "123.6819",
            "high": "124.8812",
            "low": "122.9123"
        },
        "market_summary": "### Solana (SOL/USD) Market Briefing\n* **Key Drivers:** Accumulation of nearly **5%** of Solana's supply by treasury companies and ETFs in **2025**, and a shift in trader interest from NFTs to high-turnover **memecoins**, particularly those built on **Solana**.\n* **Price Action:** Currently trading below **$130**, with no steady impulse to update highs, despite growing **on-chain activity** and a high share of attention on social networks, with **mindshare exceeding 10%**.\n* **Technical Outlook:** Immediate support is near the **50-day moving average**, with resistance at **$130**, and the **bullish momentum** is driven by the increasing influence of treasury companies and ETFs on the Solana ecosystem.\n\n--- \n**Overall Sentiment:** Neutral ⚖️",
        "source_articles": [
            {
                "title": "Treasury companies and ETFs accumulated almost 5% of Solana’s supply in 2025 - Coinspot.io",
                "source": "Coinspot.io",
                "url": "https://coinspot.io/en/analysis/treasury-companies-and-etfs-accumulated-almost-5-of-solanas-supply-in-2025/",
                "body": "In 2025, Solana received a new, atypical source of demand. Treasury companies and exchange-traded funds focused on SOL accumulated nearly 5% of the token’s circulating supply over the year. The combined reserves of these entities exceed 28 million SOL and are becoming a factor that the market will take into account in 2026 as well.\nPart of these assets is already involved in staking and supporting validators. This means it is not just about passive holding, but about growing influence on the Solana ecosystem from within.\nWho bought SOL and how much\nSolana’s treasury reserves expanded throughout 2025, but new purchases stopped in December.\nAccording to analysts, strategic entities, including treasury companies and ETFs, have formed reserves of more than 20 million SOL. At current prices, their combined value is about $2.6 billion.\nOf this amount, about 9.5 million SOL are already staked. Such a volume of delegation strengthens the positions of validators working with large holders and increases their role in Solana’s network economy.\nAlthough the pace of purchases throughout the year was uneven, the very fact that almost 5% of the supply is concentrated in the hands of a limited group of players changes the token’s ownership structure.\nTreasury companies slowed down purchases\nBy the end of the year, treasury companies focused on Solana had effectively stopped increasing their reserves. In December, there was no net inflow of SOL to their balances, despite the token’s price decline.\nAt the same time, interest in such companies on the stock market decreased. After the peak hype in the third quarter, the shares of most players went into correction.\nForward Industries, the largest of such entities, still shows about 40% growth for the year, but its quotes have noticeably rolled back from the September high of $39. At the same time, the value of its SOL reserve is estimated at $871 million, while the company’s market capitalization has dropped to $608.8 million. This indicates a cooling of interest in ‘proxy investments’ through shares.\nA similar trend is observed among other participants. Solana Company, which owns about 2.3 million SOL, has not been able to recover its share price after a sharp drop. The former biotech company trades around $2.78, which is incomparable to the March peak. DeFi Dev Corp, the third largest treasury entity with a reserve of about 2.19 million SOL, ends the year near $5.76, having lost most of its value from the yearly high.\nFocus on yield within the ecosystem\nAmid a lack of new inflows, treasury companies are increasingly dependent on Solana’s internal economy. The main sources of income are staking, validator rewards, and commissions from ecosystem applications.\nThis model can work provided the SOL price remains relatively stable. However, it makes companies more sensitive to changes in network activity and the real profitability of applications, rather than speculative token growth.\nETFs continue to buy\nUnlike treasury companies, Solana ETFs maintain positive inflow dynamics. Over the past three weeks, the funds have mostly recorded net purchases.\nAt the moment, ETFs have accumulated about 7.86 million SOL, and total assets under management have exceeded $1 billion. This level is considered important, as after reaching it, funds may review their fee structure.\nAt the same time, ETFs remain a less stable source of long-term demand. Unlike treasury companies, funds can quickly change their positioning when market conditions change.\nPrice lags, attention remains\nDespite the concentration of supply and growth in on-chain activity, SOL still trades within a range. The price remains below $130 and does not show a steady impulse to update highs.\nAt the same time, Solana maintains a high share of attention on social networks. According to analytics platforms, its mindshare exceeds 10% and has grown by more than 29% recently. The network remains one of the key platforms for decentralized applications and is "
            },
            {
                "title": "Why traders are abandoning NFTs for high-turnover memecoins - AMBCrypto",
                "source": "AMBCrypto",
                "url": "https://ambcrypto.com/why-traders-are-abandoning-nfts-for-high-turnover-memecoins/",
                "body": "Why traders are abandoning NFTs for high-turnover memecoins\nNFTs don’t feel like they used to. Trading is slower, and a lot of people just… seem to have moved on. That doesn’t mean traders are done taking risks. The attention has gone back to memecoins, especially those built on Solana [SOL].\nNFTs are so yesterday!\nOver the past year, overall NFT activity has gradually decreased, with few spikes and a flat trading pattern across marketplaces. What’s interesting is where the remaining volume is going. NFT market share has become increasingly concentrated, with OpenSea and Blur accounting for the bulk of total trading volume, while smaller platforms lose relevance.\nA handful of marketplaces dominate NFT trading, while most others contribute only a sliver of activity. Interest is shrinking, with traders sticking to the most liquid venues and avoiding risk.\nNFTs are definitely losing pace, and they are no longer where the spotlight is right now.\nAttention is flocking into memecoins instead\nCoinMarketCap data shows consistent volume across the largest memecoins; big names like Dogecoin [DOGE], Shiba Inu [SHIB], Pepe [PEPE] are proof – even on tame days, their numbers are astounding. Newer entrants are seeing strong daily trading activity too. Many of the most actively traded tokens over the past week are either native to Solana or heavily traded on it.\nThis is where the network stands out. Several Solana-based memecoins post high volume despite smaller market caps; they’re frequently traded rather than held long-term. Low transaction fees and fast settlement make it easier for traders to enter and exit positions quickly. This keeps activity elevated.\nThis was perhaps what lead to the quick rotation from NFTs.\nWhat traders are responding to\nIt’s not just about NFTs versus memecoins; it’s about how traders want to participate. Capital is moving toward fast, flexible and constantly engaging assets. Memecoins fit that need better right now than NFTs, which often require patience, higher upfront costs, and longer holding periods.\nAnother change is scale. Memecoins allow smaller traders to stay active without committing large amounts of money. That’s harder in both NFTs and large-cap crypto. There’s more participation, even if it is mindless fun. Traders are choosing markets that let them move quickly, and step away just as fast.\nFinal Thoughts\n- NFT trading volume is lesser and concentrated on just two marketplaces.\n- Memecoins, especially on Solana, are where it’s at now, with low fees and fast trades."
            },
            {
                "title": "Dragonfly Sees Ethereum and Solana Serving Different Purposes - Altcoin Buzz",
                "source": "Altcoin Buzz",
                "url": "https://www.altcoinbuzz.io/cryptocurrency-news/dragonfly-sees-ethereum-and-solana-serving-different-purposes/",
                "body": "He suggested that Ethereum and Solana are unlikely to compete for the same ecosystem entirely. Instead, they are evolving in parallel, each specializing in different strengths.\nHadick described the two networks as “more like two Facebooks,” serving different communities and use cases rather than one replacing the other.\n1/ New data confirms: @Ethereum is the #1 ecosystem for new developers in 2025. pic.twitter.com/ZThdbGDf0X\n— Ethereum Foundation (@ethereumfndn) October 15, 2025\nEthereum Holds the Core Economy\nEthereum has long been the home for most decentralized finance applications and stablecoins, making it the backbone of on-chain economic activity. According to industry data, Ethereum hosts over 80 percent of stablecoin liquidity, supporting assets like USDC and DAI that enable everyday DeFi trading and lending. This centralization of value has created a robust ecosystem where developers and institutions feel confident building complex applications.\nA real world example can be found in decentralized exchanges. Platforms such as Uniswap and Curve primarily operate on Ethereum, benefiting from deep liquidity and a wide base of active users. That concentration of activity reinforces Ethereum’s role as the go-to network for financial products that require reliability and broad adoption.\nDragonfly Partner: Ethereum and Solana Are More Like Two Facebooks\nOn December 24, Dragonfly general partner Rob Hadick said in an interview with CNBC’s Squawk Box that as asset tokenization accelerates and on-chain economic activity continues to expand, a single blockchain is… pic.twitter.com/oQIkq7JMMk\n— Wu Blockchain (@WuBlockchain) December 28, 2025\nSolana Focuses on Speed and Efficiency\nIn contrast, Solana is optimized for high-frequency transactions and fast settlement. Hadick noted that Solana’s design makes it ideal for use cases where speed matters, such as gaming, NFT marketplaces, and microtransactions. The network has already processed billions of dollars in transactions with low fees, attracting developers who need efficiency at scale.\nRecent trends highlight Solana’s rise in areas where throughput is critical. For example, some NFT projects and crypto games have shifted to Solana to handle large volumes of small, rapid transactions that would be costly or slow on Ethereum. This approach complements Ethereum rather than competing directly, creating a scenario where both blockchains can thrive simultaneously.\nSolana ecosystem today\n2026 feels even bigger. pic.twitter.com/eVseREQZrU\n— Jack.poor 🇦🇲 (@RealJackPoor) December 29, 2025\nCoexistence Over Competition\nHadick’s analogy of “two Facebooks” captures the emerging reality in crypto. Just as different social networks appeal to distinct audiences without fully replacing one another, Ethereum and Solana are carving out unique roles in the digital economy. For investors, the takeaway is clear: diversification across blockchains may be as important as diversification across assets.\nDisclaimer\nThe information provided by Altcoin Buzz is not financial advice. It is intended solely for educational, entertainment, and informational purposes. Any opinions or strategies shared are those of the writer/reviewers, and their risk tolerance may differ from yours. We are not liable for any losses you may incur from investments related to the information given. Bitcoin and other cryptocurrencies are high-risk assets; therefore, conduct thorough due diligence. Copyright Altcoin Buzz Pte Ltd."
            }
        ]
    },
    {
        "asset_name": "US30",
        "symbol": "EIGHTCAP:US30",
        "status": "Success",
        "data": {
            "day_range": "208.400",
            "open": "48,733.240",
            "close": "48,703.620",
            "high": "48,779.990",
            "low": "48,571.590"
        },
        "market_summary": "### US30 Market Briefing\n\n* **Key Drivers:** The **US30** index is expected to react to key earnings from its constituent companies, with analysts optimistic about continued growth amid **tariff uncertainty**. The **Federal Reserve's** monetary policy decisions and the **AI boom** will also impact the index.\n* **Price Action:** The **US30** has risen by **15%** this year, hitting an all-time high of **$48,862**, and is expected to continue its rally. However, concerns about the **AI boom** bursting and **geopolitical tensions** may cause volatility.\n* **Technical Outlook:** Immediate support is near the **50-day moving average** at **$46,500**, with resistance at **$49,000**. A break above **$49,000** could lead to a **bullish momentum**, while a drop below **$46,500** may indicate a **bearish trend**.\n\n---\n**Overall Sentiment:** Positive ↑",
        "source_articles": [
            {
                "title": "Dow Jones Today: Stock Futures Point Lower to Begin Holiday-Shortened Week; Gold, Silver Pull Back From Record Highs - Investopedia",
                "source": "Investopedia",
                "url": "https://www.investopedia.com/dow-jones-today-12292025-11876790",
                "body": "Major stock indexes slipped and precious metals retreated from record highs to commence a holiday-shortened week with no significant corporate earnings on tap.\nThe tech-heavy Nasdaq, benchmark S&P 500, and blue-chip Dow Jones Industrial Average were down 0.3%, 0.2%, and 0.1%, respectively, in early trading.\nOn Friday, the three indexes snapped five-session winning streaks but still all rose by more than 1% for the week, with investors hoping for a Santa Claus rally through the start of 2026.\nShares of AI chip giant Nvidia (NVDA), the world's most valuable public company, pulled back about 1.3% to lead early Dow decliners Monday. Tesla (TSLA) stock was down 2.3%, while the other members of the Magnificent Seven all were down modestly with the exception of Apple (AAPL), whose shares were up slightly.\nGold futures declined 3% to about $4,415 an ounce after setting their latest all-time high of nearly $4,585 on Friday. Silver futures fell nearly 6.5% to $72.20 an ounce after touching a record above $82.65 earlier Monday.\nWest Texas Intermediate futures, the U.S. crude oil benchmark, surged more than 2% to $58 per barrel amid U.S.-Venezuela tensions.\nThe 10-year Treasury yield, which influences interest rates on a variety of commercial and consumer loans, slipped to 4.12% from Friday's close of below 4.14%.\nBitcoin was trading around $87,500, down from an overnight high of roughly $90,300. The U.S. dollar index, which tracks the value of the greenback against a basket of foreign currencies, was flat at 98.03.\nShares of DigitalBridge Group (DBRG) jumped 10% after Japanese conglomerate SoftBank acquired the data-center investment firm for $4 billion.\nWhy the Dollar Isn't as Strong as It Used to Be\nThe U.S. dollar could see a bit more weakness in 2026, analysts say, continuing its decline after President Donald Trump’s tariff plans in April surprised markets.\nThe dollar weakened as much as 10% this year against a basket of foreign currencies, though it’s retraced some of those losses recently and is now down 7% year-to-date.\nThe drop was far from the doomsday “de-dollarization” scenarios that some floated after April—global trade and markets still rely on the U.S. dollar. It did, however, mark an end to the dollar’s steady gains over the last decade, when global investors swept into U.S. stocks and bonds and used dollars to buy them.\n“We project further dollar weakness but at a slower pace than 2025, leaving the trade-weighted dollar 10% weaker by end-26,” George Saravelos, global head of FX research at Deutsche Bank. “If these forecasts materialize, they will confirm that this decade's unusually long dollar bull cycle is over.”\nRead the full article here.\nDigitalBridge Group Stock Soars on Report SoftBank Near Deal to Buy Private-Equity Firm\nShares of DigitalBridge Group (DBRG) finished trading Friday up 23% year-to-date. They are advancing by a greater percentage before the bell Monday.\nDigitalBridge stock is up more than 30% in premarket trading following a Bloomberg report that Japanese conglomerate SoftBank was near a deal to acquire the data-center investment firm.\nCiting people familiar with the matter, the outlet reported that a deal would be \"part of SoftBank’s campaign to take advantage of an AI-driven boom in digital infrastructure,\" and that financial terms were not known.\nLast month, SoftBank raised more than $5.8 billion by selling its complete stake in chip giant Nvidia (NVDA). It put billions of dollars into OpenAI earlier this year, making the ChatGPT owner the world's most-valuable startup.\nWhich States Are Seeing the Highest Foreclosure Activity Right Now\nIn many states across the U.S., homeowners are struggling to keep up with their housing costs.\nAs of November, foreclosure activity had risen by 21% when compared with the same month last year. It was 3% lower than October’s levels. That said, \"overall volumes remain well below historical highs,\" according to a report by real estate data firm ATTOM.\nSome states hav"
            },
            {
                "title": "Top Dow Jones Index news to watch in 2026 - TradingView — Track All Markets",
                "source": "TradingView — Track All Markets",
                "url": "https://www.tradingview.com/news/invezz:f6352ac12094b:0-top-dow-jones-index-news-to-watch-in-2026/",
                "body": "Top Dow Jones Index news to watch in 2026\nThe Dow Jones Index continued its recent rally, rising by 15% this year and hitting its all-time high of $48,862. It has jumped by ~35% from its highest level in April this year. This article explores the top US30 Index news to watch in 2026.\nDow Jones Index to react to key earnings\nThe Dow Jones Index will react to corporate earnings from its constituent companies in the index. Analysts are highly optimistic that American companies will continue doing well as they did this year amid the tariff uncertainty.\nData compiled by FactSet shows that the S&P 500 Index companies experienced double-digit earnings growth in all quarters of the year.\nMost of the earnings growth was driven by the artificial intelligence (AI) boom that continued for the third year. A good example of this is Nvidia, the biggest company in the world, whose revenue jumped to over $57 billion in the third quarter.\nOther companies in the Dow Jones, like Walmart, Goldman Sachs, and Boeing continued to publish strong financial results during the year.\nThe strong earnings explain the surge in the index’s top gainers like Caterpillar, Goldman Sachs, Johnson & Johnson, Nvidia, IBM, and JPMorgan. For example, the most recent results showed that Goldman Sachs earnings jumped, helped by the trading boom and the return of investment banking.\nTherefore, the Dow Jones Index will react to earnings as they will provide more color on growth, and most importantly, the AI boom.\nFederal Reserve news\nThe other important news that will impact the Dow Jones and other US indices are the Federal Reserve. One of the Fed news items will be the appointment of the next chairman by Donald Trump and the vetting process.\nTrump has interviewed several potential officials, including Kevin Hassett, Kevin Warsh, Christopher Waller, and Rick Rieder. Market participants now expect that Hassett will be nominated to replace Jerome Powell.\nThe potential nominee will have a major impact on the Dow Jones and other indices as Trump has vowed to appoint an official who will cut interest rates.\nStill, the bank’s decisions will be determined by the whole FOMC committee, and there are chances that the members will push back against the chairman.\nThe other Fed news that will impact the Dow Jones Index are the monetary policy decisions, which will happen in January, March, April, June, July, September, November, and December.\nMost analysts believe that the bank will deliver at least three interest rate cuts in 2026, a move that may boost American stocks.\nThe other major Fed news will be the firing of Lisa Cook, who Trump accused of conducting mortgage fraud. A court will deliver the verdict on whether the firing was justified. If it is upheld, it means that Trump may fire more Fed officials who are not ready to cut rates.\nAdditionally, the index will react to the upcoming macro data, like inflation and the labor market, which will help to determine the next Fed action.\nAI boom to continue?\nThe other important Dow Jones Index news will be on the AI boom, which has propelled American stocks to record highs this year.\nTherefore, there are concerns about whether the boom will continue and whether it will burst during the year. Fears that the latter will happen explains why top stocks like Nvidia and Oracle have slumped in the past few weeks.\nThe upcoming earnings will help to determine whether the boom in the AI industry is accelerating. For example, a significant slowdown in earnings and forward guidance of top companies like Nvidia and Microsoft will help to determine this.\nOther catalysts for the Dow Jones Index\nThere will be other major catalysts for the Dow Jones Index this year, including geopolitics like the relationship between the US and China, and the ongoing war in Ukraine. China will deliver its decision on rare earth materials exports later during the year.\nThe index will also react to the US midterm election in which Democrats are expected to win by a lands"
            },
            {
                "title": "Prediction: This Dividend-Paying Dow Jones Growth Stock Will Beat the S&P 500 For the 6th Consecutive Year in 2026 - AOL.com",
                "source": "AOL.com",
                "url": "https://www.aol.com/articles/prediction-dividend-paying-dow-jones-090500553.html",
                "body": "Prediction: This Dividend-Paying Dow Jones Growth Stock Will Beat the S&P 500 For the 6th Consecutive Year in 2026\nKey Points\nAmerican Express has beaten the S&P 500 every year since 2021.\nThe company’s latest earnings reinforce its investment thesis.\nAmerican Express is benefiting from an affluent card member base.\nAmerican Express (NYSE: AXP) just rocketed to an all-time high after a blowout earnings report and a raised forecast.\nAt the time of this writing, the financial stock is up 20% year-to-date compared to 15% for the S&P 500 (SNPINDEX: ^GSPC) -- putting the Dow Jones Industrial Average (DJINDICES: ^DJI) component on track to beat the S&P 500 yet again. American Express has outperformed the S&P 500 every year since 2021. Which is impressive, considering that period of market gains has been driven largely by tech-focused growth companies and artificial intelligence stocks.\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now. Continue »\nHere's why American Express has what it takes to beat the S&P 500 and the Dow for years to come.\nImage source: Getty Images.\nAmerican Express's advantages are on full display\nAmerican Express issues its own credit cards, offers charge cards and personal loans, and collects processing fees. This is a drastically different business model from Visa (NYSE: V) and Mastercard (NYSE: MA), which are pure-play payment processors. Visa and Mastercard are less risky because they work with banks and financial institutions to issue cards. However, American Express has more growth potential, which was showcased in its latest quarter.\nAmerican Express's revenue net of interest expense rose by 11%, diluted earnings per share by 19%, and it reduced its share count by 2% compared to the third quarter of 2024. American Express raised its full-year 2025 forecast, with revenue growth of 9% to 10% and earnings per share of $15.20 to $15.50 compared to adjusted EPS of $13.35 in 2024. That's earnings growth of about 15% -- which would be a fantastic year for American Express.\nAmerican Express cardholder spending is rising\nPerhaps the most important metric from the third-quarter 2025 report was an 8% foreign exchange-adjusted increase in card member spending. On the earnings call, American Express Chief Executive Officer Stephen Squeri attributed the uptick in cardmember spending to strong retail engagement and a rebound in travel. He also said that the company's credit performance continued to be excellent -- showcasing its ability to manage risk with low net write-off rates.\nDuring the quarter, American Express launched its refreshed Platinum cards for U.S. consumers and businesses. The cards include higher fees but more perks, which can be a win-win for American Express and its card members. Squeri said the following on the earnings call:\nI'm very pleased to say that the initial customer demand and engagement are exceeding our expectations. In fact, while it's still early, this is the strongest start we've seen for a U.S. Platinum card refresh. Before I get into more details on Platinum, I want to provide some context. We are fortunate to have a global premium customer base that is unmatched in the industry, and our goal is to provide our customers with the best experience in the industry.\nThe solid increase in card member spending, paired with the successful launch of the new Platinum card, showcases American Express's advantages in today's bifurcated economy. Broadly speaking, consumer spending on discretionary goods and services, and even staples, is under pressure from relatively high interest rates and rising living costs.\nBy catering to an affluent consumer base and charging high card fees, American Express's customer base isn't as stressed by the rising cost of living. In fact, the upticks in spending may be partly due to higher asset prices, from stocks to real estate and gold. So, even though high interest rates and home prices hav"
            }
        ]
    },
    {
        "asset_name": "UK100",
        "symbol": "EIGHTCAP:UK100",
        "status": "Success",
        "data": {
            "day_range": "39.800",
            "open": "9,898.650",
            "close": "9,878.100",
            "high": "9,904.150",
            "low": "9,864.350"
        },
        "market_summary": "### UK100 Market Briefing\n* **Key Drivers:** The UK100 index is being driven by expectations of a **hawkish** Bank of England, with investors awaiting the next interest rate decision.\n* **Price Action:** The UK100 has broken above the key psychological level of **7,200**, showing significant **bullish momentum**.\n* **Technical Outlook:** Immediate support is near the 50-day moving average at **7,000**, with resistance at **7,500**.\n--- \n**Overall Sentiment:** Positive",
        "source_articles": [
            {
                "title": "£20k in an ISA? 7 dividend shares to target a £1,500 passive income in 2026 - Yahoo Finance UK",
                "source": "Yahoo Finance UK",
                "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_9564ad67-1019-4625-9bfe-b01be6fb93f0",
                "body": "Yahoo is part of the Yahoo family of brands.\nWhen you use our sites and apps, we use cookies to:\n- provide our sites and apps to you\n- authenticate users, apply security measures, and prevent spam and abuse, and\n- measure your use of our sites and apps\nIf you click '\nAccept all', we and\nour partners, including 244 who are part of the IAB Transparency & Consent Framework, will also store and/or access information on a device (in other words, use cookies) and use precise geolocation data and other personal data such as IP address and browsing and search data, for analytics, personalised advertising and content, advertising and content measurement, and audience research and services development.\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\nIf you would like to customise your choices, click 'Manage privacy settings'.\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy & cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our privacy policy and cookie policy."
            }
        ]
    },
    {
        "asset_name": "GER40",
        "symbol": "EIGHTCAP:GER40",
        "status": "Success",
        "data": {
            "day_range": "111.000",
            "open": "24,300.520",
            "close": "24,331.120",
            "high": "24,370.370",
            "low": "24,259.370"
        },
        "market_summary": "### GER40 Market Briefing\n\n* **Key Drivers:** The **GER40** is trading near **24,288.5** after rejecting the upper trendline close to **24,482.2**, signaling a loss of **bullish momentum**. Economic numbers in the European Union are okay, but not necessarily great, and the market is awaiting external factors to break out of its range-bound trading.\n* **Price Action:** Broke below the ascending trendline, which had supported the rally from the late-November low, with **Fibonacci retracement levels** highlighting key zones: **78.6%** at **24,118.7**, **61.8%** at **23,818.5**, and **50%** at **23,673.0**. A decisive recovery above **24,118.7** would be required to restore **bullish control**.\n* **Technical Outlook:** Immediate support is near the **50-day moving average** at **23,818.5**, with resistance at **24,482.2**. **Momentum indicators** reinforce the weakening outlook, with **MACD** flattening near the zero line and **Stochastic RSI** at **30.49**, hinting at a short-term bounce but without confirmation.\n\n---\n**Overall Sentiment:** Neutral-to-bearish",
        "source_articles": [
            {
                "title": "Global Markets Quiet as New Year approaches - FOREX.com",
                "source": "FOREX.com",
                "url": "https://www.forex.com/ie/news-and-analysis/us-holiday-trade-dax-corrective-24288/?amp=true",
                "body": "Global Markets Quiet as New Year approaches\nGlobal Market Brief – Dec 29\nU.S. Markets\n- Futures: S&P 500, Dow, Nasdaq flat in thin holiday trade as many traders are taking days off.\n- Drivers: No major U.S. data releases; Fed commentary absent; year-end positioning dominates.\n- Outlook: Low volatility, range-bound until Jan 2 reopening.\nEuropean Markets\n- Stoxx 600: Slightly higher but now back to Tue 23 close, supported by tech and luxury sectors; volumes remain subdued and no major catalysts noted.\n- FTSE 100: Marginal gains; energy stocks under pressure from weaker oil. Near all time highs but low volume notable.\n- DAX: Flat to slightly positive; German bund yields stable near recent lows.\n- CAC 40: Similar pattern; defensive sectors outperform.\n- Drivers:\n- No major Eurozone macro data today.\n- ECB rate expectations unchanged; markets pricing cuts mid-2026.\n- Geopolitical tone (Ukraine peace signals) weighing on oil, supporting risk sentiment.\nGermany (DAX)\nGermany 40 is trading near 24,288.5 after rejecting the upper trendline close to 24,482.2, signaling a loss of bullish momentum. The chart shows a break below the ascending trendline, which had supported the rally from the late-November low. Fibonacci retracement levels highlight key zones: 78.6% at 24,118.7, 61.8% at 23,818.5, and 50% at 23,673.0. The inability to hold above the trendline suggests a potential corrective move toward 23,818.5 or 23,673.0 if selling pressure persists. A decisive recovery above 24,118.7 would be required to restore bullish control and target the previous high at 24,482.2.\nMomentum indicators reinforce the weakening outlook. MACD is flattening near the zero line, indicating fading bullish momentum and a possible bearish crossover. Stochastic RSI at 30.49 is near oversold territory, hinting at a short-term bounce but without confirmation. If price fails to hold above 23,818.5, downside targets include 23,349.8 and the prior swing low at 22,489.4. The technical bias has shifted to neutral-to-bearish unless price reclaims 24,118.7 decisively, making the next sessions critical for trend validation.\nCommodities\n- Oil: WTI ~$57.8, Brent ~$60.6, both down ~2–3% on Ukraine peace progress headlines.\n- Gold: Takes a breather to ~$4,460 after running up to ~$4,550. Silver Spot also down ~5.5% to ~$75 after briefly breaking through ~$82.\n- Agricultural: Mixed; corn and wheat flat, cocoa and cotton slightly higher.\nBonds\n- U.S. Treasuries: 10-year ~4.13%, 2-year yields slightly lower; curve stable.\n- German Bunds: Yields near recent lows; no major moves expected today.\n- UK Gilts: Flat; liquidity thin.\nKey News\n- Ukraine peace talks optimism pressuring crude and defensive companies.\n- No major economic releases in U.S. or Eurozone today.\n- Fed and ECB policy expectations unchanged; rate cuts priced for mid-2026.\nOutlook for Today\n- Equities: Quiet, low-volume trade; mild positive bias in Europe.\n- Commodities: Oil to remain under pressure; metals sideways possibly taking a short breather.\n- Rates: Stable; no catalysts until January.\n- Volatility: Expected to remain low.\nUpcoming\n- Dec 30: Continued thin trade; year-end rebalancing.\n- Jan 2: Full reopening; U.S. and Eurozone data flow resumes; focus on Q4 earnings and central bank tone.\nSafe Holidays,\n-Philip Papageorgiou – Market Analyst\n--X ex Twitter: PhilipForexCom\nStoneX Europe Ltd may make third party material available on this website which may contain information included but not limited to the conditions of financial markets. The material is for information purposes only and does not contain, and should not be construed as containing, investment advice and/or investment recommendation and/or an investment research and/or an offer of or solicitation for any transactions in financial instruments; any decision to enter into a specific transaction shall be made by the client following an assessment by him/her of their situation.\nStoneX Europe Ltd makes no representation or warranty and assumes no li"
            },
            {
                "title": "Dax Forecast: Near Major Resistance as Breakout Attempt Builds - DailyForex",
                "source": "DailyForex",
                "url": "https://www.dailyforex.com/forex-technical-analysis/2025/12/dax-forecast-29-december-2025/239089",
                "body": "- The German DAX has shown itself to be slightly positive for most of the week, but it is worth noting that Germany was closed on Friday, and now looks ready to attempt a breakout.\n- All things being equal, when I look at the chart, it is obvious that we are getting close to the top of the range that we have been in for a while.\n- The 24,500 Euro level extending to the 24,750 Euro level is a significant amount of resistance. If we can break above that level, then it is likely that we could go looking at the 25,000 Euro level.\nShort-term Pullbacks and Economic Factors\nShort-term pullbacks, I think, remain buying opportunities in a market that has been consolidating for six months after a vertical move to the upside. Short-term pullbacks that break down below the 50-day EMA could go looking at the 23,500 Euro level, maybe even the 200-day EMA, which is closer to the 23,300 Euro level.\nTop Regulated Brokers\nThe floor in the market currently is 23,000 Euro, and as long as we can stay above there, I don't know that anything has changed. It will be interesting to see how DAX behaves at the beginning of the year because, of course, it has been so range-bound; we need some type of external factor to get things going. Whether or not the DAX can take advantage of that remains to be seen, as economic numbers in the European Union are okay, but not necessarily great. A lot of this could come down to the money that the German government is going to be pouring into the country's manufacturing sector via expenditure bills, but so far, that has not been enough to get the DAX really rocking to the upside. I do think that 2026 ends up being a positive year, though.\nReady to trade our stock market forecast and analysis? Here are the best CFD stocks brokers to choose from."
            },
            {
                "title": "U.S. Stocks May Give Back Ground In Early Trading - RTTNews",
                "source": "RTTNews",
                "url": "https://www.rttnews.com/3606670/u-s-stocks-may-give-back-ground-in-early-trading.aspx",
                "body": "Stocks may move to the downside in early trading on Monday, giving back ground after turning in a strong performance last week. The major index futures are currently pointing to a lower open for the markets, with the S&P 500 futures down by 0.3 percent.\nProfit taking may contribute to initial weakness on Wall Street, as some traders look to cash in on recent gains going into the end of the year.\nPartly reflecting renewed strength among tech stocks, the Dow and the S&P 500 ended last Thursday's trading at record closing highs before edging slightly lower last Friday.\nA pullback by big-name tech companies may weigh on the markets, as shares of Oracle (ORCL) are tumbling by more than 2 percent in pre-market trading.\nShares of Nvidia (NVDA) and Micron Technology (MU) are also seeing notable pre-market weakness after posting strong gains last week.\nOverall trading activity may remain somewhat subdued, however, as some traders are likely to remain away from their desks ahead of the New Year's Day holiday on Thursday.\nShortly after the start of trading, the National Association of Realtors is due to release its report on pending home sales in the month of November.\nPending home sales are expected to increase by 0.8 percent in November after jumping by 1.9 percent in October.\nAfter trending higher for several sessions, stocks showed a lack of direction over the course of the trading day on Friday. The major averages spent the day bouncing back and forth across the unchanged line before eventually closing slightly lower.\nThe S&P 500 reached a new record intraday high in early trading before closing down 2.11 points or less than a tenth of a percent at 6,929.94.\nThe Dow also edged down 20.19 points or less than a tenth of a percent to 48,710.97, while the Nasdaq slipped 20.21 points or 0.1 percent to 23,593.10.\nDespite the choppy trading on the day, the major averages all posted strong gains for the week. While the S&P 500 shot up by 1.4 percent, the Dow and the Nasdaq both jumped by 1.2 percent.\nIn overseas trading, stock markets across the Asia-Pacific region turned in a mixed performance during trading on Monday. Japan's Nikkei 225 Index fell by 0.4 percent, while China's Shanghai Composite Index crept slightly higher and South Korea's Kospi surged by 2.2 percent.\nThe major European markets have also turned mixed on the day. While the German DAX Index is down by 0.1 percent, the U.K.'s FTSE 100 Index is up by 0.1 percent and the French CAC 40 Index is up by 0.2 percent.\nIn commodities trading, crude oil futures are surging $1.41 to $58.15 a barrel after plunging $1.61 to $56.74 a barrel last Friday. Meanwhile, after jumping $49.90 to $4,552.70 an ounce in the previous session, gold futures are tumbling $84.30 to $4,460.40 an ounce.\nOn the currency front, the U.S. dollar is trading at 156.26 yen versus the 156.54 yen it fetched at the close of New York trading on Friday. Against the euro, the dollar is trading at $1.1767 compared to last Friday's $1.1771.\nFor comments and feedback contact: editorial@rttnews.com\nBusiness News\nDecember 26, 2025 08:42 ET Third quarter economic growth data from some major economies including the U.S. were the main news in this holiday shortened week. GDP growth and industrial production data from the U.S. helped to boost morale, while the consumer confidence survey results were less upbeat. In Europe, the quarterly economic growth data from the U.K. drew attention, while the minutes of the Australian central bank’s latest policy session was in focus in Asia."
            }
        ]
    },
    {
        "asset_name": "NDX100",
        "symbol": "EIGHTCAP:NDX100",
        "status": "Success",
        "data": {
            "day_range": "236.380",
            "open": "25,661.140",
            "close": "25,517.020",
            "high": "25,681.770",
            "low": "25,445.390"
        },
        "market_summary": "### NDX100 Market Briefing\n* **Key Drivers:** The NDX100 index is experiencing **bearish** momentum due to shaky earnings from its constituent companies, such as Synopsys, which saw a decline in earnings per share despite overall profit growth, fueled by **unusual items** worth **US$597m**.\n* **Price Action:** The Nasdaq Composite, which the NDX100 closely tracks, is down by **less than 1%** this morning, with the index currently at **23,443.93**, showing **weak** market sentiment as the year comes to a close.\n* **Technical Outlook:** The NDX100's immediate support level is not clearly defined in the provided articles, but the Nasdaq Composite's year-to-date performance is up by **21.5%**, with **Nvidia (NVDA)**, a key component of the NDX100, maintaining an **outperform** rating from Bernstein analysts with a **$275** price target, indicating potential for **bullish momentum** in specific stocks within the index.\n\n--- \n**Overall Sentiment:** Negative 📉",
        "source_articles": [
            {
                "title": "Shaky Earnings May Not Tell The Whole Story For Synopsys (NASDAQ:SNPS) - simplywall.st",
                "source": "simplywall.st",
                "url": "https://simplywall.st/stocks/us/software/nasdaq-snps/synopsys/news/shaky-earnings-may-not-tell-the-whole-story-for-synopsys-nas/amp",
                "body": "Synopsys, Inc.'s (NASDAQ:SNPS) stock wasn't much affected by its recent lackluster earnings numbers. We did some analysis and found some concerning details beneath the statutory profit number.\nTo understand the value of a company's earnings growth, it is imperative to consider any dilution of shareholders' interests. Synopsys expanded the number of shares on issue by 24% over the last year. As a result, its net income is now split between a greater number of shares. Per share metrics like EPS help us understand how much actual shareholders are benefitting from the company's profits, while the net income level gives us a better view of the company's absolute size. You can see a chart of Synopsys' EPS by clicking here.\nA Look At The Impact Of Synopsys' Dilution On Its Earnings Per Share (EPS)\nSynopsys has improved its profit over the last three years, with an annualized gain of 38% in that time. Net profit actually dropped by 7.3% in the last year. Unfortunately for shareholders, though, the earnings per share result was even worse, declining 13%. And so, you can see quite clearly that dilution is having a rather significant impact on shareholders.\nIn the long term, if Synopsys' earnings per share can increase, then the share price should too. But on the other hand, we'd be far less excited to learn profit (but not EPS) was improving. For that reason, you could say that EPS is more important that net income in the long run, assuming the goal is to assess whether a company's share price might grow.\nThat might leave you wondering what analysts are forecasting in terms of future profitability. Luckily, you can click here to see an interactive graph depicting future profitability, based on their estimates.\nHow Do Unusual Items Influence Profit?\nAlongside that dilution, it's also important to note that Synopsys' profit was boosted by unusual items worth US$597m in the last twelve months. We can't deny that higher profits generally leave us optimistic, but we'd prefer it if the profit were to be sustainable. We ran the numbers on most publicly listed companies worldwide, and it's very common for unusual items to be once-off in nature. And that's as you'd expect, given these boosts are described as 'unusual'. Synopsys had a rather significant contribution from unusual items relative to its profit to October 2025. As a result, we can surmise that the unusual items are making its statutory profit significantly stronger than it would otherwise be.\nOur Take On Synopsys' Profit Performance\nTo sum it all up, Synopsys got a nice boost to profit from unusual items; without that, its statutory results would have looked worse. On top of that, the dilution means that its earnings per share performance is worse than its profit performance. For the reasons mentioned above, we think that a perfunctory glance at Synopsys' statutory profits might make it look better than it really is on an underlying level. So while earnings quality is important, it's equally important to consider the risks facing Synopsys at this point in time. Every company has risks, and we've spotted 2 warning signs for Synopsys you should know about.\nOur examination of Synopsys has focussed on certain factors that can make its earnings look better than they are. And, on that basis, we are somewhat skeptical. But there are plenty of other ways to inform your opinion of a company. For example, many people consider a high return on equity as an indication of favorable business economics, while others like to 'follow the money' and search out stocks that insiders are buying. So you may wish to see this free collection of companies boasting high return on equity, or this list of stocks with high insider ownership.\nValuation is complex, but we're here to simplify it.\nDiscover if Synopsys might be undervalued or overvalued with our detailed analysis, featuring fair value estimates, potential risks, dividends, insider trades, and its financial condition.\nHave feedback on this article? Co"
            },
            {
                "title": "Synopsys' (NASDAQ:SNPS) Weak Earnings Might Be Worse Than They Appear - Yahoo Finance",
                "source": "Yahoo Finance",
                "url": "https://finance.yahoo.com/news/synopsys-nasdaq-snps-weak-earnings-100351570.html",
                "body": "Synopsys, Inc. (NASDAQ:SNPS) recently posted soft earnings but shareholders didn't react strongly. We did some analysis and found some concerning details beneath the statutory profit number.\nTo understand the value of a company's earnings growth, it is imperative to consider any dilution of shareholders' interests. As it happens, Synopsys issued 24% more new shares over the last year. As a result, its net income is now split between a greater number of shares. To talk about net income, without noticing earnings per share, is to be distracted by the big numbers while ignoring the smaller numbers that talk to per share value. You can see a chart of Synopsys' EPS by clicking here.\nHow Is Dilution Impacting Synopsys' Earnings Per Share (EPS)?\nAs you can see above, Synopsys has been growing its net income over the last few years, with an annualized gain of 38% over three years. Net profit actually dropped by 7.3% in the last year. But the EPS result was even worse, with the company recording a decline of 13%. So you can see that the dilution has had a fairly significant impact on shareholders.\nIf Synopsys' EPS can grow over time then that drastically improves the chances of the share price moving in the same direction. However, if its profit increases while its earnings per share stay flat (or even fall) then shareholders might not see much benefit. For that reason, you could say that EPS is more important that net income in the long run, assuming the goal is to assess whether a company's share price might grow.\nThat might leave you wondering what analysts are forecasting in terms of future profitability. Luckily, you can click here to see an interactive graph depicting future profitability, based on their estimates.\nHow Do Unusual Items Influence Profit?\nAlongside that dilution, it's also important to note that Synopsys' profit was boosted by unusual items worth US$597m in the last twelve months. We can't deny that higher profits generally leave us optimistic, but we'd prefer it if the profit were to be sustainable. When we crunched the numbers on thousands of publicly listed companies, we found that a boost from unusual items in a given year is often not repeated the next year. Which is hardly surprising, given the name. We can see that Synopsys' positive unusual items were quite significant relative to its profit in the year to October 2025. As a result, we can surmise that the unusual items are making its statutory profit significantly stronger than it would otherwise be."
            },
            {
                "title": "Live Nasdaq Composite: Stocks Kick Off Final Week With a Whimper - 24/7 Wall St.",
                "source": "24/7 Wall St.",
                "url": "https://247wallst.com/investing/2025/12/29/live-nasdaq-composite-stocks-kick-off-final-week-with-a-whimper/",
                "body": "Live Nasdaq Composite: Stocks Kick Off Final Week With a Whimper\nQuick Read\n- Nvidia acquired $5B worth of Intel shares according to public filings.\n- Bernstein maintained its outperform rating on Nvidia with a $275 price target after its licensing deal with Groq.\n- DigitalBridge stock surged on reports that Japan’s SoftBank may acquire the data center company.\n- If you’re focused on picking the right stocks and ETFs you may be missing the bigger picture: retirement income. That is exactly what The Definitive Guide to Retirement Income was created to solve, and it’s free today. Read more here\nLive Updates\nGet The Best Intel Live Earnings Coverage Like This Every Quarter\nGet earnings reminders, our top analysis on Intel, market updates, and brand-new stock recommendations delivered directly to your inbox.\nYear-to-Date Performances\nThe major stock market averages are on track for the following performances in 2025 so far:\nDow Jones Industrial Average: Up 14.1%\nS&P 500: Up 17.4%\nNasdaq Composite: Up 21.5%\nDow Stock Winner\nWhile AI leaders fueled the market growth in 2024, there has been a turn of events in 2025. Technology has been outpaced by the auto sector, with Dow stock General Motors (NYSE: GM) taking the helm as the index’s best performing stock of the year, soaring nearly 56% year-to-date.\nThis article will be updated throughout the day, so check back often for more daily updates.\nIn this final trading week of 2025, the markets are under pressure following last week’s record performance. With no Santa Claus rally in sight, technology stocks are dragging the Nasdaq Composite lower by less than 1% this morning. Sectors of the economy are a mixed bag, while commodities continue to capture the spotlight with rallies in metals like silver.\nBernstein analysts have reemphasized their “outperform” rating on Nvidia (Nasdaq: NVDA) stock with a $275 price target attached in response to the AI leader’s recent multi-billion-dollar licensing deal with startup Groq, a chip company. Additionally, the latest public filings reveal that Nvidia has acquired shares of industry peer Intel (Nasdaq: INTC) worth a cool $5 billion.\nSeparately, Bitcoin is attempted another bullish run before the end of the year, recapturing the $90,000 per-coin level before letting it slip away once again. Michael Saylor’s MicroStrategy (Nasdaq: MSTR) has gone on its latest BTC buying spree, scooping up over 1,200 BTC for its crypto-heavy balance sheet.\nHere’s a look at where things stand as of morning trading:\nDow Jones Industrial Average: 48,662.93 Down 49.69 (-0.10%)\nNasdaq Composite: 23,443.93 Down 147.16 (-0.62%)\nS&P 500: 6,906.07 Down 22.87 (-0.34%)\nBroad Market Movers\nData center company DigitalBridge (NYSE: DBRG) stock is soaring on reports that it could be an acquisition target for Japan’s SoftBank.\nNeedham analysts reemphasized their “buy” rating on Reddit (NYSE: RDDT) stock, targeting the $300 level.\nReleased: The Ultimate Guide To Retirement Income (sponsor)\nMost investors spend years learning how to pick good stocks and funds. Far fewer have a clear plan for turning those investments into a reliable retirement paycheck. The truth is, the transition from “building wealth” to “living on wealth” is one of the most overlooked risks facing successful investors in their 50s, 60s and 70s.\nThat is exactly what The Definitive Guide to Retirement Income was created to solve. It’s a free guide that outlines the straightforward math and strategies you need to convert your investments to income. Learn more here."
            }
        ]
    },
    {
        "asset_name": "SPX500",
        "symbol": "EIGHTCAP:SPX500",
        "status": "Success",
        "data": {
            "day_range": "42.470",
            "open": "6,933.110",
            "close": "6,905.280",
            "high": "6,936.990",
            "low": "6,894.520"
        },
        "market_summary": "### SPX500 Market Briefing\n* **Key Drivers:** None of the provided articles contain relevant information about the **SPX500**.\n* **Price Action:** No data available from the provided articles to analyze **SPX500** price action.\n* **Technical Outlook:** Unable to provide a technical outlook due to lack of relevant information in the provided articles. \n\n--- \n**Overall Sentiment:** Unable to determine due to lack of relevant information.",
        "source_articles": [
            {
                "title": "Could Vikings lose DC Brian Flores and S Harrison Smith this offseason? - ESPN",
                "source": "ESPN",
                "url": "https://www.espn.com/nfl/story/_/id/47418550/nfl-minnesota-vikings-brian-flores-harrison-smith",
                "body": "MINNEAPOLIS -- Brian Flores delivered a résumé game as the football world watched on Christmas Day. The question now is simple: What will he do with it?\nFlores' contract as the Minnesota Vikings' defensive coordinator will expire after this season. NFL rules allow coordinators to break their deals if they are offered a head coaching job, but Flores' situation will allow him to explore his coordinator options around the league as well. There are no indications that either Flores or the Vikings are eager to part ways, and Flores enjoys wide latitude and significant personnel influence in Minnesota. But the franchise must brace for the possibility that it will lose one of its top assets.\n\"He's one of the smartest guys when it comes to schemes that I've ever been around,\" cornerback Byron Murphy Jr. said. \"So he can't go anywhere. He's not allowed to go anywhere. No way. I know that everything happens for a reason, and it's always God's plan. But I definitely do not want him to go anywhere. I re-signed here last offseason and told him that he's one of the best coaches that I've been around, and that I wanted to come back and play for him. I don't want him to go anywhere.\"\nFlores continues to operate one of the NFL's most unique schemes, one that has evolved this season to incorporate safety Harrison Smith as a quasi-playcaller on the field. On Thursday, the Vikings dismantled the Detroit Lions' offense, forcing six turnovers, sacking quarterback Jared Goff five times and producing a defensive success rate of 71% -- their second highest in a game since Flores arrived at the start of the 2023 season.\nAmid a season lost long ago to poor quarterback play, the Vikings have evened their record at 8-8. Their defense, which ranks No. 8 in the NFL in defensive EPA per play, is the primary catalyst. In retrospect, coach Kevin O'Connell and Flores flipped a switch during the Week 6 bye as they prepared to reinsert quarterback J.J. McCarthy into the starting lineup.\n\"Our dialogue, was, 'Hey, let's just make sure we're being as aggressive as possible,'\" O'Connell said. \"And that's how [Flores] is by nature. But then also the element of Harrison being able to have a role in what we ultimately play when the ball gets snapped. And he's got an unbelievable feel of the system. ... He's really out there playing a game within the game. And it's been spectacular to watch.\n\"But you learn about each and every year. Teams are different and you learn that you might have to win different ways.\"\nAfter blitzing at a rate of 31.4% before their bye week, the Vikings have blitzed on 51.8% of their defensive snaps since. But Flores has done it in new ways and combinations, in part by relying on Smith to apply the knowledge he has absorbed in his 14-year career to break playcalling tendencies and capitalize on what coaches can't always see from the sideline.\nSmith missed the Vikings' first two games because of a personal health issue that arose during training camp, and he didn't get back to his full-time role until Week 7 -- the same time the Vikings elevated their aggressiveness. Since that point, Flores has regularly -- not on every play, but many -- given Smith the authority to change coverages and blitz alignments before the snap.\n\"Early in the year we were figuring out exactly what our individual roles were,\" Smith said. \"And there was a lot of good, but it wasn't quite as tight. And then we've gotten maybe a little more aggressive in some things. And I think it's more just the belief in that. Without getting too into detail, it's a scheme that most guys have not come up playing with these rules and these techniques and stuff.\"\nNFL coaches often give quarterbacks a series of plays to choose from on offense, but it's less common on defense. Speaking earlier this month about the arrangement, Flores said he first thought about the possibility while coaching now-retired safety Devin McCourty when they were with the New England Patriots in the late 2010s.\n\"I was"
            },
            {
                "title": "Fatal crash in Aurora causes closure on S. Gun Club Road - CBS News",
                "source": "CBS News",
                "url": "https://www.cbsnews.com/colorado/news/fatal-crash-aurora-s-gun-club-road/",
                "body": "Fatal crash in Aurora causes closure on S. Gun Club Road\nPolice in Aurora are asking drivers to avoid the area near a serious crash that happened early Sunday evening.\nAccording to the Aurora Police Department, the crash occurred after 5 p.m. on S. Gun Club Road between E. Jewell Avenue and E. Hampden Ave. Authorities said that four vehicles were involved, and at least one person has died.\nOfficers have closed down the area near the intersections while crews work the scene. The crash is under investigation, and authorities asked drivers to avoid the area until further notice."
            },
            {
                "title": "DC pipe bomb suspect Brian Cole Jr.’s possible motive revealed: ‘Something just snapped’ - New York Post",
                "source": "New York Post",
                "url": "https://nypost.com/2025/12/28/us-news/dc-pipe-bomb-suspect-brian-cole-jr-s-possible-motive-revealed/",
                "body": "DC pipe bomb suspect Brian Cole Jr.’s possible motive revealed: ‘Something just snapped’\nDC pipe-bomb suspect Brian Cole Jr. told authorities he wanted to “speak up” for people who believed the 2020 election was stolen and target the country’s political parties for being “in charge” after his arrest earlier this month, prosecutors said Sunday.\nCole, 30, told agents that “something just snapped” in him before he allegedly placed two pipe bombs by the Republican and Democratic National Committee headquarters on the eve of the Jan. 6 riots, according to a newly filed Justice Department memo.\nHe added that if people “feel that, you know, something as important as voting in the federal election is being tampered with, is being, you know, being — you know, relegated null and void, then, like, someone needs to speak up, right? Someone up top. You know, just to, just to at the very least calm things down,” the memo said.\nCole said “something just snapped” in him after “watching everything, just everything getting worse,” and that he wanted to do something “to the parties” because “they were in charge.”\nCole’s words — revealing a possible motive in the attempted attack — were laid out in the memo arguing he should remain behind bars as his case moves forward.\nCole initially denied that his actions were connected with Congress or the events of Jan. 6. But after initially disputing that he had placed the pipe bombs, he confessed to taking part in the explosive scheme, the documents show.\nHe acknowledged to agents that he felt disenchanted by the 2020 election results and was sympathetic to unfounded claims that it had been stolen by former President Joe Biden, the memo added.\nThe memo also provided evidence that investigators said connected him to the incident, including bomb-making equipment found at his home after his arrest.\nCole assembled the homemade pipe bombs using items purchased at several retailers around northern Virginia, including eight different Home Depot stores, as well as Micro Center, Lowe’s and Walmart, according to his criminal complaint.\nThe explosives had been fashioned from 8-inch galvanized steel pipes closed off with end caps, and rigged with nine-volt batteries and white kitchen timers\nThe bombs did not detonate and were discovered on Jan. 6, the afternoon when rioters supporting President Trump stormed the US Capitol in an attempt to halt the certification of the election.\nHe allegedly continued to buy bomb-making components even after placing them outside the RNC and DNC headquarters, the complaint detailed.\nWhen asked why he placed the bombs at the RNC and DNC, Cole responded with “I really don’t like either party at this point.”\nCole was arrested at his home on Dec. 4 in Woodbridge, Virginia, after a multi-agency effort and charged with the use of an explosive device and attempted malicious destruction by means of explosive materials.\nHis next court hearing is slated for Tuesday in Washington’s federal court.\nWith Post wires"
            }
        ]
    },
    {
        "asset_name": "JPN225",
        "symbol": "EIGHTCAP:JPN225",
        "status": "Success",
        "data": {
            "day_range": "538.490",
            "open": "50,451.120",
            "close": "50,690.410",
            "high": "50,934.610",
            "low": "50,396.120"
        },
        "market_summary": "### JPN225 Market Briefing\n* **Key Drivers:** The **Bank of Japan**'s recent rate hike to **0.75%** and debate on further tightening have introduced uncertainty, while the **Takaichi Trade** stimulus package aims to boost growth through **¥21.3 trillion** in fiscal spending.\n* **Price Action:** The **Nikkei 225** index has shown a **30%** rise in 2025, outperforming major global indices, with a record high of **¥52,590**, driven by the **artificial intelligence boom** and a weaker **Japanese yen**.\n* **Technical Outlook:** Immediate support for the **Nikkei 225** is not explicitly stated in the articles, but resistance is expected given the **hawkish** tone of the **Bank of Japan** and the potential impact of further rate hikes on the market, with **10-year bond yields** reaching a multi-year high of **2.10%**.\n\n--- \n**Overall Sentiment:** Cautiously **bullish** ↑",
        "source_articles": [
            {
                "title": "Nikkei Slips As The Bank Of Japan Debates More Rate Hikes - Finimize",
                "source": "Finimize",
                "url": "https://finimize.com/content/nikkei-slips-as-the-bank-of-japan-debates-more-rate-hikes",
                "body": "Japan’s market dipped after the BoJ signaled a split on further tightening, while company news lifted Itochu and Japan Tissue Engineering but hit Nishi-Nippon Railroad.\nabout 8 hours ago • 1 min\nWhat’s going on here?\nJapan’s Nikkei fell after the Bank of Japan showed it’s split on whether to keep raising interest rates.\nWhat does this mean?\nThe Nikkei 225 slipped 0.44% after the BoJ’s summary of opinions highlighted real disagreement following December’s rate hike to 0.75%, its highest level in roughly 30 years. Some policymakers think rates are still too low once inflation is factored in, keeping the door open to further tightening. Others warned against moving too fast and pushed for flexibility. That uncertainty matters because higher borrowing costs and a more volatile yen can quickly change profit expectations for exporters, lenders, and debt-heavy domestic firms.\n*..\n*Why should I care?**\nFor markets: Higher rates reshuffle the pecking order.\nEven at 0.75%, Japan’s policy rate is a regime change after decades of ultra-cheap money. If hikes continue, companies reliant on domestic borrowing or discretionary spending could feel the pinch, while firms with pricing power may cope better if inflation sticks around. The day also showed how stock-specific news can overwhelm the index: Itochu rose on a report that its Itochu-Shokuhin unit plans to expand frozen fruit exports abroad, while Nishi-Nippon Railroad fell on talk it’s exploring housing projects in India.\nZooming out: Japan Inc is hunting growth beyond its borders.\nWith Japan’s population aging and shrinking, more firms are forced to look overseas for new customers – the reported India real estate interest is one example. At the same time, healthcare is becoming a bigger earnings driver: Japan Tissue Engineering jumped after saying its cartilage therapy JACC will be covered by national health insurance from January 1, 2026. For biotech, reimbursement decisions can be the difference between a breakthrough on paper and real revenue.\nThis content is free, but you must be logged in to continue reading.\nAlready have an account?"
            },
            {
                "title": "Here’s why the Nikkei 225 Index jumped in 2025 and the top gainers - TradingView — Track All Markets",
                "source": "TradingView — Track All Markets",
                "url": "https://www.tradingview.com/news/invezz:5551db336094b:0-here-s-why-the-nikkei-225-index-jumped-in-2025-and-the-top-gainers/",
                "body": "Here’s why the Nikkei 225 Index jumped in 2025 and the top gainers\nThe Nikkei 225 Index did well this year, rising from a low of ¥31,145 in April to a record high of ¥52,590. It rose by nearly 30% this year, outperforming most global indices like the S&P 500, FTSE 100, and the German DAX.\nWhy the Nikkei 225 Index soared\nThe Nikkei 225 Index surged this year, even as the Bank of Japan maintained its hawkish tone and Japan bond yields soared to the highest level in decades. Data shows that the ten-year bond yield jumped to a multi-year high of 2.10%, while the five-year soared to 1.54%.\nThe index jumped because of the ongoing artificial intelligence boom, which benefited some of the biggest players in the industry, like Advantest and Softbank.\nAdditionally, it jumped because of the falling Japanese yen, which continued its freefall during the year. The USDJPY exchange rate rose from a low of 139.87 in April to a high of 157.83.\nA weaker Japanese yen benefits the Nikkei 225 Index by helping its biggest exporters, including automakers like Toyota, Mazda, and Honda. Other large industrial companies like Hitachi and Mitsubishi Electric also benefited.\nMeanwhile, like other indices, the Nikkei Index jumped after Donald Trump signed a trade agreement with Japan, which reduced tariffs for goods from the country. This deal brought the levies to 15%, down from over 30%, with Japan promising to invest billions of dollars in the United States.\nTop gainers and laggards in 2025\nMost companies in the Nikkei 225 Index did well this year. Sumitomo Dainippon, a giant player in the pharmaceutical industry, soared by 311% this year, bringing its market capitalization to over $4.35 billion. This surge happened as the company made progress on its pipeline and as the turnaround gained steam.\nMitsui Mining & Smelting stock price jumped by 286% this year, with its valuation hitting over $7 billion. This surge happened as commodity prices continued soaring, with gold, silver, and copper gaining momentum. The jump benefited this company as it provides engineered materials used in the mining industry.\nFujikura share price soared by 173%, with its valuation jumping to $36 billion as demand for its technology products rose. Advantest, a top player in the semiconductor industry, rose by 116%, while Sumitomo Electric rose by 123%.\nJapanese bank stocks also did well as the Bank of Japan (BoJ) hiked interest rates during the year. Shizuoka Bank stock rose by 90%, while Concordia Financial, Mizuho, Chiba Bank, and Sumitomo Mitsui Financial jumped by double digits during the year.\nMeanwhile, Softbank’s stock price jumped by 90% this year. Recently, however, the stock has dropped by over 35% this year as concerns about the AI bubble have remained.\nOn the other hand, the top laggards in the Nikkei 225 Index in 2025 were companies like Itochu, KDDI, Bridgestone, Daiichi Sankyo, and Recruit Holdings, which dropped by over 20%."
            },
            {
                "title": "Outlook 2026 Series | VI. Japan’s “Takaichi Trade”: Big Fiscal Stimulus Raises Growth Hopes—and Debt Concerns - MacroMicro",
                "source": "MacroMicro",
                "url": "https://en.macromicro.me/blog/outlook-2026-series-vi-japan-s-takaichi-trade-big-fiscal-stimulus-raises-growth-hopes-and-debt-concerns",
                "body": "Outlook 2026 Series | VI. Japan’s “Takaichi Trade”: Big Fiscal Stimulus Raises Growth Hopes—and Debt Concerns\nJapan’s new Prime Minister, Sanae Takaichi, wasted no time unveiling a massive ¥21.3 trillion stimulus package, sparking a market rally now dubbed the “Takaichi Trade.” Her policy approach—centered on aggressive fiscal spending and easing—has drawn comparisons to Abenomics.\nParadoxically, Japan’s latest fiscal package relies on heavy subsidies to curb inflation. Unlike previous expansions supported by aggressive easing, this stimulus coincides with a rate-hiking cycle. This shift has reignited concerns over debt sustainability, pushing 10-year JGB yields above 2% for the first time in two decades—even as the Yen remains weak.\nMeanwhile, Japanese equities continue to hover near record highs. Looking toward 2026, the key trajectory for the Yen and the Nikkei depends on one question: Can Japan leverage the AI and semiconductor boom to complete its economic transformation, or will structural headwinds persist? This report analyzes these critical drivers.\nKey Takeaways:\n- Takaichi’s stimulus boosted stocks, but with the yen weakening and yields surging, the economy isn’t yet in a virtuous cycle.\n- Japan faces three structural headwinds: weak corporate investment, aging demographics, and low AI adoption.\n- We analyze both short- and long-term outlooks for Japanese equities and the yen.\nTakaichi vs. Ueda: A Policy Split Ahead of 2026\nWith Takaichi’s cabinet in place, the policy focus has shifted to “responsible and proactive fiscal policy.” At the same time, the BOJ raised rates by 25 bps to 0.75% on December 19—the highest in 30 years—highlighting a growing divergence between fiscal and monetary policy.\nFiscal Plan: Estimated to Add 0.5pp to GDP Growth in 2026\nThe Takaichi government’s ¥21.3 trillion stimulus package focuses on three pillars:\n- Cost of Living Support: ¥11.7 trillion to offset rising prices. Measures include scrapping the gasoline tax surcharge, reviving energy subsidies, and boosting wage support.\n- Strategic Investment: ¥7.2 trillion for 17 priority sectors like AI, semiconductors, and quantum tech.\n- Defense & Diplomacy: ¥1.7 trillion to strengthen national security.\nBeyond this supplementary FY2025 budget, markets are watching the upcoming FY2026 initial budget, expected to exceed ¥120 trillion—another record high.\nBOJ Tightening Likely to Slow in 2026\nWhile fiscal policy expands, the BOJ is cautiously tightening. After hiking rates in December, the central bank is facing persistent inflation—November’s CPI was 2.9%, with core inflation (excluding food and energy) higher than in the U.S.\n**We expect the BOJ to\nAlready a subscriber? Click here to log in.\nFull Access to Our Services\nComprehensive data at your service\nwith key indicators for investment insights\nExclusive flash reports\non key events and data\nCreate your own charts and analysis\nincluding performance backtesting\nHub of professionals to engage\nin meaningful discussions and insights\nBig Tech earnings week is here! Stay ahead with MacroMicro’s Economic Calendar — track CPI, GDP, and key earnings like Apple & Google all in one place. Check it out »"
            }
        ]
    }
]